{
  "metadata": {
    "subject": "Communication and Language",
    "key_stage": "EYFS",
    "years_covered": [
      0
    ],
    "document_reference": "DfE EYFS Statutory Framework 2024",
    "extraction_date": "2026-02-22",
    "structure_rating": 7,
    "notes": "EYFS Communication and Language is a Prime Area — one of three foundational areas that underpin all learning. It has 2 Early Learning Goals (ELGs). ELG 1: Listening, Attention and Understanding. ELG 2: Speaking. Both contribute to the Good Level of Development (GLD) calculation. Content is entirely statutory from the EYFS Statutory Framework; the ELG bullet points define the expected attainment at end of Reception."
  },
  "domains": [
    {
      "domain_id": "CL-R-D001",
      "domain_name": "Listening, Attention and Understanding",
      "description": "The ability to attend to and make sense of spoken language, including questions, explanations and instructions, sustaining attention over back-and-forth exchanges and responding with relevant verbal and non-verbal contributions.",
      "curriculum_context": "Listening, Attention and Understanding is Early Learning Goal 1 within the Communication and Language Prime Area. At the end of Reception, children are expected to listen attentively and respond to what they hear with relevant questions, comments and actions. They should make comments about what they have heard and ask questions to clarify their understanding. Crucially, they should hold conversation when engaged in back-and-forth exchanges with their teacher and peers. This ELG underpins the entire curriculum: a child who cannot sustain attention to spoken language cannot access teacher instruction in any subject. The statutory expectation is for sustained, purposeful listening rather than passive receipt of language. The Prime Area designation signals that all other learning depends on Communication and Language development — it must be prioritised in provision, especially for children with limited early language experience.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical"
    },
    {
      "domain_id": "CL-R-D002",
      "domain_name": "Speaking",
      "description": "The ability to communicate ideas, explanations and feelings through spoken language, using recently introduced vocabulary, full sentences and age-appropriate grammatical structures including tense and conjunctions.",
      "curriculum_context": "Speaking is Early Learning Goal 2 within the Communication and Language Prime Area. At the end of Reception, children are expected to participate in small group, class and one-to-one discussions, offering their own ideas using recently introduced vocabulary. They should be able to offer explanations for why things might happen, making use of recently introduced vocabulary from stories, non-fiction, rhymes and poems when appropriate. They should express their ideas and feelings about their experiences using full sentences, including use of past, present and future tenses and making use of conjunctions, with modelling and support from their teacher. This ELG goes beyond basic expressive language: it requires children to use vocabulary purposefully, construct grammatically structured sentences across tenses, and provide causal reasoning. Strong Speaking attainment at EYFS is the most powerful predictor of KS1 English and literacy outcomes.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical"
    }
  ],
  "objectives": [
    {
      "objective_id": "CL-R-O001",
      "domain_id": "CL-R-D001",
      "objective_text": "Listen attentively and respond to what they hear with relevant questions, comments and actions when being read to and during whole class discussions and small group interactions.",
      "non_statutory_guidance": "Children at this stage should show that they have listened by giving a response that is relevant to what was said. Responses may be verbal (a question or comment) or non-verbal (a relevant action). The emphasis is on attentive, purposeful listening rather than passive receipt. Adults should ensure that stories, discussions and instructions are paced appropriately and that children have regular opportunities to respond. Repeated read-alouds support this as children become familiar with the text and can begin to anticipate and respond.",
      "examples": "After a story read-aloud, a child unprompted asks 'Why did the wolf do that?' — demonstrating attentive listening and relevant questioning. A child follows a complex instruction (e.g., 'Put the red block next to the small yellow one, not the big one') without needing repetition.",
      "is_statutory": true,
      "year": [
        0
      ]
    },
    {
      "objective_id": "CL-R-O002",
      "domain_id": "CL-R-D001",
      "objective_text": "Make comments about what they have heard and ask questions to clarify their understanding.",
      "non_statutory_guidance": "This objective captures the metacognitive listening behaviour of recognising when something has not been fully understood and taking action to resolve it. Children should learn that asking for clarification is a positive, active listener strategy, not an admission of failure. Adults should model this explicitly ('I'm not sure I understood that — let me ask a question') and create a classroom culture where questions are welcomed.",
      "examples": "A child says 'I didn't understand the bit about the bridge — can you explain again?'; a child comments 'That's different from what we said yesterday about...'; a child asks 'What does hibernating mean?' after hearing it in a story.",
      "is_statutory": true,
      "year": [
        0
      ]
    },
    {
      "objective_id": "CL-R-O003",
      "domain_id": "CL-R-D001",
      "objective_text": "Hold conversation when engaged in back-and-forth exchanges with their teacher and peers.",
      "non_statutory_guidance": "Conversation is characterised by turn-taking, listening to the other speaker, and building on what they have said. At EYFS the expectation is for sustained back-and-forth exchanges — not a single exchange but a connected dialogue across several turns. Adults should model conversation, avoid over-talking, and create structured opportunities for dialogic talk in pairs, small groups and whole class settings. Sustained shared thinking — where an adult and child jointly explore an idea together across multiple turns — is the gold standard for this objective.",
      "examples": "A child and teacher discuss what they think will happen when the ice melts, taking turns across six or more exchanges, each building on the other's contribution. Two children in the role play area sustain a 'shopping' conversation with multiple turns.",
      "is_statutory": true,
      "year": [
        0
      ]
    },
    {
      "objective_id": "CL-R-O004",
      "domain_id": "CL-R-D002",
      "objective_text": "Participate in small group, class and one-to-one discussions, offering their own ideas using recently introduced vocabulary.",
      "non_statutory_guidance": "Children should be able to contribute their own ideas in a range of discussion contexts — not just respond to direct questions but offer spontaneous contributions. The criterion 'using recently introduced vocabulary' is specific: children should actively deploy new words they have been taught rather than relying on their existing vocabulary. Adults should plan for deliberate vocabulary introduction and provide multiple opportunities for children to encounter and use new words across the week in different contexts.",
      "examples": "After a week's topic on minibeasts, a child uses the words 'camouflage' and 'habitat' correctly when telling the class what they found under a log. A child in a small group discussion uses 'nocturnal' when explaining why the owl in the story was awake at night.",
      "is_statutory": true,
      "year": [
        0
      ]
    },
    {
      "objective_id": "CL-R-O005",
      "domain_id": "CL-R-D002",
      "objective_text": "Offer explanations for why things might happen, making use of recently introduced vocabulary from stories, non-fiction, rhymes and poems when appropriate.",
      "non_statutory_guidance": "This objective requires causal reasoning expressed in spoken language. Children should move beyond describing what happened to explaining why. Adults should model causal language explicitly ('I think that happened because...', 'The reason might be...', 'If... then...') and create opportunities for explanation in science, mathematics, geography and history contexts as well as in response to literature. Vocabulary from non-fiction reading is particularly important here as it gives children the technical language needed for explanation.",
      "examples": "After an investigation with ice, a child explains 'The ice melted because it got warm — I think the heat made it turn into water'. A child explains a character's motivation: 'She was scared because it was dark and she'd never been there before'.",
      "is_statutory": true,
      "year": [
        0
      ]
    },
    {
      "objective_id": "CL-R-O006",
      "domain_id": "CL-R-D002",
      "objective_text": "Express their ideas and feelings about their experiences using full sentences, including use of past, present and future tenses and making use of conjunctions, with modelling and support from their teacher.",
      "non_statutory_guidance": "The expectation is for grammatically complete sentences across three tenses (past, present, future) and the use of conjunctions to create more complex sentences. Common conjunctions at EYFS include: and, but, so, because, if, when. The phrase 'with modelling and support from their teacher' acknowledges that this is a developmental achievement requiring adult scaffolding — full independence is not expected but children should be moving towards it. Oral sentence construction at this level is the direct precursor to written sentence construction in Year 1.",
      "examples": "A child recounts their weekend: 'We went to the park and I went on the swings but then it started raining so we had to go home'. A child predicts: 'I think the plant will grow bigger if we give it more water'. A child describes a current activity: 'I am making a house because the bear needs somewhere to sleep'.",
      "is_statutory": true,
      "year": [
        0
      ]
    }
  ],
  "concepts": [
    {
      "concept_id": "CL-R-C001",
      "domain_id": "CL-R-D001",
      "concept_name": "Sustained Listening",
      "description": "The ability to maintain focused attention on a speaker over an extended period, filtering out distractions and remaining engaged across a whole story, explanation or discussion. At EYFS, sustained listening is distinct from momentary attention — it requires a child to hold focus through multiple sentences or exchanges, retaining the thread of meaning throughout. This is foundational to all classroom learning and to the development of reading comprehension.",
      "teaching_guidance": "Build listening stamina gradually: begin with short read-alouds and extend duration as children's capacity grows. Use visual supports (props, puppets, illustrations) to sustain engagement. Signal the start of listening time explicitly ('Listening ears on'). Minimise background noise and visual distraction during whole-class listening. After listening, ask children to recount what they heard to check attention was sustained, not just present at the start.",
      "key_vocabulary": "listen, attention, focus, hear, remember, story, talk, speaker, concentrate, quiet",
      "common_misconceptions": "Children (and some adults) confuse sitting still with listening — a child can appear attentive but be entirely disengaged, and conversely a child who fidgets may be listening very well. Listening must be assessed through relevant response, not posture.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": [
        "CL-R-C002",
        "CL-R-C003"
      ]
    },
    {
      "concept_id": "CL-R-C002",
      "domain_id": "CL-R-D001",
      "concept_name": "Clarifying Questions",
      "description": "The ability to identify when something heard has not been fully understood and to formulate and ask a question that targets the specific gap in understanding. This is an active, metacognitive listening strategy that distinguishes receptive listening from engaged comprehension. Children who can ask clarifying questions are monitoring their own understanding in real time — a skill that transfers directly to reading comprehension strategies at KS1.",
      "teaching_guidance": "Model clarifying questions explicitly and frequently: 'I heard you say X — I'm not sure what you mean by that. Can you tell me more?' Provide children with question stems on cards or a display: 'What does __ mean?', 'Can you explain __?', 'I didn't understand the bit about __'. Praise children for asking clarifying questions and frame it as expert listener behaviour rather than a sign of confusion or weakness.",
      "key_vocabulary": "question, understand, mean, explain, clarify, confused, not sure, ask, wonder, what",
      "common_misconceptions": "Children often assume they have understood when they have not, or feel that asking a question signals failure rather than active listening. Some children ask random questions rather than targeted clarifying questions — the distinction is worth teaching explicitly.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": [
        "CL-R-C001",
        "CL-R-C004"
      ]
    },
    {
      "concept_id": "CL-R-C003",
      "domain_id": "CL-R-D001",
      "concept_name": "Back-and-forth Conversation",
      "description": "The ability to sustain a dialogue through multiple turn-taking exchanges, listening to the other speaker's contribution and building on it with a relevant response. Back-and-forth conversation requires the child to hold a shared topic in mind across turns, monitor the other speaker's meaning, and produce a connected response. This is the spoken analogue of reading comprehension — processing and responding to another person's language in real time.",
      "teaching_guidance": "Model conversational turn-taking explicitly using puppets or role play. Use talk partner activities with structured prompts. Practise 'talk tennis' — keeping a conversation on one topic going for as many turns as possible. Provide think-time before responses to avoid children defaulting to unrelated contributions. Use sustained shared thinking with individual children during play: follow the child's lead, respond to their comment, extend slightly, wait for their response.",
      "key_vocabulary": "turn, reply, respond, conversation, talk, listen, next, add, agree, disagree",
      "common_misconceptions": "Children often treat conversation as a series of independent statements rather than a connected exchange. They may wait for their turn to speak rather than listening to the other speaker's contribution, producing adjacent but unconnected utterances.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": [
        "CL-R-C001",
        "CL-R-C005"
      ]
    },
    {
      "concept_id": "CL-R-C004",
      "domain_id": "CL-R-D002",
      "concept_name": "Vocabulary in Context",
      "description": "The ability to use recently introduced vocabulary accurately and appropriately when contributing to discussion or explanation. This goes beyond knowing a word's definition: it requires deploying the word in a semantically appropriate context, with appropriate syntax, in spoken language. Vocabulary in context at EYFS is the foundational stage of word learning — children acquire new words through exposure in meaningful contexts and consolidate them through active use.",
      "teaching_guidance": "Plan deliberate vocabulary teaching in every topic: select 5-10 Tier 2 and Tier 3 words per fortnight and create multiple exposure opportunities across the week (story, discussion, role play, non-fiction). Use the word, explain the word, use the word again, ask children to use it — never teach vocabulary through definition alone. Create vocabulary displays and refer to them during discussion. Celebrate children's voluntary use of new vocabulary.",
      "key_vocabulary": "word, vocabulary, meaning, new, use, say, talk, describe, explain, remember",
      "common_misconceptions": "Adults sometimes assess vocabulary knowledge by asking children to define words rather than use them in context. Definitional knowledge is much weaker than productive vocabulary knowledge — the ELG target is use in context, not recitation of definitions.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": [
        "CL-R-C002",
        "CL-R-C005"
      ]
    },
    {
      "concept_id": "CL-R-C005",
      "domain_id": "CL-R-D002",
      "concept_name": "Causal Explanation in Speech",
      "description": "The ability to offer verbal explanations for why events occur or why characters behave as they do, using causal connectives such as 'because', 'so', 'if', 'therefore' and 'that's why'. Causal explanation requires the child to identify a cause-and-effect relationship and encode it in language. This is the spoken foundation for the written extended writing expected in KS1 and KS2, and also underpins scientific reasoning, mathematical justification and historical explanation.",
      "teaching_guidance": "Model causal language continuously across all subjects: 'The ice melted because the room is warm.' 'The character was sad because his friend left.' Provide causal sentence frames: 'I think __ happened because __', 'The reason for __ is __'. Use 'why?' questions as a daily practice. Accept and develop partially formed causal explanations rather than only accepting fully formed ones. Value the thinking behind an explanation even when the language is not yet complete.",
      "key_vocabulary": "because, so, if, then, why, reason, cause, happen, explain, think, might",
      "common_misconceptions": "Children often describe events sequentially ('and then... and then...') without encoding causal relationships. The shift from temporal connectives ('and then', 'next') to causal connectives ('because', 'so') is a key developmental step that requires explicit teaching.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": [
        "CL-R-C003",
        "CL-R-C006"
      ]
    },
    {
      "concept_id": "CL-R-C006",
      "domain_id": "CL-R-D002",
      "concept_name": "Tense Use in Speech",
      "description": "The ability to use past, present and future tenses accurately and appropriately in spoken language to locate events in time. At EYFS, this includes: past simple and past progressive ('I went', 'I was running'), present simple and present progressive ('I go', 'I am running'), and future forms ('I will go', 'I am going to go'). Correct tense use in speech is the direct precursor to correct tense use in writing, which is a core Year 1 grammar expectation.",
      "teaching_guidance": "Use sentence-level talk activities that require specific tenses: 'Tell me what you did at the weekend' (past); 'What are you doing right now?' (present); 'What will you do at playtime?' (future). Recast incorrect tense use naturally without over-correcting: child says 'I goed to the park' → adult responds 'Oh, you went to the park — that sounds fun!'. Provide three-tense frames as a scaffold: Yesterday I... Today I am... Tomorrow I will...",
      "key_vocabulary": "yesterday, today, tomorrow, was, is, will, went, going, did, past, present, future",
      "common_misconceptions": "Children typically acquire present tense first, then past, then future. Overgeneralisation errors ('I goed', 'I runned', 'I singed') are a normal stage of development indicating that the child has acquired the regular past tense rule but not yet learnt the irregular forms. These are positive signs of grammatical development, not errors requiring correction.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": [
        "CL-R-C005",
        "CL-R-C004"
      ]
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "CL-R-C001",
      "dependent_concept": "CL-R-C002",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "A child must be capable of sustained listening before they can identify a specific gap in their understanding and formulate a clarifying question about it. Without attentive listening, there is no comprehension to monitor and therefore no basis for targeted questioning."
    },
    {
      "prerequisite_concept": "CL-R-C001",
      "dependent_concept": "CL-R-C003",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Back-and-forth conversation requires sustained listening to the other speaker's contribution before responding. A child who cannot sustain attention to spoken language will produce adjacent but disconnected utterances rather than a genuine dialogue."
    },
    {
      "prerequisite_concept": "CL-R-C002",
      "dependent_concept": "CL-R-C004",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.75,
      "rationale": "Understanding what has been heard (including asking for clarification when needed) is a prerequisite for consolidating and using new vocabulary from that input. Children who cannot monitor their comprehension are less likely to successfully internalise and deploy newly introduced words."
    },
    {
      "prerequisite_concept": "CL-R-C003",
      "dependent_concept": "CL-R-C005",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Causal explanation in conversation requires the conversational infrastructure of back-and-forth exchange — the child must sustain a dialogue long enough to develop and express a reasoned explanation. Single-turn responses rarely allow for full causal reasoning."
    },
    {
      "prerequisite_concept": "CL-R-C001",
      "dependent_concept": "EN-KS1-C020",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Discussing texts in KS1 requires the listening comprehension foundations established through sustained listening in EYFS. A child who has not developed attentive listening in Reception will lack the capacity to engage with extended class text discussion at KS1."
    },
    {
      "prerequisite_concept": "CL-R-C003",
      "dependent_concept": "EN-KS1-C020",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Text discussion in KS1 is a dialogic activity built on the back-and-forth conversational skills established in EYFS. Children who can sustain multi-turn exchanges in Reception are equipped to participate in the structured book talk of KS1."
    },
    {
      "prerequisite_concept": "CL-R-C004",
      "dependent_concept": "EN-KS1-C019",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Vocabulary development in KS1 builds directly on the vocabulary-in-context learning established in EYFS. Children who have practised deploying recently introduced vocabulary in spoken language in Reception are better positioned to encounter, retain and use extended vocabulary in KS1 reading and writing contexts."
    }
  ]
}
