{
  "metadata": {
    "subject": "Expressive Arts and Design",
    "key_stage": "EYFS",
    "years_covered": [
      0
    ],
    "document_reference": "DfE EYFS Statutory Framework 2024",
    "extraction_date": "2026-02-22",
    "structure_rating": 7,
    "notes": "Expressive Arts and Design is a Specific Area with 2 ELGs. ELG 16: Creating with Materials; ELG 17: Being Imaginative and Expressive. Neither contributes to the GLD calculation. This area maps to Art & Design, Music, Drama and D&T at KS1. The creative processes (exploring materials, imaginative play, performance) are more important at EYFS than any specific technical skill."
  },
  "domains": [
    {
      "domain_id": "EAD-R-D001",
      "domain_name": "Creating with Materials",
      "description": "Using and exploring a variety of materials, tools and techniques to create artworks and products, sharing and explaining the creative process, and using props in role play.",
      "curriculum_context": "Creating with Materials is Early Learning Goal 16 within the Expressive Arts and Design Specific Area. At the end of Reception, children are expected to safely use and explore a variety of materials, tools and techniques, experimenting with colour, design, texture, form and function. They should be able to share their creations, explaining the process they have used. They should also make use of props and materials when role playing characters in narratives and stories. This ELG encompasses the full making cycle from initial exploration through intentional design to reflective explanation. The emphasis on process — experimenting, explaining — over product is deliberate: at EYFS, the child's engagement with materials and their growing capacity to communicate about what they have made matters more than technical finish or resemblance to a model. This domain is the direct precursor of Art and Design and Design and Technology at KS1, where children begin to develop systematic skills in drawing, painting, sculpture and the design-make-evaluate cycle.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "EAD-R-D002",
      "domain_name": "Being Imaginative and Expressive",
      "description": "Inventing and recounting narratives, singing nursery rhymes and songs, and performing songs, rhymes, poems and stories with others, including moving in time with music.",
      "curriculum_context": "Being Imaginative and Expressive is Early Learning Goal 17 within the Expressive Arts and Design Specific Area. At the end of Reception, children are expected to invent, adapt and recount narratives and stories with peers and their teacher. They should sing a range of well-known nursery rhymes and songs. They should perform songs, rhymes, poems and stories with others, and when appropriate try to move in time with music. This ELG spans narrative imagination, vocal performance and physical response to music — three interrelated expressive capacities that share a common foundation in children's drive to communicate meaning through action, voice and story. The emphasis on 'trying to move in time with music' acknowledges that keeping in time is genuinely challenging for many five-year-olds and that the intentional attempt matters more than accuracy at this stage. This domain is the direct precursor of Music at KS1 (singing, pulse, performance) and of Drama and English at KS1 (storytelling, narrative composition, performance poetry).",
      "is_cross_cutting": false,
      "structure_type": "skills"
    }
  ],
  "objectives": [
    {
      "objective_id": "EAD-R-O001",
      "domain_id": "EAD-R-D001",
      "objective_text": "Safely use and explore a variety of materials, tools and techniques, experimenting with colour, design, texture, form and function.",
      "non_statutory_guidance": "Children should have regular access to a rich range of materials including paint, clay, collage materials, construction materials, natural materials and found objects. The focus at this stage is on open-ended exploration and purposeful experimentation rather than copying a model. Adults should provide a workshop-style provision where children can choose materials independently and try out their ideas. Safety in using tools — scissors, hole punches, rolling pins — should be explicitly taught through modelling and routine rather than restriction.",
      "examples": "A child mixes paint colours to find the exact shade of orange they want for their sunset picture and tests it on a scrap of paper first. A child experiments with different ways to attach card pieces, trying glue, tape and folding tabs to find which is strongest. A child rolls, squeezes and coils clay purposefully to make a pot, describing the texture as they go.",
      "is_statutory": true,
      "year": [
        0
      ]
    },
    {
      "objective_id": "EAD-R-O002",
      "domain_id": "EAD-R-D001",
      "objective_text": "Share their creations, explaining the process they have used.",
      "non_statutory_guidance": "The expectation is for children to talk about what they have made and how they made it — not to produce a written evaluation. Adults should create regular opportunities for children to share their work with a partner, a small group or the class, and should ask open process questions: 'How did you make this part?', 'What did you try first?', 'What would you change?'. Explanation of process is a higher-order skill than simply showing a product; it requires the child to reconstruct their decision-making sequence in language, which strongly supports both cognitive consolidation and communication development.",
      "examples": "After making a collage animal, a child explains: 'I used the rough paper for the fur because it felt prickly like a hedgehog, and I folded the ears to make them stick up'. A child tells the class how they constructed their bridge: 'I put a triangle in the middle because triangles are stronger and it stopped it collapsing'.",
      "is_statutory": true,
      "year": [
        0
      ]
    },
    {
      "objective_id": "EAD-R-O003",
      "domain_id": "EAD-R-D001",
      "objective_text": "Make use of props and materials when role playing characters in narratives and stories.",
      "non_statutory_guidance": "Role play is a powerful context in which children integrate their creative, language and social development. Using props purposefully — selecting an object, transforming it symbolically (a wooden block becomes a phone, a cloth becomes a cloak) or making simple props to support the narrative — is a mark of sophisticated imaginative engagement. Adults should provide well-resourced role play areas with open-ended props that can serve multiple purposes, and should enter the role play alongside children to model purposeful prop use and extend narrative complexity.",
      "examples": "A child takes on the role of a doctor and uses a ruler as a thermometer, explaining to a patient character what she is doing and why. Children re-enact a story they have heard, assigning props to represent key objects in the narrative and adapting the ending. A child makes a simple crown from card in the making area and then uses it to role play a king character across the afternoon.",
      "is_statutory": true,
      "year": [
        0
      ]
    },
    {
      "objective_id": "EAD-R-O004",
      "domain_id": "EAD-R-D002",
      "objective_text": "Invent, adapt and recount narratives and stories with peers and their teacher.",
      "non_statutory_guidance": "Narrative invention at EYFS encompasses a spectrum from simple recount ('and then the bear went into the house') to more complex invented narrative with characters, settings, problems and resolutions. Adults should model all three processes: inventing a new story, adapting a known story (e.g. changing the ending, introducing a new character), and recounting a real or imagined experience as a narrative. Story maps, small world play, story spoons and collaborative oral storytelling are all effective contexts for developing narrative capacity. The word 'adapt' is significant: children should learn that all storytellers transform source material, not just transmit it.",
      "examples": "A child invents a sequel to a class book, narrating it to a friend using small world figures. A group of children collaboratively adapt The Three Little Pigs, giving the wolf a reason for his behaviour that makes him more sympathetic. A child recounts their weekend as a story with a beginning, middle and end: 'One day, on Saturday, I went to my Grandma's house and there was a big dog...'",
      "is_statutory": true,
      "year": [
        0
      ]
    },
    {
      "objective_id": "EAD-R-O005",
      "domain_id": "EAD-R-D002",
      "objective_text": "Sing a range of well-known nursery rhymes and songs; perform songs, rhymes, poems and stories with others.",
      "non_statutory_guidance": "A repertoire of well-known rhymes and songs is foundational to phonological awareness, musical development and cultural literacy. Schools should build a shared class repertoire of at least 20-30 songs, rhymes and poems across the Reception year, revisiting them regularly so children have them securely in memory. Performance — singing or reciting to an audience — should be a regular and low-stakes classroom routine, not reserved for set-piece concerts. Group performance before individual performance; informal before formal. Actions, instruments and props support performance confidence for less linguistically confident children.",
      "examples": "The class performs 'Incy Wincy Spider' as a morning routine with actions. A group performs a poem they have learnt for a Year 1 buddy class. Children perform a class-composed song about their topic at the end of half-term. Individual children volunteer to perform a favourite rhyme at circle time.",
      "is_statutory": true,
      "year": [
        0
      ]
    },
    {
      "objective_id": "EAD-R-O006",
      "domain_id": "EAD-R-D002",
      "objective_text": "When appropriate, try to move in time with music.",
      "non_statutory_guidance": "Moving in time with music requires the child to internalise a regular pulse and coordinate their physical movement to match it — a skill that depends on both auditory processing and motor control. The phrase 'when appropriate' acknowledges that not all music is suitable for movement, and that the expectation is contextual rather than constant. The word 'try' is deliberate: accurate synchronisation is challenging for many five-year-olds and the expectation is for intentional, effortful attempt rather than consistent precision. Adults should provide regular structured opportunities for movement to music through circle time, dance activities and musical games, using music with a clear and steady pulse.",
      "examples": "Children clap to the beat of a nursery rhyme, most clapping in time with most beats. Children march to a piece of marching music, stepping on the beat with increasing consistency. A child shows awareness of the beat by nodding their head or tapping a foot while singing. Children move freely to music, changing their movement quality when the music changes.",
      "is_statutory": true,
      "year": [
        0
      ]
    }
  ],
  "concepts": [
    {
      "concept_id": "EAD-R-C001",
      "domain_id": "EAD-R-D001",
      "concept_name": "Materials Exploration and Experimentation",
      "description": "The active, purposeful investigation of different materials, tools and techniques, experimenting with the visual and tactile qualities of colour, texture, form and function to discover what each material can and cannot do. At EYFS, this is less about acquiring specific technical skills than about developing a confident, experimental mindset: children try things out, notice what happens, adjust their approach and try again. Exploration of materials underpins all subsequent art, design and technology learning by establishing that making begins with curiosity about what materials can do.",
      "teaching_guidance": "Provide a rich and varied making environment with open-ended access to paint (powder, ready-mixed, watercolour), clay, collage materials, construction kits, natural materials and found objects. Resist providing adult models to copy: instead, pose open provocations ('I wonder what would happen if you mixed those two colours', 'What could you use to make something bumpy?'). Value the process of exploration as explicitly as the product. Encourage children to describe what they notice as they work: 'What does it feel like?', 'What happens when you add more water?', 'Can you make it a different shape?'. Ensure all children have regular access regardless of perceived ability.",
      "key_vocabulary": "material, texture, smooth, rough, soft, hard, colour, mix, shape, form, tools, experiment, try, change, explore",
      "common_misconceptions": "Adults often over-direct creative activities at EYFS, providing step-by-step models that limit children's experimentation. Children may believe there is a 'right way' to use materials if they have mainly been given structured tasks. Open-ended provision corrects this. Children may also lack confidence to experiment if previous attempts have been evaluated negatively; establishing a culture where trying is always valued over outcome is essential.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": [
        "EAD-R-C002",
        "EAD-R-C003"
      ]
    },
    {
      "concept_id": "EAD-R-C002",
      "domain_id": "EAD-R-D001",
      "concept_name": "Intentional Making and Design",
      "description": "Creating with a purpose in mind: selecting materials, tools and techniques deliberately to achieve a specific effect, and being able to explain the choices made and the process followed. This moves beyond open-ended exploration to goal-directed making in which the child holds an intention and evaluates their materials and methods against it. The ability to explain the process — 'I chose this because...', 'I did this first and then...' — demonstrates that the child has internalised the making process and can reflect on it, which is the EYFS precursor of the design-make-evaluate cycle in KS1 Design and Technology.",
      "teaching_guidance": "Provide making challenges that have a purpose but leave the method open: 'Can you make something that the bear could hide under?', 'Make a gift for someone in your family'. Before making, ask children what they are planning to make and what materials they think they will need. During making, ask process questions: 'Is that working the way you wanted?', 'What will you do next?'. After making, create regular sharing opportunities where children explain their process to the group. Value and display children's explanations alongside their products.",
      "key_vocabulary": "plan, make, choose, because, design, create, purpose, explain, process, idea, decide, try, change, finish",
      "common_misconceptions": "Children may focus entirely on product appearance without considering whether it achieves its purpose ('It looks nice' as the sole evaluation). Teaching children to check against the original intention builds purposeful evaluation. Adults sometimes accept 'I just made it' as an explanation — prompting children to reconstruct their decision sequence in language requires patience and consistent modelling.",
      "concept_type": "process",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": [
        "EAD-R-C001"
      ]
    },
    {
      "concept_id": "EAD-R-C003",
      "domain_id": "EAD-R-D001",
      "concept_name": "Role-play and Props",
      "description": "The use of physical objects — either ready-made props, repurposed everyday objects or child-made props — to support and extend imaginative role play and character enactment. In role play with props, children engage in symbolic thinking: an object is treated as standing for something else (a block becomes a phone; a cloth becomes a cloak). This symbolic use of objects is both a mark of cognitive development and a powerful support for narrative, language and social learning. Making props connects this domain to materials exploration (EAD-R-C001) and narrative invention (EAD-R-C004).",
      "teaching_guidance": "Provide role play areas that are richly resourced with open-ended props (scarves, hats, boxes, lengths of fabric, simple tools) that can serve multiple roles rather than single-use commercial props. Support children in making their own props in the making area and then using them in the role play area. Enter role play alongside children to model purposeful prop use and narrative extension. Avoid scripting the role play for children; instead, ask 'What is this?', 'What are you going to do with it?' to prompt symbolic thinking. Change the role play provision regularly to introduce new contexts and narrative possibilities.",
      "key_vocabulary": "role play, character, prop, pretend, imagine, story, become, as if, play, act, use, represent",
      "common_misconceptions": "Children who have not developed symbolic thinking may use props only literally (a phone is only a phone). Adults can scaffold symbolic play by modelling repurposing objects ('I'm going to use this stick as a magic wand — what would your magic wand do?'). Some children avoid role play areas; tracking participation and ensuring all children have supported entry experiences is important.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": [
        "EAD-R-C001",
        "EAD-R-C004"
      ]
    },
    {
      "concept_id": "EAD-R-C004",
      "domain_id": "EAD-R-D002",
      "concept_name": "Storytelling and Narrative Invention",
      "description": "The ability to create, adapt and recount narratives — stories with at least a beginning, a middle and an end, involving characters, a setting and a problem or event. At EYFS, children move from simple sequential recount ('and then... and then...') to more structured narrative that has shape and intentionality. Narrative invention is one of the most powerful vehicles for language development, imaginative thinking and cultural learning. Children who have a rich repertoire of stories they know well and the confidence to invent new ones enter KS1 with strong foundations for composition, comprehension and drama.",
      "teaching_guidance": "Build a strong shared repertoire of known stories through regular read-alouds and storytelling using Pie Corbett's Talk for Writing approach: oral retelling, story mapping, and story innovation. Use small world play, story spoons, puppets and story sacks to scaffold oral narrative. Set regular narrative tasks: retell a known story, change one element, invent a new story based on a starting image or object. Model narrative structure explicitly: 'Every story has a beginning — who is in it and where are they? A middle — what is the problem? And an end — how does it get sorted out?' Provide opportunities for collaborative storytelling between pairs and small groups.",
      "key_vocabulary": "story, beginning, middle, end, character, setting, problem, happening, retell, make up, invent, once upon a time, narrative",
      "common_misconceptions": "Children often produce lists of events ('and then... and then...') rather than narratives with structure and causality. The shift from additive to causal connectives ('because', 'so', 'which meant that') is a key developmental step requiring explicit teaching. Some children believe they cannot invent stories because they 'don't know enough'; scaffolding with a character, a setting and a simple problem removes this barrier.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": [
        "EAD-R-C003",
        "EAD-R-C005"
      ]
    },
    {
      "concept_id": "EAD-R-C005",
      "domain_id": "EAD-R-D002",
      "concept_name": "Song, Rhyme and Musical Performance",
      "description": "The ability to sing a repertoire of nursery rhymes and songs with reasonable accuracy of pitch, rhythm and words, and to perform these — and poems and stories — to others. At EYFS, children build a core shared repertoire through frequent repetition and gradually develop the confidence and vocal control to perform individually and in groups. Singing nursery rhymes and songs is not merely a musical activity: it is central to phonological awareness (hearing and producing rhyme, rhythm, syllable patterns), language development (new vocabulary, sentence patterns) and cultural knowledge. Performance — even to a small, supportive audience — develops confidence, turn-taking and the awareness that voices can communicate to others.",
      "teaching_guidance": "Sing daily, with purpose: use songs as transitions, as circle time routines, as warm-ups, as content teaching. Build the class repertoire gradually, returning to the same songs many times before adding new ones. Teach songs slowly, phrase by phrase, with movement and actions to support memory. Create low-stakes performance opportunities regularly: class performances, buddy class visits, parent sharing sessions. Value group singing before solo performance; never compel solo performance. Use clapping, percussion instruments and movement to reinforce the rhythmic structure of songs and rhymes.",
      "key_vocabulary": "sing, song, rhyme, nursery rhyme, perform, voice, words, chorus, verse, tune, melody, beat, rhythm",
      "common_misconceptions": "Adults sometimes underestimate the educational power of nursery rhymes and songs, treating them as mere entertainment. Research is clear that phonological awareness developed through rhyme and song is one of the strongest early predictors of reading success. Children who have a rich aural repertoire of rhymes and songs enter phonics instruction with significant advantages.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": [
        "EAD-R-C006",
        "EAD-R-C004"
      ]
    },
    {
      "concept_id": "EAD-R-C006",
      "domain_id": "EAD-R-D002",
      "concept_name": "Moving to Music",
      "description": "Responding to music through physical movement and, increasingly, attempting to synchronise movement with a steady musical pulse. At EYFS, this encompasses a spectrum from free expressive movement in response to the mood or character of music, to structured attempts to clap, step or move in time with a steady beat. The ability to internalise a pulse and coordinate physical movement to it — beat competency — is a foundational musical skill that develops through practice and supports all subsequent music learning. Moving to music also supports physical development, spatial awareness and the experience of music as something felt in the body rather than only heard.",
      "teaching_guidance": "Provide regular structured movement to music activities: marching, clapping games, action songs, musical statues. Use music with a very clear and consistent pulse at a tempo suitable for young children (70-90 bpm). Model beat synchronisation physically and explicitly: step on every beat, clap on every beat, emphasising the regularity. Accept and celebrate attempts to move in time even when synchronisation is approximate. Vary the stimulus — use different musical styles, different tempos, different moods — and discuss how children's movements change in response. Use body percussion (clapping, patting knees, stamping) as a bridge between listening and moving.",
      "key_vocabulary": "beat, pulse, time, move, clap, march, step, rhythm, fast, slow, in time, music, listen, feel",
      "common_misconceptions": "Many five-year-olds cannot consistently move in time with an external pulse — this is developmentally normal and not an indicator of musical aptitude. Adults should avoid labelling children as 'unmusical' based on beat synchronisation at this age. The ability to keep a steady pulse develops through practice and most children achieve it by the end of KS1 with sufficient opportunity.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": [
        "EAD-R-C005"
      ]
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "EAD-R-C001",
      "dependent_concept": "EAD-R-C002",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Open-ended exploration of materials builds the knowledge of what different materials can do that is necessary for intentional, goal-directed making. Children must discover the properties and affordances of materials through experimentation before they can select among them deliberately to achieve a specific effect."
    },
    {
      "prerequisite_concept": "EAD-R-C003",
      "dependent_concept": "EAD-R-C004",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Purposeful use of props in role play develops the symbolic and imaginative thinking that underpins narrative invention. Children who can enact characters using physical objects in role play are exercising the same capacity for imaginative transformation that story invention requires at a more complex level."
    },
    {
      "prerequisite_concept": "EAD-R-C005",
      "dependent_concept": "EAD-R-C006",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Singing nursery rhymes and songs familiarises children with the experience of musical pulse and rhythm in a vocal, social context. The rhythmic patterns embedded in song and rhyme provide the aural foundation from which children begin to synchronise physical movement with an external beat."
    },
    {
      "prerequisite_concept": "EAD-R-C001",
      "dependent_concept": "AD-KS1-C001",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "The exploratory handling of materials in EYFS — discovering what paint, clay, collage and construction materials can do — directly prepares children for the more structured materials-and-making work of KS1 Art and Design. The range of materials, tools and techniques encountered in Reception provides the practical experience base on which KS1 making skills are built."
    },
    {
      "prerequisite_concept": "EAD-R-C002",
      "dependent_concept": "AD-KS1-C005",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Intentional making at EYFS — choosing colour, texture and form deliberately and explaining those choices — establishes the foundation for the formal study of visual elements (colour, pattern, texture, line, shape, form and space) at KS1. Children who have made purposeful material choices in Reception are ready to learn the vocabulary and conceptual framework of the formal elements of art."
    },
    {
      "prerequisite_concept": "EAD-R-C005",
      "dependent_concept": "MU-KS1-C001",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "The nursery rhyme and song repertoire built in Reception — through which children internalise the rhythmic patterns of language and music — directly prepares children for the formal study of pulse and rhythm at KS1. Children who can sing a range of songs in time have practical experience of pulse and rhythm as musical phenomena before they encounter these as explicit concepts."
    },
    {
      "prerequisite_concept": "EAD-R-C006",
      "dependent_concept": "MU-KS1-C001",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Moving to music in EYFS — attempting to synchronise physical movement with a steady beat — develops the proprioceptive and auditory foundations of beat competency that is formalised as the pulse and rhythm concept at KS1. Children who have practised feeling and moving to a beat in Reception are far better equipped to engage with pulse and rhythm as explicit musical concepts at KS1."
    },
    {
      "prerequisite_concept": "EAD-R-C002",
      "dependent_concept": "DT-KS1-C001",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Intentional making with explanation in EYFS is the direct developmental precursor of the iterative design process at KS1. Children who have practised holding a making intention, evaluating their materials against it, adjusting their approach, and explaining their process have already experienced the core cognitive operations of design-make-evaluate in an informal, exploratory form."
    }
  ]
}
