{
  "metadata": {
    "subject": "Literacy",
    "key_stage": "EYFS",
    "years_covered": [0],
    "document_reference": "DfE EYFS Statutory Framework 2024",
    "extraction_date": "2026-02-22",
    "structure_rating": 9,
    "notes": "Literacy is a Specific Area with 3 ELGs. ELG 8: Comprehension; ELG 9: Word Reading; ELG 10: Writing. All contribute to GLD. EYFS Literacy is the most direct prerequisite for KS1 English. Word Reading (ELG 9) feeds directly into phonics at KS1. ELG 9 requires knowing sounds for each letter of the alphabet and at least 10 digraphs — this is the starting point for the KS1 phonics programme."
  },
  "domains": [
    {
      "domain_id": "LIT-R-D001",
      "domain_name": "Comprehension",
      "description": "Understanding and responding to what has been read aloud, including retelling stories, anticipating events, and using new vocabulary (ELG 8).",
      "curriculum_context": "Comprehension at EYFS is developed primarily through adult-led shared reading and storytelling. Children are not yet expected to read independently, so comprehension is achieved by listening to texts read aloud. The ELG focuses on three interconnected skills: retelling stories in own words (which demonstrates active engagement and internalisation of narrative structure), anticipating key events (which shows the child has developed a sense of story arc and can make predictions), and using and understanding recently introduced vocabulary (which reflects the role of rich reading diet in expanding spoken language). These skills are developed through high-quality, repeated reading of picture books, traditional tales, and non-fiction. At Reception, oral language and comprehension are the gateway to all later reading — a child who has heard and internalised hundreds of stories, discussed characters and events, and accumulated a broad vocabulary is well placed for the transition to decoding and meaning-making at KS1.",
      "is_cross_cutting": false,
      "structure_type": "sequential"
    },
    {
      "domain_id": "LIT-R-D002",
      "domain_name": "Word Reading",
      "description": "Decoding words using phonic knowledge, including letter-sound correspondences, digraph awareness, and reading common exception words (ELG 9).",
      "curriculum_context": "Word Reading at EYFS is the foundational layer of the systematic synthetic phonics programme that continues through KS1 and into KS2. The ELG specifies three components that together constitute early decoding competence: knowing a sound (phoneme) for each letter of the alphabet (GPC knowledge), knowing the sounds for at least 10 digraphs (two letters representing one sound, e.g. sh, ch, th, ee, ai), and being able to blend phonemes to read words consistent with the child's current phonic knowledge, including reading simple sentences and books. Children at this stage also begin to recognise common exception words (tricky words) that cannot be fully decoded phonically, such as 'the', 'said', 'was'. This domain has the most direct relationship to statutory KS1 requirements: the phonics screening check at the end of Year 1 tests the same knowledge and skills. Reception-class systematic phonics teaching is therefore the essential prerequisite for KS1 English reading. The EYFS word reading domain is taught through discrete daily phonics sessions using a structured programme (typically Read Write Inc., Jolly Phonics, or Letters and Sounds Phase 2-3).",
      "is_cross_cutting": false,
      "structure_type": "sequential"
    },
    {
      "domain_id": "LIT-R-D003",
      "domain_name": "Writing",
      "description": "Writing recognisable letters with correct formation, spelling phonically by segmenting sounds, and composing simple phrases and sentences (ELG 10).",
      "curriculum_context": "Writing at EYFS brings together two distinct capabilities: the physical skill of letter formation and the linguistic skill of encoding spoken language into print. ELG 10 sets expectations at a level appropriate to the end of Reception: children should be able to write recognisable letters, most with correct orientation and formation; spell words by identifying the sounds in them and representing each sound with a letter or letters; and write simple phrases and sentences that others can read. This requires the integration of phonemic segmentation (breaking a spoken word into its constituent sounds), grapheme-phoneme correspondence knowledge (knowing which letters represent which sounds), letter formation (the motor skill of writing each letter legibly), and sentence-level knowledge (understanding that written language is composed in sentences). Writing at EYFS is therefore dependent on all the phonological skills from the Word Reading domain plus the motor skill of letter formation. The relationship between reading and writing is explicitly acknowledged in the statutory framework: they are mutually reinforcing, and progress in one supports progress in the other.",
      "is_cross_cutting": false,
      "structure_type": "sequential"
    }
  ],
  "objectives": [
    {
      "objective_id": "LIT-R-O001",
      "domain_id": "LIT-R-D001",
      "objective_text": "Demonstrate understanding of what has been read to them by retelling stories and narratives using their own words and recently introduced vocabulary.",
      "non_statutory_guidance": "Children should be given frequent opportunities to retell familiar stories in their own words, using puppets, props, story maps, and role-play. Adults should model the use of story language ('Once upon a time…', 'Then…', 'In the end…') and expect children to use it. Repeated reading of the same text builds the secure knowledge of narrative sequence needed for independent retelling. Non-fiction texts should also be used so that children practise retelling factual content.",
      "examples": "Retelling 'The Three Billy Goats Gruff' using puppets in the small world area; using a story map to sequence events in 'The Enormous Turnip'; retelling a non-fiction text about penguins after it has been read aloud twice.",
      "is_statutory": true,
      "year": [0]
    },
    {
      "objective_id": "LIT-R-O002",
      "domain_id": "LIT-R-D001",
      "objective_text": "Anticipate — where appropriate — key events in stories.",
      "non_statutory_guidance": "Children should be encouraged to predict what will happen next in stories based on what they already know about the characters, setting, and story pattern. Adults should pause at key moments and ask 'What do you think will happen next? Why do you think that?' Predictable patterned stories (e.g., repetitive cumulative tales) are particularly good for developing anticipation. Over time, children should be able to anticipate not just plot events but character responses and typical genre conventions.",
      "examples": "Predicting what the wolf will do next in 'The Three Little Pigs'; anticipating the final pattern in a cumulative tale such as 'The Very Hungry Caterpillar'; predicting what a non-fiction book about the sea might tell us before reading it.",
      "is_statutory": true,
      "year": [0]
    },
    {
      "objective_id": "LIT-R-O003",
      "domain_id": "LIT-R-D001",
      "objective_text": "Use and understand recently introduced vocabulary during discussions about stories, non-fiction, rhymes and poems and during role-play.",
      "non_statutory_guidance": "Children should be directly taught new vocabulary from books and use it in context. Tier 2 vocabulary (words used across many contexts: enormous, ferocious, delicate, transparent) should be explicitly highlighted during reading and revisited across the week. Children should be expected to use new words in their own talk, in discussions about books, and in role-play. Creating vocabulary displays and word banks linked to class texts supports retention.",
      "examples": "Using the word 'burrowed' correctly after encountering it in a rabbit story; discussing what 'transparent' means after a non-fiction science text; using words like 'timid', 'courageous', 'devastated' in drama and role-play linked to class books.",
      "is_statutory": true,
      "year": [0]
    },
    {
      "objective_id": "LIT-R-O004",
      "domain_id": "LIT-R-D002",
      "objective_text": "Say a sound for each letter of the alphabet and at least 10 digraphs.",
      "non_statutory_guidance": "Children should be taught the letter sounds (phonemes) for all 26 letters of the alphabet in their single-letter form, and the sounds for at least 10 digraphs (two letters making one sound). Digraphs should be chosen from those taught in the structured phonics programme used by the setting. Common digraphs include: sh, ch, th, ng, ai, ee, igh, oa, oo, ar, or, ur, ow, oi, ear, air. The grapheme-phoneme correspondence should be taught in both directions: given the grapheme, say the phoneme; given the phoneme, identify the grapheme.",
      "examples": "Saying 'mmm' when shown the letter m; saying 'sh' when shown the digraph sh; playing snap or bingo with letter cards; playing sound-sorting games.",
      "is_statutory": true,
      "year": [0]
    },
    {
      "objective_id": "LIT-R-O005",
      "domain_id": "LIT-R-D002",
      "objective_text": "Read words consistent with their phonic knowledge by sound-blending.",
      "non_statutory_guidance": "Children should be able to read unfamiliar words within their phonics knowledge by saying each sound in order and blending them together. This is the core synthetic phonics skill. At Reception, words will typically be CVC (consonant-vowel-consonant) and simple CVCC/CCVC patterns. Children should read words in isolation and in decodable text. Blending should become increasingly smooth and automatic across the year.",
      "examples": "Reading 'cat' by saying c-a-t and blending; reading 'ship' using the digraph sh; reading a decodable book at the appropriate phase; word-reading games using phonics flashcards.",
      "is_statutory": true,
      "year": [0]
    },
    {
      "objective_id": "LIT-R-O006",
      "domain_id": "LIT-R-D002",
      "objective_text": "Read aloud simple sentences and books that are consistent with their phonic knowledge, including some common exception words.",
      "non_statutory_guidance": "Children should be able to read simple decodable books matched to their current phonics phase and common exception words (tricky words) that they have been taught. Exception words cannot be fully decoded phonically (e.g., 'the', 'said', 'was', 'I', 'to') and must be partially or wholly learned by sight. By the end of Reception, children should be able to read simple sentences fluently, blending phonically decodable words and recalling taught exception words from memory.",
      "examples": "Reading a Phase 3 decodable book independently; reading a sentence like 'The dog sat on the mat' which includes the exception word 'the'; reading exception word flashcards as a warm-up activity.",
      "is_statutory": true,
      "year": [0]
    },
    {
      "objective_id": "LIT-R-O007",
      "domain_id": "LIT-R-D003",
      "objective_text": "Write recognisable letters, most of which are correctly formed.",
      "non_statutory_guidance": "Children should be able to form all letters of the alphabet in a recognisable way, with most letters correctly formed in terms of starting point, direction of movement, and orientation. Some reversal errors (e.g., b/d, p/q) are normal at this stage. Physical development — fine motor skills, pencil grip, hand strength — underpins letter formation and should be developed through a range of activities. The correct formation of each letter should be explicitly taught and practised.",
      "examples": "Forming the letter 's' starting at the top and curving correctly; writing a recognisable 'a' even if it is slightly large or uneven; practising letter formation in sand, on whiteboards, and in the air before pencil on paper.",
      "is_statutory": true,
      "year": [0]
    },
    {
      "objective_id": "LIT-R-O008",
      "domain_id": "LIT-R-D003",
      "objective_text": "Spell words by identifying the sounds in them (segmenting) and representing the sounds with a letter or letters.",
      "non_statutory_guidance": "Children should be taught to spell phonically regular words by segmenting spoken words into their constituent phonemes and selecting appropriate graphemes for each. This is the inverse process to blending for reading. At Reception, children are not expected to spell exception words correctly from memory but should attempt an approximation using their phonic knowledge. Invented spelling that shows clear phoneme-grapheme correspondence ('woz' for 'was', 'sed' for 'said') should be celebrated as demonstrating phonological understanding.",
      "examples": "Spelling 'dog' by saying d-o-g and writing each sound; spelling 'chip' using the ch digraph; writing a caption for a picture using phonically regular words; segmenting using the fingers ('robot arms') before writing.",
      "is_statutory": true,
      "year": [0]
    },
    {
      "objective_id": "LIT-R-O009",
      "domain_id": "LIT-R-D003",
      "objective_text": "Write simple phrases and sentences that can be read by others.",
      "non_statutory_guidance": "Children should be able to compose and write simple phrases and full sentences that are legible and readable by an adult. This requires the integration of letter formation, phonemic segmentation, and sentence-level understanding (spaces between words, capital letter at the start, full stop at the end). Composition should be taught orally first — children say their sentence aloud, rehearse it, then write it. Short, supported writing tasks with a clear purpose are most effective at this stage.",
      "examples": "Writing a caption under a drawing ('I can see a big dog'); writing a sentence about a class trip ('We went to the park'); writing a simple label for a model or object in the environment; completing a sentence frame in a guided writing session.",
      "is_statutory": true,
      "year": [0]
    }
  ],
  "concepts": [
    {
      "concept_id": "LIT-R-C001",
      "domain_id": "LIT-R-D001",
      "concept_name": "Story Retelling",
      "description": "The ability to retell a narrative heard or read aloud using one's own words, maintaining the correct sequence of events and using story language. Story retelling at EYFS demonstrates active comprehension: the child has understood and internalised the narrative well enough to reconstruct it. Secure retelling incorporates story structure (beginning, middle, end), character reference, and key plot events. It is not memorised recitation but a reconstruction using the child's own language enriched by story vocabulary.",
      "teaching_guidance": "Use props, puppets, story maps, and story stones to support retelling. Model retelling explicitly before expecting children to do it alone. Provide repeated readings of the same text before expecting independent retelling. Accept and value diverse retelling approaches — oral, through play, through drawing. Teach story language frames ('One day...', 'Suddenly...', 'In the end...') as tools for retelling. Pair children to retell to each other.",
      "key_vocabulary": "retell, story, beginning, middle, end, character, event, happen, then, next, finally",
      "common_misconceptions": "Children sometimes confuse retelling with giving a personal opinion or response to a story. They may describe how the story made them feel rather than sequencing what happened. Some children retell only the ending if that was most memorable. Scaffolding with a simple three-part structure (what happened first, in the middle, at the end) helps.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": ["LIT-R-C002", "LIT-R-C003"]
    },
    {
      "concept_id": "LIT-R-C002",
      "domain_id": "LIT-R-D001",
      "concept_name": "Anticipation of Story Events",
      "description": "The cognitive skill of predicting what will happen next in a story based on knowledge of story structure, character, setting, and genre conventions. Anticipation demonstrates that the child is actively constructing meaning as they listen, using what they know about narrative patterns to generate expectations. At EYFS, this is typically stimulated through oral prediction activities during shared reading. Increasingly sophisticated anticipation involves drawing on character motivation, genre conventions, and thematic patterns rather than just previous plot events.",
      "teaching_guidance": "Pause during reading at high-anticipation moments and ask 'What do you think will happen next? Why do you think that?' Accept and discuss multiple predictions. After the event, return to predictions and evaluate them. Use highly patterned and repetitive stories (cumulative tales, quest narratives, problem-resolution structures) where anticipation is built in. Discuss how familiar knowledge of character traits helps us predict (e.g., 'The wolf is always trying to trick someone, so he will probably...').",
      "key_vocabulary": "predict, think, might, next, happen, because, story, pattern, character, expect",
      "common_misconceptions": "Children often confuse prediction with preference ('I think she'll find the treasure because I like treasure'). They may also make random guesses rather than evidence-based predictions. Explicitly asking 'Why do you think that?' and connecting predictions to story evidence helps develop genuine inference.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": ["LIT-R-C001"]
    },
    {
      "concept_id": "LIT-R-C003",
      "domain_id": "LIT-R-D001",
      "concept_name": "Vocabulary in Comprehension",
      "description": "The active use and understanding of newly introduced vocabulary encountered in stories, non-fiction texts, rhymes, and poems. At EYFS, vocabulary in comprehension involves both receptive knowledge (understanding what a word means when heard) and productive use (being able to use the word appropriately in one's own speech, discussion, and play). Rich vocabulary knowledge is directly predictive of reading comprehension at KS1 and beyond. This concept encompasses Tier 2 vocabulary (general academic words used across subjects: enormous, delicate, transparent, anxious) as well as Tier 3 words specific to topics being studied.",
      "teaching_guidance": "Explicitly highlight new vocabulary during shared reading: stop, say the word, explain or elicit its meaning, use it in a sentence, and invite children to use it. Revisit target vocabulary across the week in different contexts. Create vocabulary displays and word cards in the reading area. Encourage children to use target words in their own talk, play, and drawing. Sentence stems that include the new word can scaffold early use.",
      "key_vocabulary": "word, mean, use, new, learn, describe, vocabulary, say, tell",
      "common_misconceptions": "Children sometimes know a word receptively but are unable to use it productively. They may give a definition-like response ('enormous means big') but not use the word in natural speech. Providing multiple meaningful exposures in varied contexts, rather than definitions alone, supports productive vocabulary acquisition.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": ["LIT-R-C001", "LIT-R-C010"]
    },
    {
      "concept_id": "LIT-R-C004",
      "domain_id": "LIT-R-D002",
      "concept_name": "Letter-Sound Knowledge",
      "description": "The knowledge of the phoneme (sound) associated with each grapheme (letter) of the alphabet in its single-letter form. This is the foundational grapheme-phoneme correspondence (GPC) knowledge required for both decoding (reading) and encoding (writing). Secure letter-sound knowledge means the child can, when shown any letter, immediately say the corresponding phoneme, and conversely, when given a phoneme, identify the corresponding grapheme. This applies to all 26 letters of the alphabet. Letter-sound knowledge is the entry point to the systematic synthetic phonics programme and is the prerequisite for all subsequent phonics work including digraphs, blending, and segmenting.",
      "teaching_guidance": "Teach letter sounds in a structured sequence following the school's chosen phonics programme (typically starting with high-frequency, easily distinguishable sounds such as s, a, t, p, i, n). Ensure children can both identify the grapheme and produce the phoneme — and vice versa. Use multi-sensory approaches: auditory (hear the sound), visual (see the letter), kinaesthetic (write or trace the letter). Practise daily using flashcards, games, and activities. Distinguish between letter names and letter sounds — at this stage, sounds are more important for decoding.",
      "key_vocabulary": "letter, sound, phoneme, grapheme, alphabet, say, match, recognise",
      "common_misconceptions": "Children often confuse letter names with letter sounds (e.g., saying 'aitch' instead of 'h' when decoding). Some children learn letter sounds in a fixed order (through a song, for example) and cannot access a sound out of that sequence. Multiple practice formats that retrieve sounds in random order help build flexible, secure knowledge.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 5,
      "co_teach_hints": ["LIT-R-C005", "LIT-R-C008"]
    },
    {
      "concept_id": "LIT-R-C005",
      "domain_id": "LIT-R-D002",
      "concept_name": "Digraph Awareness",
      "description": "Knowledge that two letters can work together to represent a single phoneme (a digraph), and the ability to identify and produce the phoneme for at least 10 digraphs. Common digraphs taught at Reception include consonant digraphs (sh, ch, th, ng, qu) and vowel digraphs (ai, ee, igh, oa, oo, ar, or, ur, ow, oi, ear, air). Digraph awareness extends letter-sound knowledge by establishing the principle that phoneme-grapheme correspondence is not always one-to-one, and that readers must sometimes consider two-letter combinations as a single unit when decoding.",
      "teaching_guidance": "Introduce digraphs after pupils have a secure grasp of single-letter sounds. Use the same multi-sensory teaching approach as for single letters. Emphasise that a digraph is 'two letters, one sound'. Use reading and writing activities that include known digraphs. Provide plenty of practice distinguishing digraphs from adjacent single letters (e.g., 'ship' — sh is one sound, not s + h).",
      "key_vocabulary": "digraph, two letters, one sound, sh, ch, th, ee, ai, oo, blend",
      "common_misconceptions": "Children often try to sound out each letter of a digraph individually (reading 'ship' as s-h-i-p rather than sh-i-p). Consistent use of digraph flashcards and explicit teaching that the two letters make one sound helps. Some children confuse consonant digraphs (sh, ch) with adjacent consonants in clusters (st, str).",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 4,
      "co_teach_hints": ["LIT-R-C004", "LIT-R-C006"]
    },
    {
      "concept_id": "LIT-R-C006",
      "domain_id": "LIT-R-D002",
      "concept_name": "Phonemic Blending for Reading",
      "description": "The ability to blend individual phonemes together in sequence to produce a recognisable spoken word, thereby decoding a written word. Blending is the core synthetic phonics reading skill: the reader identifies each grapheme in a word, recalls its corresponding phoneme, and runs the phonemes together to reconstruct the word. At Reception, blending is applied to words consistent with the child's current phonic knowledge — typically CVC words first, then CCVC, CVCC, and words containing digraphs. Automatic, fluent blending is the target: initially blending is laboured and segmented; with practice it becomes smooth and rapid.",
      "teaching_guidance": "Teach blending as a skill in its own right, not just as a by-product of reading. Use the 'robot talk' strategy (say the sounds robotically, then push them together). Start with onset-rime blending before phoneme-by-phoneme blending. Use pure phoneme sounds (no 'uh' after consonants). Build from short, CVC words to longer words as confidence grows. Ensure word reading practice follows directly from phonics teaching so children can apply new GPCs immediately.",
      "key_vocabulary": "blend, sound, phoneme, push together, read, word, decode",
      "common_misconceptions": "Children often add a vowel sound ('uh') after consonants, making blending impossible (e.g., 'buh-a-tuh' instead of 'b-a-t'). They may sound out each phoneme correctly but fail to blend them into a word. Some children can blend in isolation but not when reading connected text. Separating the skill practice (word cards) from whole-text reading until blending is automatic can help.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 5,
      "co_teach_hints": ["LIT-R-C005", "LIT-R-C007", "LIT-R-C009"]
    },
    {
      "concept_id": "LIT-R-C007",
      "domain_id": "LIT-R-D002",
      "concept_name": "Common Exception Word Recognition",
      "description": "The ability to read common exception words (also called tricky words or sight words) that cannot be fully decoded using current phonic knowledge. Exception words include high-frequency words that contain phonically irregular or as-yet-untaught correspondences: 'the', 'said', 'was', 'I', 'to', 'do', 'are', 'come', 'some', 'one', 'have', 'like', 'little', 'there'. Reading these words accurately requires partial decoding combined with sight recognition. By the end of Reception, children should recognise the exception words taught in their phonics programme from memory.",
      "teaching_guidance": "Teach exception words explicitly after introducing them in context. Use flashcard practice for rapid retrieval. Explain which part of the word is 'tricky' (cannot be decoded phonically) and which part can be sounded out. Use mnemonics where helpful ('said' = Sally and Ian drove). Ensure exception words appear in decodable reading books so children practice reading them in context. Revisit regularly — exception word recall requires overlearning.",
      "key_vocabulary": "tricky word, sight word, exception, remember, read, recognise",
      "common_misconceptions": "Children may attempt to decode exception words phonically and produce plausible but incorrect attempts ('woz' for 'was'). While this shows good phonics knowledge, they need to learn to recognise the conventionally spelled form. Some children memorise exception words in list form but fail to recognise them in running text.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": ["LIT-R-C006"]
    },
    {
      "concept_id": "LIT-R-C008",
      "domain_id": "LIT-R-D003",
      "concept_name": "Letter Formation",
      "description": "The motor skill of forming recognisable written letters with correct starting point, direction of movement, and orientation. Correct letter formation at Reception means that each letter is recognisable as the intended letter, most letters are correctly oriented (not reversed), and letters are formed using the correct movement pattern that supports later joined handwriting. Letter formation is underpinned by fine motor development and requires significant practice to become automatic. It is a prerequisite for all written composition at EYFS and beyond.",
      "teaching_guidance": "Teach letter formation explicitly alongside letter sound teaching in the phonics programme. Model the formation of each letter, narrating the movement ('Start at the top, go round and down'). Use multi-sensory practice: air writing, sand trays, whiteboards, then pencil on paper. Focus initially on legibility and correct movement pattern rather than neatness. Ensure pencil grip is appropriate — an overhand grip should be corrected early. Letter families (letters formed in similar ways) can be taught together.",
      "key_vocabulary": "letter, form, write, start, direction, correctly, shape, hold, pencil",
      "common_misconceptions": "Some children form letters correctly but with incorrect movement patterns that are difficult to correct later (e.g., forming 'a' with two separate strokes). Reversal errors (b/d, p/q) are extremely common and normal until around age 7. Children who have used tablets extensively may have poor pencil grip and need additional fine motor development work.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 4,
      "co_teach_hints": ["LIT-R-C004"]
    },
    {
      "concept_id": "LIT-R-C009",
      "domain_id": "LIT-R-D003",
      "concept_name": "Phonemic Segmenting for Writing",
      "description": "The ability to break a spoken word into its individual phonemes in sequence, as the basis for spelling — selecting a grapheme to represent each phoneme and writing the letters in order. Phonemic segmenting is the inverse of blending: whereas blending moves from written graphemes to spoken word, segmenting moves from spoken word to written graphemes. At Reception, children are expected to segment simple words consistent with their current phonic knowledge. This skill underpins all independent spelling development through KS1 and beyond.",
      "teaching_guidance": "Teach segmenting explicitly alongside blending — they are complementary skills. Use the 'robot arms' or 'finger tapping' strategy: say the word slowly, holding up a finger for each phoneme, then write a letter for each. Start with short CVC words before progressing to words with digraphs or consonant clusters. Celebrate phonically plausible spelling attempts even when conventionally incorrect. Segmenting should be practised in both isolation (spelling individual words) and in the context of writing sentences.",
      "key_vocabulary": "segment, sound, phoneme, write, spell, letter, word, tap, count",
      "common_misconceptions": "Children often confuse the number of letters in a word with the number of phonemes (e.g., 'ship' has 4 letters but 3 phonemes: sh-i-p). They may write letters for syllables rather than phonemes. Some children can blend successfully but cannot segment — segmenting is a harder skill that requires explicit teaching.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 5,
      "co_teach_hints": ["LIT-R-C006", "LIT-R-C008"]
    },
    {
      "concept_id": "LIT-R-C010",
      "domain_id": "LIT-R-D003",
      "concept_name": "Simple Sentence Construction",
      "description": "The ability to compose and write simple phrases and sentences that can be read by others. At Reception, a simple sentence typically consists of a subject and verb with possible extension (e.g., 'The cat sat.', 'I can see a big dog.'). Written sentence construction requires the integration of oral composition (saying and rehearsing the sentence), phonemic segmenting (to spell each word), letter formation (to write each letter legibly), and sentence conventions (spaces between words, capital letter at start, full stop at end). Mastery at this stage means the child can produce independently readable written sentences, even if some spellings are phonically plausible rather than conventional.",
      "teaching_guidance": "Develop oral sentence construction before written. Use 'say it, repeat it, write it, check it' as a routine. Rehearse the sentence aloud before writing. Teach sentence conventions explicitly: capital letter, full stop, word spaces. Finger spaces between words can be taught physically using a lolly stick or finger. Use shared and guided writing to model the full composition process. Short, purposeful writing tasks with real audiences (labels for displays, captions for photographs, letters to story characters) motivate early writers.",
      "key_vocabulary": "sentence, word, capital letter, full stop, space, write, read, start, end",
      "common_misconceptions": "Children often run words together without spaces. They may write several letters or sounds and consider it a sentence without a clear meaning. Some children focus entirely on spelling and forget to reread for sense. Others write ideas that make sense orally but cannot be decoded from the written form. Rereading after each word or phrase helps children catch and correct errors.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 4,
      "co_teach_hints": ["LIT-R-C003", "LIT-R-C009"]
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "LIT-R-C004",
      "dependent_concept": "LIT-R-C005",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.95,
      "rationale": "Secure knowledge of single-letter sounds (alphabetic GPCs) is the prerequisite for learning digraph sounds. Digraphs extend the GPC principle to two-letter units; pupils must first understand that letters map to sounds before they can grasp that two letters can map to a single sound together."
    },
    {
      "prerequisite_concept": "LIT-R-C004",
      "dependent_concept": "LIT-R-C006",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.95,
      "rationale": "Phonemic blending requires a stock of grapheme-phoneme correspondences to draw on. A child cannot blend phonemes they do not know. Letter-sound knowledge provides the essential raw material that blending operates on."
    },
    {
      "prerequisite_concept": "LIT-R-C004",
      "dependent_concept": "LIT-R-C009",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.95,
      "rationale": "Phonemic segmenting for writing requires the child to select a grapheme for each phoneme they identify in a spoken word. Without letter-sound knowledge, the child cannot translate phonemes into graphemes and thus cannot encode words in writing."
    },
    {
      "prerequisite_concept": "LIT-R-C005",
      "dependent_concept": "LIT-R-C006",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Blending words that contain digraphs requires knowledge of those digraphs. A child who knows only single-letter sounds can blend simple CVC words, but must learn digraph GPCs to decode words like 'ship', 'chat', 'rain'. Digraph awareness extends the blending repertoire."
    },
    {
      "prerequisite_concept": "LIT-R-C006",
      "dependent_concept": "LIT-R-C007",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.75,
      "rationale": "Common exception word recognition is most effectively taught after blending is established. Understanding that a word is a tricky exception (cannot be fully decoded) requires first trying to decode it phonically. Children who can blend attempt to decode exception words and thereby discover which part is irregular — this metacognitive awareness supports targeted memorisation."
    },
    {
      "prerequisite_concept": "LIT-R-C001",
      "dependent_concept": "LIT-R-C002",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Story retelling demonstrates understanding of narrative sequence and character, which is prerequisite for anticipating what will happen next. A child must have internalised enough story structure to reconstruct it (retelling) before they can use that structure to generate forward predictions (anticipation). Secure retelling reflects the narrative knowledge that makes meaningful anticipation possible."
    },
    {
      "prerequisite_concept": "LIT-R-C003",
      "dependent_concept": "LIT-R-C010",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Vocabulary knowledge supports sentence construction: a child who has acquired rich vocabulary from stories and non-fiction has more varied and precise language available for composing their own sentences. Vocabulary in comprehension (receptive and productive word knowledge) feeds directly into the quality and range of written sentences a child can independently compose."
    },
    {
      "prerequisite_concept": "LIT-R-C008",
      "dependent_concept": "LIT-R-C010",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Writing sentences requires the ability to form legible letters. Without secure letter formation, the physical act of writing a sentence is not possible. Letter formation is the foundational motor skill upon which all sentence-level writing depends."
    },
    {
      "prerequisite_concept": "LIT-R-C009",
      "dependent_concept": "LIT-R-C010",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.95,
      "rationale": "Writing simple sentences requires the ability to spell individual words by segmenting. Sentence writing is the application of segmenting skill across multiple consecutive words, connected by sentence conventions. A child who cannot segment phonemes cannot independently spell the words needed to compose a sentence."
    },
    {
      "prerequisite_concept": "LIT-R-C004",
      "dependent_concept": "EN-KS1-C001",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "EYFS Letter-Sound Knowledge is the direct precursor to the KS1 concept of Phoneme. Children who have been taught letter sounds in Reception are introduced at KS1 to the technical vocabulary ('phoneme') that names the sounds they already know. The EYFS concept provides the experiential foundation that the KS1 technical concept formalises."
    },
    {
      "prerequisite_concept": "LIT-R-C004",
      "dependent_concept": "EN-KS1-C002",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "EYFS Letter-Sound Knowledge is the direct precursor to the KS1 concept of Grapheme. Children who have learned letter sounds in Reception are introduced at KS1 to the technical vocabulary ('grapheme') that names the letters and letter-combinations they already know. The EYFS concept provides the experiential foundation that the KS1 technical concept formalises."
    },
    {
      "prerequisite_concept": "LIT-R-C004",
      "dependent_concept": "EN-KS1-C003",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "EYFS Letter-Sound Knowledge constitutes the practical learning of grapheme-phoneme correspondences. The KS1 concept of Grapheme-Phoneme Correspondence (GPC) is the formal, systematic elaboration of the same knowledge. Secure EYFS letter-sound learning directly enables KS1 GPC work to begin from a position of practical fluency rather than from scratch."
    },
    {
      "prerequisite_concept": "LIT-R-C006",
      "dependent_concept": "EN-KS1-C004",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "EYFS Phonemic Blending for Reading is the practical precursor to the KS1 concept of Blending. Children entering KS1 with established blending from Reception can immediately extend this skill to new, more complex phonics patterns. Without Reception blending, KS1 blending instruction must begin from the very beginning."
    },
    {
      "prerequisite_concept": "LIT-R-C009",
      "dependent_concept": "EN-KS1-C005",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "EYFS Phonemic Segmenting for Writing is the practical precursor to the KS1 concept of Segmenting. Children who can segment phonemes in Reception enter KS1 with the foundational skill needed to apply segmenting across a wider range of phonics patterns and to develop independent spelling."
    },
    {
      "prerequisite_concept": "LIT-R-C006",
      "dependent_concept": "EN-KS1-C006",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "EYFS Phonemic Blending for Reading is the foundational precursor to the KS1 concept of Decoding. Decoding at KS1 is the developed, consolidated form of the blending skill established in Reception. Children who blend fluently in Reception are able to decode more complex words at KS1 without needing to relearn the underlying process."
    },
    {
      "prerequisite_concept": "LIT-R-C007",
      "dependent_concept": "EN-KS1-C008",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "EYFS Common Exception Word Recognition directly precedes the KS1 concept of Common Exception Words. Children who have learned the Reception exception word list enter KS1 having already memorised the most frequent tricky words. KS1 extends this learning to a larger set of exception words, building on the EYFS foundation."
    },
    {
      "prerequisite_concept": "LIT-R-C001",
      "dependent_concept": "EN-KS1-C018",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "EYFS Story Retelling is the direct precursor to the KS1 concept of Story Structure. Children who can retell stories in Reception have already internalised narrative structure at a practical level. The KS1 concept makes this understanding explicit and technical, providing vocabulary (plot, character, setting, narrative) for knowledge that Reception children possess experientially."
    },
    {
      "prerequisite_concept": "LIT-R-C003",
      "dependent_concept": "EN-KS1-C019",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "EYFS Vocabulary in Comprehension is the direct precursor to the KS1 concept of Vocabulary Development. Children who have been systematically taught vocabulary through shared reading in Reception enter KS1 with a larger, richer vocabulary and with experience of how vocabulary is explicitly learned from texts. This supports the vocabulary strand of the KS1 English programme."
    }
  ]
}
