{
  "metadata": {
    "subject": "Mathematics",
    "key_stage": "EYFS",
    "years_covered": [
      0
    ],
    "document_reference": "DfE EYFS Statutory Framework 2024",
    "extraction_date": "2026-02-22",
    "structure_rating": 9,
    "notes": "EYFS Mathematics is a Specific Area with 2 ELGs. ELG 11: Number; ELG 12: Numerical Patterns. Both contribute to GLD. These are the most important EYFS→KS1 prerequisites for mathematics. ELG 11 requires deep understanding of numbers to 10 and automatic recall of number bonds to 5. ELG 12 requires verbal counting beyond 20 and pattern recognition. These feed directly into Y1 counting, number bonds and calculation concepts."
  },
  "domains": [
    {
      "domain_id": "EYMA-R-D001",
      "domain_name": "Number",
      "description": "Deep understanding of number to 10, subitising up to 5, and automatic recall of number bonds to 5, with beginning recall of bonds to 10.",
      "curriculum_context": "ELG 11: Number. Children at the expected level of development will have a deep understanding of number to 10, including the composition of each number; subitise (recognise quantities without counting) up to 5; automatically recall (without reference to rhymes, counting or other aids) number bonds up to 5 (including subtraction facts) and some number bonds to 10, including double facts. This domain establishes the most critical foundations for all primary mathematics — knowing that numbers are composed of smaller parts, and building automatic recall of core facts, underpins the whole architecture of early arithmetic. The statutory framework emphasises deep understanding over superficial counting fluency: a child who knows that 5 is made of 3 and 2 in multiple ways is better prepared for Y1 than one who can count to 50 by rote. Subitising (instantaneous recognition of small quantities) is given equal statutory weight to composition knowledge for the first time in the 2021/2024 frameworks, reflecting research showing it is a distinct and important precursor to number sense.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical"
    },
    {
      "domain_id": "EYMA-R-D002",
      "domain_name": "Numerical Patterns",
      "description": "Verbal counting beyond 20, comparison of quantities up to 10, and exploration of patterns including evens, odds, doubles and equal distribution.",
      "curriculum_context": "ELG 12: Numerical Patterns. Children at the expected level of development will verbally count beyond 20, recognising the pattern of the counting system; compare quantities up to 10 in different contexts, recognising when one quantity is greater than, less than or the same as the other quantity; explore and represent patterns within numbers up to 10, including evens and odds, double facts and how quantities can be distributed equally. This domain reflects the shift in early mathematics pedagogy towards pattern and structure rather than rote procedure. Verbal counting beyond 20 is specifically framed as recognising the decade pattern (the system), not merely reciting numbers — children who see the structural logic of twenty-one, twenty-two... are far better placed to understand place value in Year 1. Quantity comparison is positioned as a prerequisite to the formal inequality language (greater than, less than) of KS1. The pattern recognition strand — evens, odds, doubles, equal distribution — is a deliberate bridge to the multiplicative reasoning that begins formally in Y2.",
      "is_cross_cutting": false,
      "structure_type": "sequential"
    }
  ],
  "objectives": [
    {
      "objective_id": "EYMA-R-O001",
      "domain_id": "EYMA-R-D001",
      "objective_text": "Have a deep understanding of number to 10, including the composition of each number.",
      "non_statutory_guidance": "Children should experience numbers in many forms and contexts — on fingers, with objects, in pictures, in stories — to build a rich, flexible sense of what each number means. Activities such as building numbers with manipulatives in multiple ways (4 = 3+1 = 2+2 = 4+0), partitioning small sets, and using number frames reinforce composition. The goal is a mental model of each number as a quantity with internal structure, not just a label in a sequence.",
      "examples": "Showing 7 objects arranged as 5 and 2 on a ten-frame; asking 'Can you make 6 in a different way?'; using dot cards in different arrangements to show that 4 is always 4 regardless of layout; partitioning a set of 8 counters in several ways.",
      "is_statutory": true,
      "year": [
        0
      ]
    },
    {
      "objective_id": "EYMA-R-O002",
      "domain_id": "EYMA-R-D001",
      "objective_text": "Subitise (recognise quantities without counting) up to 5.",
      "non_statutory_guidance": "Subitising should be developed through regular, brief activities using dot patterns (dice, domino, ten-frame). Both perceptual subitising (instantly seeing 3 dots as 3) and conceptual subitising (seeing 6 as two groups of 3) should be developed. Flash cards and rapid number recognition games build this skill. Children who subitise reliably are freed from slow finger-counting for small quantities, enabling cognitive resources to be directed to the structure of number.",
      "examples": "Flashing a card showing 4 dots in a die arrangement and asking 'How many? How do you know?'; showing 5 fingers splayed and asking children to say the number without counting; using dot pattern cards in rapid-response games.",
      "is_statutory": true,
      "year": [
        0
      ]
    },
    {
      "objective_id": "EYMA-R-O003",
      "domain_id": "EYMA-R-D001",
      "objective_text": "Automatically recall number bonds up to 5 (including subtraction facts) and some number bonds to 10, including double facts.",
      "non_statutory_guidance": "Automatic recall means without reference to counting, finger-use or rhymes. For bonds to 5: 0+5, 1+4, 2+3, 3+2, 4+1, 5+0 and all corresponding subtractions. For bonds to 10: key doubles (1+1, 2+2, 3+3, 4+4, 5+5) and 5+5 should be secured. This is not rote memorisation through drill alone — children should develop fluency through understanding (knowing 3+2=5 because they have decomposed and recomposed 5 many times). Singing, games, visual patterns and systematic practice all contribute.",
      "examples": "Playing 'What goes with 4 to make 5?' using a five-frame; using 'bond bags' with 5 objects hidden in two hands; reciting and showing doubles on fingers; 'How many hiding?' games with a total of 5.",
      "is_statutory": true,
      "year": [
        0
      ]
    },
    {
      "objective_id": "EYMA-R-O004",
      "domain_id": "EYMA-R-D002",
      "objective_text": "Verbally count beyond 20, recognising the pattern of the counting system.",
      "non_statutory_guidance": "The emphasis is on pattern recognition in the counting system — that after reaching a decade number (twenty, thirty...) the unit words repeat. Children do not need to count to 100 with full reliability, but should demonstrate they understand that twenty-one follows twenty in the same way that eleven follows ten. Activities that make the decade structure visible (hundred squares, Cuisenaire rods, counting in tens) support this understanding. Oral counting in varied contexts — counting steps, jumps, objects — keeps it meaningful.",
      "examples": "Counting objects to 25 and continuing; asking 'What comes after twenty-nine?' and explaining the pattern; counting in tens to 100; counting on from a large number (e.g. 'Start at 17, count on 5').",
      "is_statutory": true,
      "year": [
        0
      ]
    },
    {
      "objective_id": "EYMA-R-O005",
      "domain_id": "EYMA-R-D002",
      "objective_text": "Compare quantities up to 10 in different contexts, recognising when one quantity is greater than, less than or the same as the other.",
      "non_statutory_guidance": "Comparison should be done in multiple contexts: comparing groups of objects, comparing numbers on cards, comparing quantities in pictures and stories. Children should use comparative language correctly: 'more', 'fewer', 'less', 'the same as', 'equal'. One-to-one correspondence (lining up objects to compare) is a valid strategy but children should also compare without matching. The formal symbols (<, =, >) are not expected at EYFS but the underlying concepts must be secure.",
      "examples": "Comparing two groups of cubes: 'Which group has more? How do you know?'; ordering three sets of objects from fewest to most; comparing two numbers on digit cards; using a balance to compare physical quantities.",
      "is_statutory": true,
      "year": [
        0
      ]
    },
    {
      "objective_id": "EYMA-R-O006",
      "domain_id": "EYMA-R-D002",
      "objective_text": "Explore and represent patterns within numbers up to 10, including evens and odds, double facts and how quantities can be distributed equally.",
      "non_statutory_guidance": "Pattern recognition in this context is about the internal structure of numbers — noticing that even numbers can always be shared equally into two groups, that odd numbers always have one left over, that doubles are symmetric. Linking this to concrete manipulation (sharing 8 counters into two equal groups, building doubles on a ten-frame) is essential. Children are not expected to use the terms 'even' and 'odd' with full reliability, but exposure to the patterns prepares them for formal introduction in Y1.",
      "examples": "Sharing 10 cubes between two people and noticing they each get the same; trying the same with 9 and noticing one is left over; building doubles on a ten-frame (2+2, 3+3, 4+4, 5+5); sorting numbers 1-10 into 'can be split equally' and 'cannot'.",
      "is_statutory": true,
      "year": [
        0
      ]
    }
  ],
  "concepts": [
    {
      "concept_id": "EYMA-R-C001",
      "domain_id": "EYMA-R-D001",
      "concept_name": "Deep Number Understanding to 10",
      "description": "The understanding that each number from 1 to 10 is not merely a label in a sequence but a quantity with internal structure — composed of smaller parts in multiple ways. For example, 7 can be seen as 5 and 2, as 4 and 3, as 6 and 1, and as 7 and 0. This concept of composition goes beyond counting to knowing number as a flexible quantity. It is the cornerstone of ELG 11 and the deepest prerequisite for arithmetic.",
      "teaching_guidance": "Use five-frames and ten-frames as the primary representational tool. Build each number in multiple ways using two colours of counters. Make explicit the idea that 6 is always 6 regardless of how it is arranged. Part-whole models (a circle split into two parts) are a powerful visual. Regularly ask 'What is inside this number?' rather than 'How many?'. Connect to stories (5 birds: 3 on the branch and 2 flew away) to build semantic richness around composition.",
      "key_vocabulary": "number, how many, made of, parts, whole, altogether, split, total, compose, decompose",
      "common_misconceptions": "Children often think a number only means one specific arrangement of objects (e.g., 4 always looks like a 2x2 square). They may not recognise that 4 dots in a line is the same quantity as 4 dots in a cluster. Some children confuse the numeral (the written digit) with the quantity, treating '5' as a shape to be copied rather than a number of things.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 5,
      "co_teach_hints": ["EYMA-R-C002", "EYMA-R-C003"]
    },
    {
      "concept_id": "EYMA-R-C002",
      "domain_id": "EYMA-R-D001",
      "concept_name": "Subitising",
      "description": "The ability to instantly recognise the quantity of a small group of objects without counting. Perceptual subitising applies to very small groups (1-3) where recognition is immediate. Conceptual subitising extends to larger groups (4-5, and informally beyond) by recognising them as composed of smaller subitisable groups. Subitising is a distinct cognitive process from counting and represents an important parallel pathway to number sense.",
      "teaching_guidance": "Use brief, daily flash activities with dot cards in varied arrangements (not just standard dice patterns). Start with 1-3 before moving to 4-5. Ask 'How did you know?' to surface the perceptual or compositional strategies children use. Avoid always showing canonical arrangements (e.g., only showing 3 in a triangle) — varied arrangements force children to subitise rather than recognise a pattern. Connect to composition: 'I saw 5 as a group of 3 and a group of 2.'",
      "key_vocabulary": "how many, quick, see, spot, group, instantly, recognise, dots, without counting",
      "common_misconceptions": "Children who are unsure will often begin counting even when the quantity is small enough to subitise — they do not yet trust their instant recognition. Some children can subitise standard dice arrangements only (they have memorised the pattern, not subitised the quantity). Checking with non-standard arrangements reveals true subitising.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 4,
      "co_teach_hints": ["EYMA-R-C001"]
    },
    {
      "concept_id": "EYMA-R-C003",
      "domain_id": "EYMA-R-D001",
      "concept_name": "Number Bond Recall to 5",
      "description": "Automatic, effortless recall of all pairs of numbers that sum to each number from 1 to 5, including corresponding subtraction facts. For 5: 0+5, 1+4, 2+3, 3+2, 4+1, 5+0. For 4: 0+4, 1+3, 2+2, 3+1, 4+0. And so on for 3, 2 and 1. The ELG standard requires this recall to be automatic — without counting, finger-use or external aids. This is the first instance of mathematical fact fluency in the English curriculum.",
      "teaching_guidance": "Build bonds through understanding first, then consolidate to automaticity. Use five-frames, number bond diagrams (part-whole), and hiding games ('I have 5 — 3 are showing, how many hiding?'). Daily retrieval practice through games is more effective than drill. Emphasise the inverse relationship: knowing 2+3=5 should immediately yield 5-2=3. Songs and chants can support but should not be the primary route to recall.",
      "key_vocabulary": "number bond, pair, makes, adds up to, total, subtract, take away, left, inverse, fact",
      "common_misconceptions": "Children often know addition bonds but are unsure of corresponding subtraction bonds — they treat them as separate facts rather than inverse pairs. Many children in Reception can produce bonds to 5 by counting on their fingers but have not yet reached automatic recall; this is developmentally normal but the ELG standard is beyond this stage.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 5,
      "co_teach_hints": ["EYMA-R-C001", "EYMA-R-C004"]
    },
    {
      "concept_id": "EYMA-R-C004",
      "domain_id": "EYMA-R-D001",
      "concept_name": "Number Bonds to 10",
      "description": "Beginning recall of pairs of numbers that sum to 10, with particular emphasis on the double facts (1+1=2, 2+2=4, 3+3=6, 4+4=8, 5+5=10) and the anchor bond 5+5=10. The ELG standard specifies 'some number bonds to 10' — not full automaticity for all ten bonds, but the beginnings of this knowledge. This concept bridges the deep bonds-to-5 knowledge of ELG 11 to the Year 1 expectation of bonds within 20.",
      "teaching_guidance": "Use a ten-frame as the primary tool — children can see that 6 and 4 fill the frame. Start with doubles because they have a memorable symmetry. Introduce 10-frame 'full and empty' — how many red and how many yellow to fill the frame? Link to the composition knowledge already built for numbers to 10. Doubles should be learned as visual patterns (two equal rows on a ten-frame) as well as numerical facts.",
      "key_vocabulary": "number bond, ten, doubles, double, pair, makes ten, full, total, same, symmetry",
      "common_misconceptions": "Children often find non-double bonds to 10 harder than doubles — they need more exposure to the non-symmetric bonds (3+7, 4+6). Some children know 5+5=10 but do not connect it to the broader family of bonds to 10. Regularly revisiting the ten-frame model helps prevent this fragmentation.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 4,
      "co_teach_hints": ["EYMA-R-C003", "EYMA-R-C007"]
    },
    {
      "concept_id": "EYMA-R-C005",
      "domain_id": "EYMA-R-D002",
      "concept_name": "Verbal Counting Beyond 20",
      "description": "The ability to recite the number word sequence beyond 20 by recognising and applying the structural pattern of the counting system — that after each decade number (twenty, thirty, forty...) the units repeat (twenty-one, twenty-two... in the same pattern as one, two...). This is explicitly framed in ELG 12 as understanding the pattern of the counting system, not merely recitation. It is the earliest prerequisite for place value.",
      "teaching_guidance": "Make the decade structure explicit — count in tens on a hundred square, then explore the units repeating. Pause at decade boundaries ('What comes after twenty? After twenty-nine?') to check pattern understanding rather than rote recall. Counting larger quantities of objects provides a meaningful context. Use a hundred square as a visual reference — pointing to each decade row reinforces the repeating pattern.",
      "key_vocabulary": "count, twenty, thirty, forty, fifty, sixty, seventy, eighty, ninety, hundred, pattern, next, after",
      "common_misconceptions": "Children commonly make the error 'twenty-nine, twenty-ten' — they apply the within-decade pattern at the wrong point. This reveals that counting beyond 20 is being memorised without understanding the decade structure. The words 'eleven' and 'twelve' (which do not follow the regular pattern) are frequent stumbling points, as are the 'teen' numbers.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": ["EYMA-R-C006"]
    },
    {
      "concept_id": "EYMA-R-C006",
      "domain_id": "EYMA-R-D002",
      "concept_name": "Quantity Comparison",
      "description": "The ability to compare two groups of objects or two numbers up to 10 and accurately judge which is greater, which is less, or whether they are the same (equal). This includes comparison by direct matching (one-to-one correspondence), by subitising, and eventually by knowing the relative position of numbers in the count sequence. The language of comparison — more, fewer, less, the same as, equal — is as important as the conceptual skill.",
      "teaching_guidance": "Always work with concrete objects before moving to abstract numbers. Line objects up one-to-one to make comparison visible initially. Ask for justifications: 'How do you know there are more?' Introduce the vocabulary 'greater than', 'less than' and 'equal to' orally but do not require formal symbolic notation at this stage. Balance activities and equalising activities (adding to the smaller group to make them equal) develop the concept alongside comparison.",
      "key_vocabulary": "more, fewer, less, the same, equal, greater than, less than, compare, bigger, smaller, group",
      "common_misconceptions": "Children commonly confuse 'fewer' and 'less' (and adults often model this incorrectly). Some children compare the physical size of individual objects rather than the number of objects — a row of large bricks may be judged as 'more' than a larger row of small bricks. Spreading objects out in a line can mislead children who compare length rather than quantity.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": ["EYMA-R-C005", "EYMA-R-C007"]
    },
    {
      "concept_id": "EYMA-R-C007",
      "domain_id": "EYMA-R-D002",
      "concept_name": "Pattern Recognition in Numbers",
      "description": "The ability to identify and describe structural patterns within the numbers to 10, including: even numbers (can be split into two equal groups, no remainder), odd numbers (always one left over when split), double facts (each even number up to 10 is the double of a smaller number), and equal distribution (sharing equally into groups). These structural patterns are the earliest manifestations of multiplicative and algebraic thinking.",
      "teaching_guidance": "Use physical sharing activities — distribute objects between two teddies and observe when it works out equally (even numbers) and when there is a remainder (odd numbers). Build doubles on ten-frames using two colours and note the symmetry. Introduce the concept of 'fair sharing' as a context for equal distribution. Use bead strings, interlocking cubes in two colours, and hundred squares to make patterns visible. Avoid introducing formal notation for odd/even until KS1.",
      "key_vocabulary": "pattern, even, odd, double, half, share, equal, groups, left over, same, split, fair",
      "common_misconceptions": "Many children at this stage associate 'even' only with specific familiar numbers (2, 4) rather than understanding it as a property defined by equal division. Some children think odd numbers are random exceptions rather than recognising the consistent 'one left over' pattern. Doubles are often treated as isolated facts rather than a family with a shared structural property.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": ["EYMA-R-C004", "EYMA-R-C001"]
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "EYMA-R-C002",
      "dependent_concept": "EYMA-R-C001",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Subitising builds a perceptual foundation for number sense — children who can instantly recognise small quantities as units are better positioned to understand those quantities as having internal structure. Subitising 5 as '3 and 2' directly supports understanding the composition of 5."
    },
    {
      "prerequisite_concept": "EYMA-R-C001",
      "dependent_concept": "EYMA-R-C003",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Number bonds to 5 are an expression of composition knowledge — knowing all the ways to make 5 requires the deep understanding that 5 is composed of smaller parts. Without a flexible sense of number composition, bond recall remains rote and fragile."
    },
    {
      "prerequisite_concept": "EYMA-R-C003",
      "dependent_concept": "EYMA-R-C004",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Automatic recall of bonds to 5 is the prerequisite for beginning work on bonds to 10. The understanding of part-whole relationships and inverse addition/subtraction, once secure for numbers to 5, transfers to the larger number family. The doubles within bonds to 10 (particularly 5+5) are a natural extension of the doubles-to-5 pattern."
    },
    {
      "prerequisite_concept": "EYMA-R-C005",
      "dependent_concept": "EYMA-R-C006",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Comparison of quantities beyond small subitisable groups relies on knowing the count sequence — to judge whether 14 is more or less than 17, a child must know the relative position of those numbers in the verbal counting sequence. Counting is the primary tool for determining and comparing larger quantities."
    },
    {
      "prerequisite_concept": "EYMA-R-C001",
      "dependent_concept": "EYMA-R-C007",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Recognising structural patterns in numbers (evens, odds, doubles, equal distribution) requires the compositional number sense built in EYMA-R-C001. A child who sees numbers as compositions of smaller parts is positioned to notice that even numbers always compose perfectly into two equal groups, and that odd numbers always leave a remainder."
    },
    {
      "prerequisite_concept": "EYMA-R-C005",
      "dependent_concept": "MA-Y1-C001",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Verbal counting beyond 20 with understanding of the decade pattern directly enables counting forwards and backwards to 100. A child who has recognised the repeating unit pattern within decades in EYFS will understand the system rather than memorising a longer rote sequence."
    },
    {
      "prerequisite_concept": "EYMA-R-C005",
      "dependent_concept": "MA-Y1-C002",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Counting in multiples of 2, 5 and 10 in Y1 requires the verbal counting foundation established at EYFS. A child who has counted beyond 20 with decade pattern awareness is ready to count in structured steps — skipping counts are an extension of the same sequential oral counting skill."
    },
    {
      "prerequisite_concept": "EYMA-R-C001",
      "dependent_concept": "MA-Y1-C005",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Understanding one more and one less in Y1 rests on the EYFS concept of number composition — knowing that 7 is composed of 6 and 1 more, or that removing one from 7 leaves 6. Deep compositional understanding makes one-more/one-less a logical extension rather than a new fact to memorise."
    },
    {
      "prerequisite_concept": "EYMA-R-C006",
      "dependent_concept": "MA-Y1-C007",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "The Y1 language of comparison (equal to, more than, less than) is the formal symbolic and linguistic extension of the comparison concept developed at EYFS. A child who can reliably compare quantities and use informal comparative language is ready to map those concepts onto formal vocabulary and notation."
    },
    {
      "prerequisite_concept": "EYMA-R-C003",
      "dependent_concept": "MA-Y1-C008",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Number bonds within 20 in Y1 are a direct extension of bonds to 5 from EYFS. The concept of complementary pairs, the inverse relationship between addition and subtraction facts, and the part-whole model are all established at EYFS and carry forward to the larger number set."
    },
    {
      "prerequisite_concept": "EYMA-R-C001",
      "dependent_concept": "MA-Y1-C009",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Y1 addition as combining and augmenting is built on the EYFS concept of number composition. A child who understands that 5 can be composed of 3 and 2 has the prerequisite conceptual model for addition as the combining of two parts to make a whole."
    },
    {
      "prerequisite_concept": "EYMA-R-C004",
      "dependent_concept": "MA-Y1-C013",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "The double facts begun in EYFS bonds-to-10 (1+1, 2+2, 3+3, 4+4, 5+5) are the direct foundation for the Y1 concept of doubling and halving. Children who have built doubles within 10 are ready to extend the pattern to larger numbers and to understand halving as the inverse operation."
    },
    {
      "prerequisite_concept": "EYMA-R-C007",
      "dependent_concept": "MA-Y1-C002",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Pattern recognition in numbers at EYFS — particularly recognising even and odd structure and equal distribution — prepares children to understand counting in multiples as a pattern. Counting in 2s is the first formal encounter with the even number pattern; the EYFS foundation makes this connection conceptual rather than procedural."
    }
  ]
}
