{
  "metadata": {
    "subject": "Physical Development",
    "key_stage": "EYFS",
    "years_covered": [0],
    "document_reference": "DfE EYFS Statutory Framework 2024",
    "extraction_date": "2026-02-22",
    "structure_rating": 8,
    "notes": "Physical Development is a Prime Area with 2 ELGs. ELG 6: Gross Motor Skills; ELG 7: Fine Motor Skills. Both contribute to GLD. ELG 7 (Fine Motor Skills, especially the tripod grip for writing) is a direct prerequisite for handwriting in KS1 English. ELG 6 links to PE KS1."
  },
  "domains": [
    {
      "domain_id": "PD-R-D001",
      "domain_name": "Gross Motor Skills",
      "description": "Whole-body movement competencies including navigation of space, strength, balance, coordination, and a wide energetic movement vocabulary.",
      "curriculum_context": "Gross Motor Skills (ELG 6) is one of two Early Learning Goals within Physical Development, a Prime Area of the EYFS. At Reception, gross motor development focuses on the whole body: children learn to move confidently in and around spaces, developing the physical awareness and self-regulation needed to keep themselves and others safe. They build core strength, balance and coordination through play-based physical activity, and develop a broad vocabulary of energetic movement patterns — running, jumping, hopping, skipping, dancing and climbing. The ELG specifies three outcome strands: safe spatial navigation; strength, balance and coordination; and energetic movement vocabulary. Together these lay the physical foundation for PE at KS1, where the same movement competencies are formalised as fundamental movement skills and applied to games, gymnastics and dance.",
      "is_cross_cutting": false,
      "structure_type": "sequential"
    },
    {
      "domain_id": "PD-R-D002",
      "domain_name": "Fine Motor Skills",
      "description": "Small-muscle control and hand-tool manipulation, culminating in the tripod pencil grip, accurate use of tools such as scissors and brushes, and deliberate mark-making.",
      "curriculum_context": "Fine Motor Skills (ELG 7) is the second Early Learning Goal within Physical Development. Fine motor development at Reception centres on the hand and finger musculature that underpins writing, drawing and manipulation of everyday tools. The key statutory outcome is that children hold a pencil effectively in preparation for fluent writing, using the tripod grip in almost all cases. Additional outcomes specify competent use of scissors, paintbrushes and cutlery, and the beginning of accurate, careful drawing. ELG 7 is the most directly cross-stage of all EYFS ELGs: tripod grip and pencil control are the developmental prerequisites for handwriting at KS1 (EN-KS1-D005), and the KS1 English curriculum explicitly notes that correct pencil grip should be established from Reception and reinforced consistently in Year 1. Fine motor skills also support early mathematical recording, science diagrams, and DT making activities across KS1.",
      "is_cross_cutting": false,
      "structure_type": "sequential"
    }
  ],
  "objectives": [
    {
      "objective_id": "PD-R-O001",
      "domain_id": "PD-R-D001",
      "objective_text": "Negotiate space and obstacles safely, with consideration for themselves and others",
      "non_statutory_guidance": "This outcome develops as children gain experience of moving through varied environments — indoors, outdoors, fixed equipment, loose parts. Practitioners should provide rich environments that offer challenges at varying levels of difficulty, supporting children to assess and manage risk rather than avoiding challenge. Children should be explicitly taught to look out for others and to move with awareness, not just speed.",
      "examples": "Moving confidently around the outdoor environment without bumping into peers; navigating an obstacle course; changing direction when running to avoid a collision; pausing at a narrow gap to allow others through.",
      "is_statutory": true,
      "year": [0]
    },
    {
      "objective_id": "PD-R-O002",
      "domain_id": "PD-R-D001",
      "objective_text": "Demonstrate strength, balance and coordination when playing",
      "non_statutory_guidance": "Strength, balance and coordination develop through repeated, varied physical play rather than direct instruction. Climbing, hanging, rolling and balancing activities build core strength. One-leg balances, beam walking and yoga-style holds develop postural control. Activities requiring bilateral coordination (using both sides of the body together) support the neural pathways underlying later literacy and numeracy. Practitioners should observe children across different contexts, as these qualities manifest differently in structured and unstructured play.",
      "examples": "Balancing on one leg; walking along a low beam; hanging from monkey bars; climbing a scramble net; rolling a ball and running after it; catching a large ball thrown gently; riding a balance bike.",
      "is_statutory": true,
      "year": [0]
    },
    {
      "objective_id": "PD-R-O003",
      "domain_id": "PD-R-D001",
      "objective_text": "Move energetically, such as running, jumping, dancing, hopping, skipping and climbing",
      "non_statutory_guidance": "The EYFS specifies that children must be physically active for at least 180 minutes per day (Birth to 5 Matters guidance). Energetic movement should be a daily feature of provision, both in structured PE-style sessions and through continuous provision. Practitioners should ensure outdoor space enables a genuine range of movement types, not only running. Music, storytelling and imaginative play are powerful vehicles for developing a varied movement vocabulary.",
      "examples": "Playing chase games involving running and direction change; learning a simple skipping rhyme; hopping between stepping stones; dancing to music with varied tempo; jumping from a low platform with a safe landing; climbing the outdoor climbing frame.",
      "is_statutory": true,
      "year": [0]
    },
    {
      "objective_id": "PD-R-O004",
      "domain_id": "PD-R-D002",
      "objective_text": "Hold a pencil effectively in preparation for fluent writing — using the tripod grip in almost all cases",
      "non_statutory_guidance": "The tripod grip (pencil held between the pads of thumb and forefinger with the middle finger as a rest) should be introduced and consistently reinforced throughout Reception. Pencil grips (physical aids) can support children who struggle. Left-handed children should be taught with paper angled to the right and the hand below the writing line. Poor grip habits (fist grip, four-finger grip) should be corrected early, before they become entrenched. The phrase 'in almost all cases' acknowledges that some children with additional physical needs may require adapted grips.",
      "examples": "Holding a thick triangular pencil with a tripod grip during mark-making activities; an adult demonstrating the grip and asking children to copy; using tweezers and tongs as grip-building exercises; threading, pegging and clay-rolling activities to develop pincer movement.",
      "is_statutory": true,
      "year": [0]
    },
    {
      "objective_id": "PD-R-O005",
      "domain_id": "PD-R-D002",
      "objective_text": "Use a range of small tools including scissors, paint brushes and cutlery",
      "non_statutory_guidance": "Tool use at Reception should be genuinely functional — scissors used to cut out real things, brushes used for real painting, cutlery used at mealtimes. This authentic context supports motivation and meaningful practice. Children should be explicitly taught how to hold and use each tool safely. Left-handed scissors should always be available. The range of tools should be broad: hole punches, staple removers, tweezers and rolling pins all develop the same fine motor control.",
      "examples": "Cutting along a curved line with scissors; using a brush to paint fine details; using a fork and knife at lunchtime; using a hole punch to make a simple book; using tongs to move objects in a science investigation.",
      "is_statutory": true,
      "year": [0]
    },
    {
      "objective_id": "PD-R-O006",
      "domain_id": "PD-R-D002",
      "objective_text": "Begin to show accuracy and care when drawing",
      "non_statutory_guidance": "Drawing with accuracy at EYFS is not about producing realistic representations; it is about intention and control — the child choosing what to draw and making deliberate, controlled marks to realise that intention. Practitioners should value process over product and provide a wide range of mark-making materials. Drawing should be integrated across all areas of learning: observational drawing in science, map-making in geography, and recording in mathematics all develop this outcome purposefully.",
      "examples": "Drawing a portrait of a family member, taking care over facial features; drawing an observed object (a leaf, a shell) with attention to shape; adding detail to an illustration for their own story; using a ruler to draw a straight line deliberately.",
      "is_statutory": true,
      "year": [0]
    }
  ],
  "concepts": [
    {
      "concept_id": "PD-R-C001",
      "domain_id": "PD-R-D001",
      "concept_name": "Spatial Awareness and Safety",
      "description": "The ability to perceive one's own position and movement in relation to the surrounding environment and other people, and to adjust movement accordingly to avoid collisions and manage risk. At Reception, this manifests as moving through shared spaces confidently without bumping into others, pausing at obstacles, and changing direction smoothly. It is the social-spatial dimension of physical literacy: children understand that they share physical space with others and bear responsibility for mutual safety.",
      "teaching_guidance": "Provide varied indoor and outdoor environments with different spatial challenges: narrow passages, open spaces, crowded areas with peers, fixed and moveable equipment. Use games that require spatial decision-making — tag variants where avoiding others is the goal, 'follow the leader' in complex paths, musical statues. Model and narrate spatial language: 'I can see a gap there', 'I need to slow down because Amara is just ahead'. Introduce risk assessment vocabulary: 'Is it safe?', 'What might happen if...?'. Deliberately avoid environments that are too open and risk-free, as challenge is necessary for developing spatial judgement.",
      "key_vocabulary": "space, obstacle, safe, careful, around, between, through, gap, dodge, avoid, direction, look, slow down, stop",
      "common_misconceptions": "Children often focus entirely on their own movement goal (reaching a target, running fast) and become unaware of others around them. This is developmentally normal in younger Reception children; awareness of others as co-occupants of space develops gradually. Some practitioners remove physical challenge to reduce falls; this deprives children of the feedback loops necessary to develop spatial judgement. Managed risk, not elimination of risk, is the correct approach.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": ["PD-R-C002"]
    },
    {
      "concept_id": "PD-R-C002",
      "domain_id": "PD-R-D001",
      "concept_name": "Strength, Balance and Coordination",
      "description": "The trio of core physical competencies underpinning all confident physical activity. Strength refers to muscular force production, particularly core and upper body strength needed for climbing, hanging and supporting body weight. Balance encompasses both static (holding a position) and dynamic (maintaining stability during movement) postural control. Coordination is the smooth integration of multiple body parts in purposeful movement — the bilateral, cross-lateral and eye-hand coordination that underpins later PE skills, writing and many daily tasks.",
      "teaching_guidance": "Ensure daily access to equipment that builds each quality: climbing frames and monkey bars for strength; beams, stepping stones and one-leg activities for balance; ball skills, catching and threading for coordination. Yoga and mindful movement activities develop static balance and body awareness. Bilateral coordination activities (clapping games, threading, using scissors) develop the interhemispheric neural connections that also support reading and writing. Observe children across different activities: a child may have strong balance but poor upper body strength, requiring different provision. Avoid over-scaffolding; allow children to struggle productively with physical challenges.",
      "key_vocabulary": "strong, balance, coordinate, steady, hold, climb, stretch, reach, catch, throw, both hands, core, stable",
      "common_misconceptions": "Balance is often understood only as static balance (standing on one leg). Dynamic balance — staying controlled while moving — is equally important and often underdeveloped. Coordination difficulties are sometimes misattributed to lack of effort; they may indicate developmental coordination disorder (DCD/dyspraxia) and warrant specialist input. Strength in young children should be developed through bodyweight and play activities, never weighted exercises.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": ["PD-R-C001", "PD-R-C003"]
    },
    {
      "concept_id": "PD-R-C003",
      "domain_id": "PD-R-D001",
      "concept_name": "Energetic Movement Vocabulary",
      "description": "A broad repertoire of whole-body locomotor and non-locomotor movement patterns, including running, jumping, hopping, skipping, dancing and climbing. Movement vocabulary at Reception means that children have experienced and can intentionally reproduce a range of movement types, each requiring distinct coordination and body-use patterns. A rich movement vocabulary is the foundation for the 'fundamental movement skills' framework at KS1 PE, where these same patterns are formalised and applied to games, gymnastics and dance.",
      "teaching_guidance": "Provide daily opportunities for varied movement, not only free running. Structure some sessions around specific movement types: a skipping session, a jumping session (horizontal, vertical, one-foot take-off, two-foot take-off). Use music with varied tempo and character to prompt different movement qualities. Storytelling and imaginative contexts ('move like a robot', 'travel like water') expand movement vocabulary organically. Teach hopping and skipping explicitly — many children cannot hop on both feet or skip in a coordinated pattern without direct instruction and practice. Celebrate movement diversity: not every child needs to achieve the same pattern at the same time.",
      "key_vocabulary": "run, jump, hop, skip, climb, dance, gallop, slide, roll, spin, freeze, stretch, curl, fast, slow, high, low",
      "common_misconceptions": "Outdoor provision is sometimes dominated by running, with insufficient opportunity for the full movement vocabulary. Skipping in particular is often neglected despite being explicitly named in ELG 6. Some children — particularly those with limited outdoor play at home — arrive at Reception with a restricted movement repertoire; this gap responds well to deliberate, playful teaching. Dance is sometimes treated as an arts activity rather than a physical development activity, separating it from the broader movement curriculum.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": ["PD-R-C002"]
    },
    {
      "concept_id": "PD-R-C004",
      "domain_id": "PD-R-D002",
      "concept_name": "Tripod Grip and Pencil Control",
      "description": "The tripod grip is the dominant efficient pencil hold for writing: the pencil rests on the middle finger and is pinched between the pads of the forefinger and thumb, allowing the small muscles of the hand and wrist to control the nib with precision and minimal fatigue. Pencil control is the ability to guide a pencil along intended paths with pressure modulation — essential for letter formation, number formation, and drawing. This concept is the single most important fine motor prerequisite for KS1 handwriting: the KS1 English curriculum explicitly states that correct pencil grip should be established from Reception and reinforced consistently throughout Year 1.",
      "teaching_guidance": "Introduce the tripod grip from the very first mark-making sessions in Reception. Demonstrate clearly, name it ('the tripod grip' or 'the pinch and rest'), and provide a physical check routine children can self-apply. Use triangular pencils and thick grips initially; progress to standard pencils. Pre-writing activities that build pincer strength: tweezers, pegs, threading, rolling clay, tear-and-stick, using small blocks. For children with weak grip, daily short sessions of targeted fine motor activity accelerate progress more than extended mark-making alone. Left-handed children: paper angled to the right, hand positioned below the writing line. Correct suboptimal grips (fist grip, four-finger grip, thumb wrap) early; once established they are very difficult to change.",
      "key_vocabulary": "tripod grip, pencil, hold, pinch, rest, middle finger, thumb, forefinger, steady, control, press, light, firm",
      "common_misconceptions": "The most common misconception among children is that any grip that 'works' is acceptable; they may resist correction because their current grip feels natural. Among practitioners, there is sometimes reluctance to correct grip out of concern about stifling creative flow; however, the KS1 curriculum is explicit that correct grip must be established in Reception. The tripod grip is not the only valid grip (some individuals use a lateral pinch or adapted grip effectively), but it should be the default taught and reinforced.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": ["PD-R-C005", "PD-R-C006"]
    },
    {
      "concept_id": "PD-R-C005",
      "domain_id": "PD-R-D002",
      "concept_name": "Small Tool Use",
      "description": "The competent and safe handling of small hand tools including scissors, paintbrushes and cutlery. Each tool requires a specific grip and control strategy: scissors require coordinated opening and closing of fingers while guiding the blades; brushes require varied grip for different effects and pressure modulation; cutlery requires simultaneous bilateral use. Small tool competence develops the same intrinsic hand muscles and motor planning circuits as pencil control, and should be treated as part of the integrated fine motor curriculum rather than as separate practical life skills.",
      "teaching_guidance": "Ensure all small tools are sized appropriately for children's hands and that both right-handed and left-handed versions are available. Embed tool use in authentic, purposeful activities: scissors for craft and making, brushes for painting and mark-making, cutlery at mealtimes. Teach safe tool use explicitly rather than assuming children know how to hold scissors safely. Introduce scissors using snip-snip-snip actions on narrow strips before progressing to cutting along lines and then curves and shapes. For painting, teach how grip changes with different brush sizes and effects. Observe and scaffold: children who avoid tools may have underlying fine motor difficulties.",
      "key_vocabulary": "scissors, brush, cutlery, fork, knife, spoon, hold, open, close, cut, snip, grip, safe, careful, accurate",
      "common_misconceptions": "Children often hold scissors with their thumb and forefinger only, losing stability; they should use thumb in one loop and middle finger (or middle and ring finger together) in the other. Scissors with assisted spring return can bridge this gap. Many children find scissors difficult for longer than expected; this is normal and responds to practice. Practitioners sometimes allow inaccurate tool use to avoid discouraging children; explicit, encouraging correction supports rather than hinders development.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": ["PD-R-C004", "PD-R-C006"]
    },
    {
      "concept_id": "PD-R-C006",
      "domain_id": "PD-R-D002",
      "concept_name": "Drawing with Accuracy",
      "description": "Deliberate mark-making with care and intention, producing drawings that attempt to represent observed or imagined subjects with increasing control and detail. Accuracy at Reception does not mean photographic realism; it means that the child is making intentional choices about where to place lines, how to represent shapes, and what level of detail to include, and is executing those choices with the degree of pencil control available to them. This outcome sits at the intersection of fine motor development and early artistic representation, and directly develops the hand-eye coordination and spatial planning that underpin letter and number formation.",
      "teaching_guidance": "Provide rich observational drawing opportunities: still-life arrangements, natural objects, mirrors for self-portraits. Teach children to look and look again before and during drawing, not just once at the start. Model the process of drawing: 'I'm going to look at where the stem meets the leaf... now I'm going to draw that join carefully.' Use a range of media — pencils, fine-tipped pens, charcoal — so children experience different levels of control. Value the process, not only the product: ask children to talk about their drawing decisions. Connect drawing to other areas: observational drawing in science, map sketches in geography, diagram-making in DT.",
      "key_vocabulary": "draw, mark, careful, accurate, detail, look, shape, line, curve, straight, join, represent, observe, sketch",
      "common_misconceptions": "Drawing accuracy is sometimes conflated with artistic talent, leading practitioners to praise only naturalistic outcomes and discouraging children who struggle. The key is intentionality and control improvement over time, not a fixed outcome standard. Some children rush through drawings without looking at their subject; slowing down and the 'look, look, draw' strategy directly addresses this. Children may believe drawing is only for art time; integrating drawing into science, geography and maths normalises it as a tool for thinking.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": ["PD-R-C004", "PD-R-C005"]
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "PD-R-C002",
      "dependent_concept": "PD-R-C001",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Strength, balance and coordination provide the physical substrate for spatial awareness: a child without sufficient postural stability and body control cannot reliably navigate space safely, as the neuromuscular regulation needed to stop, change direction and respond to obstacles depends on core balance and coordination being in place."
    },
    {
      "prerequisite_concept": "PD-R-C004",
      "dependent_concept": "PD-R-C005",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Tripod grip and pencil control establish the pincer-and-guide motor pattern that underpins all small tool use. A child who has developed effective pencil grip has the intrinsic hand muscle strength and motor planning circuits needed to transfer that control to scissors, brushes and cutlery, though each tool also requires its own specific practice."
    },
    {
      "prerequisite_concept": "PD-R-C004",
      "dependent_concept": "PD-R-C006",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Drawing with accuracy requires the same pencil control as writing: the tripod grip and the ability to guide a pencil deliberately along an intended path. Without established pencil control, children produce unintentional marks and cannot execute the spatial planning that accurate drawing demands."
    },
    {
      "prerequisite_concept": "PD-R-C004",
      "dependent_concept": "EN-KS1-C035",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "EN-KS1-C035 (Pencil grip and posture) is the KS1 formalisation of the same skill established at EYFS. The KS1 English curriculum explicitly states that correct pencil grip (tripod) should be established from Reception; PD-R-C004 is therefore the direct developmental prerequisite. Without a secure tripod grip from EYFS, KS1 handwriting instruction begins with a remediation burden rather than building on secure foundations."
    },
    {
      "prerequisite_concept": "PD-R-C004",
      "dependent_concept": "EN-KS1-C036",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "EN-KS1-C036 (Letter formation) requires the child to execute precise pencil strokes with controlled start points, direction and end points. This level of pencil control cannot be reliably achieved without the tripod grip established in EYFS Physical Development (PD-R-C004); poor grip produces inconsistent pressure and limited directional control, making correct letter formation physically inaccessible."
    },
    {
      "prerequisite_concept": "PD-R-C002",
      "dependent_concept": "PE-KS1-C001",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "PE-KS1-C001 (Fundamental Movement Skills) formalises and extends the gross motor competencies first established in EYFS Physical Development. The KS1 curriculum's requirement to 'master' running, jumping, throwing, catching, balance, agility and coordination builds directly on the strength, balance and coordination developed in Reception (PD-R-C002). Children who reach KS1 with well-developed EYFS gross motor skills engage with the KS1 PE curriculum from a position of physical confidence rather than starting from scratch."
    },
    {
      "prerequisite_concept": "PD-R-C003",
      "dependent_concept": "PE-KS1-C001",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "The energetic movement vocabulary of EYFS (running, jumping, hopping, skipping, dancing, climbing — PD-R-C003) maps directly onto the fundamental movement skills specified at KS1 PE. A child arriving at Year 1 with a broad movement vocabulary has already practised the raw movement patterns that KS1 PE refines into technically correct, applied skills. The EYFS vocabulary is the substrate; KS1 PE develops it into mastery."
    }
  ]
}
