{
  "metadata": {
    "subject": "Personal, Social and Emotional Development",
    "key_stage": "EYFS",
    "years_covered": [0],
    "document_reference": "DfE EYFS Statutory Framework 2024",
    "extraction_date": "2026-02-22",
    "structure_rating": 7,
    "notes": "PSED is a Prime Area — fundamental to cognitive development. 3 ELGs. ELG 3: Self-Regulation; ELG 4: Managing Self; ELG 5: Building Relationships. All contribute to GLD. PSED has no direct NC subject equivalent (maps weakly to PSHE in KS1) but underpins classroom readiness for all subjects."
  },
  "domains": [
    {
      "domain_id": "PSED-R-D001",
      "domain_name": "Self-Regulation",
      "description": "Understanding and managing own and others' feelings, controlling impulses, sustaining attention, and following multi-step instructions.",
      "curriculum_context": "ELG 3 (Self-Regulation) addresses the foundational executive function capabilities children need to participate in school life. By the end of Reception, children are expected to show understanding of their own feelings and those of others, and to begin to regulate their behaviour accordingly. This includes the capacity to set and work towards simple goals, wait for what they want, and control immediate impulses when appropriate. Crucially, self-regulation also encompasses the ability to give focused attention to what the teacher says even when engaged in another activity, and to follow instructions involving several ideas or actions. This ELG is deeply grounded in attachment theory: warm, responsive relationships with trusted adults scaffold the gradual internalisation of self-control. Children who arrive in Reception with limited self-regulation often have gaps in early attachment experience, and practitioners must be sensitive to this. The Characteristics of Effective Learning — particularly Active Learning (keeping trying, enjoying achieving) — are closely related to and mutually reinforcing with self-regulation development.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical"
    },
    {
      "domain_id": "PSED-R-D002",
      "domain_name": "Managing Self",
      "description": "Developing confidence, resilience, independence, moral understanding, and basic self-care capabilities.",
      "curriculum_context": "ELG 4 (Managing Self) covers the child's growing capacity to act as an independent, purposeful, morally aware agent. At the end of Reception, children should be confident to try new activities and demonstrate independence, resilience, and perseverance in the face of challenges. They should be able to explain the reasons for rules, understand right from wrong, and try to behave accordingly — an early form of moral reasoning rooted in concrete social contexts rather than abstract principles. Managing self also includes the practical dimension of managing basic hygiene and personal needs: dressing, toileting, and understanding the importance of healthy food choices. The independence strand is critical for readiness for Year 1, where the demands on children to self-direct, sustain effort, and manage transitions increase significantly. Practitioners support this domain primarily through a growth mindset culture, careful use of praise (effort over outcome), and provision of achievable challenges that stretch without overwhelming.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical"
    },
    {
      "domain_id": "PSED-R-D003",
      "domain_name": "Building Relationships",
      "description": "Forming secure attachments to adults and peers, working cooperatively, taking turns, and showing sensitivity to others' needs.",
      "curriculum_context": "ELG 5 (Building Relationships) addresses the social competencies that underpin all collaborative learning and school wellbeing. By end of Reception, children should work and play cooperatively and take turns with others, form positive attachments to adults and friendships with peers, and show sensitivity to their own and others' needs. The attachment dimension is foundational: the quality of children's relationships with key adults in the EYFS setting directly shapes their sense of safety, their willingness to explore and take risks, and their later capacity to form productive learning relationships. The cooperative play and turn-taking strand connects directly to ELG 3 (impulse control and delayed gratification) — a child who cannot yet regulate their impulses will find turn-taking structurally difficult, not merely a matter of willingness. Sensitivity to others' needs represents an early form of theory of mind and empathy, linking to Communication and Language development (understanding others' perspectives expressed through speech). Building Relationships is also the PSED domain with the most direct consequences for classroom culture: when children feel safe, respected, and connected, the conditions for learning across all seven areas are optimised.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical"
    }
  ],
  "objectives": [
    {
      "objective_id": "PSED-R-O001",
      "domain_id": "PSED-R-D001",
      "objective_text": "Show an understanding of their own feelings and those of others, and begin to regulate their behaviour accordingly",
      "non_statutory_guidance": "Practitioners should create a language-rich environment for feelings, using emotion word walls, feelings check-ins, and story-based discussions. Key texts such as The Colour Monster (Anna Llenas) provide accessible metaphors. Regulation is supported by co-regulation first — the adult models calm and names emotions before children can do this independently. Development Matters (Reception) notes that children benefit from adults narrating their own emotional states: 'I'm feeling a bit frustrated right now, so I'm going to take a breath.'",
      "examples": "A child noticing a peer is upset and fetching a comfort toy; a child saying 'I feel angry when you take my things' rather than hitting; a practitioner prompting 'How do you think Maya is feeling right now?'",
      "is_statutory": true,
      "year": [0]
    },
    {
      "objective_id": "PSED-R-O002",
      "domain_id": "PSED-R-D001",
      "objective_text": "Set and work towards simple goals, being able to wait for what they want and control their immediate impulses when appropriate",
      "non_statutory_guidance": "Impulse control and delayed gratification develop through the pre-frontal cortex, which is still forming rapidly at age 4-5. Practitioners should not simply expect children to wait but must actively scaffold waiting through clear routines, visual timers, and meaningful activities during waiting periods. Goal-setting is best done in the context of child-initiated play — 'What do you want to make today?' — with adult support to articulate and revisit the goal. The EYFS framework's Active Learning characteristic ('keeping trying') directly reflects this objective.",
      "examples": "A child completing a jigsaw without giving up when pieces don't fit; waiting for a turn on the computer and using a visual timer; telling an adult 'I'm going to build a tower all the way to the ceiling' and returning to the task across several days.",
      "is_statutory": true,
      "year": [0]
    },
    {
      "objective_id": "PSED-R-O003",
      "domain_id": "PSED-R-D001",
      "objective_text": "Give focused attention to what the teacher says, responding appropriately even when engaged in activity, and show an ability to follow instructions involving several ideas or actions",
      "non_statutory_guidance": "Multi-step instruction following requires working memory, attention shifting, and inhibitory control — all executive functions that develop through ages 3-5. Practitioners support this by using children's names before giving instructions, keeping instructions brief and sequential, pairing verbal instructions with visual cues, and checking understanding by asking children to repeat back. Children with SEND (particularly those with language delay, DLD, or ADHD profiles) may need individualised support with this objective. Carpet-time length should be developmentally appropriate — 10-15 minutes maximum for most Reception children.",
      "examples": "A child stopping play, looking at the teacher, listening to the instruction 'Get your coat, put it on, then line up by the door', and carrying out all three steps in sequence; a child pausing a game when called upon and responding correctly to a question.",
      "is_statutory": true,
      "year": [0]
    },
    {
      "objective_id": "PSED-R-O004",
      "domain_id": "PSED-R-D002",
      "objective_text": "Be confident to try new activities and show independence, resilience and perseverance in the face of challenges",
      "non_statutory_guidance": "Confidence to try new activities is rooted in secure attachment (feeling safe enough to venture into uncertainty) and intrinsic motivation. Practitioners should avoid over-praising outcome (it can create fear of failure) and instead celebrate effort, strategy, and perseverance: 'I noticed you tried it a different way when it didn't work.' Challenge should be calibrated within the child's zone of proximal development. A setting that values risk-taking and treats mistakes as learning signals builds a culture where resilience can develop. Development Matters notes that resilience requires experience of overcoming genuine difficulty — settings that remove all challenge inadvertently undermine it.",
      "examples": "A child attempting a climbing wall and trying again after sliding down; a child persisting with scissors when cutting is difficult; a child trying to write their name without the model in front of them.",
      "is_statutory": true,
      "year": [0]
    },
    {
      "objective_id": "PSED-R-O005",
      "domain_id": "PSED-R-D002",
      "objective_text": "Explain the reasons for rules, know right from wrong and try to behave accordingly",
      "non_statutory_guidance": "Moral reasoning at this stage is primarily heteronomous (rules come from authority) and grounded in concrete consequences rather than abstract principles — this is developmentally appropriate and consistent with Piagetian theory. Practitioners should encourage children to explain the purpose of rules ('Why do we walk inside?') rather than simply stating them. Circle time discussions about fairness, role-play scenarios with ethical dilemmas, and story characters who face moral choices all support this development. The emphasis should be on understanding and internalising principles, not rote rule-following.",
      "examples": "A child explaining 'We don't run inside because someone could get hurt'; a child who has taken a toy saying 'That was wrong, I should have asked'; discussing a story character's dilemma about whether to tell the truth.",
      "is_statutory": true,
      "year": [0]
    },
    {
      "objective_id": "PSED-R-O006",
      "domain_id": "PSED-R-D002",
      "objective_text": "Manage their own basic hygiene and personal needs, including dressing, going to the toilet and understanding the importance of healthy food choices",
      "non_statutory_guidance": "Physical independence in self-care enables children to participate fully in the school day and underpins dignity and agency. Practitioners should provide time and opportunity for children to manage dressing (coats, shoes) without rushing, model and narrate handwashing routines, and discuss food groups in the context of the food children actually eat. Settings should never shame children who are not yet independent in toileting — this is an additional vulnerability risk for looked-after children and those with SEND. Healthy food understanding at this stage is about simple categories and enjoyment, not calorie awareness.",
      "examples": "A child putting on their own coat and fastening it; a child washing hands before lunch without prompting; a child choosing fruit at snack time and explaining 'fruit keeps us healthy'.",
      "is_statutory": true,
      "year": [0]
    },
    {
      "objective_id": "PSED-R-O007",
      "domain_id": "PSED-R-D003",
      "objective_text": "Work and play cooperatively and take turns with others",
      "non_statutory_guidance": "Cooperative play develops through stages (solitary → parallel → associative → cooperative) and most Reception children are in the associative-to-cooperative transition. Practitioners support cooperative play through structured small group activities, provision of resources that require sharing or collaboration (e.g., one set of tools between two), explicit teaching of turn-taking language ('It's your turn now', 'Can I have a go?'), and adult facilitation during play without over-directing. Game playing — both rule-bound board games and outdoor games — is a natural context for developing turn-taking within emotionally manageable stakes.",
      "examples": "Two children taking turns to add blocks to a shared tower; a group of children negotiating roles in role-play ('I'll be the shopkeeper and you be the customer'); waiting in a queue for the slide.",
      "is_statutory": true,
      "year": [0]
    },
    {
      "objective_id": "PSED-R-O008",
      "domain_id": "PSED-R-D003",
      "objective_text": "Form positive attachments to adults and friendships with peers",
      "non_statutory_guidance": "Attachment to key adults in the EYFS setting is the single most important protective factor for children's learning and wellbeing. Settings should assign key persons meaningfully, ensure warm and consistent interactions, and be especially attentive to children who appear not to seek proximity to adults (avoidant attachment pattern) or who show distress disproportionate to separation (anxious attachment). Friendships at this stage are typically dyadic and activity-based rather than sustained — this is normal. Practitioners should notice and gently support children who consistently play alone, but also recognise that some children recharge through solitary play and should not be pathologised for this.",
      "examples": "A child seeking out their key person when distressed; a child greeting a specific peer by name and choosing to play alongside them regularly; a child showing a creation to their key worker with pride.",
      "is_statutory": true,
      "year": [0]
    },
    {
      "objective_id": "PSED-R-O009",
      "domain_id": "PSED-R-D003",
      "objective_text": "Show sensitivity to their own and to others' needs",
      "non_statutory_guidance": "Sensitivity to others' needs is an early manifestation of theory of mind and requires both cognitive (perspective-taking) and affective (emotional resonance) components. At age 4-5, most children are moving beyond the egocentrism typical of earlier years and can consider that others may feel, want, or know something different from themselves. Practitioners support this through daily opportunities to discuss feelings and needs, explicit modelling of sensitivity ('Let's check if Amara wants to join our game — how can we ask?'), and books that explore different characters' needs and perspectives. Sensitivity to one's own needs is equally important: children who cannot recognise their own hunger, tiredness, or discomfort struggle to self-regulate.",
      "examples": "A child noticing a peer crying and going to sit beside them; a child inviting a child who is standing alone to join their game; a child telling the teacher 'I'm really tired today — can I have a quiet corner?'",
      "is_statutory": true,
      "year": [0]
    }
  ],
  "concepts": [
    {
      "concept_id": "PSED-R-C001",
      "domain_id": "PSED-R-D001",
      "concept_name": "Emotional Identification and Self-Awareness",
      "description": "The ability to name, recognise, and label one's own emotional states and to identify emotions in others through facial expression, body language, and context. At Reception level, children work with a core palette of basic emotions (happy, sad, angry, scared, surprised, disgusted) and begin to recognise that emotions exist on a continuum of intensity (a little cross → very angry). Self-awareness in this sense is the precondition for all subsequent emotional regulation: you cannot manage what you cannot name.",
      "teaching_guidance": "Use a rich feeling vocabulary consistently and incidentally throughout the day. Introduce nuanced emotion words beyond happy/sad: frustrated, nervous, proud, disappointed, excited. Feeling check-ins at the start of sessions, emotion word walls with faces, and regular use of story characters' feelings in discussions all build this vocabulary. Validate all emotions while distinguishing them from behaviour: 'It's okay to feel angry. It's not okay to hit.' Mirror and name children's own emotions back to them ('You look really pleased with that — are you feeling proud?').",
      "key_vocabulary": "feelings, emotions, happy, sad, angry, scared, worried, excited, proud, frustrated, calm, surprised",
      "common_misconceptions": "Adults sometimes conflate emotion-naming with regulation — knowing the word 'angry' does not automatically confer control. Children who can label their emotions do not automatically manage them; the labelling is the prerequisite, not the solution. Also, some children (particularly those with limited emotional vocabulary at home) may present as emotionally 'flat' in school but are not actually less emotional — they have fewer language tools to express what they feel.",
      "concept_type": "social",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": ["PSED-R-C002", "PSED-R-C009"]
    },
    {
      "concept_id": "PSED-R-C002",
      "domain_id": "PSED-R-D001",
      "concept_name": "Impulse Control and Delayed Gratification",
      "description": "The capacity to inhibit an immediate response or desire in order to serve a longer-term goal or social norm. In Reception, this manifests as waiting for a turn, pausing before acting on an urge, completing a task before moving to something more appealing, and resisting taking something that belongs to someone else. Delayed gratification is a specific form of impulse control involving the ability to forgo immediate reward for a greater future reward. Both are heavily dependent on working memory (holding the goal in mind while inhibiting the impulse) and are core components of executive function.",
      "teaching_guidance": "Scaffold waiting by making it meaningful and time-bounded — visual timers reduce the anxiety of open-ended waiting. Do not simply demand waiting; provide something to do during the wait (a fidget tool, a simple counting game). Use role-play and social stories to rehearse impulse control in low-stakes situations. Avoid creating unnecessarily long waiting situations in the classroom — they are developmentally demanding and create unnecessary failure. Celebrate instances of successful impulse control explicitly and privately where possible.",
      "key_vocabulary": "wait, turn, soon, later, when, finished, my turn, your turn, patient, stop",
      "common_misconceptions": "Impulse control is often framed as a character issue ('he's naughty') when it is primarily a neurological developmental issue. The pre-frontal cortex, which governs impulse control, develops significantly between ages 3-7 and is highly sensitive to stress and adversity. Children from high-adversity backgrounds (domestic violence, neglect, poverty) typically show delayed executive function development — this is a trauma response, not a choice. Punitive responses to impulse control failures are counterproductive and can entrench the problem.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": ["PSED-R-C001", "PSED-R-C007"]
    },
    {
      "concept_id": "PSED-R-C003",
      "domain_id": "PSED-R-D001",
      "concept_name": "Following Multi-Step Instructions",
      "description": "The ability to receive, hold in working memory, and sequentially execute instructions involving two or more steps or ideas. At Reception level, children are expected to manage sequences such as 'Get your coat, put it on, then line up by the door'. This requires working memory (holding all steps), attention (attending to the full instruction before beginning), sequencing (performing steps in the right order), and inhibition (not acting on step 1 while still receiving step 2). Instruction-following is a critical predictor of classroom learning across all subjects.",
      "teaching_guidance": "Always say the child's name first to secure attention before giving a multi-step instruction. Keep sequences short (two steps for less-ready children, up to three for more-ready children). Pair verbal instructions with visual supports (picture sequence cards). Check comprehension by asking 'What are you going to do first?' Avoid giving instructions from the other side of the room or while the child is mid-activity — proximity and eye contact improve compliance. For children with language delay or SEND, simplify to one step at a time and gradually build up.",
      "key_vocabulary": "first, then, next, last, listen, remember, steps, instructions, order",
      "common_misconceptions": "Children who do not follow multi-step instructions are often labelled as 'not listening' or defiant when the underlying issue may be working memory limitation, auditory processing difficulty, or receptive language delay. An assessment of whether the child can follow a single-step instruction (and succeeds) helps to distinguish compliance issues from capacity issues.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "PSED-R-C004",
      "domain_id": "PSED-R-D002",
      "concept_name": "Resilience and Persistence",
      "description": "The disposition to continue attempting a task in the face of difficulty, setback, or failure. Resilience involves bouncing back from disappointment; persistence involves sustaining effort over time. Together they are central to the EYFS Characteristic of Effective Learning described as Active Learning — 'keeping trying, enjoying achieving what you set out to do'. At Reception, resilience is still largely externally scaffolded (children need adult encouragement to persist) but the foundations of an internalised growth mindset are being laid. Research consistently shows that effort-focused praise ('You worked hard on that') rather than ability-focused praise ('You're so clever') builds more durable resilience.",
      "teaching_guidance": "Deliberately calibrate challenge so children experience achievable difficulty — too easy builds no resilience, too hard creates avoidance. Narrate resilience when you see it ('Look how you kept trying even when it was hard — that's really resilient'). Avoid rescuing children too quickly; allow a period of struggle before intervening. Use picture books with resilient characters and discuss their feelings when things went wrong. Create a classroom culture where mistakes are visibly celebrated as learning opportunities.",
      "key_vocabulary": "try, keep going, not yet, hard, tricky, practise, again, brave, proud, learning",
      "common_misconceptions": "Resilience is sometimes conflated with not showing distress or not asking for help. True resilience includes knowing when and how to seek appropriate support. Children who suppress distress entirely may be showing avoidant coping rather than resilience.",
      "concept_type": "social",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": ["PSED-R-C005", "PSED-R-C002"]
    },
    {
      "concept_id": "PSED-R-C005",
      "domain_id": "PSED-R-D002",
      "concept_name": "Understanding Rules and Moral Reasoning",
      "description": "The developing capacity to understand that rules exist for reasons, to explain those reasons, to distinguish right from wrong actions in concrete social contexts, and to attempt to align behaviour with moral understanding. At Reception level this is pre-conventional in Kohlberg's terms — children understand rules primarily in terms of authority and consequences rather than underlying principles — but they are beginning to grasp the social contract: 'We have this rule so that everyone can be safe/fair/happy.' This is a genuine moral concept, not mere compliance training.",
      "teaching_guidance": "Always explain the why behind rules, especially when enforcing them: 'We walk inside because if we run, someone might get hurt and that would be unfair to them.' Use circle time to involve children in creating, discussing, and revising class rules. Present moral dilemmas through story ('What should the character do? Why?') and through structured reflection on real incidents without blame ('What happened? How did it make them feel? What could we do differently?'). Avoid invoking authority alone ('Because I said so') — this builds compliance without moral understanding.",
      "key_vocabulary": "rules, fair, right, wrong, kind, safe, hurt, because, reason, should, shouldn't",
      "common_misconceptions": "Children who break rules do not necessarily lack moral understanding — they may lack impulse control (PSED-R-C002), or may be in a state of emotional arousal that overrides their knowledge of the rule. Distinguishing 'does not know the rule' from 'cannot yet act on the rule when dysregulated' is important for appropriate response.",
      "concept_type": "social",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": ["PSED-R-C002"]
    },
    {
      "concept_id": "PSED-R-C006",
      "domain_id": "PSED-R-D002",
      "concept_name": "Independence in Self-Care",
      "description": "The practical capacity to manage basic personal needs including dressing, undressing, toileting, and understanding healthy eating choices, without requiring adult assistance for routine tasks. Self-care independence is both a functional skill and a contributor to self-efficacy and dignity. By the end of Reception, children should be able to manage coats and shoes, use the toilet independently and maintain basic hygiene routines. Understanding healthy food choices at this stage means knowing that fruit and vegetables are important and that a variety of foods is good for the body — not calorie counting or nutritional analysis.",
      "teaching_guidance": "Build genuine practice time into the daily routine — putting on and fastening coats should not be rushed away. Name and narrate each step when modelling. Celebrate independent self-care achievements quietly and genuinely. Be alert to children whose self-care independence at home is actively restricted by anxious carers; school may be where they first practise these skills. Never shame or draw attention to difficulties in toileting — this is an area of high vulnerability. Healthy food discussions should be positive and exploratory ('I wonder what this vegetable tastes like?') not prescriptive or tied to weight/body shape.",
      "key_vocabulary": "independently, myself, hygiene, clean, healthy, dress, undress, toilet, wash, food, choice",
      "common_misconceptions": "Independence in self-care is not simply a function of practice — children whose family circumstances involve significant adversity, or who have caring responsibilities at home, may present very differently in their self-care capabilities and needs. Cultural assumptions about what constitutes 'appropriate' self-care independence should be held lightly.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "PSED-R-C007",
      "domain_id": "PSED-R-D003",
      "concept_name": "Cooperative Play and Turn-Taking",
      "description": "The ability to engage in joint activity with other children, negotiating goals, sharing resources, taking turns, and sustaining the cooperative frame over time. Cooperative play at Reception level involves entering others' play appropriately, adapting one's own play agenda to accommodate a shared narrative or goal, taking turns in both game and conversational contexts, and resolving minor conflicts without escalation. This is the most structurally demanding form of social play, requiring simultaneous management of one's own desires (impulse control), awareness of others' states (empathy), and the shared rules of the activity.",
      "teaching_guidance": "Scaffold cooperative play through small groups (2-3 children) rather than large ones, and through role-play contexts with defined roles. Board games with simple rules provide a highly structured scaffold for turn-taking within an emotionally engaging context. Resist the urge to always intervene in social difficulties — allow children to attempt resolution first, intervening with open questions ('What could you do?') before directive suggestions. Explicitly teach and rehearse the language of cooperative play: 'Can I join in?', 'It's your turn', 'Let's take turns', 'I have an idea — what do you think?'",
      "key_vocabulary": "turn, share, together, cooperate, join, wait, my turn, your turn, fair, include, agree, play",
      "common_misconceptions": "Turn-taking in a simple bilateral context (passing a ball) is significantly easier than turn-taking within complex cooperative play (sustaining a shared role-play scenario). Children who can pass the ball without dispute may still struggle with the latter — these are related but distinct capabilities. Also, children who choose solitary or parallel play are not necessarily failing to develop social skills — some children recharge through quieter independent play and this is developmentally normal.",
      "concept_type": "social",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": ["PSED-R-C002", "PSED-R-C008"]
    },
    {
      "concept_id": "PSED-R-C008",
      "domain_id": "PSED-R-D003",
      "concept_name": "Forming Secure Attachments",
      "description": "The capacity to develop trusting, warm, consistent relationships with key adults in the setting and positive peer friendships. Attachment to a key adult in the EYFS context is the primary safe base from which children explore, take risks, and regulate distress. Peer friendships at Reception level are typically dyadic, activity-based, and relatively unstable compared to later childhood friendships — this is developmentally normal. A securely attached child in the EYFS setting will seek proximity to their key person when distressed, use them as a secure base for exploration, and respond to comfort from them.",
      "teaching_guidance": "Assign key persons meaningfully and protect key-person time. Warm, genuine, attentive interactions are the foundation — not activities or resources. Be especially attentive to children who show signs of insecure attachment patterns: avoidant (do not seek adults when distressed), anxious/ambivalent (highly distressed on separation, difficult to comfort), or disorganised (show confusing or contradictory attachment behaviours). The latter is a risk indicator and should prompt consultation with the SENCO or designated safeguarding lead. Do not discourage children from forming preferences for particular adults — this is healthy attachment behaviour, not favouritism.",
      "key_vocabulary": "safe, trust, friend, together, care, help, kind, special, belong",
      "common_misconceptions": "Secure attachment is sometimes assumed to mean the child does not show distress at separation. In fact, protest at separation from a familiar carer followed by settling and comfort-seeking from the key person is a sign of secure (not insecure) attachment. Children who show no distress at all in any context may be displaying avoidant patterns that warrant attention.",
      "concept_type": "social",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": ["PSED-R-C001", "PSED-R-C007"]
    },
    {
      "concept_id": "PSED-R-C009",
      "domain_id": "PSED-R-D003",
      "concept_name": "Empathy and Perspective-Taking",
      "description": "The developing ability to recognise and resonate with another person's emotional state (affective empathy) and to understand that others may have thoughts, feelings, and knowledge that differ from one's own (cognitive empathy / theory of mind). At Reception level, children are completing the shift from egocentrism to an early theory of mind (typically consolidated around age 4). They can understand that a person who hasn't seen something doesn't know about it (false belief task level) and can infer basic emotions from context. Affective empathy — feeling moved by another's distress — often precedes the cognitive capacity to accurately identify its cause.",
      "teaching_guidance": "Build perspective-taking explicitly through books, role-play, and structured discussion. Ask 'What do you think she is feeling? Why?' and 'What might he be thinking?' Validate and celebrate spontaneous acts of empathy when you observe them. Story books where the same events are narrated from multiple characters' perspectives are a powerful tool. Be aware that empathy development can be temporarily suppressed by the child's own distress or threat-response — a dysregulated child is not able to access empathy at that moment, and expecting them to do so is developmentally inappropriate. Empathy should never be weaponised ('How do you think that makes her feel?') as a shaming technique.",
      "key_vocabulary": "feel, think, wonder, understand, imagine, how, why, perspective, same, different, kind, notice",
      "common_misconceptions": "Empathy and sympathy are often confused. Empathy involves resonating with and trying to understand the other's experience; sympathy involves responding from one's own perspective. Children (and adults) often offer solutions ('Here, have my toy') when empathy (sitting with the distress, acknowledging it) is what is needed. Both are appropriate at different times, and children benefit from learning to distinguish them.",
      "concept_type": "social",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": ["PSED-R-C001", "PSED-R-C008"]
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "PSED-R-C001",
      "dependent_concept": "PSED-R-C002",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.85,
      "rationale": "Emotional identification is a prerequisite for impulse control: a child must first be able to name and recognise the emotional state that is driving an impulse before they can begin to regulate it. Labelling the feeling ('I am angry') creates the brief cognitive pause necessary for inhibition to operate. Without emotional awareness, regulation strategies have no purchase point."
    },
    {
      "prerequisite_concept": "PSED-R-C002",
      "dependent_concept": "PSED-R-C006",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.65,
      "rationale": "Independence in self-care requires a degree of impulse regulation — specifically, the ability to attend to and complete a multi-step self-care routine rather than abandoning it for something more immediately appealing. Children with very limited impulse control often need adult co-regulation to complete dressing and hygiene routines consistently. The link is moderate because self-care can also be achieved through highly routinised habit even with lower impulse control."
    },
    {
      "prerequisite_concept": "PSED-R-C001",
      "dependent_concept": "PSED-R-C009",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Empathy and perspective-taking depend on a prior capacity for emotional identification: a child cannot recognise or resonate with another's emotional state if they do not yet have the vocabulary and conceptual framework to distinguish emotional states in themselves. Emotional self-awareness is the cognitive scaffold on which the recognition of others' emotions is built."
    },
    {
      "prerequisite_concept": "PSED-R-C001",
      "dependent_concept": "PSED-R-C005",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.7,
      "rationale": "Understanding rules and moral reasoning in social contexts requires the ability to consider the emotional impact of actions on others ('it would hurt their feelings', 'it would make them sad'). This affective component of moral understanding depends on basic emotional identification. A child with limited emotional vocabulary cannot reason morally about emotional consequences."
    },
    {
      "prerequisite_concept": "PSED-R-C008",
      "dependent_concept": "PSED-R-C007",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Secure attachment to key adults provides the emotional safe base from which children venture into the more challenging social territory of peer cooperation. Children without a secure adult attachment often find peer cooperation significantly harder, as they lack the co-regulated emotional stability needed to manage the frustrations and negotiations involved. A securely attached child is neurobiologically better placed to take the social risks that cooperation requires."
    },
    {
      "prerequisite_concept": "PSED-R-C002",
      "dependent_concept": "PSED-R-C007",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Cooperative play and turn-taking structurally require impulse control: to take turns, a child must inhibit the impulse to act when it is not their turn and wait despite the pull of immediate desire. Without a developing capacity for impulse control, turn-taking remains aspirational but unreachable — the child knows the rule but cannot yet act on it when the impulse is strong."
    },
    {
      "prerequisite_concept": "PSED-R-C009",
      "dependent_concept": "PSED-R-C007",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.75,
      "rationale": "Sustained cooperative play requires some capacity to model and respond to a partner's perspective — to understand that the other child wants or thinks something, and to adapt one's own play accordingly. Children with very limited perspective-taking ability tend to engage in parallel rather than genuinely cooperative play. This is a developmental link rather than a logical prerequisite, as simple turn-taking can occur without full perspective-taking."
    }
  ]
}
