{
  "metadata": {
    "subject": "Understanding the World",
    "key_stage": "EYFS",
    "years_covered": [
      0
    ],
    "document_reference": "DfE EYFS Statutory Framework 2024",
    "extraction_date": "2026-02-22",
    "structure_rating": 7,
    "notes": "Understanding the World is a Specific Area with 3 ELGs. ELG 13: Past and Present (maps to History KS1); ELG 14: People, Culture and Communities (maps to Geography KS1, RE); ELG 15: The Natural World (maps to Science KS1). ELGs 13-15 do NOT count towards the GLD calculation. Understanding the World is the most multi-disciplinary EYFS area, spanning History, Geography, Science and PSHE."
  },
  "domains": [
    {
      "domain_id": "UW-R-D001",
      "domain_name": "Past and Present",
      "description": "Developing awareness of the past and how it differs from the present, using family stories, books and settings to understand chronological change and similarity across time.",
      "curriculum_context": "Past and Present is Early Learning Goal 13 within the Understanding the World Specific Area. At the end of Reception, children are expected to talk about the lives of the people around them and their roles in society; know some similarities and differences between things in the past and now, drawing on their experiences and what has been read in class; and understand the past through settings, characters and events encountered in books read in class and storytelling. This ELG is the foundational precursor to KS1 History: it establishes the key concepts of chronological language, change over time, and narrative as historical evidence. The emphasis on family stories and books means that children's prior knowledge and home literacy practices are explicitly legitimised as historical sources. Past and Present does not count towards the Good Level of Development calculation, but its developmental significance is substantial — children who leave Reception with a secure sense of 'before and after' and 'then and now' are markedly better equipped for the formal chronological demands of KS1 History.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "UW-R-D002",
      "domain_name": "People, Culture and Communities",
      "description": "Building knowledge of the immediate environment and of cultural, religious and geographical diversity through observation, discussion, stories and maps.",
      "curriculum_context": "People, Culture and Communities is Early Learning Goal 14 within the Understanding the World Specific Area. At the end of Reception, children are expected to describe their immediate environment using knowledge from observation, discussion, stories, non-fiction texts and maps; know some similarities and differences between different religious and cultural communities in this country, drawing on their experiences and what has been read in class; and explain some similarities and differences between life in this country and life in other countries, drawing on knowledge from stories, non-fiction texts and maps. This ELG spans Geography (local environment observation, comparison of places) and Religious Education (diversity of belief and practice), making it the most cross-disciplinary of the Understanding the World ELGs. The requirement to use maps — even very simple ones — introduces the fundamental geographical tool at the earliest possible stage. People, Culture and Communities does not count towards the GLD, but provides the motivational and cultural grounding for geographical and RE learning across KS1 and KS2.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "UW-R-D003",
      "domain_name": "The Natural World",
      "description": "Developing scientific curiosity through close observation and drawing of animals and plants, comparing environments and contrasting habitats, and beginning to understand key processes such as seasonal change and states of matter.",
      "curriculum_context": "The Natural World is Early Learning Goal 15 within the Understanding the World Specific Area. At the end of Reception, children are expected to explore the natural world around them, making observations and drawing pictures of animals and plants; know some similarities and differences between the natural world around them and contrasting environments, drawing on their experiences or what has been read in class; and understand some important processes and changes in the natural world around them, including the seasons and changing states of matter. This ELG is the direct precursor to KS1 Science, particularly the Working Scientifically, Plants, Animals Including Humans, and Seasonal Changes domains. The explicit requirement for observation and drawing — rather than verbal description alone — establishes scientific recording practices from the outset. The inclusion of changing states of matter (e.g., ice melting into water) is notable: this is the most abstract concept in the EYFS science curriculum, introduced here through direct physical experience before formal scientific vocabulary is taught. The Natural World does not count towards the GLD calculation.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical"
    }
  ],
  "objectives": [
    {
      "objective_id": "UW-R-O001",
      "domain_id": "UW-R-D001",
      "objective_text": "Talk about the lives of the people around them and their roles in society.",
      "non_statutory_guidance": "Children should be encouraged to discuss the roles of people they encounter in daily life — family members, teachers, local community workers — and to understand that these roles existed in the past too, though they may have looked different. Family oral history provides a powerful first-hand resource. Adults should model the use of past and present tense when discussing roles over time. Visits from community members and role play are effective approaches.",
      "examples": "A child talks about how their grandparent used to be a nurse and compares this with a modern nurse's uniform seen in a picture book. A child explains that the caretaker looks after the school building and discusses whether caretakers existed 'in the olden days'.",
      "is_statutory": true,
      "year": [
        0
      ]
    },
    {
      "objective_id": "UW-R-O002",
      "domain_id": "UW-R-D001",
      "objective_text": "Know some similarities and differences between things in the past and now, drawing on their experiences and what has been read in class.",
      "non_statutory_guidance": "The emphasis on 'drawing on their experiences and what has been read in class' means both family oral history and book knowledge are valid and expected sources. Adults should plan systematic comparisons of 'old' and 'new' across multiple domains — transport, homes, toys, technology, clothing. Dual-image comparison materials (same object old and new) are particularly effective. Children should be taught to use vocabulary such as 'in the past', 'a long time ago', 'now' and 'these days'.",
      "examples": "After reading a non-fiction book about Victorian schools, a child identifies that children used to write on slates rather than paper, but that they still had to learn to write. A child brings in a photograph of their parent as a baby and compares the pram to modern buggies.",
      "is_statutory": true,
      "year": [
        0
      ]
    },
    {
      "objective_id": "UW-R-O003",
      "domain_id": "UW-R-D001",
      "objective_text": "Understand the past through settings, characters and events encountered in books read in class and storytelling.",
      "non_statutory_guidance": "High-quality fiction and picture books set in the past provide accessible windows into historical periods without requiring abstract chronological reasoning. Books about Victorian times, wartime rationing, ancient Egypt or Tudor England are all age-appropriate if the story is compelling. Adults should explicitly draw attention to the historical setting — 'This story is set a long time ago. What do you notice that is different from today?' The distinction between fiction and historical fact can be gently introduced at this stage.",
      "examples": "After reading a book set in the Second World War, a child describes the Anderson shelter setting and asks why people had to have their lights off at night. A child listening to Cinderella comments that the characters travel by horse-drawn carriage rather than a car 'because it was in the olden days'.",
      "is_statutory": true,
      "year": [
        0
      ]
    },
    {
      "objective_id": "UW-R-O004",
      "domain_id": "UW-R-D002",
      "objective_text": "Describe their immediate environment using knowledge from observation, discussion, stories, non-fiction texts and maps.",
      "non_statutory_guidance": "Children should use multiple sources — first-hand observation on walks in the local area, discussion with adults and peers, stories and non-fiction books about local environments, and simple maps — to build and express knowledge of their immediate surroundings. Adults should introduce the vocabulary of physical and human features (road, building, park, river, hill) explicitly. Simple hand-drawn maps created by adults and children together are valuable at this stage. Regular outdoor learning in the school grounds and local neighbourhood is essential.",
      "examples": "A child uses vocabulary from a local walk to describe the school environment: 'There is a road outside and a park round the corner and a big hill behind the houses.' A child looks at a simple aerial photograph of the local area and points out features they recognise.",
      "is_statutory": true,
      "year": [
        0
      ]
    },
    {
      "objective_id": "UW-R-O005",
      "domain_id": "UW-R-D002",
      "objective_text": "Know some similarities and differences between different religious and cultural communities in this country, drawing on their experiences and what has been read in class.",
      "non_statutory_guidance": "Children's own cultural and religious backgrounds are the primary starting point — the classroom community itself is likely to embody diversity. Adults should draw on non-fiction books, festivals, visitors and artefacts to build knowledge of a range of communities. Comparisons should focus on specific observable practices (food, clothing, celebrations, places of worship) rather than abstract beliefs. The emphasis on 'some similarities and differences' is important: both sameness and difference should be explored to avoid an othering approach.",
      "examples": "A child describes how their family celebrates Eid and compares it with a classmate's description of Christmas — noting that both involve special food and being with family. After a visit to a local mosque, a child talks about how it was similar to and different from a church they had visited.",
      "is_statutory": true,
      "year": [
        0
      ]
    },
    {
      "objective_id": "UW-R-O006",
      "domain_id": "UW-R-D002",
      "objective_text": "Explain some similarities and differences between life in this country and life in other countries, drawing on knowledge from stories, non-fiction texts and maps.",
      "non_statutory_guidance": "Non-fiction books about daily life in other countries, alongside stories set in other countries, provide the primary resource for this objective. The use of maps — even world maps or globes used to show where different countries are — is explicitly included. Adults should choose contrasting countries that offer genuine geographical and cultural difference from the UK while avoiding stereotyping. The emphasis is on daily life similarities and differences (what children eat, what homes look like, what weather is like) rather than on exotic or exceptional features.",
      "examples": "After reading a non-fiction book about Kenya, a child uses a world map to show where Kenya is, and explains that it is much hotter there and that some children walk a long way to school, but that children there also play games and go to school just like here. A child recognises similarities in family life across different countries studied.",
      "is_statutory": true,
      "year": [
        0
      ]
    },
    {
      "objective_id": "UW-R-O007",
      "domain_id": "UW-R-D003",
      "objective_text": "Explore the natural world around them, making observations and drawing pictures of animals and plants.",
      "non_statutory_guidance": "Outdoor learning is essential for this objective — children should explore the school grounds, a garden, a park or a nature area regularly. Drawing should be purposeful and observational, not merely decorative: adults should encourage children to look carefully at the subject before drawing, and to include detail. Magnifying glasses should be made available to support close observation. Adults should use scientific vocabulary alongside everyday language when discussing observations: 'That's a bee — it has six legs, so it's an insect.'",
      "examples": "A child uses a magnifying glass to look closely at a woodlouse found under a stone, then draws it with visible legs and body segments. A child observes a conker tree in autumn and draws the leaves, conkers and branches, labelling them with adult support.",
      "is_statutory": true,
      "year": [
        0
      ]
    },
    {
      "objective_id": "UW-R-O008",
      "domain_id": "UW-R-D003",
      "objective_text": "Know some similarities and differences between the natural world around them and contrasting environments, drawing on their experiences or what has been read in class.",
      "non_statutory_guidance": "Contrasting environments include polar regions, deserts, rainforests, and ocean habitats — all significantly different from the UK temperate environment children experience directly. Non-fiction books, photographs, video clips and artefacts are the primary resources. Adults should structure comparisons using consistent frameworks: What animals live there? What does it look like? What is the weather like? How is it similar to and different from here? Focusing on two or three contrasting environments in depth is more effective than superficial coverage of many.",
      "examples": "After a class topic on polar bears, a child explains that the Arctic is very cold and has snow and ice whereas 'where we live' has grass and trees and is warmer. A child compares a rainforest image with the school garden: 'They're both outside and they both have trees and animals, but the rainforest is much bigger and wetter.'",
      "is_statutory": true,
      "year": [
        0
      ]
    },
    {
      "objective_id": "UW-R-O009",
      "domain_id": "UW-R-D003",
      "objective_text": "Understand some important processes and changes in the natural world around them, including the seasons and changing states of matter.",
      "non_statutory_guidance": "Seasonal change is best understood through sustained observation across the school year — noting changes in trees, animals, weather and day length. A class seasonal journal or display maintained throughout the year is the most effective pedagogical approach. States of matter (solid, liquid) are introduced at this stage through direct physical experience: melting ice, freezing water, and noting that puddles dry up. The formal vocabulary (solid, liquid, gas) and scientific explanation (particles) come later; at EYFS the aim is a secure observational understanding that 'this stuff can change from one form to another'.",
      "examples": "A child who has observed the school tree monthly describes how it lost its leaves in autumn and now (in spring) has new buds. A child melts ice cubes and explains 'The ice turned into water because it got warm' — showing understanding of state change through direct observation.",
      "is_statutory": true,
      "year": [
        0
      ]
    }
  ],
  "concepts": [
    {
      "concept_id": "UW-R-C001",
      "domain_id": "UW-R-D001",
      "concept_name": "Chronological Language",
      "description": "The vocabulary and grammatical structures used to locate events and situations in time and to express temporal relationships — including past tense forms ('was', 'used to', 'long ago', 'in the past', 'before', 'when I was little', 'in those days') and contrast markers ('now', 'these days', 'today'). At EYFS, children develop chronological language primarily through oral storytelling, family oral history, and discussion of books set in the past. Mastery at this stage means using past and present tense vocabulary correctly to describe change over time in oral contexts, before writing is expected.",
      "teaching_guidance": "Model chronological language explicitly and consistently in every discussion about the past. Use dual-image comparison materials (then/now photographs) and talk through them using the target vocabulary. Read aloud books set in the past and pause to use 'once', 'long ago', 'back then' and 'now' in discussion. Family photographs brought from home provide a highly motivating context. Invite grandparents or community elders to talk about 'when they were young' — children's questions to visitors naturally elicit chronological vocabulary.",
      "key_vocabulary": "long ago, in the past, before, used to, once upon a time, then, now, these days, today, change, different, same, old, new, modern, ancient",
      "common_misconceptions": "Children often use 'old' as a synonym for both 'in the past' and 'worn out' or 'ugly', and 'new' as a synonym for 'better'. They may compress all of history into a single undifferentiated 'olden days'. Using family oral history helps calibrate the sense of time scale: grandparent's childhood is much closer than the Great Fire of London.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": [
        "UW-R-C002",
        "UW-R-C003"
      ]
    },
    {
      "concept_id": "UW-R-C002",
      "domain_id": "UW-R-D001",
      "concept_name": "Similarities and Differences Across Time",
      "description": "The ability to identify specific ways in which daily life, objects, environments and people's roles have changed from the past to the present, and specific ways in which they have remained the same. This concept — change and continuity — is the foundational organising idea of all historical thinking. At EYFS it is introduced through direct comparison of observable artefacts, photographs and stories rather than through abstract chronological reasoning. Mastery is demonstrated when a child can articulate both a specific change ('cars are different now — they used to be very noisy and slow') and a specific continuity ('people have always needed somewhere to live').",
      "teaching_guidance": "Use paired comparison activities as the primary teaching approach: a Victorian schoolroom photograph alongside a photograph of the classroom; a horse-drawn cart alongside a modern lorry; a dial telephone alongside a smartphone. Ask three questions systematically: 'What has changed? What has stayed the same? Why do you think it changed?' Avoid framing all change as progress — some things were lost as well as gained.",
      "key_vocabulary": "change, the same, different, similar, still, but, whereas, used to, now, before, after, compare, then, today",
      "common_misconceptions": "Children naturally focus on differences and need prompting to identify continuities. They often assume all historical change represents improvement ('better now than before'), which is worth challenging gently through discussion of things that may have been lost (community, craftsmanship, outdoor play).",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": [
        "UW-R-C001"
      ]
    },
    {
      "concept_id": "UW-R-C003",
      "domain_id": "UW-R-D001",
      "concept_name": "Stories as Historical Windows",
      "description": "The understanding that books, picture books, stories and oral narratives set in the past convey information about how people lived, thought and behaved in different historical periods — and that fiction, though not factual, can accurately represent the texture of past life. At EYFS this is one of the primary modes of historical learning: children encounter past settings, characters and events through carefully chosen literature before they engage with formal historical sources. Mastery means a child can look at a story setting or character and recognise it as 'from the past', describe specific features that tell them this, and ask questions about the historical context.",
      "teaching_guidance": "Choose books that have historically accurate settings and are set in clearly identifiable periods: books set during wartime evacuation, Victorian domestic life, or pre-industrial crafts work well. After reading, ask 'What tells us this story is set in the past?' and draw out specific visual and textual clues. Distinguish between what the story is about (the characters' feelings, the plot) and what it shows about the historical period (the setting, the objects, the way of life). Begin to raise the idea that even fiction is created by an author in a particular time and place.",
      "key_vocabulary": "story, setting, character, past, historical, long ago, tells us, shows us, real, made up, evidence, clue",
      "common_misconceptions": "Children may not distinguish between fairy tales (non-historical fantasy) and historical fiction. They may also assume all old-looking books are set in the past. Explicitly discussing the historical setting as separate from the plot helps. Children may conflate a story being old with it being set in the past — a book printed in 1960 about the future is not a historical source.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 1,
      "co_teach_hints": [
        "UW-R-C001",
        "UW-R-C002"
      ]
    },
    {
      "concept_id": "UW-R-C004",
      "domain_id": "UW-R-D002",
      "concept_name": "Observation and Description of Local Environment",
      "description": "The ability to use learned vocabulary to describe the physical and human features of the immediate local environment — the school building, school grounds, the street, local park, shops and community buildings — drawing on direct observation from walks and outdoor learning as well as photographs, stories and simple maps. This is the foundational geographical skill: geography begins with the ability to notice and name the world around you. At EYFS, mastery means a child can describe several features of their local environment using appropriate vocabulary and can point to features on a simple aerial photograph or map.",
      "teaching_guidance": "Regular local walks are essential for this concept — children need repeated, guided observation outdoors to build the vocabulary and mental map. Take photographs on walks to review and discuss back in the classroom. Create simple maps together: 'What would we see if we flew over our school? Let us draw it.' Introduce physical vocabulary (road, hill, river, field, tree, garden) and human vocabulary (house, shop, school, church, road, park) explicitly. Use simple aerial photographs of the local area from Google Maps or similar sources — children find it highly engaging to recognise their own school from above.",
      "key_vocabulary": "school, road, building, park, shop, garden, house, hill, tree, field, path, environment, local, near, far, describe, observe, notice",
      "common_misconceptions": "Children often describe their local area in terms of personal relevance ('that is where my friend lives', 'that is the shop we go to') rather than in geographical terms. Gently redirect to geographical features: 'Yes, and what type of building is that? What is around it?' Children may not see familiar surroundings as worthy of geographical attention — framing ordinary environments as interesting and worth studying is important.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": [
        "UW-R-C005",
        "UW-R-C006"
      ]
    },
    {
      "concept_id": "UW-R-C005",
      "domain_id": "UW-R-D002",
      "concept_name": "Cultural and Religious Diversity Awareness",
      "description": "The foundational understanding that different people within Britain and around the world hold different religious beliefs, follow different cultural traditions, celebrate different festivals and organise their lives in different ways — and that this diversity is a normal feature of human society rather than an exception. At EYFS this is introduced through the concrete and specific: particular festivals, particular foods, particular clothing practices, particular places of worship. Mastery means a child can name some specific examples of cultural or religious diversity and identify both similarities and differences between different communities in terms of specific observable practices.",
      "teaching_guidance": "Begin with the children's own community — the diversity present in the class is the starting point. Use dual-focus books that centre characters from diverse backgrounds without exoticising them. Celebrate festivals from multiple traditions across the year. Invite family members to share cultural practices. Maintain a 'similarities and differences' framework throughout: always connect diverse practices back to universal human needs (celebration, community, food, stories) to maintain respect and avoid othering.",
      "key_vocabulary": "celebrate, festival, religion, culture, community, belief, tradition, similar, different, custom, food, clothing, worship, mosque, church, temple, synagogue, gurdwara",
      "common_misconceptions": "Children may assume that 'different' means 'strange' or 'inferior'. Consistent framing of diversity as normal and enriching addresses this. Children may also over-generalise from limited examples ('all Muslims fast at Ramadan' as though it applies identically to all Muslims everywhere) — emphasising that there is diversity within traditions as well as between them develops more nuanced understanding.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 1,
      "co_teach_hints": [
        "UW-R-C006"
      ]
    },
    {
      "concept_id": "UW-R-C006",
      "domain_id": "UW-R-D002",
      "concept_name": "Comparing Local and Global Communities",
      "description": "The ability to identify specific ways in which life in a community in another country is similar to and different from life in the UK, using knowledge gathered from stories, non-fiction texts, photographs and maps. This is simultaneously a geographical concept (places are different because of location, climate and culture) and a humanities concept (human lives share common features across distance). At EYFS, comparison is structured around daily life features: food, homes, schools, weather, transport, landscape. Mastery means a child can locate another country on a world map, describe at least two ways it differs from the UK and at least two ways it is similar, and express curiosity about the place.",
      "teaching_guidance": "Choose one or two contrasting countries for sustained study rather than superficial coverage of many. Build a rich picture of daily life through multiple sources: a fiction book, a non-fiction book, photographs of children the same age in that country, a simple map showing where it is. Use a consistent comparison framework across all countries studied so children develop a transferable method. Explicitly model finding the country on a world map — this introduces the map as a tool for situating knowledge geographically.",
      "key_vocabulary": "country, world, map, here, there, similar, different, same, compare, climate, hot, cold, food, home, school, journey, travel, far away, near",
      "common_misconceptions": "Children may assume all differences are dramatic and all similarities trivial. Explicitly valuing both prevents this hierarchy. They may also assume that 'far away' means 'very different', which is not always true. Children may think about other countries primarily through tourist or adventure contexts rather than everyday lived experience — choosing books that show ordinary daily life in the target country addresses this.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": [
        "UW-R-C004",
        "UW-R-C005"
      ]
    },
    {
      "concept_id": "UW-R-C007",
      "domain_id": "UW-R-D003",
      "concept_name": "Observation of Living Things",
      "description": "The ability to closely observe animals and plants in the natural world and to record these observations through purposeful drawing. Close observation at EYFS involves using multiple senses, using simple equipment such as magnifying glasses, staying with an observation long enough to notice detail, and translating what is seen into a drawn record. This is the foundational scientific skill: all further work in biology, ecology, and scientific enquiry builds on the ability to observe carefully and systematically. Mastery means a child can use a magnifying glass correctly, describe specific details of what they observe ('it has six legs', 'the petal has lines on it', 'the bark is rough'), and produce a drawing that shows observable features rather than a symbolic representation.",
      "teaching_guidance": "Create regular opportunities for outdoor observation: the school garden, a nearby park, a nature area. Introduce magnifying glasses as standard tools and teach how to use them correctly (held close to the eye, then moved towards the object). Model observational drawing explicitly: look carefully first, then draw what you see rather than what you think it looks like. Provide structured observation prompts: 'How many legs does it have?', 'What colour are its wings?', 'What does the surface feel like?'. Use nature journals or field notebooks. Celebrate careful observation and detailed drawing equally with verbal responses.",
      "key_vocabulary": "observe, look closely, magnify, notice, detail, describe, draw, record, animal, plant, leaf, wing, leg, petal, root, stem, trunk, bark, smooth, rough, colour, shape, size",
      "common_misconceptions": "Children often draw a symbolic version of an animal or plant (a standard flower shape, a cartoon bee) rather than what they actually observe. Model the difference between a symbolic representation and an observational drawing explicitly. Children may rush observation and miss important details — structured observation prompts and think-pair-share before drawing help slow them down. Children sometimes focus only on sight; prompting them to use touch and listening enriches observation.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": true,
      "teaching_weight": 3,
      "co_teach_hints": [
        "UW-R-C008",
        "UW-R-C009"
      ]
    },
    {
      "concept_id": "UW-R-C008",
      "domain_id": "UW-R-D003",
      "concept_name": "Contrasting Environments",
      "description": "The understanding that different natural environments — woodland, seaside, grassland, desert, polar regions, ocean — look and feel very different from each other, and that each supports different animals and plants. At EYFS this is introduced through comparison of the child's familiar local environment with one or more contrasting habitats encountered through books, photographs and video. The concept connects to geography (different places look different), biology (different habitats support different life), and environmental awareness (these places are real and worth knowing about). Mastery means a child can name two or more contrasting environments, describe key features of each (cold and icy, very hot and sandy, covered in tall trees) and name at least one animal or plant typical of each.",
      "teaching_guidance": "Choose two or three contrasting environments for sustained comparison — polar, desert and tropical rainforest are commonly used as they offer stark contrast with the UK temperate environment. Use high-quality non-fiction books and photographs alongside fiction (e.g., a polar bear story). Build a 'habitats wall' with the local environment in the centre and contrasting environments around it. Use comparative language throughout: 'How is this the same as our school garden? How is it different?'",
      "key_vocabulary": "environment, habitat, forest, woodland, seaside, desert, polar, Arctic, jungle, rainforest, ocean, different, same, hot, cold, icy, sandy, wet, dry, animal, plant, live, grow, survive",
      "common_misconceptions": "Children may think that exotic environments (Arctic, Amazon) are very far away and therefore not real or relevant. Making connections to familiar places — 'a wood is a bit like a very big version of the trees in our school grounds' — helps. Children sometimes think polar regions have no life; non-fiction showing the rich wildlife of Arctic seas and tundra challenges this.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": [
        "UW-R-C007"
      ]
    },
    {
      "concept_id": "UW-R-C009",
      "domain_id": "UW-R-D003",
      "concept_name": "Seasonal Change and States of Matter",
      "description": "The understanding that the natural world changes in predictable, cyclical ways through the four seasons (spring, summer, autumn, winter), and that matter can change from one physical form to another — most accessibly, water can be liquid or solid (ice), and ice melts into water when warmed. These two concepts are paired within ELG 15 because both involve understanding observable natural processes involving change. At EYFS, the aim is a secure observational understanding of both phenomena through direct experience: watching the school tree change through the year; melting ice; seeing puddles form and then dry up. Formal scientific vocabulary and particle-level explanation come later in KS1 and KS3; at EYFS, the focus is on noticing, naming, and describing the change.",
      "teaching_guidance": "For seasonal change: maintain a class seasonal journal or display throughout the Reception year, with photographs taken at the same location across all four seasons. Go outside in all weathers. For states of matter: provide direct physical experience — freeze water, melt ice, observe puddles, notice condensation on a cold window. Use the words 'melt', 'freeze', 'solid' and 'liquid' naturally in discussion. Do not require children to produce a full scientific explanation — 'the ice melted because it got warm' is the target understanding.",
      "key_vocabulary": "season, spring, summer, autumn, winter, change, warm, cold, freeze, melt, ice, water, solid, liquid, puddle, evaporate, cloud, snow, rain, leaves, blossom, harvest",
      "common_misconceptions": "Children often think it is always the same season everywhere at once. For seasonal change, confusion between weather (what happens today) and season (the typical pattern over months) is common — maintain a distinction in language. For states of matter, children commonly think that frozen water and liquid water are different substances rather than the same substance in different states. Freeze and unfreeze the same water in front of them to establish the identity-through-change concept.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": [
        "UW-R-C007"
      ]
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "UW-R-C001",
      "dependent_concept": "UW-R-C002",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Chronological language — past tense vocabulary, temporal connectives, and the use of 'before' and 'after' — is the prerequisite for comparing change and continuity across time. A child cannot articulate what has changed without the language to locate events in the past and contrast them with the present."
    },
    {
      "prerequisite_concept": "UW-R-C004",
      "dependent_concept": "UW-R-C006",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Describing and understanding the local environment through observation is the necessary starting point for comparing it with global communities. Children need a secure vocabulary for describing their own environment before they can productively compare it with environments elsewhere in the world."
    },
    {
      "prerequisite_concept": "UW-R-C007",
      "dependent_concept": "UW-R-C008",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "The ability to observe and describe living things in the local natural environment provides the observational baseline against which contrasting environments can be compared. Children who have not developed close observation of their local environment lack the reference point needed to notice meaningful differences in contrasting habitats."
    },
    {
      "prerequisite_concept": "UW-R-C007",
      "dependent_concept": "UW-R-C009",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Observation of living things, including observation of plants and trees across time, is the primary mechanism through which seasonal change becomes visible to children. The child who has developed careful observational skills — noticing the presence and absence of leaves, the appearance of blossom, the behaviour of insects — is equipped to perceive and understand seasonal patterns."
    },
    {
      "prerequisite_concept": "UW-R-C007",
      "dependent_concept": "SC-KS1-C002",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Close Observation in KS1 Science builds directly on the observational skills established through natural world observation in EYFS. Children who have spent Reception year making careful observations of animals and plants — using magnifying glasses, looking for detail, recording in drawing — arrive at KS1 already practising the observational habits that Working Scientifically formalises."
    },
    {
      "prerequisite_concept": "UW-R-C007",
      "dependent_concept": "SC-KS1-C001",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Natural curiosity about the living world, expressed through close observation in EYFS, is the motivational and cognitive foundation from which KS1 scientific questioning emerges. Children who have been encouraged to notice, wonder and ask questions during natural world exploration in Reception are disposed towards asking the investigable scientific questions that formal enquiry requires."
    },
    {
      "prerequisite_concept": "UW-R-C009",
      "dependent_concept": "SC-KS1-C029",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Understanding seasonal change through direct observation in EYFS provides the empirical grounding for the KS1 concept of the four seasons. Children who have observed the school tree and recorded seasonal changes in Reception arrive at Year 1 with concrete seasonal experience on which formal seasonal science builds."
    },
    {
      "prerequisite_concept": "UW-R-C001",
      "dependent_concept": "HI-KS1-C001",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Chronological language developed in EYFS — past and present tense vocabulary, temporal sequencing words, and the concept of 'before and after' — is the prerequisite for the formal chronological understanding required in KS1 History. Time and Chronology at KS1 builds on the temporal vocabulary and sequencing abilities established through oral history work and book-based historical exploration in Reception."
    },
    {
      "prerequisite_concept": "UW-R-C004",
      "dependent_concept": "GE-KS1-C004",
      "confidence": "curated",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Observation and description of the local environment in EYFS builds the vocabulary and observational habits that KS1 Geography formalises as Physical and Human Features. Children who have been systematically naming and describing features of their immediate environment in Reception arrive at Year 1 already using the geographical vocabulary and observational framework that the Physical and Human Features concept develops."
    }
  ]
}
