{
  "version": "1.0",
  "subject": "History",
  "authored_by": "history-specialist",
  "authored_date": "2026-02-24",
  "note": "Named canonical historical sources referenced by HistoryStudy nodes across KS1-KS3. Each source is a specific, named artefact, document or site that the AI tutor can reference when generating source-based activities. Source types follow the ontology controlled vocabulary. Only named canonical sources are included (not generic types like 'Roman coins'). Pedagogical_use gives the AI direct instruction on how to deploy the source in teaching.",
  "sources": [
    {
      "source_id": "HSRC-001",
      "name": "Samuel Pepys' Diary (Great Fire entries)",
      "source_type": "primary_written",
      "date_description": "2-5 September 1666",
      "date_start_year": 1666,
      "date_end_year": 1666,
      "provenance": "Samuel Pepys was a senior naval administrator and diarist who lived in London. He wrote his diary entries as personal records of his daily life, not for publication. His account of the Great Fire is an eyewitness description written as events unfolded.",
      "location": "Pepys Library, Magdalene College, Cambridge",
      "url": "https://www.pepysdiary.com/diary/1666/09/",
      "pedagogical_use": "Read simplified extracts aloud. Ask pupils: 'What did Pepys SEE and FEEL during the fire?' Then ask: 'Pepys was ONE person. Can his diary tell us what EVERYONE in London experienced?' This develops the concept that a source gives one perspective, not the whole picture.",
      "key_stage_suitability": ["KS1", "KS2"],
      "sensitivity_notes": "Pepys describes destruction and fear. Use extracts that focus on human response (helping neighbours, saving belongings) rather than graphic descriptions of suffering.",
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-002",
      "name": "Contemporary Illustrations of the Great Fire of London",
      "source_type": "primary_visual",
      "date_description": "1666-1680s",
      "date_start_year": 1666,
      "date_end_year": 1680,
      "provenance": "Several artists produced views of the Great Fire both during and shortly after the event. The most famous is an anonymous painting now in the Museum of London showing the fire from the south bank of the Thames. These were produced to record a dramatic event and to sell as prints.",
      "location": "Museum of London; British Museum",
      "url": "https://www.museumoflondon.org.uk/museum-london",
      "pedagogical_use": "Show the painting and ask pupils to describe what they can see. Then ask: 'Who painted this? Were they there?' and 'What can the painting tell us that Pepys' diary cannot?' Use alongside HSRC-001 to develop the idea that different sources tell us different things.",
      "key_stage_suitability": ["KS1"],
      "sensitivity_notes": null,
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-003",
      "name": "Florence Nightingale Photograph and Portrait",
      "source_type": "primary_visual",
      "date_description": "c.1854-1860",
      "date_start_year": 1854,
      "date_end_year": 1860,
      "provenance": "Several photographs and painted portraits of Nightingale exist from the Crimean War period and after. The most famous photograph shows her seated in a formal pose. Portraits were often commissioned to present public figures in a particular light.",
      "location": "National Portrait Gallery, London; Florence Nightingale Museum, London",
      "url": "https://www.npg.org.uk/collections/search/person/mp03321/florence-nightingale",
      "pedagogical_use": "Compare this portrait with the Seacole photograph (HSRC-004). Ask: 'What do these images tell us about how each woman was seen in her time?' and 'Why do we have more formal portraits of Nightingale than Seacole?' This introduces the idea that who gets recorded in history is not accidental.",
      "key_stage_suitability": ["KS1"],
      "sensitivity_notes": null,
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-004",
      "name": "Mary Seacole Photograph",
      "source_type": "primary_visual",
      "date_description": "c.1873",
      "date_start_year": 1873,
      "date_end_year": 1873,
      "provenance": "A hand-coloured daguerreotype-style photograph of Mary Seacole, taken after the Crimean War. Far fewer images of Seacole survive compared with Nightingale, reflecting the different levels of public recognition each woman received in their lifetimes.",
      "location": "National Portrait Gallery, London",
      "url": "https://www.npg.org.uk/collections/search/person/mp81684/mary-seacole",
      "pedagogical_use": "Use alongside HSRC-003. Ask: 'Why do we have fewer pictures of Mary Seacole than Florence Nightingale?' Connect to the significance concept: being remembered and recorded is not automatic -- it depends on who society chooses to celebrate.",
      "key_stage_suitability": ["KS1", "KS2"],
      "sensitivity_notes": "The reason Seacole was less well-documented is partly racial prejudice. Discuss age-appropriately as 'unfairness' at KS1.",
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-005",
      "name": "The Armada Portrait of Elizabeth I",
      "source_type": "primary_visual",
      "date_description": "c.1588",
      "date_start_year": 1588,
      "date_end_year": 1588,
      "provenance": "Attributed to George Gower, this portrait was painted to celebrate the defeat of the Spanish Armada. It shows Elizabeth with her hand on a globe, the English fleet behind her and the wrecked Armada in the other window. It is a piece of political propaganda designed to project power and divine favour.",
      "location": "Queen's House, Royal Museums Greenwich",
      "url": "https://www.rmg.co.uk/see-do/we-recommend/attractions/armada-portrait-elizabeth-i",
      "pedagogical_use": "At KS1: compare with portraits of Queen Victoria and ask 'What do these pictures tell us about how each queen wanted to be seen?' At KS3: analyse as propaganda -- what symbols of power does Elizabeth surround herself with, and what message is being sent? Who was the intended audience?",
      "key_stage_suitability": ["KS1", "KS3"],
      "sensitivity_notes": null,
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-006",
      "name": "Skara Brae Settlement Remains",
      "source_type": "primary_archaeological",
      "date_description": "c.3180-2500 BC",
      "date_start_year": -3180,
      "date_end_year": -2500,
      "provenance": "A Neolithic settlement on Mainland, Orkney, Scotland. Preserved under sand dunes for thousands of years until exposed by a storm in 1850. The settlement contains eight stone houses connected by covered passages, complete with stone furniture (beds, dressers, hearths). It is the best-preserved Neolithic village in northern Europe.",
      "location": "Orkney, Scotland (Historic Environment Scotland)",
      "url": "https://www.historicenvironment.scot/visit-a-place/places/skara-brae/",
      "pedagogical_use": "Show photographs of the interior of a Skara Brae house. Ask: 'What can you see? What does this tell us about how Stone Age people lived?' Then: 'What can this settlement NOT tell us? (What they believed, what they ate, what they wore -- unless we combine it with other evidence.)' This develops understanding that archaeological evidence requires inference.",
      "key_stage_suitability": ["KS2"],
      "sensitivity_notes": null,
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-007",
      "name": "Stonehenge",
      "source_type": "built_heritage",
      "date_description": "c.3000-2000 BC (constructed in stages)",
      "date_start_year": -3000,
      "date_end_year": -2000,
      "provenance": "A prehistoric monument on Salisbury Plain, Wiltshire. Built in several stages over approximately 1,000 years. The purpose remains debated: religious temple, astronomical observatory, healing site, or ceremonial gathering place. The transport of bluestones from Wales (~150 miles) demonstrates remarkable organisation and engineering.",
      "location": "Salisbury Plain, Wiltshire (English Heritage)",
      "url": "https://www.english-heritage.org.uk/visit/places/stonehenge/",
      "pedagogical_use": "Present the different theories about Stonehenge's purpose. Ask: 'How can historians disagree about something so famous?' and 'What evidence would we need to settle the debate?' This develops understanding that even iconic sources can be interpreted in different ways.",
      "key_stage_suitability": ["KS2"],
      "sensitivity_notes": null,
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-008",
      "name": "Star Carr Antler Headdresses",
      "source_type": "museum_artefact",
      "date_description": "c.9000 BC",
      "date_start_year": -9000,
      "date_end_year": -9000,
      "provenance": "Red deer antler frontlets found at Star Carr, a Mesolithic archaeological site near Scarborough, North Yorkshire. The antlers had been thinned and perforated, suggesting they were worn as headdresses. Whether they were used for hunting disguise, ritual, or both is debated.",
      "location": "British Museum, London; Museum of Archaeology and Anthropology, Cambridge",
      "url": "https://www.britishmuseum.org/collection/object/H_1953-0402-1",
      "pedagogical_use": "Show the artefact and ask: 'What do you think this was used for? Why?' Collect pupils' ideas, then explain what archaeologists think. Ask: 'How can we decide between our ideas when the people who made this left no written record?' This models archaeological reasoning from objects.",
      "key_stage_suitability": ["KS2"],
      "sensitivity_notes": null,
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-009",
      "name": "Vindolanda Tablets",
      "source_type": "primary_written",
      "date_description": "c.85-130 AD",
      "date_start_year": 85,
      "date_end_year": 130,
      "provenance": "Thin wooden writing tablets discovered at the Roman fort of Vindolanda near Hadrian's Wall. Written in ink by Roman soldiers and their families, they record everyday life: military supplies, birthday party invitations, requests for warm socks. They are the oldest surviving handwritten documents in Britain.",
      "location": "Vindolanda Museum, Northumberland; British Museum, London",
      "url": "https://www.vindolanda.com/roman-writing-tablets",
      "pedagogical_use": "Read a simplified Vindolanda tablet (e.g. the birthday invitation from Claudia Severa, or the request for warm socks). Ask: 'What does this tell us about daily life for a Roman soldier?' Then: 'These are personal letters. How is this different from an official Roman record? What can personal letters tell us that official records cannot?'",
      "key_stage_suitability": ["KS2", "KS3"],
      "sensitivity_notes": null,
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-010",
      "name": "Hadrian's Wall",
      "source_type": "built_heritage",
      "date_description": "Begun 122 AD",
      "date_start_year": 122,
      "date_end_year": 128,
      "provenance": "A stone wall built on the orders of Emperor Hadrian stretching 73 miles across northern England from Wallsend-on-Tyne to Bowness-on-Solway. It marked the northern frontier of the Roman Empire and contained forts, milecastles and turrets for military garrisons. Its construction demonstrates the scale of Roman engineering and military organisation.",
      "location": "Northern England (English Heritage / National Trust)",
      "url": "https://www.english-heritage.org.uk/visit/places/hadrians-wall/",
      "pedagogical_use": "Ask: 'Why did the Romans build a wall here? What does it tell us about the limits of Roman power?' and 'What can the wall tell us about how the Romans controlled their empire?' Use alongside HSRC-009 to build a picture of life on the Roman frontier.",
      "key_stage_suitability": ["KS2", "KS3"],
      "sensitivity_notes": null,
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-011",
      "name": "Roman Coins from Britain",
      "source_type": "primary_archaeological",
      "date_description": "c.43-410 AD",
      "date_start_year": 43,
      "date_end_year": 410,
      "provenance": "Thousands of Roman coins have been found across Britain, from military sites, towns, villas and hoards. They carry portraits of emperors and symbols of Roman power. Their distribution across Britain maps the extent of Romanisation and trade networks.",
      "location": "British Museum, London; local museums across Britain",
      "url": "https://www.britishmuseum.org/collection/search?keyword=roman+coin+britain",
      "pedagogical_use": "Show a Roman coin with an emperor's portrait. Ask: 'What can this coin tell us about who was in charge?' and 'Where this coin was found tells us something too -- what might it mean that Roman coins were found in Scotland?' Coins are accessible primary sources for KS2: they are small, concrete objects with readable images.",
      "key_stage_suitability": ["KS2"],
      "sensitivity_notes": null,
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-012",
      "name": "Sutton Hoo Ship Burial",
      "source_type": "primary_archaeological",
      "date_description": "c.625 AD",
      "date_start_year": 625,
      "date_end_year": 625,
      "provenance": "An Anglo-Saxon ship burial discovered in 1939 at Sutton Hoo, Suffolk. The burial contained a wealth of grave goods including a helmet, sword, shield, gold buckle, silver bowls and Byzantine silverware. It is believed to be the burial of King Raedwald of East Anglia. The burial demonstrates the wealth, trading connections and belief systems of Anglo-Saxon elites.",
      "location": "British Museum, London",
      "url": "https://www.britishmuseum.org/collection/galleries/sutton-hoo-and-europe",
      "pedagogical_use": "Show the Sutton Hoo helmet reconstruction. Ask: 'What does this tell us about the person buried here?' Build outward: 'The grave also contained silver from Byzantium (modern Turkey). What does THAT tell us about Anglo-Saxon trading connections?' Then: 'Why bury such valuable objects? What does this tell us about Anglo-Saxon beliefs about death?'",
      "key_stage_suitability": ["KS2"],
      "sensitivity_notes": null,
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-013",
      "name": "Bede's Ecclesiastical History of the English People",
      "source_type": "primary_written",
      "date_description": "Completed 731 AD",
      "date_start_year": 731,
      "date_end_year": 731,
      "provenance": "Written by the Venerable Bede, a monk at Jarrow monastery in Northumbria. It is the primary narrative source for the history of the Anglo-Saxon conversion to Christianity and the early English Church. Bede wrote as a devout Christian with the explicit purpose of recording God's work in the conversion of the English. His perspective shapes what he includes and omits.",
      "location": "British Library, London (earliest manuscript copies)",
      "url": "https://www.bl.uk/collection-items/bedes-ecclesiastical-history-of-the-english-people",
      "pedagogical_use": "Read a simplified extract about Augustine's arrival in 597 AD. Ask: 'Bede was a monk. How might that affect what he wrote about the arrival of Christianity?' and 'What would a non-Christian Briton have said about the same events?' This develops understanding that the author's identity shapes their account.",
      "key_stage_suitability": ["KS2"],
      "sensitivity_notes": "Bede presents the conversion to Christianity as unambiguously positive. Encourage pupils to consider the perspective of those whose existing beliefs were replaced.",
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-014",
      "name": "Anglo-Saxon Chronicle",
      "source_type": "primary_written",
      "date_description": "c.890 AD onwards (compiled retrospectively, then continued annually)",
      "date_start_year": 890,
      "date_end_year": 1154,
      "provenance": "A collection of annals recording the history of the Anglo-Saxons, begun during the reign of Alfred the Great and continued in various monasteries until 1154. Multiple versions survive from different monasteries. The Chronicle was compiled retrospectively for earlier centuries and written contemporaneously from Alfred's reign. It reflects an Anglo-Saxon (and specifically West Saxon) perspective on events.",
      "location": "British Library, London; Corpus Christi College, Cambridge",
      "url": "https://www.bl.uk/collection-items/anglo-saxon-chronicle",
      "pedagogical_use": "Compare the Chronicle's account of Viking raids with archaeological evidence from Viking-settled towns like Jorvik. Ask: 'The Chronicle was written by Anglo-Saxon monks. How might their account of Vikings differ from what the Vikings themselves would have said?' and 'The archaeological evidence shows Vikings as traders and craftspeople. Why might the Chronicle not mention this?' This is one of the best KS2 sources for teaching about perspective and bias.",
      "key_stage_suitability": ["KS2"],
      "sensitivity_notes": null,
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-015",
      "name": "Lindisfarne Gospels",
      "source_type": "primary_artistic",
      "date_description": "c.715-720 AD",
      "date_start_year": 715,
      "date_end_year": 720,
      "provenance": "An illuminated manuscript Gospel book produced at Lindisfarne Priory, Northumbria. Created by Eadfrith, Bishop of Lindisfarne, in honour of St Cuthbert. The intricate decorated pages combine Celtic, Germanic and Mediterranean artistic traditions, demonstrating the cultural fusion of Anglo-Saxon Christianity.",
      "location": "British Library, London",
      "url": "https://www.bl.uk/collection-items/lindisfarne-gospels",
      "pedagogical_use": "Show the carpet page designs. Ask: 'What does the skill and beauty of this book tell us about how important Christianity was to Anglo-Saxon monks?' and 'The designs combine Celtic, Germanic and Roman styles. What does that tell us about the connections between different cultures in Anglo-Saxon Britain?'",
      "key_stage_suitability": ["KS2"],
      "sensitivity_notes": null,
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-016",
      "name": "Viking Coins from York (Jorvik)",
      "source_type": "primary_archaeological",
      "date_description": "c.880-954 AD",
      "date_start_year": 880,
      "date_end_year": 954,
      "provenance": "Coins minted in Viking-ruled York (Jorvik) bearing Norse names and symbols. Their existence demonstrates that the Vikings established a functioning economic system with their own minting, trade networks and political authority in England.",
      "location": "JORVIK Viking Centre, York; British Museum, London",
      "url": "https://www.jorvikvikingcentre.co.uk/",
      "pedagogical_use": "Show a Viking coin alongside an Anglo-Saxon coin. Ask: 'What is similar and what is different? What does it tell us that the Vikings minted their OWN coins in England?' This challenges the 'savage raider' stereotype by demonstrating sophisticated economic and political organisation.",
      "key_stage_suitability": ["KS2"],
      "sensitivity_notes": null,
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-017",
      "name": "Bayeux Tapestry",
      "source_type": "primary_visual",
      "date_description": "c.1070s",
      "date_start_year": 1070,
      "date_end_year": 1080,
      "provenance": "An embroidered cloth nearly 70 metres long depicting the events leading up to and including the Norman Conquest of England in 1066. Probably commissioned by Bishop Odo of Bayeux (William the Conqueror's half-brother) and made in England. It tells the story from a Norman perspective, justifying William's claim to the English throne.",
      "location": "Musee de la Tapisserie de Bayeux, Bayeux, France",
      "url": "https://www.bayeuxmuseum.com/en/the-bayeux-tapestry/",
      "pedagogical_use": "At KS2 (Vikings context): use the final scenes showing the Battle of Hastings to mark the end of the Anglo-Saxon period. Ask: 'Who made this tapestry and whose story does it tell?' At KS3: full propaganda analysis -- 'How does the Tapestry justify William's invasion? What scenes are chosen and what is left out? How would Harold's supporters have told the same story?'",
      "key_stage_suitability": ["KS2", "KS3"],
      "sensitivity_notes": "The Tapestry depicts violent battle scenes including death. At KS2, focus on the narrative and perspective rather than the violence.",
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-018",
      "name": "Cuneiform Tablets from Sumer",
      "source_type": "primary_written",
      "date_description": "c.3400-1900 BC",
      "date_start_year": -3400,
      "date_end_year": -1900,
      "provenance": "Clay tablets inscribed with wedge-shaped marks using a reed stylus. Cuneiform was the world's first writing system, developed in Sumer for accounting, then expanded to record laws, literature, medicine and astronomy. Tens of thousands of tablets survive, providing an extraordinary record of Mesopotamian civilisation.",
      "location": "British Museum, London; University of Pennsylvania Museum",
      "url": "https://www.britishmuseum.org/collection/search?keyword=cuneiform",
      "pedagogical_use": "Show a cuneiform tablet and explain that it records a list of goods (barley, sheep, etc.). Ask: 'Why was writing invented? Was it for stories or for keeping records?' Then: 'What does it tell us that the FIRST writing was used for counting and trading?' This connects the invention of writing to economic necessity.",
      "key_stage_suitability": ["KS2"],
      "sensitivity_notes": null,
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-019",
      "name": "The Standard of Ur",
      "source_type": "primary_visual",
      "date_description": "c.2600-2400 BC",
      "date_start_year": -2600,
      "date_end_year": -2400,
      "provenance": "A decorated box discovered in the Royal Cemetery of Ur (modern Iraq) by Leonard Woolley in the 1920s. One side shows scenes of war (chariots, soldiers, prisoners); the other shows scenes of peace (banquet, music, animals). Made of lapis lazuli, shell and red limestone inlaid in bitumen. Its purpose is uncertain -- perhaps a soundbox for a musical instrument.",
      "location": "British Museum, London",
      "url": "https://www.britishmuseum.org/collection/object/W_1928-1010-3",
      "pedagogical_use": "Show both sides of the Standard. Ask: 'What can the War side tell us about Sumerian armies and power?' and 'What can the Peace side tell us about Sumerian daily life and celebrations?' Then: 'The lapis lazuli came from Afghanistan, thousands of miles away. What does that tell us about Sumerian trade?'",
      "key_stage_suitability": ["KS2"],
      "sensitivity_notes": null,
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-020",
      "name": "Stele of Hammurabi's Code",
      "source_type": "primary_legal",
      "date_description": "c.1754 BC",
      "date_start_year": -1754,
      "date_end_year": -1754,
      "provenance": "A black diorite stele inscribed with 282 laws issued by King Hammurabi of Babylon. At the top, Hammurabi is shown receiving authority from the sun god Shamash, legitimising the laws as divinely sanctioned. It is one of the oldest surviving law codes and reveals details of Babylonian social hierarchy, punishment, trade and property.",
      "location": "Louvre Museum, Paris",
      "url": "https://www.louvre.fr/en/oeuvre-notices/law-code-hammurabi-king-babylon",
      "pedagogical_use": "Read simplified examples of laws (e.g. 'If a builder builds a house that falls down and kills the owner, the builder shall be put to death'). Ask: 'What do these laws tell us about what was important to the people of Babylon?' and 'Are these laws fair? How are they different from our laws today?' This connects ancient civilisation to modern concepts of justice.",
      "key_stage_suitability": ["KS2"],
      "sensitivity_notes": "Some of Hammurabi's laws include harsh punishments and distinctions based on social class. Select examples carefully and use them as evidence of the society's values rather than endorsing the punishments.",
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-021",
      "name": "Mohenjo-daro Archaeological Remains",
      "source_type": "primary_archaeological",
      "date_description": "c.2500-1900 BC",
      "date_start_year": -2500,
      "date_end_year": -1900,
      "provenance": "One of the largest cities of the Indus Valley civilisation, located in modern-day Sindh, Pakistan. Excavated from the 1920s onwards. The remains reveal a city with a sophisticated grid plan, advanced drainage and sewerage systems, a large public bath (the Great Bath), and standardised brick sizes. No clear evidence of palaces, temples or obvious ruling class structures.",
      "location": "In situ, Sindh, Pakistan (UNESCO World Heritage Site); artefacts in National Museum, Karachi",
      "url": "https://whc.unesco.org/en/list/138",
      "pedagogical_use": "Show the city plan and drainage system. Ask: 'What does the grid plan and drainage tell us about how this city was organised?' and 'We have NOT found palaces or temples like in Egypt or Sumer. What might that mean about who was in charge?' This is the best source for teaching the limits of archaeological evidence when writing is undeciphered.",
      "key_stage_suitability": ["KS2"],
      "sensitivity_notes": null,
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-022",
      "name": "Indus Valley Seals",
      "source_type": "museum_artefact",
      "date_description": "c.2600-1900 BC",
      "date_start_year": -2600,
      "date_end_year": -1900,
      "provenance": "Small carved stone seals found across the Indus Valley civilisation. They show animals (unicorn-like bull, elephant, rhinoceros), human figures and short inscriptions in the undeciphered Indus script. Probably used as marks of identity or ownership in trade. Over 3,500 seals have been found, demonstrating standardised practices across the entire civilisation.",
      "location": "National Museum, New Delhi; British Museum, London",
      "url": "https://www.britishmuseum.org/collection/search?keyword=indus+seal",
      "pedagogical_use": "Show several seals and their common features. Ask: 'These seals were found in cities hundreds of miles apart, but they look very similar. What does that tell us about how the civilisation was organised?' and 'We cannot read the writing on these seals. What questions does that leave unanswered?'",
      "key_stage_suitability": ["KS2"],
      "sensitivity_notes": null,
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-023",
      "name": "The Rosetta Stone",
      "source_type": "primary_written",
      "date_description": "196 BC",
      "date_start_year": -196,
      "date_end_year": -196,
      "provenance": "A granodiorite stele inscribed with a decree by King Ptolemy V in three scripts: Egyptian hieroglyphs, Demotic Egyptian and Ancient Greek. Discovered by Napoleon's soldiers in 1799 at Rosetta (Rashid), Egypt. Jean-Francois Champollion used it to decipher hieroglyphs in 1822, unlocking the ability to read thousands of years of Egyptian written records.",
      "location": "British Museum, London",
      "url": "https://www.britishmuseum.org/collection/object/Y_EA24",
      "pedagogical_use": "Explain that before the Rosetta Stone, nobody could read hieroglyphs. Ask: 'Why was this stone so important? What did it allow historians to do?' Then connect to evidence and interpretation: 'Without the Rosetta Stone, Egyptian history would be like the Indus Valley -- we could see the buildings but couldn't read the writing. What difference does being able to read the writing make?'",
      "key_stage_suitability": ["KS2"],
      "sensitivity_notes": "The Rosetta Stone's presence in the British Museum rather than in Egypt is contested. This can be discussed as a parallel to the Elgin Marbles debate if age-appropriate.",
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-024",
      "name": "Tutankhamun's Tomb and Death Mask",
      "source_type": "primary_archaeological",
      "date_description": "c.1323 BC (burial); discovered 1922",
      "date_start_year": -1323,
      "date_end_year": -1323,
      "provenance": "The tomb of the young pharaoh Tutankhamun in the Valley of the Kings, discovered nearly intact by Howard Carter in 1922. The gold death mask, sarcophagus and over 5,000 artefacts provide the most complete picture of an Egyptian royal burial. Tutankhamun was a minor pharaoh; his significance lies in the quality of evidence his undisturbed tomb provides.",
      "location": "Grand Egyptian Museum, Cairo (death mask); Egyptian Museum, Cairo (other artefacts)",
      "url": "https://www.grandegyptianmuseum.org/",
      "pedagogical_use": "Ask: 'Tutankhamun was not a very important pharaoh. Why is he the most famous Egyptian pharaoh today?' This develops the significance concept: his fame comes from the DISCOVERY, not from what he did. Then ask: 'What can the objects in his tomb tell us about what Egyptians believed about life after death?'",
      "key_stage_suitability": ["KS2"],
      "sensitivity_notes": "Discussion of mummification and burial should respect beliefs about death and the afterlife. The display of human remains raises ethical questions worth noting.",
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-025",
      "name": "Egyptian Book of the Dead",
      "source_type": "primary_written",
      "date_description": "c.1550-50 BC (various copies)",
      "date_start_year": -1550,
      "date_end_year": -50,
      "provenance": "A collection of funerary texts written on papyrus and placed in tombs to guide the deceased through the afterlife. The most famous is the Papyrus of Ani (c.1250 BC) in the British Museum. It contains spells, prayers and illustrations including the weighing of the heart ceremony. Each copy was personalised for the individual buried with it.",
      "location": "British Museum, London (Papyrus of Ani); Egyptian Museum, Cairo",
      "url": "https://www.britishmuseum.org/collection/object/Y_EA10470",
      "pedagogical_use": "Show the weighing of the heart scene. Ask: 'What does this tell us about what the Egyptians believed happened after death?' and 'Why would people pay to have this book made for them?' Connect to evidence and interpretation: 'This was written for a rich person. Would a poor Egyptian farmer have had one?'",
      "key_stage_suitability": ["KS2"],
      "sensitivity_notes": "Respect for religious beliefs about death and the afterlife. Present as evidence of sincere belief, not as 'strange' or 'weird' customs.",
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-026",
      "name": "Shang Dynasty Oracle Bones",
      "source_type": "primary_written",
      "date_description": "c.1600-1046 BC",
      "date_start_year": -1600,
      "date_end_year": -1046,
      "provenance": "Animal bones (usually ox scapulae) and turtle shells used for divination by Shang dynasty rulers. Questions were inscribed on the bone, which was heated until it cracked; the pattern of cracks was interpreted as answers from ancestral spirits. The inscriptions are the earliest known Chinese writing. Over 150,000 fragments have been found.",
      "location": "National Museum of China, Beijing; British Museum, London",
      "url": "https://www.britishmuseum.org/collection/search?keyword=oracle+bone",
      "pedagogical_use": "Show an oracle bone with inscriptions. Explain the divination process. Ask: 'What kinds of questions did the Shang king ask the ancestors?' (War, harvest, weather, illness.) 'What does this tell us about what the Shang king was worried about?' Then: 'Oracle bone inscriptions are the earliest Chinese writing. But writing on bamboo and silk would have rotted away. What else might the Shang have written that we will never find?'",
      "key_stage_suitability": ["KS2"],
      "sensitivity_notes": "Oracle bone divination should be presented as a sincere religious practice, not as superstition.",
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-027",
      "name": "Tomb of Fu Hao",
      "source_type": "primary_archaeological",
      "date_description": "c.1200 BC",
      "date_start_year": -1200,
      "date_end_year": -1200,
      "provenance": "The intact tomb of Lady Fu Hao, a consort of King Wu Ding of the Shang dynasty, discovered at Yinxu in 1976. It contained over 450 bronze objects, 750 jade objects, 560 bone objects and 6,900 cowrie shells. Oracle bone inscriptions describe Fu Hao as a military leader who commanded troops in battle, challenging assumptions about women's roles in Shang society.",
      "location": "National Museum of China, Beijing; Yinxu Museum, Anyang",
      "url": null,
      "pedagogical_use": "Show images of the bronze vessels and jade objects. Ask: 'What does the wealth of this burial tell us about Fu Hao's status?' Then: 'Oracle bones tell us Fu Hao led armies in battle. Does this surprise you? What does it tell us about what women could do in Shang society?' This challenges assumptions and develops critical thinking about gender in ancient societies.",
      "key_stage_suitability": ["KS2"],
      "sensitivity_notes": "The tomb contained evidence of human sacrifice (16 human burials alongside the main burial). Mention only if age-appropriate and in context.",
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-028",
      "name": "The Parthenon (and Elgin Marbles)",
      "source_type": "built_heritage",
      "date_description": "447-432 BC (original construction)",
      "date_start_year": -447,
      "date_end_year": -432,
      "provenance": "A temple to the goddess Athena on the Acropolis in Athens, built during the Golden Age under Pericles. The sculptured friezes (known as the Elgin Marbles after Lord Elgin, who removed them 1801-1812) depict the Panathenaic procession and mythological scenes. The marbles' removal and continued display in the British Museum is one of the most prominent cultural heritage disputes in the world.",
      "location": "Acropolis, Athens (structure); British Museum, London (Elgin Marbles); Acropolis Museum, Athens (remaining sculptures)",
      "url": "https://www.britishmuseum.org/about-us/british-museum-story/contested-objects-collection/parthenon-sculptures",
      "pedagogical_use": "Show the Parthenon and its sculptured frieze. Ask: 'What does this building tell us about the power and wealth of Athens?' Then introduce the Elgin Marbles debate: 'Part of this building is now in the British Museum in London. The Greek government wants it returned. What do you think?' This develops the concept that historical sources are not just evidence -- they are also objects with their own contested histories.",
      "key_stage_suitability": ["KS2", "KS3"],
      "sensitivity_notes": "The repatriation debate is politically charged. Present both sides fairly: the British Museum argues for preservation and global access; Greece argues for cultural integrity and historical justice.",
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-029",
      "name": "Ancient Greek Pottery (Black-Figure and Red-Figure)",
      "source_type": "primary_artistic",
      "date_description": "c.700-300 BC",
      "date_start_year": -700,
      "date_end_year": -300,
      "provenance": "Painted ceramic vessels produced in Athens and other Greek city-states. Black-figure pottery (older technique, black figures on red clay) and red-figure pottery (newer, red figures on black glaze) depict scenes from mythology, daily life, athletic competitions and warfare. They are among the most abundant and informative sources for Greek social history.",
      "location": "British Museum, London; Metropolitan Museum of Art, New York; National Archaeological Museum, Athens",
      "url": "https://www.britishmuseum.org/collection/search?keyword=greek+pottery",
      "pedagogical_use": "Show pottery depicting different scenes: an athletic competition, a symposium (drinking party), a woman at a loom. Ask: 'What can each of these scenes tell us about life in ancient Greece?' and 'Pottery was made by craftworkers, not rulers. Does that make it more or less useful than an official document?' This develops the concept that everyday objects can be rich historical sources.",
      "key_stage_suitability": ["KS2"],
      "sensitivity_notes": "Some Greek pottery depicts scenes of warfare and violence, or nude athletic figures. Select age-appropriate examples.",
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-030",
      "name": "Arabic Scientific and Medical Manuscripts",
      "source_type": "primary_written",
      "date_description": "c.800-1200 CE",
      "date_start_year": 800,
      "date_end_year": 1200,
      "provenance": "Manuscripts produced by scholars working in the Islamic world, particularly Baghdad's House of Wisdom. These include translations and extensions of Greek scientific and philosophical texts, original works on algebra, medicine, optics and astronomy. Al-Khwarizmi's algebra treatise and Ibn Sina's Canon of Medicine are among the most influential. Many survive in libraries across the Islamic world and Europe.",
      "location": "Bodleian Library, Oxford; British Library, London; various libraries in Istanbul, Cairo and Tehran",
      "url": "https://www.bl.uk/collection-guides/islamic-scientific-manuscripts",
      "pedagogical_use": "Show a page from an Arabic astronomical manuscript alongside a later European text that translated it. Ask: 'How did knowledge travel from Baghdad to Europe?' and 'Why do we use Arabic numerals (1, 2, 3) rather than Roman numerals (I, II, III) today?' This develops understanding of how knowledge transfers across cultures and challenges Eurocentric narratives.",
      "key_stage_suitability": ["KS2", "KS3"],
      "sensitivity_notes": null,
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-031",
      "name": "Astrolabes from the Islamic World",
      "source_type": "primary_technological",
      "date_description": "c.800-1500 CE (various examples)",
      "date_start_year": 800,
      "date_end_year": 1500,
      "provenance": "Navigational and astronomical instruments developed and refined by Islamic scholars. An astrolabe can determine the time, the direction of Mecca for prayer, and the positions of celestial bodies. They demonstrate the mathematical and engineering sophistication of Islamic civilisation. Many surviving examples are beautifully engraved with Arabic calligraphy.",
      "location": "Museum of the History of Science, Oxford; British Museum, London; Museum of Islamic Art, Doha",
      "url": "https://www.mhs.ox.ac.uk/collections/imu-search-page/browse-by-category/?browse=astrolabes",
      "pedagogical_use": "Show an astrolabe and explain what it does. Ask: 'What does the existence of this instrument tell us about what Islamic scholars knew about mathematics and astronomy?' and 'Why would a navigator, a scientist AND a religious person all need an astrolabe?' This connects scientific knowledge to practical and religious application.",
      "key_stage_suitability": ["KS2"],
      "sensitivity_notes": null,
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-032",
      "name": "Benin Bronzes",
      "source_type": "primary_artistic",
      "date_description": "c.1400-1897 (various pieces)",
      "date_start_year": 1400,
      "date_end_year": 1897,
      "provenance": "Thousands of metal plaques, sculptures and other artefacts from the Kingdom of Benin (in present-day Nigeria). Created using the lost-wax casting technique, they decorated the pillars of the Oba's palace and depicted court ceremonies, warriors, traders and animals. Many were looted by British forces during the 1897 punitive expedition and dispersed to museums worldwide. Repatriation to Nigeria is now underway.",
      "location": "Formerly British Museum, London (many now repatriated); Ethnologisches Museum, Berlin; various museums worldwide; National Museum, Benin City, Nigeria",
      "url": "https://www.britishmuseum.org/about-us/british-museum-story/contested-objects-collection/benin-bronzes",
      "pedagogical_use": "Show a Benin Bronze plaque depicting the Oba with attendants. Ask: 'What does this tell us about the power of the Oba in Benin?' and 'The bronze casting technique used here is among the finest in the world. What does this tell us about the skill and technology of Benin craftworkers?' Then introduce the repatriation debate: 'These objects were taken by the British army in 1897. Should they be returned to Nigeria?'",
      "key_stage_suitability": ["KS2", "KS3"],
      "sensitivity_notes": "The 1897 British punitive expedition involved significant violence. The repatriation debate is politically charged and ongoing. Present both the historical context of the looting and the current status of repatriation efforts. Be sensitive to pupils of Nigerian or West African heritage.",
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-033",
      "name": "Bayeux Tapestry (KS3 analysis)",
      "source_type": "primary_visual",
      "date_description": "c.1070s",
      "date_start_year": 1070,
      "date_end_year": 1080,
      "provenance": "See HSRC-017 for full provenance. At KS3, the Tapestry is analysed as a piece of political propaganda rather than simply as a narrative source. The Norman perspective, the selection and omission of events, and the visual rhetoric of the composition all become objects of critical analysis.",
      "location": "Musee de la Tapisserie de Bayeux, Bayeux, France",
      "url": "https://www.bayeuxmuseum.com/en/the-bayeux-tapestry/",
      "pedagogical_use": "At KS3: focus on the propaganda dimension. Ask: 'The Tapestry was probably commissioned by William's half-brother. How does this affect what it shows?' Analyse specific scenes: 'Harold is shown swearing an oath on holy relics. Why would the Normans want to include this scene?' and 'What scenes are MISSING that Harold's supporters would have included?' This develops sophisticated source analysis skills.",
      "key_stage_suitability": ["KS3"],
      "sensitivity_notes": null,
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-034",
      "name": "Magna Carta",
      "source_type": "primary_legal",
      "date_description": "1215 (original); 1297 (surviving statutory version)",
      "date_start_year": 1215,
      "date_end_year": 1215,
      "provenance": "A charter of liberties agreed between King John and his rebellious barons at Runnymede in June 1215. Only four copies of the original survive. The charter limited the king's power and established principles (no taxation without consent, right to a fair trial) that were later mythologised as foundational to democracy. In reality, it was a pragmatic peace deal between elite men.",
      "location": "British Library, London (2 copies); Salisbury Cathedral; Lincoln Castle",
      "url": "https://www.bl.uk/magna-carta",
      "pedagogical_use": "Read simplified clauses (e.g. Clause 39: 'No free man shall be arrested or imprisoned except by the lawful judgement of his equals'). Ask: 'Who benefited from this clause? Who was NOT included?' (Women, serfs, the unfree.) Then: 'Magna Carta is celebrated as the foundation of democracy. But was it really? Who was it written for?' This develops critical evaluation of significance claims.",
      "key_stage_suitability": ["KS3"],
      "sensitivity_notes": null,
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-035",
      "name": "Domesday Book",
      "source_type": "primary_administrative",
      "date_description": "1086",
      "date_start_year": 1086,
      "date_end_year": 1086,
      "provenance": "A survey of English landholding commissioned by William the Conqueror in 1085 and completed in 1086. It records the ownership, value and resources of virtually every manor in England. It was compiled to establish who held what land and what taxes they owed. It is the most comprehensive administrative document to survive from medieval Europe.",
      "location": "The National Archives, Kew, London",
      "url": "https://www.nationalarchives.gov.uk/domesday/",
      "pedagogical_use": "Show a simplified Domesday entry for a local area (if available). Ask: 'Why did William want to know exactly who owned what in England?' (Control and taxation.) 'What does this tell us about the kind of ruler William was?' Then: 'Domesday Book records land and wealth, not people's feelings or beliefs. What can it tell us and what CAN'T it tell us?'",
      "key_stage_suitability": ["KS3"],
      "sensitivity_notes": null,
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-036",
      "name": "Chronicles of Jean Froissart",
      "source_type": "primary_written",
      "date_description": "c.1370-1400",
      "date_start_year": 1370,
      "date_end_year": 1400,
      "provenance": "A narrative history of the Hundred Years War and associated events written by the French chronicler Jean Froissart. Based on interviews with participants and other chronicles. Froissart wrote from an aristocratic perspective, celebrating chivalric ideals and largely ignoring the experience of common people. His account of the Peasants' Revolt (1381) is one of the few contemporary descriptions but reflects his hostility to the rebels.",
      "location": "Bibliotheque nationale de France, Paris; British Library, London (illustrated copies)",
      "url": "https://www.bl.uk/collection-items/froissarts-chronicles",
      "pedagogical_use": "Read Froissart's description of the Peasants' Revolt. Ask: 'Froissart was a French aristocrat. How does that affect his description of the rebels?' and 'He calls the rebels dangerous and foolish. What would the rebels have said about themselves?' This is one of the best medieval sources for teaching about perspective and provenance at KS3.",
      "key_stage_suitability": ["KS3"],
      "sensitivity_notes": null,
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-037",
      "name": "The Armada Portrait of Elizabeth I (KS3 analysis)",
      "source_type": "primary_visual",
      "date_description": "c.1588",
      "date_start_year": 1588,
      "date_end_year": 1588,
      "provenance": "See HSRC-005 for full provenance. At KS3, the portrait is analysed in greater depth as a piece of political propaganda: the symbolism of the globe, the pearl ropes, the English fleet and the wrecked Armada are all decoded as deliberate statements of power, legitimacy and divine favour.",
      "location": "Queen's House, Royal Museums Greenwich",
      "url": "https://www.rmg.co.uk/see-do/we-recommend/attractions/armada-portrait-elizabeth-i",
      "pedagogical_use": "At KS3: systematic propaganda analysis. Identify every symbol in the painting and decode its meaning. Ask: 'Who was this portrait painted for?' and 'What message is Elizabeth sending to her subjects and to foreign powers?' Then: 'This is one person's version of Elizabeth. How would a Catholic recusant, or a Spanish diplomat, have depicted her differently?' This develops the concept that all historical representations are constructions.",
      "key_stage_suitability": ["KS3"],
      "sensitivity_notes": null,
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-038",
      "name": "Equiano's Autobiography (The Interesting Narrative)",
      "source_type": "primary_written",
      "date_description": "Published 1789",
      "date_start_year": 1789,
      "date_end_year": 1789,
      "provenance": "The autobiography of Olaudah Equiano, published in 1789 as 'The Interesting Narrative of the Life of Olaudah Equiano'. Equiano described his experience of being captured in West Africa as a child, the Middle Passage, enslavement in the Caribbean, and his eventual freedom. He published the book to support the abolitionist cause. Historians debate whether Equiano was born in Africa (as he claimed) or in South Carolina, based on documentary evidence.",
      "location": "British Library, London; widely available in print and digital editions",
      "url": "https://www.bl.uk/collection-items/the-interesting-narrative-of-the-life-of-olaudah-equiano",
      "pedagogical_use": "Read Equiano's description of the Middle Passage. Ask: 'Why did Equiano write this book?' (To support abolition.) 'Does that mean his account is not trustworthy?' Develop the concept that a biased source can still be valuable: 'Equiano wanted to persuade people that slavery was wrong. Does that make his description of suffering less true, or does it explain WHY he wrote it?' Then: 'Some historians question whether Equiano was born in Africa. If he was born in America, does that change the value of his account?'",
      "key_stage_suitability": ["KS3"],
      "sensitivity_notes": "Equiano's descriptions of the Middle Passage and enslavement are distressing. Select extracts carefully. Centre the humanity and agency of Equiano, not just his suffering. Be aware that pupils of African and Caribbean heritage may have personal connections to this history.",
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-039",
      "name": "Anne Frank's Diary",
      "source_type": "testimony",
      "date_description": "1942-1944",
      "date_start_year": 1942,
      "date_end_year": 1944,
      "provenance": "The diary of Anne Frank, a Jewish girl who hid with her family in a secret annex in Amsterdam for two years during the Nazi occupation of the Netherlands. She was 13 when she began writing. The diary records her daily life, fears, hopes and reflections. Anne died in Bergen-Belsen concentration camp in 1945. Her father Otto Frank, the sole survivor of the family, published the diary in 1947.",
      "location": "Anne Frank House, Amsterdam (original diary); widely published",
      "url": "https://www.annefrank.org/en/",
      "pedagogical_use": "Read an extract that shows Anne as a normal teenager (arguing with her mother, thinking about school, writing about her feelings). Ask: 'What does reading Anne's diary tell us that statistics about the Holocaust cannot?' Develop the concept that testimony gives us the human reality behind the numbers. Then: 'Anne wrote her diary hoping it would be published after the war. How does that affect what she wrote?'",
      "key_stage_suitability": ["KS3"],
      "sensitivity_notes": "This is a deeply sensitive source. The UCL Centre for Holocaust Education advises starting with Anne as a person (her hopes, interests, personality) before moving to her persecution and death. Do not use Anne's story to represent 'all' Holocaust victims -- she was one of millions of individuals. Be aware of Jewish pupils who may have family connections to the Holocaust.",
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    },
    {
      "source_id": "HSRC-040",
      "name": "Nuremberg Trial Transcripts and Documents",
      "source_type": "primary_legal",
      "date_description": "1945-1946",
      "date_start_year": 1945,
      "date_end_year": 1946,
      "provenance": "The official transcripts of the International Military Tribunal at Nuremberg (1945-46), which tried 24 major Nazi war criminals. The trial produced an enormous documentary record including filmed testimony, captured Nazi documents, and the transcripts of the proceedings themselves. The trial established the concept of 'crimes against humanity' in international law.",
      "location": "United States Holocaust Memorial Museum, Washington DC; International Court of Justice, The Hague; Nuremberg Palace of Justice",
      "url": "https://www.ushmm.org/collections/bibliography/nuremberg-trials",
      "pedagogical_use": "Use simplified extracts of testimony or documentary evidence presented at the trial. Ask: 'Why was it important to hold a trial rather than simply punishing the Nazi leaders?' Develop the concept that legal proceedings produce a specific kind of historical evidence: sworn testimony, cross-examination, documentary proof. Then: 'The trial created the concept of crimes against humanity. Why was a new legal concept needed?'",
      "key_stage_suitability": ["KS3"],
      "sensitivity_notes": "Trial testimony includes descriptions of genocide, mass murder and systematic persecution. Select extracts that demonstrate the legal and moral dimensions of the trial rather than graphic descriptions of atrocities. The Nuremberg Trials are a moment of accountability and justice, not just documentation of horror.",
      "display_category": "History Study",
      "display_color": "#B45309",
      "display_icon": "source"
    }
  ]
}