[
  {
    "concept_id": "MA-Y1-C001",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y1) with concrete stage requiring physical manipulatives (Bead strings (100 beads, colour change every 10), Counters). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Bead strings (100 beads, colour change every 10), Counters, Interlocking cubes, Buttons and shells for counting collections, Number track (1-20, then 1-100)"
  },
  {
    "concept_id": "MA-Y1-C002",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y1) with concrete stage requiring physical manipulatives (Pairs of socks, shoes or gloves, 5p coins). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Pairs of socks, shoes or gloves, 5p coins, Dienes ten-sticks, Bundles of 10 straws, Egg boxes (groups of 10), Counters for grouping"
  },
  {
    "concept_id": "MA-Y1-C003",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y1) with concrete stage requiring physical manipulatives (Numeral cards (0-100), Magnetic digits). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Numeral cards (0-100), Magnetic digits, Sandpaper numerals (0-9), Digit tiles"
  },
  {
    "concept_id": "MA-Y1-C004",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y1) with concrete stage requiring physical manipulatives (Number word cards (one to twenty), Numeral cards (1-20)). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Number word cards (one to twenty), Numeral cards (1-20), Number word wall display, Matching trays"
  },
  {
    "concept_id": "MA-Y1-C005",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y1) with concrete stage requiring physical manipulatives (Interlocking cubes, Numicon plates). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Interlocking cubes, Numicon plates, Bead strings, Counters"
  },
  {
    "concept_id": "MA-Y1-C006",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y1) with concrete stage requiring physical manipulatives (Floor number line (chalk or tape, 0-20), Washing line with pegs and number cards). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Floor number line (chalk or tape, 0-20), Washing line with pegs and number cards, Bead strings with numbered positions"
  },
  {
    "concept_id": "MA-Y1-C007",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y1) with concrete stage requiring physical manipulatives (Interlocking cubes for tower-building, Counters). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Interlocking cubes for tower-building, Counters, Sorting hoops labelled 'more' and 'fewer', Buttons, shells or other small objects"
  },
  {
    "concept_id": "MA-Y1-C008",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y1) with concrete stage requiring physical manipulatives (Ten frames, Double ten frames). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Ten frames, Double ten frames, Two-colour counters (red/yellow), Numicon plates, Interlocking cubes in two colours"
  },
  {
    "concept_id": "MA-Y1-C009",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y1) with concrete stage requiring physical manipulatives (Counters, Interlocking cubes). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Counters, Interlocking cubes, Toy animals or buttons for combining, Small bags or pots for augmenting"
  },
  {
    "concept_id": "MA-Y1-C010",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y1) with concrete stage requiring physical manipulatives (Counters, Interlocking cubes for comparison rows). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Counters, Interlocking cubes for comparison rows, Small objects to remove from a group"
  },
  {
    "concept_id": "MA-Y1-C011",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y1) with concrete stage requiring physical manipulatives (Part-whole trays (three sections), Cups or cloths for covering). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Part-whole trays (three sections), Cups or cloths for covering, Interlocking cubes, Numicon plates showing complements"
  },
  {
    "concept_id": "MA-Y1-C012",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y1) with concrete stage requiring physical manipulatives (Teddies or toy figures for sharing between, Plates or sorting hoops). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Teddies or toy figures for sharing between, Plates or sorting hoops, Counters, cubes, toy animals, Small bags for grouping"
  },
  {
    "concept_id": "MA-Y1-C013",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y1) with concrete stage requiring physical manipulatives (Interlocking cubes, Counters). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Interlocking cubes, Counters, Small mirrors, Plates for splitting into two groups"
  },
  {
    "concept_id": "MA-Y1-C014",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y1) with concrete stage requiring physical manipulatives (Paper circles, squares and rectangles for folding, Playdough). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Paper circles, squares and rectangles for folding, Playdough, Ribbon or string, Plates for sharing between 2"
  },
  {
    "concept_id": "MA-Y1-C015",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y1) with concrete stage requiring physical manipulatives (Paper squares and circles for double-folding, 4 plates or teddies for sharing between). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Paper squares and circles for double-folding, 4 plates or teddies for sharing between, Counters and cubes, Real fruit for quartering (with supervision)"
  },
  {
    "concept_id": "MA-Y1-C016",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y1) with concrete stage requiring physical manipulatives (Interlocking cubes for non-standard measuring, Paperclips). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Interlocking cubes for non-standard measuring, Paperclips, Classroom objects to compare (pencils, books, ribbons), Rulers for introduction to standard units"
  },
  {
    "concept_id": "MA-Y1-C017",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y1) with concrete stage requiring physical manipulatives (Balance scales, Classroom objects of varied size and mass). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Balance scales, Classroom objects of varied size and mass, Cubes or conkers as non-standard weight units"
  },
  {
    "concept_id": "MA-Y1-C018",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y1) with concrete stage requiring physical manipulatives (Water tray or sand tray, Containers of different shapes and sizes). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Water tray or sand tray, Containers of different shapes and sizes, Cups for non-standard measuring, Funnels"
  },
  {
    "concept_id": "MA-Y1-C019",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y1) with concrete stage requiring physical manipulatives (Daily routine picture cards, Geared demonstration clock). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Daily routine picture cards, Geared demonstration clock, Individual clock-face manipulatives, Daily timetable display"
  },
  {
    "concept_id": "MA-Y1-C020",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y1) with concrete stage requiring physical manipulatives (Real UK coins (1p, 2p, 5p, 10p, 20p, 50p, £1, £2), Paper and crayons for coin rubbing). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Real UK coins (1p, 2p, 5p, 10p, 20p, 50p, £1, £2), Paper and crayons for coin rubbing, Sorting trays"
  },
  {
    "concept_id": "MA-Y1-C021",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y1) with concrete stage requiring physical manipulatives (2-D shape tiles (various sizes, orientations, colours), Lolly sticks for building shapes). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: 2-D shape tiles (various sizes, orientations, colours), Lolly sticks for building shapes, Sorting hoops, Shape posting boxes"
  },
  {
    "concept_id": "MA-Y1-C022",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y1) with concrete stage requiring physical manipulatives (Solid 3-D shapes (cube, cuboid, sphere, pyramid, cylinder, cone), Everyday objects for matching (dice, boxes, balls, tins)). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Solid 3-D shapes (cube, cuboid, sphere, pyramid, cylinder, cone), Everyday objects for matching (dice, boxes, balls, tins), Sorting trays for roll/stack/slide"
  },
  {
    "concept_id": "MA-Y1-C023",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y1) with concrete stage requiring physical manipulatives (Programmable floor robots (Beebots), Obstacle course equipment). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Programmable floor robots (Beebots), Obstacle course equipment, Toys and boxes for positional placement, Direction instruction cards"
  },
  {
    "concept_id": "MA-Y1-C024",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y1) with concrete stage requiring physical manipulatives (Space for physical turning, Card arrows on a pivot). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Space for physical turning, Card arrows on a pivot, Turntable with a pointer, Directional compass mat"
  }
]