[
  {
    "concept_id": "MA-Y2-C001",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y2) with concrete stage requiring physical manipulatives (Interlocking cubes for towers of 3, Counters for grouping). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Interlocking cubes for towers of 3, Counters for grouping, 5p and 2p coins for skip counting, Dienes ten-sticks"
  },
  {
    "concept_id": "MA-Y2-C002",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y2) with concrete stage requiring physical manipulatives (Dienes blocks (ten-sticks and unit cubes), Place value mats (T | O columns)). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Dienes blocks (ten-sticks and unit cubes), Place value mats (T | O columns), Straws and elastic bands for bundling, Numicon ten-plates"
  },
  {
    "concept_id": "MA-Y2-C003",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y2) with concrete stage requiring physical manipulatives (Interlocking cubes, Dienes blocks). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Interlocking cubes, Dienes blocks, Comparison mats"
  },
  {
    "concept_id": "MA-Y2-C004",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y2) with concrete stage requiring physical manipulatives (Ten frames, Double ten frames). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Ten frames, Double ten frames, Two-colour counters, Numicon plates, Dienes ten-sticks for deriving facts to 100"
  },
  {
    "concept_id": "MA-Y2-C005",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y2) with concrete stage requiring physical manipulatives (Dienes blocks (ten-sticks and unit cubes), Place value mats). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Dienes blocks (ten-sticks and unit cubes), Place value mats, Numicon plates"
  },
  {
    "concept_id": "MA-Y2-C006",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y2) with concrete stage requiring physical manipulatives (Interlocking cubes in two colours, Counters). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Interlocking cubes in two colours, Counters, Part-whole model trays"
  },
  {
    "concept_id": "MA-Y2-C007",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y2) with concrete stage requiring physical manipulatives (Part-whole model trays, Interlocking cubes). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Part-whole model trays, Interlocking cubes, Bar model frames"
  },
  {
    "concept_id": "MA-Y2-C008",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y2) with concrete stage requiring physical manipulatives (Interlocking cubes for arrays, Counters for grouping). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Interlocking cubes for arrays, Counters for grouping, 2p, 5p and 10p coins, Array trays"
  },
  {
    "concept_id": "MA-Y2-C009",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y2) with concrete stage requiring physical manipulatives (Plates and cubes for equal groups, Array trays with counters). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Plates and cubes for equal groups, Array trays with counters, × and ÷ symbol cards"
  },
  {
    "concept_id": "MA-Y2-C010",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y2) with concrete stage requiring physical manipulatives (Counters for arrays, Array frames or trays). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Counters for arrays, Array frames or trays, Turntable for rotating arrays"
  },
  {
    "concept_id": "MA-Y2-C011",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y2) with concrete stage requiring physical manipulatives (Interlocking cubes, Plates for sharing between 2). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Interlocking cubes, Plates for sharing between 2, Pairing mats"
  },
  {
    "concept_id": "MA-Y2-C012",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y2) with concrete stage requiring physical manipulatives (Counters, Plates or cups for sharing (2, 3 and 4)). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Counters, Plates or cups for sharing (2, 3 and 4), Fraction strips"
  },
  {
    "concept_id": "MA-Y2-C013",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y2) with concrete stage requiring physical manipulatives (Paper strips for folding, Crayons for shading). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Paper strips for folding, Crayons for shading, Fraction tiles (halves and quarters)"
  },
  {
    "concept_id": "MA-Y2-C014",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y2) with concrete stage requiring physical manipulatives (30 cm rulers, Metre sticks). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: 30 cm rulers, Metre sticks, Balance scales with g and kg weights, Thermometers, Measuring jugs (marked in ml and l)"
  },
  {
    "concept_id": "MA-Y2-C015",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y2) with concrete stage requiring physical manipulatives (Real or plastic UK coins and notes, Price tag cards). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Real or plastic UK coins and notes, Price tag cards, Shop role-play resources, Coin sorting trays"
  },
  {
    "concept_id": "MA-Y2-C016",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y2) with concrete stage requiring physical manipulatives (Geared demonstration clock, Individual clock-face manipulatives). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Geared demonstration clock, Individual clock-face manipulatives, 5 times table chart connected to clock positions"
  },
  {
    "concept_id": "MA-Y2-C017",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y2) with concrete stage requiring physical manipulatives (2-D shape tiles (wide variety including irregular shapes), Geoboards and elastic bands). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: 2-D shape tiles (wide variety including irregular shapes), Geoboards and elastic bands, Small mirrors for symmetry checking, Sorting hoops"
  },
  {
    "concept_id": "MA-Y2-C018",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y2) with concrete stage requiring physical manipulatives (Solid 3-D shapes (cube, cuboid, pyramid, prism, cone, cylinder), Stickers for marking counted features). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Solid 3-D shapes (cube, cuboid, pyramid, prism, cone, cylinder), Stickers for marking counted features, Recording tables"
  },
  {
    "concept_id": "MA-Y2-C019",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y2) with concrete stage requiring physical manipulatives (Solid 3-D shapes, Paper and crayons for tracing). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Solid 3-D shapes, Paper and crayons for tracing, Paint for face printing, Sorting trays"
  },
  {
    "concept_id": "MA-Y2-C020",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y2) with concrete stage requiring physical manipulatives (Space for physical movement, Right-angle measurers (card L-shapes)). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Space for physical movement, Right-angle measurers (card L-shapes), Programmable floor robots (Beebots), Direction mats"
  },
  {
    "concept_id": "MA-Y2-C021",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y2) with concrete stage requiring physical manipulatives (Shape tiles in different colours and sizes, Coloured cubes). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Shape tiles in different colours and sizes, Coloured cubes, Pattern beads and strings, Attribute blocks"
  },
  {
    "concept_id": "MA-Y2-C022",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y2) with concrete stage requiring physical manipulatives (Lolly sticks for tallying, Sorting hoops with labels). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Lolly sticks for tallying, Sorting hoops with labels, Picture cards for pictograms, Large paper for display"
  },
  {
    "concept_id": "MA-Y2-C023",
    "primary_mode": "ai_facilitated",
    "primary_mode_id": "DM-AF",
    "confidence": "high",
    "rationale": "Primary maths (Y2) with concrete stage requiring physical manipulatives (Sorted objects in labelled groups, Concrete pictograms (physical picture cards)). AI delivers instruction; facilitator sets up materials.",
    "alternative_modes": [
      "ai_direct"
    ],
    "teaching_requirements": [
      "TR-OBJ",
      "TR-DIG",
      "TR-SPR",
      "TR-PHY"
    ],
    "notes": "Concrete resources: Sorted objects in labelled groups, Concrete pictograms (physical picture cards)"
  }
]