{
  "version": "1.0",
  "subject_group": "Humanities",
  "authored_by": "humanities-agent",
  "authored_date": "2026-02-22",
  "note": "Cluster definitions for History, Geography, Religious Studies and Citizenship across KS1–KS4. Clusters follow action-oriented verb phrase naming adapted for humanities inquiry. Co-teach hints from extraction files inform grouping decisions. Each concept appears in exactly one cluster per domain.",
  "domains": {
    "GE-KS1-D001": {
      "domain_name": "Locational Knowledge",
      "clusters": [
        {
          "cluster_name": "Understand the world's continents, oceans and UK countries",
          "cluster_type": "introduction",
          "thinking_lenses": [
            {
              "lens": "scale_proportion_quantity",
              "rationale": "The cognitive demand here is zooming between scales — from the global (continents, oceans) to the national (UK nations and capitals) — requiring pupils to hold nested spatial relationships in mind and understand that the same world can be described at different levels of granularity."
            },
            {
              "lens": "patterns",
              "rationale": "Recognising where continents and oceans sit relative to one another introduces pattern recognition in spatial distribution, laying the groundwork for later understanding of why populations and climates are distributed as they are."
            }
          ],
          "concept_ids": ["GE-KS1-C001", "GE-KS1-C002"],
          "rationale": "Both concepts establish foundational spatial literacy — the global scale (continents and oceans) and the home-country scale (UK nations and capitals). Taught together they build a nested sense of place: pupils locate the UK within the wider world.",
          "inspired_by": "C3 Framework D2.Geo.2 — identifying locations using mental maps at multiple scales"
        }
      ]
    },
    "GE-KS1-D002": {
      "domain_name": "Place Knowledge",
      "clusters": [
        {
          "cluster_name": "Compare a locality in the UK with a contrasting place abroad",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "patterns",
              "rationale": "Comparison of two contrasting localities asks pupils to notice patterns in how places are organised — what features recur (housing, shops, transport) and what differs — which is fundamentally pattern recognition applied at local geographic scale."
            },
            {
              "lens": "perspective_interpretation",
              "rationale": "Using photographs, maps and first-hand accounts to understand another place asks pupils to interpret evidence through the lens of people whose lived experience differs from their own, introducing the idea that place is understood differently from the inside and outside."
            }
          ],
          "concept_ids": ["GE-KS1-C006"],
          "rationale": "Single concept domain; place study and comparison is the core activity of KS1 place knowledge — pupils observe similarities and differences between two contrasting localities using photographs, maps and first-hand accounts.",
          "inspired_by": "C3 Framework D2.Geo.4 — explaining how culture influences place characteristics"
        }
      ]
    },
    "GE-KS1-D003": {
      "domain_name": "Human and Physical Geography",
      "clusters": [
        {
          "cluster_name": "Describe weather, seasons and the difference between physical and human features",
          "cluster_type": "introduction",
          "thinking_lenses": [
            {
              "lens": "patterns",
              "rationale": "Seasonal weather cycles are the most accessible example of recurring natural patterns that pupils can observe directly; recognising the repeating sequence of seasons is the entry point for understanding cyclical physical processes."
            },
            {
              "lens": "systems_models",
              "rationale": "Distinguishing physical features (rivers, hills, forests) from human features (roads, buildings, farmland) introduces the idea that landscapes are shaped by interacting natural and human systems — a foundational systems-thinking concept for KS1."
            }
          ],
          "concept_ids": ["GE-KS1-C003", "GE-KS1-C004"],
          "rationale": "Weather/climate and the physical/human feature distinction are foundational geographical concepts that KS1 pupils encounter together when observing their local environment. Both deal with how to 'read' the landscape around them.",
          "inspired_by": "NGSS ESS2 — Earth's Systems; distinguishing natural from human-made features"
        }
      ]
    },
    "GE-KS1-D004": {
      "domain_name": "Geographical Skills and Fieldwork",
      "clusters": [
        {
          "cluster_name": "Use maps, atlases and globes to locate and describe places",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "evidence_argument",
              "rationale": "Maps and atlases are geographical evidence tools; using them to answer locational questions requires pupils to interrogate a source, interpret its symbols and conventions, and draw spatial conclusions — the same evidence-to-claim reasoning that underpins geographical argument."
            },
            {
              "lens": "scale_proportion_quantity",
              "rationale": "Moving between atlas pages, globe and large-scale map asks pupils to understand that the same place looks different at different scales, and to reason about the relationship between map representation and real-world distance."
            }
          ],
          "concept_ids": ["GE-KS1-C005"],
          "rationale": "Single concept domain; map, atlas and globe literacy is the core geographical skill at KS1 — pupils learn to use these tools to find and communicate information about places studied in the other domains.",
          "inspired_by": "C3 Framework D2.Geo.1 — constructing maps to represent spatial relationships"
        }
      ]
    },
    "GE-KS2-D001": {
      "domain_name": "Locational Knowledge",
      "clusters": [
        {
          "cluster_name": "Use latitude, longitude and the global grid to locate places",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "scale_proportion_quantity",
              "rationale": "Latitude and longitude are quantitative coordinate systems; the cognitive demand is understanding how degrees of arc translate to position on a sphere and why latitude predicts climate — reasoning about proportion and quantity in a spatial context."
            },
            {
              "lens": "patterns",
              "rationale": "Linking latitude bands to climate zones introduces the idea that global climate patterns are not random but follow predictable spatial regularities tied to distance from the equator and angle of incoming solar radiation."
            }
          ],
          "concept_ids": ["GE-KS2-C001"],
          "rationale": "Single concept domain; latitude and longitude is the defining KS2 locational knowledge skill — pupils build on KS1 atlas use to work with coordinate systems and understand climate patterns linked to latitude.",
          "inspired_by": "C3 Framework D2.Geo.1 — using geographic representations including grid coordinates"
        }
      ]
    },
    "GE-KS2-D002": {
      "domain_name": "Place Knowledge",
      "clusters": [
        {
          "cluster_name": "Compare a region of the UK with a region in Europe or the Americas",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "scale_proportion_quantity",
              "rationale": "Expanding from KS1 locality comparison to regional scale requires pupils to reason about how comparisons change when the unit of analysis grows — what similarities and differences are meaningful at regional rather than local scale."
            },
            {
              "lens": "systems_models",
              "rationale": "Applying the full range of geographical enquiry tools to understand a region means treating that region as a system where physical and human factors interact — climate influences economy, topography shapes settlement, which in turn affects culture."
            }
          ],
          "concept_ids": ["GE-KS2-C006"],
          "rationale": "Single concept domain; regional place study expands KS1 locality comparison to a larger geographical scale — pupils use the full range of geographical enquiry tools to compare human and physical characteristics across continents.",
          "inspired_by": "C3 Framework D2.Geo.5 — explaining how cultural and environmental characteristics differ between places"
        }
      ]
    },
    "GE-KS2-D003": {
      "domain_name": "Human and Physical Geography",
      "clusters": [
        {
          "cluster_name": "Understand climate zones, biomes and the water cycle",
          "cluster_type": "introduction",
          "thinking_lenses": [
            {
              "lens": "systems_models",
              "rationale": "The water cycle is an archetypal system — evaporation, condensation, precipitation and run-off are interconnected processes where a change at one point affects all others; the biome concept similarly treats climate, soils, plants and animals as a functioning ecological system."
            },
            {
              "lens": "patterns",
              "rationale": "Climate zones and biomes are distributed across the globe in recognisable spatial patterns tied to latitude, altitude and ocean currents — recognising these patterns and explaining why they exist is the core cognitive task of this cluster."
            }
          ],
          "concept_ids": ["GE-KS2-C002", "GE-KS2-C003"],
          "rationale": "Climate zones/biomes (C002) and river systems/water cycle (C003) are linked by co-teach hints and share the physical geography thread — both explain how natural systems shape landscapes and are best taught as an interconnected physical world unit before introducing human responses.",
          "inspired_by": "NGSS ESS2.C — The Roles of Water in Earth's Surface Processes"
        },
        {
          "cluster_name": "Investigate settlement patterns and economic geography",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "patterns",
              "rationale": "Settlement and economic geography asks pupils to identify why settlements grew where they did — near rivers, transport routes, resources — which is fundamentally about recognising spatial patterns and explaining what determines them."
            },
            {
              "lens": "cause_and_effect",
              "rationale": "Understanding how physical factors (river crossing, flat land, natural harbour) caused settlements to grow, and how economic activities in turn shaped the settlement's form and function, requires explicit cause-and-effect reasoning across physical and human geography."
            }
          ],
          "concept_ids": ["GE-KS2-C004"],
          "rationale": "Settlement and economic geography (C004) builds on the physical world established in cluster 1 — pupils explore how humans organise themselves in relation to physical features such as rivers, coasts and climate zones, applying understanding of place at multiple scales.",
          "inspired_by": "C3 Framework D2.Geo.7 — explaining how economic decisions affect the sustainable development of places"
        }
      ]
    },
    "GE-KS2-D004": {
      "domain_name": "Geographical Skills and Fieldwork",
      "clusters": [
        {
          "cluster_name": "Use Ordnance Survey maps and grid references to navigate and describe the landscape",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "evidence_argument",
              "rationale": "Interpreting OS map symbols, contours and grid references to describe or navigate a landscape requires treating the map as evidential data and making reasoned spatial arguments about what the landscape must look like based on that evidence."
            },
            {
              "lens": "scale_proportion_quantity",
              "rationale": "Understanding map scale, contour intervals and six-figure grid references involves proportional reasoning — translating distances and heights from map to reality and back — which is the quantitative core of this cluster's cognitive demand."
            }
          ],
          "concept_ids": ["GE-KS2-C005"],
          "rationale": "Single concept domain; OS maps and grid references represent the core KS2 cartographic skill — pupils move from general atlas use to the specialist detail of topographic maps, interpreting contours, symbols and four/six-figure grid references.",
          "inspired_by": "C3 Framework D2.Geo.1 — constructing and interpreting geographic representations"
        }
      ]
    },
    "HI-KS1-D001": {
      "domain_name": "Chronological Understanding",
      "clusters": [
        {
          "cluster_name": "Understand chronology and how things change and stay the same over time",
          "cluster_type": "introduction",
          "thinking_lenses": [
            {
              "lens": "continuity_change",
              "rationale": "This cluster is the foundational introduction to the most central historical thinking concept — pupils build the vocabulary of time and begin to distinguish what has changed from what has persisted within living memory, which is the cognitive essence of continuity_change reasoning."
            },
            {
              "lens": "patterns",
              "rationale": "Sequencing events on timelines and ordering objects by age introduces the idea that the past has structure and patterns — things don't change randomly but follow sequences that can be read and narrated."
            }
          ],
          "concept_ids": ["HI-KS1-C001", "HI-KS1-C002"],
          "rationale": "Time/chronology (C001) and change/continuity (C002) are linked by co-teach hints and form the conceptual bedrock of historical thinking at KS1 — pupils use the vocabulary of time, sequence events on timelines, and begin to notice what has changed and what has stayed the same within living memory.",
          "inspired_by": "C3 Framework D2.His.1 — creating timelines and explaining relationships among events"
        }
      ]
    },
    "HI-KS1-D002": {
      "domain_name": "Historical Content Knowledge",
      "clusters": [
        {
          "cluster_name": "Explore significant individuals and events in local and national history",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "cause_and_effect",
              "rationale": "Studying significant individuals asks pupils to trace the consequences of particular people's actions on events and society — why did this person matter? what changed because of what they did? — which is explicitly causal-chain reasoning applied to historical biography and local/national narrative."
            },
            {
              "lens": "perspective_interpretation",
              "rationale": "Understanding why historical figures are considered significant requires pupils to think about how people in the past saw their world differently from us, and why later generations chose to remember certain individuals, introducing interpretive thinking at KS1."
            }
          ],
          "concept_ids": ["HI-KS1-C003", "HI-KS1-C005"],
          "rationale": "Significant individuals (C003) and local/national history (C005) belong in the same cluster because KS1 content study is organised around notable people whose actions connect to the local community or national story — the two concepts are routinely taught through the same historical episodes (e.g. exploring a local hero alongside national figures).",
          "inspired_by": "C3 Framework D2.His.5 — explaining connections among historical individuals, ideas, and events"
        }
      ]
    },
    "HI-KS1-D003": {
      "domain_name": "Historical Enquiry Skills",
      "clusters": [
        {
          "cluster_name": "Investigate historical sources and ask questions about the past",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "evidence_argument",
              "rationale": "Handling artefacts, photographs and documents and asking what they show is the most direct application of evidence-based reasoning in the primary curriculum — pupils learn that historical knowledge comes from interpreting incomplete, partial sources rather than from received fact."
            },
            {
              "lens": "perspective_interpretation",
              "rationale": "Beginning to recognise that evidence can be biased or incomplete introduces the interpretive dimension — different sources may tell different stories, and pupils must begin to consider who made the source and why, establishing foundations for later source analysis."
            }
          ],
          "concept_ids": ["HI-KS1-C004"],
          "rationale": "Single concept domain; source-based enquiry is the defining historical skill at KS1 — pupils handle artefacts, photographs and documents, ask questions about what they show, and begin to understand that evidence can be incomplete or biased.",
          "inspired_by": "C3 Framework D2.His.9 — comparing information provided by different historical sources"
        }
      ]
    },
    "HI-KS2-D002": {
      "domain_name": "British History",
      "clusters": [
        {
          "cluster_name": "Understand British prehistory and medieval history from Stone Age to Norman Conquest",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "continuity_change",
              "rationale": "The sweep from Stone Age to Norman Conquest is explicitly a study in long-run change and continuity — pupils must trace what shifted (tools, religion, political organisation, language) and what persisted across prehistoric, Roman and Anglo-Saxon periods, building a chronological framework for later study."
            },
            {
              "lens": "cause_and_effect",
              "rationale": "Each successive wave of change (Roman invasion, Anglo-Saxon migration, Viking raids, Norman Conquest) requires pupils to ask what caused it and what consequences followed, practising causal reasoning at an accessible narrative scale."
            }
          ],
          "concept_ids": ["HI-KS2-C005"],
          "rationale": "Single concept domain; the sweep from Stone Age to medieval Britain is the major British history content unit at KS2 — pupils trace change and continuity across prehistoric, Iron Age, Roman, Anglo-Saxon and Viking periods, building a chronological framework for later study.",
          "inspired_by": "C3 Framework D2.His.2 — classifying historical periods into eras and explaining the criteria used"
        }
      ]
    },
    "HI-KS2-D003": {
      "domain_name": "World History",
      "clusters": [
        {
          "cluster_name": "Investigate the achievements and legacies of ancient civilisations",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "systems_models",
              "rationale": "Ancient civilisations are studied as organised societies — pupils examine how early states structured their governance, agriculture, religion and trade as interlocking systems, developing comparative thinking about what makes a civilisation function."
            },
            {
              "lens": "continuity_change",
              "rationale": "Focusing on 'legacies' explicitly asks what from these ancient societies persists into the present (writing systems, legal codes, architectural forms) — a continuity_change frame that gives historical distance meaning for pupils."
            }
          ],
          "concept_ids": ["HI-KS2-C004"],
          "rationale": "Single concept domain; ancient civilisations (Egypt, Sumer, Indus Valley, Shang China) are studied as KS2 world history content — pupils examine how early societies organised themselves and what they left behind, developing comparative thinking across cultures.",
          "inspired_by": "C3 Framework D2.His.2 — explaining how and why historical periods have been constructed"
        }
      ]
    },
    "HI-KS2-D004": {
      "domain_name": "Historical Enquiry and Disciplinary Skills",
      "clusters": [
        {
          "cluster_name": "Analyse causes, consequences and the significance of historical events",
          "cluster_type": "introduction",
          "thinking_lenses": [
            {
              "lens": "cause_and_effect",
              "rationale": "This cluster introduces the second-order concept of causation directly — pupils learn to identify multiple causes, organise them into categories, and trace short and long-term consequences, which is the defining cognitive demand of causal-chain historical reasoning."
            },
            {
              "lens": "evidence_argument",
              "rationale": "Evaluating significance requires pupils to construct and justify a ranked argument about which causes or consequences matter most, using evidence to support their judgement — the move from description to evidenced evaluation is the key disciplinary step introduced here."
            }
          ],
          "concept_ids": ["HI-KS2-C001", "HI-KS2-C002"],
          "rationale": "Cause and consequence (C001) and significance (C002) are linked by co-teach hints — pupils learning to explain why events happened naturally move to evaluating which causes and consequences were most important (significance). These second-order concepts are typically introduced together through a shared historical enquiry question.",
          "inspired_by": "C3 Framework D2.His.3 — explaining why individuals and groups held particular perspectives during historical periods"
        },
        {
          "cluster_name": "Evaluate historical evidence and construct interpretations of the past",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "perspective_interpretation",
              "rationale": "Evaluating the range and limitations of surviving evidence requires pupils to ask who created each source, from what standpoint, and for what purpose — making interpretation of perspective the central cognitive challenge rather than mere information retrieval."
            },
            {
              "lens": "evidence_argument",
              "rationale": "Assessing how reliably we know what happened demands that pupils distinguish between inference and assertion, weigh the evidential value of different source types, and construct arguments about what the available evidence does and does not support."
            }
          ],
          "concept_ids": ["HI-KS2-C003"],
          "rationale": "Historical evidence and interpretation (C003) builds on the causal thinking in cluster 1 — once pupils understand why events happened, they apply source skills to assess how reliably we know what happened, evaluating the range and limitations of surviving evidence.",
          "inspired_by": "C3 Framework D2.His.9 — comparing information provided by different historical sources about the past"
        }
      ]
    },
    "CI-KS34-D001": {
      "domain_name": "Democracy, Parliament and Government (KS3)",
      "clusters": [
        {
          "cluster_name": "Understand how parliamentary democracy and the UK constitution work",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "systems_models",
              "rationale": "Parliamentary democracy is a governance system with interlocking parts — the electorate, the Commons, the Lords, the Executive, the Monarch, the judiciary — and understanding how Parliament operates requires modelling how these elements interact and constrain one another."
            },
            {
              "lens": "stability_change",
              "rationale": "The uncodified UK constitution is notable for having evolved incrementally rather than through revolutionary rupture; understanding it requires pupils to examine how constitutional stability is maintained through convention and precedent while accommodating reform."
            }
          ],
          "concept_ids": ["CI-KS34-C001"],
          "rationale": "Single concept domain; parliamentary democracy and constitutional understanding is the foundational civic knowledge unit at KS3 — pupils examine how Parliament is elected, how government forms and operates, and what the uncodified UK constitution means in practice.",
          "inspired_by": "C3 Framework D2.Civ.1 — describing the powers and limits of the branches of government"
        }
      ]
    },
    "CI-KS34-D002": {
      "domain_name": "Law, Justice and Rights (KS3)",
      "clusters": [
        {
          "cluster_name": "Understand rights, liberties and the rule of law in democratic society",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "systems_models",
              "rationale": "The rule of law operates as a system of mutual constraints — rights create duties, the judiciary enforces limits on government, and Parliament passes laws within constitutional boundaries; pupils must model how these elements interact to protect and potentially threaten liberty."
            },
            {
              "lens": "perspective_interpretation",
              "rationale": "Rights claims often involve competing perspectives — individual freedom versus collective safety, civil liberties versus national security — and pupils need to evaluate these tensions from multiple standpoints to understand why rights frameworks are contested."
            }
          ],
          "concept_ids": ["CI-KS34-C002"],
          "rationale": "Single concept domain; rights and the rule of law is the core justice and liberty unit at KS3 — pupils examine the legal framework protecting individual freedoms, the role of the judiciary, and the relationship between rights and responsibilities.",
          "inspired_by": "C3 Framework D2.Civ.2 — explaining how the rule of law applies to individuals and groups"
        }
      ]
    },
    "CI-KS34-D003": {
      "domain_name": "Community, Identity and Participation (KS3 and KS4)",
      "clusters": [
        {
          "cluster_name": "Explore identity, diversity and mutual respect in British society",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "perspective_interpretation",
              "rationale": "Understanding how national, regional, ethnic and religious identities coexist requires pupils to take the perspective of communities whose experience of British society differs from their own, and to interpret 'shared values' as contested constructions rather than fixed givens."
            },
            {
              "lens": "systems_models",
              "rationale": "Social cohesion depends on the interaction of legal frameworks (equality law), civic institutions, cultural practices and shared norms; treating British society as a system helps pupils see how diversity and unity are maintained simultaneously through these intersecting mechanisms."
            }
          ],
          "concept_ids": ["CI-KS34-C004"],
          "rationale": "Single concept domain; identity and diversity is the community cohesion unit spanning KS3/KS4 — pupils examine how national, regional, ethnic and religious identities coexist, and how mutual respect and shared values underpin civic life.",
          "inspired_by": "C3 Framework D2.Civ.10 — explaining how people work together to advocate for changes to laws or government policies"
        }
      ]
    },
    "CI-KS34-D004": {
      "domain_name": "Constitutional Democracy, Human Rights and International Relations (KS4)",
      "clusters": [
        {
          "cluster_name": "Analyse democracy, elections and comparative political systems",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "systems_models",
              "rationale": "Comparing electoral systems (FPTP, proportional representation, AV) and different types of democracy requires pupils to model how the rules of a political system generate different outcomes — the same voter preferences produce different results under different systems, illustrating systemic logic."
            },
            {
              "lens": "perspective_interpretation",
              "rationale": "Human rights frameworks are interpreted differently across states and cultures; evaluating them comparatively requires pupils to understand that democratic values are applied and contested from different national and political standpoints, not simply universal absolutes."
            }
          ],
          "concept_ids": ["CI-KS34-C003"],
          "rationale": "Single concept domain; comparative democracy is the KS4 extension of constitutional understanding — pupils evaluate different electoral systems, compare democracies internationally, and consider how human rights frameworks shape global relations.",
          "inspired_by": "C3 Framework D2.Civ.1 — explaining how governments of different types achieve their purposes"
        }
      ]
    },
    "CI-KS34-D005": {
      "domain_name": "Personal Finance and Economic Understanding",
      "clusters": [
        {
          "cluster_name": "Evaluate personal financial decisions and understand economic systems",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "systems_models",
              "rationale": "Individual financial decisions (saving, borrowing, spending) connect to the wider economic system through taxation, public spending and interest rates; pupils must trace how personal choices aggregate into macroeconomic patterns and how economic conditions in turn shape individual options."
            },
            {
              "lens": "cause_and_effect",
              "rationale": "The practical focus on evaluating financial decisions is explicitly causal — what are the consequences of taking on credit, of not saving for retirement, of different tax policies? — requiring pupils to reason about short and long-term consequences of economic choices."
            }
          ],
          "concept_ids": ["CI-KS34-C005"],
          "rationale": "Single concept domain; personal financial management is the economic literacy unit at KS3/KS4 — pupils develop skills to manage income, credit and savings, understand taxation and public spending, and consider how individual financial choices connect to wider economic conditions.",
          "inspired_by": "C3 Framework D2.Eco.1 — explaining how economic decisions affect the well-being of individuals, businesses, and society"
        }
      ]
    },
    "CI-KS34-D006": {
      "domain_name": "Citizenship Skills: Critical Analysis and Democratic Participation",
      "clusters": [
        {
          "cluster_name": "Practise active citizenship and democratic participation in the community",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "evidence_argument",
              "rationale": "Active citizenship skills — researching issues, forming reasoned arguments, campaigning — are applied forms of evidence-to-argument reasoning; pupils must gather evidence on an issue, evaluate its reliability, and construct a persuasive case for action."
            },
            {
              "lens": "perspective_interpretation",
              "rationale": "Civic engagement requires understanding that democratic issues are contested — different groups hold different values and interests — and effective participation means engaging with opposing perspectives rather than simply asserting one's own position."
            }
          ],
          "concept_ids": ["CI-KS34-C006"],
          "rationale": "Single concept domain; active citizenship is the applied skills unit — pupils learn to research issues, form reasoned arguments, campaign, vote and engage with local and national democratic processes, translating knowledge from other domains into civic action.",
          "inspired_by": "C3 Framework D2.Civ.7 — applying civic virtues when working with others"
        }
      ]
    },
    "GE-KS3-D001": {
      "domain_name": "Locational Knowledge",
      "clusters": [
        {
          "cluster_name": "Develop detailed locational knowledge of Africa, Asia and the Middle East",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "patterns",
              "rationale": "Building fluent locational knowledge of major world regions involves recognising the spatial patterns of political boundaries, physical features and population distribution — not just memorising names but understanding why countries, cities and landscapes are distributed as they are."
            },
            {
              "lens": "scale_proportion_quantity",
              "rationale": "These are vast and internally diverse regions; developing working knowledge requires pupils to reason across scales — from continental patterns to sub-regional variation — and to hold quantitative proportions (relative sizes, distances, populations) in mind."
            }
          ],
          "concept_ids": ["GE-KS3-C005"],
          "rationale": "Single concept domain; extending locational knowledge to Africa, Asia and the Middle East is the KS3 focus — building on KS2 European/Americas knowledge, pupils develop a fluent working knowledge of these major world regions including their physical and political geography.",
          "inspired_by": "C3 Framework D2.Geo.2 — using geographic representations to explain relationships between places"
        }
      ]
    },
    "GE-KS3-D002": {
      "domain_name": "Place Knowledge",
      "clusters": [
        {
          "cluster_name": "Investigate a region of Africa or Asia through in-depth place study",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "systems_models",
              "rationale": "Producing a 'rounded analysis' of how physical and human factors interact in an African or Asian region requires treating the place as a system — climate shapes agriculture, topography affects trade routes, historical context influences political structures — where no single factor can be understood in isolation."
            },
            {
              "lens": "perspective_interpretation",
              "rationale": "In-depth place study requires pupils to move beyond outsider description to engage with how inhabitants and insiders understand their own region, including how Western geographical framings can misrepresent places through stereotyping or selective emphasis."
            }
          ],
          "concept_ids": ["GE-KS3-C006"],
          "rationale": "Single concept domain; place depth study at KS3 requires nuanced, multi-layered understanding of a specific African or Asian region — pupils apply all geographical concepts and skills to produce a rounded analysis that goes beyond surface description to explain how physical and human factors interact.",
          "inspired_by": "C3 Framework D2.Geo.4 — explaining how cultural and environmental characteristics affect the distribution and movement of people"
        }
      ]
    },
    "GE-KS3-D003": {
      "domain_name": "Human and Physical Geography",
      "clusters": [
        {
          "cluster_name": "Investigate plate tectonics and its role in shaping landscapes and hazards",
          "cluster_type": "introduction",
          "thinking_lenses": [
            {
              "lens": "systems_models",
              "rationale": "Plate tectonics is an Earth system process — the movement of tectonic plates drives volcanic activity, earthquakes, mountain building and ocean formation through interlocking physical mechanisms operating over geological time, requiring pupils to model a large-scale physical system."
            },
            {
              "lens": "stability_change",
              "rationale": "The tectonic framework explains both the stability of plate interiors and the instability at plate boundaries where hazards occur; pupils must understand why some regions are geologically stable while others experience frequent catastrophic change."
            }
          ],
          "concept_ids": ["GE-KS3-C001"],
          "rationale": "Plate tectonics (C001) is the gateway physical geography concept at KS3 — it is co-taught with development and population (C002, C004) but forms a distinct physical science cluster. Teaching it first gives pupils the physical framework before they explore human responses to geological hazards.",
          "inspired_by": "NGSS ESS2.B — Plate Tectonics and Large-Scale System Interactions"
        },
        {
          "cluster_name": "Analyse global development, inequality, population and urbanisation",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "cause_and_effect",
              "rationale": "This cluster asks why inequalities persist and why populations urbanise — both require multi-factor causal reasoning about how historical, economic, environmental and political forces combine to produce the development gap and patterns of rural-urban migration."
            },
            {
              "lens": "systems_models",
              "rationale": "Development, population growth and urbanisation are interdependent — economic growth drives urbanisation which changes demographic structure which affects development indicators — requiring pupils to map the feedback loops within the human geography system."
            }
          ],
          "concept_ids": ["GE-KS3-C002", "GE-KS3-C004"],
          "rationale": "Global development/inequality (C002) and population/urbanisation/migration (C004) share co-teach hints with each other and with plate tectonics — they form a coherent human geography cluster examining how economic and demographic forces shape where and how people live, and why inequalities persist.",
          "inspired_by": "C3 Framework D2.Geo.7 — explaining how economic decisions affect sustainable development"
        },
        {
          "cluster_name": "Evaluate the causes and consequences of climate change and environmental geography",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "stability_change",
              "rationale": "Climate change is the paradigm case of human-induced destabilisation of a previously stable Earth system; evaluating its causes, unequal impacts and the adequacy of human responses requires pupils to reason about tipping points, feedback loops and the difference between natural variability and anthropogenic forcing."
            },
            {
              "lens": "cause_and_effect",
              "rationale": "The cluster explicitly requires pupils to examine causes (greenhouse gas emissions) and trace consequences (rising temperatures, extreme weather, sea-level rise, ecosystem disruption) while also evaluating whether human responses are sufficient to break the causal chain."
            }
          ],
          "concept_ids": ["GE-KS3-C003"],
          "rationale": "Climate change and environmental geography (C003) is co-taught with development (C002) but stands as a distinct evaluative cluster — pupils examine the science of climate change, its unequal impacts, and the range of human responses, applying critical geographical thinking about sustainability and justice.",
          "inspired_by": "NGSS ESS3.D — Global Climate Change; C3 Framework D2.Geo.9 — evaluate the influence of long- or short-term climate variability"
        }
      ]
    },
    "GE-KS3-D004": {
      "domain_name": "Geographical Skills and Fieldwork",
      "clusters": [
        {
          "cluster_name": "Use GIS, maps and fieldwork methods to collect and communicate geographical data",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "evidence_argument",
              "rationale": "Designing a fieldwork enquiry, collecting primary data, and processing and presenting findings to answer a geographical question is a complete evidence-to-argument cycle — pupils must ensure their data collection methods generate reliable evidence and then construct geographical arguments from it."
            },
            {
              "lens": "patterns",
              "rationale": "Statistical and cartographic techniques are used to reveal spatial and temporal patterns in geographical data; the purpose of GIS and fieldwork data processing is precisely to make patterns visible that would otherwise be obscured in raw observations."
            }
          ],
          "concept_ids": ["GE-KS3-C007"],
          "rationale": "Single concept domain; GIS, maps and fieldwork at KS3 represent a significant step up in technical skill — pupils learn to design and conduct fieldwork enquiries, use digital mapping tools, and process and present geographical data using statistical and cartographic techniques.",
          "inspired_by": "C3 Framework D2.Geo.1 — constructing maps and other representations to explain geographic patterns"
        }
      ]
    },
    "GE-KS4-D001": {
      "domain_name": "Physical Geography: Hazards and Natural Processes",
      "clusters": [
        {
          "cluster_name": "Investigate tectonic hazards, their causes, impacts and management",
          "cluster_type": "introduction",
          "thinking_lenses": [
            {
              "lens": "cause_and_effect",
              "rationale": "Tectonic hazards analysis requires pupils to trace the causal chain from plate boundary type through earthquake or eruption mechanism to primary and secondary impacts, then evaluate whether management strategies can interrupt the chain — cause-and-effect reasoning is the explicit cognitive demand."
            },
            {
              "lens": "systems_models",
              "rationale": "Comparing management strategies in contrasting global contexts requires pupils to model how socioeconomic systems interact with physical hazard risk — why the same magnitude earthquake kills thousands in one country and hundreds in another depends on system-level factors like building codes, emergency response and land use."
            }
          ],
          "concept_ids": ["GE-KS4-C001"],
          "rationale": "Tectonic hazards (C001) is the opening physical hazards cluster — pupils build on KS3 plate tectonics to examine earthquakes and volcanic eruptions in depth, applying hazard risk frameworks and comparing management strategies in contrasting global contexts.",
          "inspired_by": "NGSS ESS2.B — Plate Tectonics and Large-Scale System Interactions; ESS3.B — Natural Hazards"
        },
        {
          "cluster_name": "Analyse tropical storms, extreme weather and the role of climate change",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "stability_change",
              "rationale": "Understanding tropical storms as a consequence of a changing climate requires pupils to reason about how a destabilised climate system produces more extreme and more frequent weather events — the core question is how increasing atmospheric energy changes the frequency and intensity distribution of hazards."
            },
            {
              "lens": "cause_and_effect",
              "rationale": "Evaluating human adaptation strategies requires tracing whether interventions (early warning systems, flood barriers, building codes) effectively break the causal chain between storm formation and human casualties or economic loss."
            }
          ],
          "concept_ids": ["GE-KS4-C011", "GE-KS4-C002"],
          "rationale": "Tropical storms (C011) and climate change (C002) are linked by co-teach hints — extreme weather events are understood as a consequence of a changing climate. Teaching them together allows pupils to apply the science of climate change to real hazard examples and evaluate human adaptation strategies.",
          "inspired_by": "NGSS ESS3.B — Natural Hazards; ESS3.D — Global Climate Change"
        },
        {
          "cluster_name": "Describe and explain tropical rainforest and hot desert ecosystems",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "systems_models",
              "rationale": "Ecosystems are the classic systems model in geography — climate, soils, vegetation and fauna interact through nutrient cycling, energy flow and trophic relationships; understanding how the rainforest or desert works requires pupils to trace these interdependencies and explain why disruption of one element affects the whole."
            },
            {
              "lens": "stability_change",
              "rationale": "Evaluating human threats and management responses requires pupils to reason about ecosystem resilience — how much disturbance can the system absorb before it shifts to a degraded state — and whether deforestation or desertification represents reversible or irreversible change."
            }
          ],
          "concept_ids": ["GE-KS4-C015"],
          "rationale": "Tropical rainforest and hot desert ecosystems (C015) form a coherent biome study cluster — pupils examine how climate, soils, plants and animals interact to create distinct ecosystem structures, and evaluate the human threats to these environments and management responses.",
          "inspired_by": "NGSS LS2.C — Ecosystem Dynamics, Functioning, and Resilience"
        }
      ]
    },
    "GE-KS4-D002": {
      "domain_name": "Physical Geography: Landscapes and Systems",
      "clusters": [
        {
          "cluster_name": "Describe river processes and landforms and examine flood management",
          "cluster_type": "introduction",
          "thinking_lenses": [
            {
              "lens": "systems_models",
              "rationale": "The river drainage basin is a physical system — precipitation, infiltration, run-off, erosion, transportation and deposition are interdependent processes forming a cascade; pupils must model how changes upstream or in land use propagate through the whole system to affect flood risk downstream."
            },
            {
              "lens": "cause_and_effect",
              "rationale": "Examining flood management strategies requires tracing how both physical causes (high rainfall, impermeable rock) and human causes (urbanisation, deforestation) combine to increase flood risk, and evaluating whether hard or soft engineering responses address root causes or merely symptoms."
            }
          ],
          "concept_ids": ["GE-KS4-C003"],
          "rationale": "River landscapes and processes (C003) is the first landscape systems cluster — pupils systematically examine erosion, transportation and deposition processes, the formation of river landforms, and strategies for managing the flood risk to human settlements.",
          "inspired_by": "NGSS ESS2.C — The Roles of Water in Earth's Surface Processes"
        },
        {
          "cluster_name": "Examine coastal processes, landforms and strategies for coastal management",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "systems_models",
              "rationale": "The coastal system — wave energy, sediment cells, longshore drift, cliff recession and deposition — operates as a sediment budget where intervention at one point (a groyne, a sea wall) affects the entire cell, requiring pupils to model how management choices create unintended consequences elsewhere."
            },
            {
              "lens": "stability_change",
              "rationale": "Evaluating hard versus soft engineering approaches requires pupils to reason about whether coastal defence maintains the shoreline in a fixed state (stability) or works with natural processes (managed retreat, beach nourishment) to allow dynamic equilibrium — a fundamentally different philosophical relationship with landscape change."
            }
          ],
          "concept_ids": ["GE-KS4-C004"],
          "rationale": "Coastal processes and management (C004) parallels river landscapes — pupils apply the same geomorphological framework to coastal environments, examining wave action, longshore drift and the landforms they create, then evaluating hard and soft engineering management approaches.",
          "inspired_by": "NGSS ESS2.C — The Roles of Water in Earth's Surface Processes; ESS3.B — Natural Hazards"
        }
      ]
    },
    "GE-KS4-D003": {
      "domain_name": "Human Geography: Urban Issues and Challenges",
      "clusters": [
        {
          "cluster_name": "Investigate urbanisation, slum growth and challenges in cities of the developing world",
          "cluster_type": "introduction",
          "thinking_lenses": [
            {
              "lens": "cause_and_effect",
              "rationale": "Explaining rapid urban growth in lower-income countries requires pupils to trace the push-pull causal chain from rural poverty and environmental stress through migration decisions to the social, economic and environmental consequences of informal settlement growth."
            },
            {
              "lens": "systems_models",
              "rationale": "Urban challenges (housing, sanitation, employment, crime) in rapidly growing cities are interconnected — inadequate infrastructure constrains economic productivity, which limits tax revenue, which prevents infrastructure investment — and pupils must model these feedback loops to evaluate whether interventions address root causes."
            }
          ],
          "concept_ids": ["GE-KS4-C005"],
          "rationale": "Urbanisation and slum development (C005) provides the problem-focused entry into urban geography — pupils examine the push-pull drivers of rural-urban migration and the social, economic and environmental challenges created by rapid urban growth in lower-income countries.",
          "inspired_by": "C3 Framework D2.Geo.7 — explaining how economic decisions affect sustainable development of places"
        },
        {
          "cluster_name": "Evaluate sustainable urban development strategies in UK and global cities",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "stability_change",
              "rationale": "Urban sustainability is fundamentally about managing change — evaluating whether regeneration strategies, transport investment and planning policies can transition cities from unsustainable to sustainable trajectories requires reasoning about what kind of change is desirable and whether it is durable."
            },
            {
              "lens": "evidence_argument",
              "rationale": "Assessing the social, economic and environmental sustainability of different urban development strategies requires pupils to gather case study evidence, apply evaluation criteria, and construct a supported argument about which approaches are most effective — a rigorous evidence-to-judgement task."
            }
          ],
          "concept_ids": ["GE-KS4-C013"],
          "rationale": "Sustainable urban development (C013) builds directly on the urbanisation problems in cluster 1 — pupils evaluate a range of regeneration, transport and planning strategies in UK cities and global case studies, assessing their social, economic and environmental sustainability.",
          "inspired_by": "C3 Framework D2.Geo.9 — evaluating the influence of human decisions on resource and environment management"
        }
      ]
    },
    "GE-KS4-D004": {
      "domain_name": "Human Geography: Economic Development and Global Inequality",
      "clusters": [
        {
          "cluster_name": "Investigate the development gap and the causes of global inequality",
          "cluster_type": "introduction",
          "thinking_lenses": [
            {
              "lens": "cause_and_effect",
              "rationale": "The development gap unit is explicitly causal — pupils must identify and evaluate multiple interacting causes of global inequality (colonialism, trade rules, geography, governance, conflict) and assess whether these causes are being addressed by current aid, trade and debt relief strategies."
            },
            {
              "lens": "scale_proportion_quantity",
              "rationale": "Development indicators (HDI, GNI per capita, infant mortality) require pupils to reason about what quantitative measures do and don't capture, how they aggregate to mask internal variation, and how different scales of analysis (global, regional, national) tell different stories about the same inequality."
            }
          ],
          "concept_ids": ["GE-KS4-C006"],
          "rationale": "The development gap (C006) is the conceptual entry point — pupils examine the measures and causes of global inequality, analyse why the gap exists and has grown, and evaluate the effectiveness of strategies such as aid, trade and debt relief in reducing it.",
          "inspired_by": "C3 Framework D2.Eco.15 — explaining how trade policies influence economic development"
        },
        {
          "cluster_name": "Evaluate transnational corporations and the impacts of economic globalisation",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "systems_models",
              "rationale": "TNCs operate as global economic systems linking raw material extraction, manufacturing, distribution and consumption across multiple countries; pupils must model how value is generated and distributed along these supply chains to understand why some countries benefit more than others from the same globalisation process."
            },
            {
              "lens": "perspective_interpretation",
              "rationale": "Evaluating TNCs requires pupils to interpret the same corporation's activities from multiple standpoints — host-country workers, shareholders, local communities, environmental regulators, consuming-country consumers — each of whom has a different interest in and experience of globalisation."
            }
          ],
          "concept_ids": ["GE-KS4-C012"],
          "rationale": "TNCs and economic globalisation (C012) is the applied second cluster — pupils study how global corporations drive development and inequality simultaneously, evaluating positive and negative impacts on host countries, workers and the environment, and debating the role of regulation.",
          "inspired_by": "C3 Framework D2.Eco.15 — explaining the influence of trade on economic development"
        }
      ]
    },
    "GE-KS4-D005": {
      "domain_name": "Resource Management and Sustainability",
      "clusters": [
        {
          "cluster_name": "Analyse global water insecurity and evaluate water management strategies",
          "cluster_type": "introduction",
          "thinking_lenses": [
            {
              "lens": "systems_models",
              "rationale": "Water insecurity arises where demand exceeds supply within a physical hydrological system constrained by climate, geology and land use; management strategies (dams, transfers, conservation) intervene in this system and pupils must evaluate their effectiveness and unintended environmental and social consequences."
            },
            {
              "lens": "scale_proportion_quantity",
              "rationale": "Mapping global patterns of water supply and demand requires reasoning about spatial and quantitative mismatches — where rainfall is abundant relative to population and where it is scarce — and understanding how scale (local aquifer to transboundary river basin) determines the appropriate management response."
            }
          ],
          "concept_ids": ["GE-KS4-C007"],
          "rationale": "Water insecurity (C007) opens resource management — pupils map global patterns of water supply and demand, examine the human and physical causes of water stress, and evaluate management strategies (dams, transfers, conservation) and their environmental and social impacts.",
          "inspired_by": "NGSS ESS3.A — Natural Resources; C3 Framework D2.Geo.9"
        },
        {
          "cluster_name": "Evaluate energy security and the transition to a sustainable energy mix",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "stability_change",
              "rationale": "The energy transition is explicitly a question of managed change — moving from a fossil-fuel-dependent system to a renewable one — and pupils must evaluate whether different transition strategies (rapid decarbonisation, phased replacement, carbon capture) represent achievable paths to a stable low-carbon energy system."
            },
            {
              "lens": "cause_and_effect",
              "rationale": "Evaluating the economic and environmental case for renewable energy requires tracing the consequences of continuing fossil fuel dependence (climate change, geopolitical instability, resource depletion) and the consequences of rapid transition (grid reliability, economic disruption, material supply chains for turbines and panels)."
            }
          ],
          "concept_ids": ["GE-KS4-C014"],
          "rationale": "Energy security and the changing energy mix (C014) mirrors the water insecurity framework — pupils examine global energy demand patterns, the geopolitics of fossil fuel dependence, and evaluate the economic and environmental case for renewable energy transition.",
          "inspired_by": "NGSS ESS3.A — Natural Resources; ESS3.D — Global Climate Change"
        }
      ]
    },
    "GE-KS4-D006": {
      "domain_name": "Geographical Skills, Fieldwork, and Enquiry",
      "clusters": [
        {
          "cluster_name": "Plan and conduct geographical fieldwork enquiry and present findings",
          "cluster_type": "introduction",
          "thinking_lenses": [
            {
              "lens": "evidence_argument",
              "rationale": "Fieldwork is the complete evidence-to-argument cycle in geography — pupils formulate a hypothesis, design data collection methods, gather primary evidence, and construct a conclusion that the evidence does or does not support; evaluating the reliability of their methods is central to the cognitive demand."
            },
            {
              "lens": "patterns",
              "rationale": "Fieldwork enquiry is typically organised around detecting and explaining spatial or temporal patterns in a local environment (vegetation along a transect, pedestrian counts in a town centre, pebble size down a beach); identifying whether patterns are present and what processes explain them is the core investigative task."
            }
          ],
          "concept_ids": ["GE-KS4-C008"],
          "rationale": "Fieldwork enquiry (C008) is the applied skills entry point — pupils design a full enquiry from hypothesis to conclusion, collecting primary data in the field and evaluating the reliability of their methods. This underpins the independent investigation component of GCSE assessment.",
          "inspired_by": "NGSS Science and Engineering Practice 3 — Planning and Carrying Out Investigations"
        },
        {
          "cluster_name": "Use maps, GIS and statistical techniques to interpret geographical data",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "patterns",
              "rationale": "Statistical and cartographic analysis techniques are tools for making patterns in geographical data visible — choropleth maps reveal spatial clustering, scatter graphs expose correlations, and measures of central tendency and dispersion describe distribution shapes; the cognitive purpose of all these techniques is pattern detection and description."
            },
            {
              "lens": "evidence_argument",
              "rationale": "Applying quantitative and spatial analysis to exam-based and fieldwork data requires pupils to move from processed data to geographical argument — selecting the right technique, interpreting the output correctly, and using it to support or challenge a geographical claim."
            }
          ],
          "concept_ids": ["GE-KS4-C009", "GE-KS4-C010"],
          "rationale": "Cartographic/map skills (C009) and statistical skills (C010) are the complementary technical skills cluster — pupils apply a range of quantitative and spatial analysis techniques to exam-based and fieldwork data, integrating mapwork and data interpretation in geographical argument.",
          "inspired_by": "C3 Framework D2.Geo.1 — constructing and interpreting multiple geographic representations"
        }
      ]
    },
    "HI-KS3-D001": {
      "domain_name": "British History from 1066 to Present",
      "clusters": [
        {
          "cluster_name": "Analyse the transformation of political power from monarchy to parliamentary democracy",
          "cluster_type": "introduction",
          "thinking_lenses": [
            {
              "lens": "continuity_change",
              "rationale": "The eight-century arc from Norman kingship to modern democracy is an extended continuity_change analysis — pupils must identify the moments of genuine constitutional rupture (Magna Carta, Civil War, Reform Acts) and distinguish them from periods of apparent stability where underlying power relations were shifting incrementally."
            },
            {
              "lens": "cause_and_effect",
              "rationale": "Each constitutional turning point (the English Civil War, the Glorious Revolution, the Great Reform Act) requires pupils to explain what caused power to shift, which actors drove change, and what the long-run consequences were for the distribution of political authority."
            }
          ],
          "concept_ids": ["HI-KS3-C001"],
          "rationale": "Power, monarchy and democracy (C001) opens British history at KS3 — pupils trace the long-run story of political change from Norman kingship through Magna Carta, Civil War, and the Reform Acts to modern democracy, examining change and continuity across eight centuries.",
          "inspired_by": "C3 Framework D2.His.1 — analysing change and continuity within and across periods of history"
        },
        {
          "cluster_name": "Examine the British Empire, colonialism and its enduring consequences",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "cause_and_effect",
              "rationale": "Examining the causes of imperial expansion, the mechanisms of colonial control, and the long-term consequences — economic, cultural, demographic, linguistic — for both colonised peoples and Britain itself requires sustained multi-strand causal-chain reasoning that connects past actions to present realities."
            },
            {
              "lens": "perspective_interpretation",
              "rationale": "Colonial history is inherently a story told from multiple, often incompatible perspectives — colonisers justified empire through civilisational narratives while colonised peoples experienced it as dispossession and violence; pupils must engage with these competing interpretations to understand how the same events have been understood so differently."
            }
          ],
          "concept_ids": ["HI-KS3-C002"],
          "rationale": "Empire, colonialism and its consequences (C002) is co-taught with power and democracy (C001) — imperial expansion is inseparable from British political history and its legacy shapes modern society. Pupils examine causes, justifications, resistance and long-term consequences including migration, culture and contemporary inequalities.",
          "inspired_by": "C3 Framework D2.His.5 — explaining connections among historical individuals, ideas, and events across geographic contexts"
        }
      ]
    },
    "HI-KS3-D002": {
      "domain_name": "World and Non-European History",
      "clusters": [
        {
          "cluster_name": "Understand the Holocaust: causes, events and moral responsibilities",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "cause_and_effect",
              "rationale": "The Holocaust requires pupils to trace a causal sequence from the conditions that enabled Nazi ideology to take hold, through the escalating persecution, to systematic genocide — and to evaluate the role of individual choices, institutional failures and international inaction in enabling each step."
            },
            {
              "lens": "perspective_interpretation",
              "rationale": "Examining moral responsibility requires pupils to engage with the perspectives of perpetrators, bystanders, resisters and victims — not to relativise these positions but to understand how ordinary people came to participate in or acquiesce to atrocity, and what this means for contemporary ethical responsibilities."
            }
          ],
          "concept_ids": ["HI-KS3-C003"],
          "rationale": "Single concept domain; the Holocaust is the mandatory world history unit at KS3 — pupils examine the systematic persecution and genocide of Jewish people and others, placing it in the context of Nazi ideology and the failure of international response, drawing out lessons about prejudice, complicity and moral responsibility.",
          "inspired_by": "C3 Framework D2.His.5 — explaining multiple causes of historical events using sourced evidence"
        }
      ]
    },
    "HI-KS3-D003": {
      "domain_name": "Historical Thinking and Disciplinary Skills",
      "clusters": [
        {
          "cluster_name": "Construct evidence-based historical arguments using disciplinary concepts",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "evidence_argument",
              "rationale": "Constructing extended written responses that use second-order concepts to answer historical questions with a structured, evidenced thesis is the most direct application of evidence_argument reasoning in the curriculum — pupils must move from source handling to analytical claim-making in a sustained piece of writing."
            },
            {
              "lens": "perspective_interpretation",
              "rationale": "Using second-order concepts like significance and interpretations in an argument requires pupils to acknowledge that historical judgements are contestable — different historians prioritise different evidence and reach different conclusions, and a strong argument must engage with and rebut alternative interpretations."
            }
          ],
          "concept_ids": ["HI-KS3-C004"],
          "rationale": "Single concept domain; constructing historical arguments is the signature KS3 disciplinary skill — pupils develop extended written responses that use second-order concepts (causation, significance, change) to answer historical questions with a structured, evidenced thesis.",
          "inspired_by": "C3 Framework D3.His.1 — gather relevant information from multiple sources while taking into account the origin, authority, structure, context, and corroborative value of the sources"
        }
      ]
    },
    "HI-KS4-D001": {
      "domain_name": "Thematic Studies",
      "clusters": [
        {
          "cluster_name": "Investigate crime and punishment in Britain across time",
          "cluster_type": "introduction",
          "thinking_lenses": [
            {
              "lens": "continuity_change",
              "rationale": "Crime and punishment is a thematic study explicitly designed to train continuity_change analysis — pupils must identify which types of crime, which punishments, and which underlying attitudes have persisted across centuries versus changed dramatically, which requires systematic comparison across multiple time periods."
            },
            {
              "lens": "cause_and_effect",
              "rationale": "Explaining why punishments changed (from public execution to rehabilitation) requires tracing the causal roles of Enlightenment philosophy, industrialisation, changing state capacity and shifting public attitudes — multi-factor causal reasoning applied across a long timespan."
            }
          ],
          "concept_ids": ["HI-KS4-C007"],
          "rationale": "Crime and punishment (C007) is typically taught as the entry thematic study — its long chronological sweep from medieval to modern Britain gives pupils practice in the thematic study methodology: identifying patterns of change and continuity across centuries rather than within a single period.",
          "inspired_by": "C3 Framework D2.His.1 — analysing change and continuity within and across periods of history"
        },
        {
          "cluster_name": "Examine the history of medicine, public health and scientific knowledge in Britain",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "continuity_change",
              "rationale": "Medicine in Britain traces the thematic history of how understanding of disease and treatment has changed — from miasma theory to germ theory to genetics — while certain continuities persist (the role of chance, the conservatism of medical establishments), requiring the same long-run comparative analysis as crime and punishment."
            },
            {
              "lens": "cause_and_effect",
              "rationale": "Evaluating the roles of individuals (Pasteur, Fleming, Jenner), science (microscopy, DNA), government (public health legislation, NHS) and war (surgical advances) in driving medical progress requires attributing causal weight across competing explanatory factors — a classic GCSE analytical task."
            }
          ],
          "concept_ids": ["HI-KS4-C008"],
          "rationale": "Medicine in Britain (C008) applies the same thematic study framework to a different domain — pupils trace changing understanding of disease causation, treatments and public health from the medieval period to the present, evaluating the roles of individuals, science, government and war.",
          "inspired_by": "C3 Framework D2.His.3 — explaining why individuals and groups held particular perspectives"
        },
        {
          "cluster_name": "Analyse the history of migration to and from Britain from the medieval period to today",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "continuity_change",
              "rationale": "Migration in Britain as a thematic study requires pupils to identify what has changed (scale, origins, policy) and what has remained constant (economic motivations, patterns of reception, contribution to host society) across more than a millennium — the cognitive demand is the same long-run comparative analysis that defines thematic study."
            },
            {
              "lens": "perspective_interpretation",
              "rationale": "The history of migration is inherently a story of multiple perspectives — migrants' motivations and experiences, receiving communities' reactions, political and media representations — and connecting historical patterns to contemporary debates requires pupils to read present-day discourse critically through a historical lens."
            }
          ],
          "concept_ids": ["HI-KS4-C015"],
          "rationale": "Migrants in Britain (C015) is the third thematic option — pupils trace migration across more than a millennium, examining push-pull factors, the diversity of migrant experiences and contributions, and the political and social responses to migration, connecting historical patterns to contemporary debates.",
          "inspired_by": "C3 Framework D2.His.5 — explaining connections among historical individuals, ideas, and events across geographic contexts"
        }
      ]
    },
    "HI-KS4-D002": {
      "domain_name": "British Depth Studies",
      "clusters": [
        {
          "cluster_name": "Investigate Early Elizabethan England and the religious and political challenges of 1558–1588",
          "cluster_type": "introduction",
          "thinking_lenses": [
            {
              "lens": "perspective_interpretation",
              "rationale": "Elizabethan depth study is distinguished by its reliance on primary source analysis — pupils evaluate the utility, reliability and provenance of a wide range of documents and images from the period, and must understand that historical knowledge of this era is constructed from partial, interested sources."
            },
            {
              "lens": "cause_and_effect",
              "rationale": "The religious settlement and threats to the Crown are causal puzzles — why was a compromise settlement chosen? What caused Catholic conspiracies to intensify? What made the Armada fail? — requiring pupils to identify multiple interacting causes and evaluate their relative significance."
            }
          ],
          "concept_ids": ["HI-KS4-C009"],
          "rationale": "Early Elizabethan England (C009) is the most popular British depth study option — pupils examine the establishment of the Elizabethan settlement in detail, using a wide range of primary sources to analyse religious tension, threats to the Crown and Elizabethan society, applying all six second-order concepts.",
          "inspired_by": "C3 Framework D2.His.9 — comparing information provided by different historical sources about the same historical event"
        },
        {
          "cluster_name": "Examine Norman England: conquest, control and the transformation of society 1066–1100",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "continuity_change",
              "rationale": "The core analytical question of Norman England is the extent of change — how much did the feudal system, the Church, the language and the built environment transform English society, and what survived from the Anglo-Saxon world? — which requires fine-grained continuity_change analysis within a 35-year period."
            },
            {
              "lens": "cause_and_effect",
              "rationale": "Analysing how the Normans imposed control (Domesday Survey, castle-building, forest law, Church appointments) requires pupils to understand how each mechanism was a deliberate response to the threat of rebellion — cause-and-effect reasoning about state-building under conditions of occupation."
            }
          ],
          "concept_ids": ["HI-KS4-C014"],
          "rationale": "Norman England (C014) is the other major British depth option — pupils study the Conquest and its immediate aftermath in close detail, analysing how the Normans imposed control through the feudal system, castles and Domesday Book, and evaluating the extent of change for the English population.",
          "inspired_by": "C3 Framework D2.His.1 — analysing change and continuity within a historical period"
        }
      ]
    },
    "HI-KS4-D003": {
      "domain_name": "Period Studies",
      "clusters": [
        {
          "cluster_name": "Analyse the Weimar Republic, the rise of Nazism and Germany 1918–1939",
          "cluster_type": "introduction",
          "thinking_lenses": [
            {
              "lens": "cause_and_effect",
              "rationale": "Explaining why Weimar democracy failed and why the Nazis rose to power is the paradigm GCSE causal question — pupils must weigh the contributions of economic crisis, political weakness, Nazi strategy, and international pressure in a multi-factor causal explanation, then trace the consequences of Nazi consolidation for German society."
            },
            {
              "lens": "perspective_interpretation",
              "rationale": "Understanding how ordinary Germans experienced and responded to Nazism requires examining the same events from multiple perspectives — believers, opportunists, bystanders, resisters and persecuted groups — each of whom held a different understanding of what was happening and what was permissible."
            }
          ],
          "concept_ids": ["HI-KS4-C010"],
          "rationale": "Weimar and Nazi Germany (C010) is the most widely studied period study — pupils examine the fragile democracy of the Weimar Republic, the conditions that allowed the Nazi rise to power, and the social, economic and cultural life of the Third Reich, preparing them for analysis of the Holocaust from HI-KS3.",
          "inspired_by": "C3 Framework D2.His.3 — explaining why individuals and groups held particular perspectives during historical periods"
        },
        {
          "cluster_name": "Examine the migration, settlement and conflict of the American West c1835–1895",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "perspective_interpretation",
              "rationale": "The American West is explicitly a conflict of perspectives — Manifest Destiny and settler colonialism from the American perspective versus dispossession and cultural destruction from the Plains Indian perspective — and the core analytical task is evaluating these competing accounts rather than accepting a single narrative."
            },
            {
              "lens": "cause_and_effect",
              "rationale": "Explaining the violent dispossession of Plains Indians requires tracing the causal chain from government policy (Indian Removal Act, reservation system), through economic incentives (cattle ranching, gold rushes), to the military and social mechanisms by which indigenous peoples were stripped of land and autonomy."
            }
          ],
          "concept_ids": ["HI-KS4-C011"],
          "rationale": "The American West (C011) is the other main period study option — pupils examine the westward expansion of the United States, the lives of Plains Indians and the violent dispossession they suffered, and the social transformation brought by cattle ranching and settlement, developing comparative perspectives on colonisation.",
          "inspired_by": "C3 Framework D2.His.5 — explaining connections among historical individuals, ideas, and events across geographic contexts"
        }
      ]
    },
    "HI-KS4-D004": {
      "domain_name": "World Depth Studies",
      "clusters": [
        {
          "cluster_name": "Investigate non-European societies and global historical perspectives",
          "cluster_type": "introduction",
          "thinking_lenses": [
            {
              "lens": "perspective_interpretation",
              "rationale": "Non-European depth study explicitly counters Eurocentric historical framing — pupils must engage with how imperial China, Mughal India or the Ottoman Empire understood their own history and achievements, which requires taking seriously perspectives that are structurally marginalised in the standard British history curriculum."
            },
            {
              "lens": "systems_models",
              "rationale": "Studying historically significant non-European societies in genuine depth requires pupils to model how governance, economy, religion and culture interacted as a functioning social system — the same comparative civilisational analysis applied at KS2 but with greater sophistication and source engagement."
            }
          ],
          "concept_ids": ["HI-KS4-C016"],
          "rationale": "Non-European societies (C016) is co-taught with Cold War (C017) and opens world depth study — pupils examine historically significant societies outside Europe (imperial China, Mughal India, the Ottoman Empire) in genuine depth, developing global historical perspectives that counterbalance the Eurocentrism of other units.",
          "inspired_by": "C3 Framework D2.His.2 — classifying historical periods into eras and explaining the criteria used to define them"
        },
        {
          "cluster_name": "Analyse the Cold War: superpower rivalry, ideology and global consequences",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "cause_and_effect",
              "rationale": "Cold War analysis requires tracing a complex causal network — ideological antagonism, nuclear deterrence, proxy conflicts and détente — and evaluating competing explanations for the war's onset, escalation, de-escalation and eventual end, making it one of the most demanding multi-factor causal analysis tasks at GCSE."
            },
            {
              "lens": "perspective_interpretation",
              "rationale": "Understanding the Cold War requires engaging with radically different ideological perspectives — American liberal democracy and Soviet communism each generated self-justifying narratives — and pupils must evaluate these competing worldviews to understand why both superpowers believed their actions were defensive and necessary."
            }
          ],
          "concept_ids": ["HI-KS4-C017"],
          "rationale": "Cold War and superpower relations (C017) forms the modern world depth option — pupils examine the ideological confrontation between the USA and USSR from 1945 onwards, the nuclear arms race, proxy conflicts and détente, and evaluate the causes of the Cold War's end and its legacy for international relations.",
          "inspired_by": "C3 Framework D2.His.3 — explaining why individuals and groups held particular perspectives during historical periods"
        }
      ]
    },
    "HI-KS4-D005": {
      "domain_name": "Historic Environment Study",
      "clusters": [
        {
          "cluster_name": "Investigate a historic site as a primary source for understanding the past",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "evidence_argument",
              "rationale": "The historic environment study treats a physical site as primary evidence — pupils interrogate built heritage alongside documentary sources and must evaluate what the site reveals and what it conceals, constructing arguments about the period that integrate material and textual evidence."
            },
            {
              "lens": "perspective_interpretation",
              "rationale": "Built heritage embodies the perspectives of those who commissioned and built it — a castle reveals Norman power and fear of rebellion; a Victorian workhouse reveals attitudes to poverty — and pupils must read the site as an artefact of the values and priorities of its creators, not as neutral historical fact."
            }
          ],
          "concept_ids": ["HI-KS4-C012"],
          "rationale": "Single concept domain; the historic environment study is the GCSE unit where pupils treat a specific physical site (e.g. Whitechapel, Castles of Edward I) as historical evidence — they learn to interrogate built heritage alongside documentary sources and evaluate what the site reveals and conceals about the period.",
          "inspired_by": "C3 Framework D2.His.9 — comparing information provided by different historical sources about the same historical event"
        }
      ]
    },
    "HI-KS4-D006": {
      "domain_name": "Second Order Historical Concepts",
      "clusters": [
        {
          "cluster_name": "Analyse historical causation and evaluate consequences of events and developments",
          "cluster_type": "introduction",
          "thinking_lenses": [
            {
              "lens": "cause_and_effect",
              "rationale": "This cluster is the explicit conceptual introduction to causal reasoning — pupils learn the disciplinary toolkit for identifying, categorising and prioritising causes and for distinguishing short-term triggers from long-term underlying factors, which underpins all extended essay writing at GCSE."
            },
            {
              "lens": "evidence_argument",
              "rationale": "Evaluating which causes are most important requires pupils to construct and defend a prioritised argument using specific historical evidence — the move from listing causes to building a supported analytical hierarchy is the core GCSE essay-writing skill introduced here."
            }
          ],
          "concept_ids": ["HI-KS4-C001", "HI-KS4-C002"],
          "rationale": "Causation (C001) and consequence (C002) are the foundational analytical pair — pupils learn to identify and prioritise causes, organise them into categories (economic, social, political), then trace short and long-term consequences. These two second-order concepts are taught together through shared enquiry questions and are the building blocks for extended essay writing.",
          "inspired_by": "C3 Framework D2.His.3 — explaining why individuals and groups held particular perspectives and how perspectives have changed"
        },
        {
          "cluster_name": "Examine change, continuity and similarity across historical periods",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "continuity_change",
              "rationale": "This cluster gives pupils the disciplinary vocabulary and analytical framework for continuity_change reasoning — distinguishing pace of change, identifying what changes at the surface versus underlying structures, and comparing across time periods — which is the conceptual core of thematic study at GCSE."
            },
            {
              "lens": "patterns",
              "rationale": "Similarity and difference analysis asks pupils to identify patterns across historical situations — what do apparently different events have in common structurally? — which is a form of pattern recognition that enables comparative historical generalisation rather than mere description of individual cases."
            }
          ],
          "concept_ids": ["HI-KS4-C003", "HI-KS4-C013"],
          "rationale": "Change and continuity (C003) and similarity and difference (C013) form a natural analytical pair — both require pupils to make structured comparisons across time (change/continuity) and across situations (similarity/difference). They are frequently applied together in thematic questions and in comparing historical case studies.",
          "inspired_by": "C3 Framework D2.His.1 — analysing change and continuity within and across periods of history"
        },
        {
          "cluster_name": "Evaluate historical significance, source utility and competing interpretations",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "evidence_argument",
              "rationale": "Source analysis and interpretation evaluation are the most demanding evidence-based skills at GCSE — pupils must apply criteria (NOP: nature, origin, purpose; CUPS: content, utility, provenance, sufficiency) to assess evidential value and construct arguments about what sources do and don't reliably tell us."
            },
            {
              "lens": "perspective_interpretation",
              "rationale": "Significance judgements and interpretation analysis are inherently perspectival — significance depends on who is asking and from what standpoint, and competing interpretations arise because historians ask different questions from different theoretical positions; pupils must understand this to evaluate rather than merely describe different views."
            }
          ],
          "concept_ids": ["HI-KS4-C004", "HI-KS4-C005", "HI-KS4-C006"],
          "rationale": "Historical significance (C004), source analysis (C005) and interpretations (C006) form the evaluative cluster — all three require pupils to apply criteria-based judgement: how important? how reliable? how convincing? These skills are tested together in GCSE exam questions and underpin extended argument writing.",
          "inspired_by": "C3 Framework D2.His.9 — comparing information provided by different historical sources; D2.His.10 — detecting possible limitations in historical sources"
        }
      ]
    },
    "RS-KS4-D001": {
      "domain_name": "Beliefs and Teachings",
      "clusters": [
        {
          "cluster_name": "Explore theological beliefs, doctrines and scriptural authority in major world religions",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "perspective_interpretation",
              "rationale": "GCSE RS requires pupils to understand theological beliefs from within the tradition being studied — not as external observers but as interpreters of how believers understand God, humanity and salvation through their own sacred texts and doctrinal frameworks; this is fundamentally perspective-taking applied to religious thought."
            },
            {
              "lens": "evidence_argument",
              "rationale": "Scriptural authority involves contested interpretation — different denominations and traditions read the same texts differently and use them to support different doctrinal positions; pupils must evaluate how religious communities use sacred texts as evidence to justify beliefs and practices."
            }
          ],
          "concept_ids": ["RS-KS4-C001", "RS-KS4-C003"],
          "rationale": "Theological belief and doctrine (C001) and scriptural authority (C003) belong in a single cluster because GCSE RS studies them as an integrated unit — the core beliefs of a religion (what is believed about God, humanity, salvation) are inseparable from the sacred texts that authorise and express those beliefs.",
          "inspired_by": "C3 Framework D2.His.5 — explaining how religious and philosophical ideas shaped historical events and social structures"
        }
      ]
    },
    "RS-KS4-D002": {
      "domain_name": "Practices and Sources of Authority",
      "clusters": [
        {
          "cluster_name": "Investigate religious practices, worship and sources of authority in faith communities",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "perspective_interpretation",
              "rationale": "Understanding lived religious practice requires pupils to view rituals, rites of passage and devotional acts from the insider perspective of practitioners, rather than as external observers, which is the defining skill of phenomenological religious studies — grasping what these practices mean to those who perform them."
            },
            {
              "lens": "continuity_change",
              "rationale": "Analysing how tradition and authority shape practice across denominations requires pupils to examine what has changed (liturgical reform, contemporary expressions of faith) and what has persisted (core sacraments, canonical texts) within and across religious traditions over time."
            }
          ],
          "concept_ids": ["RS-KS4-C006"],
          "rationale": "Single concept domain; religious practices and worship is the lived religion cluster — pupils examine the rituals, rites of passage, places of worship and forms of devotion that express and sustain religious belief in community, and analyse how tradition and authority shape practice across denominations and traditions.",
          "inspired_by": "C3 Framework D2.His.5 — explaining how cultural and religious practices shape historical and contemporary communities"
        }
      ]
    },
    "RS-KS4-D003": {
      "domain_name": "Religion and Ethics",
      "clusters": [
        {
          "cluster_name": "Evaluate ethical frameworks, moral reasoning and the sanctity of human life",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "perspective_interpretation",
              "rationale": "Studying major normative ethical theories requires pupils to take each framework seriously on its own terms — understanding why a utilitarian reaches different conclusions about euthanasia from a natural law theorist, and evaluating the internal coherence of each rather than simply comparing outcomes."
            },
            {
              "lens": "evidence_argument",
              "rationale": "Applying ethical frameworks to sanctity of life issues (abortion, euthanasia, capital punishment) requires pupils to construct structured arguments in which premises from an ethical theory lead logically to a conclusion, and to evaluate whether religious or secular premises are more convincing in each case."
            }
          ],
          "concept_ids": ["RS-KS4-C002", "RS-KS4-C005"],
          "rationale": "Ethical frameworks (C002) and sanctity of life/human dignity (C005) form the core ethics cluster — pupils study the major normative ethical theories (natural law, utilitarianism, situation ethics, Kantian ethics) and then apply them to issues such as euthanasia, abortion and capital punishment where the sanctity of life is directly at stake.",
          "inspired_by": "C3 Framework D2.Civ.12 — analysing the relationship between the rule of law and individual rights"
        }
      ]
    },
    "RS-KS4-D004": {
      "domain_name": "Religion and Society",
      "clusters": [
        {
          "cluster_name": "Explore religious pluralism, interfaith dialogue and the role of religion in public life",
          "cluster_type": "practice",
          "thinking_lenses": [
            {
              "lens": "perspective_interpretation",
              "rationale": "Theological attitudes to pluralism (exclusivism, inclusivism, pluralism) are themselves competing interpretations of religious truth and the status of other traditions; pupils must evaluate these positions from within each tradition's own frame of reference, which is a sophisticated application of perspective-taking in religious thought."
            },
            {
              "lens": "systems_models",
              "rationale": "Evaluating the contribution of interfaith dialogue to social cohesion requires pupils to model how multiple faith traditions, secular institutions and legal frameworks interact within a democratic society — understanding pluralism as a social system with feedback between religious communities, civic institutions and public discourse."
            }
          ],
          "concept_ids": ["RS-KS4-C004"],
          "rationale": "Single concept domain; religious pluralism and interfaith dialogue is the society-facing cluster — pupils examine how multiple faith traditions coexist in a secular democratic society, analyse theological attitudes to pluralism (exclusivism, inclusivism, pluralism), and evaluate the contribution of interfaith dialogue to social cohesion.",
          "inspired_by": "C3 Framework D2.Civ.10 — analysing the relationship between individual rights and the common good in a diverse society"
        }
      ]
    }
  }
}
