[
  {
    "concept_id": "AD-KS3-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Uses familiar materials and techniques with basic control, producing work that shows effort but limited range of media or intentionality in technical choices.",
        "example_task": "Create a tonal drawing of a shoe using pencil. Show at least three different tones from light to dark.",
        "example_response": "The drawing shows the shoe from direct observation with three clear tonal values: light areas where the surface catches light, mid-tones on the body of the shoe, and dark shadows in the creases and under the sole. The pencil marks follow the contours of the shoe, creating a sense of three-dimensional form.",
        "common_errors": [
          "Using only outline with no tonal variation, producing a flat rather than three-dimensional drawing",
          "Pressing hard for dark tones instead of using layered hatching or cross-hatching techniques"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Experiments with a wider range of materials and techniques, showing growing control and beginning to make deliberate choices about which techniques serve their creative intentions.",
        "example_task": "Using two different media (e.g., charcoal and ink), create two studies of the same object. Annotate each with what you learned about the properties of the medium.",
        "example_response": "Charcoal study: 'Charcoal creates soft, smudgeable marks that are good for smooth gradations of tone. I used the side of the charcoal stick for broad shadows and the tip for fine detail. The eraser lifts charcoal to create highlights. The effect is atmospheric and slightly blurred.' Ink study: 'Ink gives sharp, permanent lines with no gradation — a mark is either there or not. I used hatching to build tone because ink cannot be blended like charcoal. The effect is more graphic and defined. Cross-hatching in the shadows created depth.'",
        "common_errors": [
          "Producing two studies that look identical despite using different media, showing no exploration of each medium's distinctive qualities",
          "Annotating with 'I liked this' rather than specific observations about what the medium does"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Demonstrates confident control across a range of techniques and media, selects approaches with clear creative intent, and integrates technical skill with expressive and communicative purpose.",
        "example_task": "Choose a technique and medium that best communicates the idea of 'growth'. Produce the work and write a 50-word justification of your technical choices.",
        "example_response": "I chose watercolour wet-on-wet technique because the way colour bleeds and spreads unpredictably on wet paper mirrors how plants grow — organically, without straight lines, responding to their environment. I dropped concentrated green pigment onto pre-wet paper and tilted it to create branching flows. The lack of hard edges suggests living, dynamic growth rather than static form. The translucent layers show accumulation over time.",
        "common_errors": [
          "Choosing a technique without being able to explain why it communicates the intended idea",
          "Describing what was done technically without connecting it to creative meaning"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Develops a personal technical vocabulary, combining and adapting techniques in innovative ways, and demonstrates sophisticated understanding of the relationship between technique, material and meaning.",
        "example_task": "An artist uses only found materials (rubbish, discarded objects) to make portraits. Evaluate how the choice of materials changes the meaning of the artwork compared to conventional portrait painting.",
        "example_response": "Using found materials transforms the portrait from a representation of appearance to a commentary on identity and value. When a face is constructed from discarded packaging, broken electronics and waste fabric, the viewer is forced to reconcile the human dignity of the subject with the low status of the materials, creating a tension that provokes questions: what do we discard? Who do we overlook? The texture and colour of found materials are uncontrollable in ways paint is not — the artist must work with what exists rather than mixing an exact colour, which introduces an element of responsive improvisation absent from traditional portraiture. The materials also carry their own history: a piece of newspaper brings its own text and images, adding unintended meaning layers. Technically, the challenge shifts from depicting surface appearance to constructing recognisable form from irregular, resistant materials — a sculptural and compositional problem rather than a rendering one. The work references Cubist collage (Picasso, Braque), Dada assemblage (Schwitters), and contemporary artists like Vik Muniz, placing it within a tradition of using 'low' materials to question hierarchies of art and value.",
        "common_errors": [
          "Evaluating the work only on whether it 'looks like' the person rather than considering how material choice creates meaning",
          "Not connecting the technique to art historical precedents or broader ideas about art and materials"
        ]
      }
    ]
  },
  {
    "concept_id": "AD-KS3-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can express a personal opinion about an artwork ('I like it' / 'I don't like it') but struggles to explain why, and does not use formal art vocabulary.",
        "example_task": "Look at this painting. Describe three things you notice about how the artist has used colour.",
        "example_response": "The artist has used warm colours (reds and oranges) in the centre to draw your eye there first. The background uses cool colours (blues and greens) which make it feel further away. The contrast between the warm centre and cool edges makes the focal point stand out.",
        "common_errors": [
          "Describing what is depicted ('there is a tree') rather than how formal elements are used",
          "Using everyday language ('it's pretty') rather than art-specific vocabulary ('warm palette', 'contrast')"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Uses a structured analytical framework (formal elements, composition, context) to describe artworks, and begins to make evaluative judgements supported by specific visual evidence.",
        "example_task": "Analyse how the artist has created a sense of depth in this landscape painting. Refer to at least two formal elements.",
        "example_response": "The artist creates depth through aerial perspective: objects in the foreground are painted in strong, warm colours with sharp detail, while the distant mountains are pale blue-grey with soft, blurred edges. This mimics how the atmosphere scatters light over distance. The artist also uses diminishing scale: trees in the foreground are large and detailed, while similar trees near the horizon are tiny. The converging lines of the path draw the eye from foreground to background, creating a sense of recession into space.",
        "common_errors": [
          "Identifying depth effects without explaining the specific techniques used to create them",
          "Naming formal elements without explaining how they contribute to the overall effect"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses artworks with precision and depth, connecting formal analysis to meaning and context, and applies critical evaluation to their own work-in-progress to improve it iteratively.",
        "example_task": "Compare how two artists from different periods represent the human figure. What does each approach tell us about the values of their time?",
        "example_response": "Michelangelo's David (1504) represents the human figure with idealised anatomical precision — every muscle is defined, the proportions follow classical ratios, and the pose (contrapposto) echoes ancient Greek sculpture. This reflects Renaissance values: the revival of classical learning, the celebration of human potential, and the belief that the human body is a worthy subject for the highest art. In contrast, Giacometti's Walking Man (1961) reduces the figure to an elongated, skeletal form with rough, eroded surfaces. The figure appears fragile, isolated and diminished — reflecting post-war existentialist anxiety about human vulnerability and insignificance. Giacometti's rough textures reject the smooth finish of classical sculpture, suggesting that polished perfection is no longer honest. Both artists represent the human figure, but their radically different approaches reveal how artistic representation is shaped by the philosophical and cultural context of its time.",
        "common_errors": [
          "Describing both works without making a comparative analysis that identifies similarities and differences",
          "Not connecting the visual choices to the cultural and philosophical context of each period"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Constructs sophisticated critical arguments about art, challenges established interpretations with evidence, and uses analysis as a creative tool to inform and develop their own practice.",
        "example_task": "Some critics argue that Banksy is not a 'real' artist because he works on walls rather than in galleries. Construct a counter-argument using your knowledge of art history and critical analysis.",
        "example_response": "The argument that art must be in a gallery to be legitimate is historically recent and culturally specific. Before the 18th century, most art was site-specific: frescoes in churches (Michelangelo's Sistine Chapel ceiling), murals in palaces, and public sculpture in squares. The gallery system emerged as a commercial framework, not an aesthetic requirement. Banksy's work is closer to this pre-gallery tradition than most contemporary gallery art. More substantively, Banksy uses the visual language of art — composition, symbolism, irony, cultural reference — with considerable sophistication. 'Girl with a Balloon' uses the formal device of a single figure against a blank wall (echoing Magritte's surrealist compositions) to communicate themes of innocence and loss. The street location is not incidental but integral to the meaning: placing art in public space democratises access (no admission fee, no cultural gatekeeping) and creates unexpected encounters between art and everyday life. The argument that gallery = art and street = vandalism reflects a class-based distinction about whose culture counts, not an aesthetic judgement about quality. Duchamp demonstrated in 1917, with his readymade 'Fountain', that the context in which something is presented determines whether it is received as art — Banksy simply extends this logic from the gallery to the street.",
        "common_errors": [
          "Defending Banksy without reference to art historical precedent or critical frameworks",
          "Accepting the gallery/street binary rather than questioning the assumption behind it"
        ]
      }
    ]
  },
  {
    "concept_id": "AD-KS3-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can name a few famous artists (e.g., Van Gogh, Picasso) but has limited knowledge of when they worked, what movements they belonged to, or how their work relates to historical context.",
        "example_task": "Name one art movement and one artist associated with it. What makes their work different from art that came before?",
        "example_response": "Impressionism — Claude Monet. Impressionist painters like Monet painted outdoors using visible brushstrokes and bright colours to capture the effect of light at a specific moment. This was different from earlier Academic art, which was painted in studios with smooth, invisible brushstrokes and focused on historical or mythological subjects.",
        "common_errors": [
          "Naming an artist without being able to connect them to a movement or explain what was distinctive about their approach",
          "Describing what the paintings look like without explaining how they differed from what came before"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Knows several major periods and movements in approximate chronological order, and can describe the distinctive characteristics of each with reference to specific artists and works.",
        "example_task": "Place these movements in chronological order: Pop Art, Renaissance, Impressionism, Cubism. For one movement, explain its key characteristics.",
        "example_response": "Chronological order: Renaissance (c.1400-1600), Impressionism (c.1860-1890), Cubism (c.1907-1920), Pop Art (c.1955-1970). Cubism, pioneered by Picasso and Braque, broke objects into geometric fragments and showed multiple viewpoints simultaneously in a single image. Instead of painting what you see from one fixed position (as in Renaissance perspective), Cubists painted what they knew about the object — front, side and top combined. This challenged the 500-year-old convention of single-point perspective and opened the door to abstract art.",
        "common_errors": [
          "Confusing the chronological order of movements",
          "Describing Cubism as simply 'using shapes' without explaining the multiple-viewpoint concept"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Understands how movements respond to historical, social and political contexts, makes connections across periods and cultures, and uses art historical knowledge to inform their own creative practice.",
        "example_task": "The Dada movement emerged during World War I. Explain why the war led artists to reject traditional art forms, and how this rejection shaped the movement's approach.",
        "example_response": "World War I killed approximately 17 million people using industrial technology. Dada artists (Duchamp, Tzara, Arp) saw this as the catastrophic failure of European civilisation and its supposedly rational values — the same civilisation that had produced the great art traditions of the Renaissance, Baroque and Romanticism. If 'civilisation' could produce mechanised slaughter, then the art of that civilisation was implicated. Dada's response was deliberately anti-art: Duchamp submitted a urinal ('Fountain', 1917) as a sculpture; Hugo Ball recited nonsense poetry; collages were made from newspaper fragments about the war. The absurdity was intentional — it mirrored the absurdity of a world that called mass killing 'progress'. By rejecting traditional skill, beauty and meaning, Dada artists were rejecting the entire value system that had failed so catastrophically. This iconoclasm was not nihilism but a clearing of ground — it opened space for Surrealism, Conceptual Art and Performance Art, all of which question what art is and what it can do.",
        "common_errors": [
          "Describing Dada as merely 'weird' or 'random' without understanding its purposeful relationship to the war",
          "Not connecting the artistic rejection to the broader cultural and political crisis"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Critically examines the construction of the art historical canon, recognises whose art has been included and excluded, and applies art historical understanding to evaluate contemporary practice.",
        "example_task": "The traditional art history curriculum focuses primarily on white male European artists. Evaluate why this is problematic and suggest how a more inclusive art history would change our understanding of art.",
        "example_response": "The Western art historical canon was constructed by European institutions (academies, museums, universities) that reflected the power structures of their time: predominantly white, male, wealthy and colonial. Women artists (Artemisia Gentileschi, Frida Kahlo, Louise Bourgeois) were systematically excluded from academies, denied commissions and overlooked by historians — not because their work was inferior but because they operated outside the institutional system that defined 'great art'. Non-Western art traditions (Japanese woodblock printing, West African sculpture, Islamic geometric design, Aboriginal Australian painting) were collected as ethnographic curiosities rather than studied as art, reflecting a colonial hierarchy that treated European culture as civilisation and other cultures as objects of study. A more inclusive art history would: expand the definition of 'art' beyond painting and sculpture to include textiles, ceramics, body art and oral traditions; recognise that artistic innovation has always been global (Picasso's Cubism was directly influenced by African masks; Impressionism was shaped by Japanese prints); include artists marginalised by gender, race, disability and class; and examine how the canon itself was constructed and whose interests it served. This does not diminish Michelangelo or Rembrandt — it enriches our understanding by placing their work within a truly global history of human creative expression rather than a narrow European lineage.",
        "common_errors": [
          "Arguing for inclusion without providing specific examples of excluded artists and traditions",
          "Treating the problem as simply 'adding more names' rather than questioning the criteria by which 'great art' was defined"
        ]
      }
    ]
  },
  {
    "concept_id": "AD-KS3-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Follows instructions to produce work that looks similar to examples shown, but does not make independent creative choices or develop personal themes and approaches.",
        "example_task": "You have been given an open brief: 'Transformation'. Describe an idea for a piece of art that responds to this theme in a way that is personal to you.",
        "example_response": "I would create a series of self-portraits showing myself at different ages — child, teenager, adult — using progressively more complex media (crayon for childhood, pencil for teenage, oil paint for adulthood). The transformation is both in the subject (growing up) and in the technique (becoming more skilled), so the medium itself tells the story of development.",
        "common_errors": [
          "Choosing an obvious or generic response (e.g., a butterfly lifecycle) rather than a personally meaningful interpretation",
          "Describing what the work would look like without explaining the personal connection or creative reasoning"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Makes some independent creative choices within projects, begins to develop recurring themes or interests, and takes creative risks with growing confidence.",
        "example_task": "Look back at your last three projects. Identify one theme, approach or interest that appears in more than one piece, and explain how you might develop it further.",
        "example_response": "In my cityscape project I focused on reflections in glass buildings; in my still life I was drawn to shiny, reflective surfaces; in my abstract work I experimented with metallic paint. The connecting theme is reflection and surface — how surfaces transform and distort what they reflect. I could develop this by: photographing reflections in different surfaces (water, chrome, glass, oil puddles); studying artists who work with reflection (Anish Kapoor's mirrors, Gerhard Richter's photo-paintings); and experimenting with actual reflective materials (mirror fragments, foil) in mixed-media work rather than only painting reflective effects.",
        "common_errors": [
          "Not identifying connections between separate projects",
          "Describing what to do next without connecting it to what they have already learned and are interested in"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Develops a distinctive creative approach through sustained exploration, makes considered choices about subject matter, technique and presentation, and reflects critically on their own emerging creative identity.",
        "example_task": "Write a 100-word artist's statement explaining what your recent work is about, what techniques you use, and what you want the viewer to experience.",
        "example_response": "My work explores the tension between the natural and the artificial. I photograph plants growing through cracks in concrete, weeds colonising abandoned buildings, and moss on industrial surfaces, then rework these images using a combination of botanical drawing (precise, scientific) and spray-painted gestural marks (urban, energetic). The contrast between careful observation and spontaneous expression reflects the subject: nature's patient persistence against human infrastructure. I want the viewer to notice the beauty in overlooked spaces — the places where nature reasserts itself — and to question whether the boundary between 'natural' and 'built' is as fixed as we assume.",
        "common_errors": [
          "Writing a statement that describes processes without explaining the ideas driving them",
          "Not articulating what they want the viewer to think or feel"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Demonstrates a mature and distinctive creative voice, positions their work in relation to art historical and contemporary contexts, and uses creative practice as a form of critical inquiry.",
        "example_task": "How does studying the work of other artists help you develop your own creative voice, rather than just imitating theirs?",
        "example_response": "Studying other artists expands my creative vocabulary without determining what I say with it. When I studied Kathe Kollwitz's expressive use of charcoal to communicate suffering, I did not copy her subjects but adopted her technique of letting the material's grain contribute to emotional texture — I applied this to my own drawings of decaying buildings, using charcoal's roughness to express material deterioration. When I studied Hokusai's woodblock prints, I was struck by how he composed waves as dynamic patterns rather than realistic representations — this influenced my approach to photographing cloud formations, where I now seek abstract pattern rather than documentary record. The key is studying what the artist is doing (their methods and intentions) rather than what their work looks like (their surface appearance). Each influence becomes a tool in my toolkit, not a template to copy. The personal voice emerges from the unique combination of influences filtered through my own experiences, interests and aesthetic sensibility. No two artists absorb the same influences in the same way, because no two people see the world identically.",
        "common_errors": [
          "Describing influence as imitation rather than as a process of absorbing methods and making them one's own",
          "Not providing specific examples of how particular artists influenced their work in concrete ways"
        ]
      }
    ]
  }
]