[
  {
    "concept_id": "AD-KS1-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Exploring different materials (paper, card, fabric, clay, found objects) through handling, feeling and simple making activities.",
        "example_task": "Explore these materials: tissue paper, card, felt and clay. Make something using at least two of them.",
        "example_response": "I scrunched the tissue paper to make a flower shape and stuck it onto card. The tissue paper is soft and you can see through it. The card is stiff and holds the flower up.",
        "common_errors": [
          "Using only one material instead of exploring and combining",
          "Not noticing or describing the different properties of materials"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Selecting materials for a purpose, explaining why a particular material is suitable for the intended artwork.",
        "example_task": "Choose the best material to make a textured collage of an animal's fur. Explain your choice.",
        "example_response": "I chose cotton wool for the sheep's body because it looks fluffy like real wool. I used sandpaper for the face because it is rough like a sheep's skin. I chose materials that feel like the real textures.",
        "common_errors": [
          "Choosing materials for colour alone without considering texture or form",
          "Not being able to explain why the material matches the purpose"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Experimenting with how materials can be changed, combined and manipulated to create specific visual or tactile effects, making deliberate creative choices.",
        "example_task": "Create a mixed-media piece that shows a stormy sea. Choose and combine materials to show the movement and power of the water.",
        "example_response": "I tore blue and white tissue paper into strips and layered them with PVA to create translucent wave shapes. I added string coated in paint to show the spray. I crumpled foil for the rocks. Tearing rather than cutting gives ragged edges that look like waves. The layering makes the sea look deep and the shiny foil contrasts with the soft paper.",
        "common_errors": [
          "Using materials in only their original form without transforming them",
          "Not connecting material choices to the mood or subject of the artwork"
        ]
      }
    ]
  },
  {
    "concept_id": "AD-KS1-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Making marks confidently using different drawing tools (pencils, crayons, chalk, charcoal), exploring what each can do.",
        "example_task": "Use a pencil, a crayon and charcoal to draw the same object. How do they feel different?",
        "example_response": "The pencil makes thin, neat lines. The crayon makes thick, waxy marks. The charcoal is soft and smudgy. I like the charcoal because I can blend it with my finger.",
        "common_errors": [
          "Pressing too hard or too lightly without varying pressure",
          "Using only one tool throughout without exploring alternatives"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Drawing from observation with increasing accuracy, using line and simple shading to represent what they see.",
        "example_task": "Draw this plant from observation. Look carefully at the shapes of the leaves and where they join the stem.",
        "example_response": "I looked carefully and drew the stem first, then added each leaf where I could see it joining. Some leaves are bigger than others. I used light and dark pencil pressure to show which leaves are in front and which are behind.",
        "common_errors": [
          "Drawing from imagination rather than looking at the actual object",
          "Making all leaves the same size and shape rather than observing differences"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using drawing purposefully to explore ideas, record observations or communicate, with control over line, tone, pattern and detail.",
        "example_task": "Draw a detailed observational study of a shell. Show the texture, pattern and form using different line techniques.",
        "example_response": "I drew the overall spiral shape first, then added the ridged texture using parallel curved lines that follow the shell's form. I used cross-hatching for the darker areas inside the opening and left the highlights white. The pattern on the surface spirals outward, and I drew this carefully by following the lines I could see.",
        "common_errors": [
          "Outlining everything with the same thickness of line instead of varying line quality",
          "Not using shading techniques to show three-dimensional form"
        ]
      }
    ]
  },
  {
    "concept_id": "AD-KS1-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Using paint freely to explore colour, discovering what happens when colours are mixed and applied in different ways.",
        "example_task": "Mix red and yellow paint together. What colour do you get? Try mixing different amounts.",
        "example_response": "When I mixed red and yellow I got orange. More red makes a darker orange, more yellow makes a lighter, yellowy orange.",
        "common_errors": [
          "Adding too much of one colour so the mix becomes muddy",
          "Not cleaning the brush between colours, accidentally mixing unwanted shades"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Mixing secondary colours from primaries with control, and beginning to create lighter and darker shades by adding white or black.",
        "example_task": "Mix three different shades of green — a light green, a medium green and a dark green.",
        "example_response": "I mixed blue and yellow to get medium green. I added white to some to make light green. I added a tiny bit of black to make dark green. I had to add the black very carefully because a little goes a long way.",
        "common_errors": [
          "Adding too much black, which quickly overwhelms the colour",
          "Not understanding that adding white changes a shade to a tint"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Applying paint with control using different brush techniques to achieve specific effects, mixing colours purposefully to match or create a mood.",
        "example_task": "Paint a sunset scene. Mix the exact colours you need and use different brush strokes for the sky and the ground.",
        "example_response": "I mixed warm oranges and pinks by adding white to red and orange. I used broad, horizontal strokes for the sky to show the bands of colour blending into each other. For the dark silhouette of trees on the ground, I used black with a thin brush and precise strokes. I blended the sky colours while they were still wet so they merged naturally.",
        "common_errors": [
          "Using paint straight from the pot without mixing to match the observed colours",
          "Using the same brush stroke for everything instead of varying technique"
        ]
      }
    ]
  },
  {
    "concept_id": "AD-KS1-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Handling and shaping three-dimensional materials (clay, playdough, found objects) to create simple forms.",
        "example_task": "Use clay to make a simple animal shape. Think about the body, head and legs.",
        "example_response": "I rolled a big piece of clay for the body and a smaller ball for the head. I rolled four thin pieces for legs and stuck them on. I pinched two ears on the head.",
        "common_errors": [
          "Making all parts the same size instead of varying proportions",
          "Not joining pieces securely so they fall apart"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using modelling, cutting and joining techniques to create three-dimensional work with more control, considering form from multiple viewpoints.",
        "example_task": "Make a clay figure of a person sitting down. Make sure it looks right from the front and the side.",
        "example_response": "I shaped the body sitting on a clay chair. I scored and slipped the joins so they are strong. I checked from the front — you can see the face and hands. From the side, the legs bend at the knees. The figure sits up straight because I made the back thick enough to support it.",
        "common_errors": [
          "Only considering how the sculpture looks from one angle",
          "Not using proper clay joining techniques (score and slip)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Creating sculptures that demonstrate awareness of form, proportion and surface texture, using appropriate materials and techniques to realise their design intention.",
        "example_task": "Create a sculpture inspired by a natural form (shell, seed pod, leaf). Capture the form, texture and detail.",
        "example_response": "I chose a pinecone. I built the basic cone shape from clay, then added each scale individually, overlapping them like the real pinecone. I used a pointed tool to add texture to each scale. The base is wider and the top comes to a point. I looked at the real pinecone from all angles while I worked to make sure the proportions matched.",
        "common_errors": [
          "Creating a flat representation rather than working in three dimensions",
          "Not adding surface detail and texture to bring the form to life"
        ]
      }
    ]
  },
  {
    "concept_id": "AD-KS1-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying and naming the visual elements — colour, line, shape — in artwork and the world around them.",
        "example_task": "Look at this painting. What colours can you see? Can you find any curved lines and straight lines?",
        "example_response": "I can see blue, green and yellow. The sky has smooth curved lines like waves. The building has straight lines going up and down and across.",
        "common_errors": [
          "Naming colours but not noticing other elements like line, shape or pattern",
          "Using vague descriptions rather than specific element vocabulary"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing how artists use visual elements to create effects, and using these elements purposefully in their own work.",
        "example_task": "Create a pattern using repeating shapes. Think about which colours go well together.",
        "example_response": "I used a circle, a triangle and a square and repeated them in a row. I chose blue and orange because they contrast well and make the pattern stand out. The shapes repeat in the same order: circle, triangle, square, circle, triangle, square.",
        "common_errors": [
          "Creating a random arrangement rather than a deliberate repeating pattern",
          "Not considering how colour combinations affect the visual impact"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using all the visual elements (colour, pattern, texture, line, shape, form, space) to create artwork with specific intentions, explaining their choices.",
        "example_task": "Create a piece of artwork that makes the viewer feel calm. Explain which visual elements you used and why.",
        "example_response": "I used cool colours (blues and greens) because they feel peaceful. I used flowing, curved lines rather than jagged ones. The shapes are soft and rounded. I created a gentle repeating wave pattern because repetition feels soothing. I left lots of open space rather than filling every area, which gives a feeling of stillness. The smooth texture of the paint adds to the calm mood.",
        "common_errors": [
          "Using elements randomly without connecting them to the intended mood or meaning",
          "Not being able to explain why particular choices create particular effects"
        ]
      }
    ]
  },
  {
    "concept_id": "AD-KS1-C006",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying that different people create art, craft and design in different ways and for different purposes.",
        "example_task": "Look at these pictures: a painting by an artist, a pot made by a potter, and a chair designed by a designer. How are they different?",
        "example_response": "The painting is for looking at on a wall. The pot is for holding things and it looks nice. The chair is for sitting on. Different people make different things for different reasons.",
        "common_errors": [
          "Not recognising that craft and design are different from fine art",
          "Thinking art is only paintings hung in galleries"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing the work of specific artists, craft makers or designers studied in class, identifying distinctive features of their work.",
        "example_task": "What is special about how Andy Goldsworthy makes his art?",
        "example_response": "Andy Goldsworthy uses natural materials like leaves, stones, ice and sticks to make sculptures outdoors. His work is special because it uses nature itself as the material and it changes over time — the wind blows it away or it melts. He doesn't use paint or a studio.",
        "common_errors": [
          "Describing what an artist's work looks like without saying what makes it distinctive",
          "Not being able to recall specific details about the artists studied"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Making connections between the work of artists studied and their own creative work, explaining how an artist's ideas or techniques have influenced their choices.",
        "example_task": "Create a piece of artwork inspired by an artist you have studied. Explain the connection.",
        "example_response": "I was inspired by Andy Goldsworthy. I collected autumn leaves and arranged them in a colour gradient from green to yellow to red in a spiral pattern on the grass. Like Goldsworthy, I used only natural materials and worked outdoors. I took a photograph because the wind would blow it away, which is part of the point — art doesn't have to last forever.",
        "common_errors": [
          "Copying an artist's work directly rather than being inspired by their approach",
          "Making artwork and then retrospectively claiming an artist connection that isn't genuine"
        ]
      }
    ]
  }
]
