[
  {
    "concept_id": "AD-KS2-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Drawing from observation using pencil with some attention to proportion and detail.",
        "example_task": "Draw this shoe from observation. Look carefully at the shape and proportions before you start.",
        "example_response": "I looked at the overall shape first and drew it lightly. The sole is wider than the top. I added the laces, the stitching line and the brand logo. I used light lines first and then made the final lines darker.",
        "common_errors": [
          "Drawing from memory or imagination rather than looking at the object",
          "Starting with small details instead of the overall shape"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using a range of drawing techniques (hatching, cross-hatching, stippling, blending) to create tone and texture in observational drawings.",
        "example_task": "Draw this crumpled piece of fabric. Use shading techniques to show the folds, shadows and highlights.",
        "example_response": "I used cross-hatching in the deep folds where the shadows are darkest. For the medium tones, I used lighter hatching. I left the highlights as white paper. I used blending with my finger where the fabric curves gently. The shading shows which parts are raised and which are folded under.",
        "common_errors": [
          "Applying the same tone everywhere instead of observing light and shadow",
          "Using only one shading technique throughout"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Creating observational drawings that demonstrate control of line, tone, proportion and texture, using drawing tools and techniques selected for their specific qualities.",
        "example_task": "Create a detailed study of a natural object (feather, shell, leaf) using the drawing medium that best captures its qualities.",
        "example_response": "I chose charcoal for a feather because the softness of charcoal matches the softness of the feather. I drew the central quill with a sharp edge and the barbs with light, sweeping strokes. I used an eraser to lift highlights where the feather catches light. The tip is detailed and the base becomes softer and more blurred, drawing the eye along the form.",
        "common_errors": [
          "Choosing a drawing medium without considering how its qualities match the subject",
          "Not varying the level of detail to create visual interest and focus"
        ]
      }
    ]
  },
  {
    "concept_id": "AD-KS2-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Mixing secondary and tertiary colours from primaries with control, understanding the colour wheel.",
        "example_task": "Mix the colour you can see in this autumn leaf. What primary colours do you need?",
        "example_response": "I mixed red and yellow to make orange, then added a tiny bit of green to make it more brownish. The leaf has different colours in different parts so I mixed several shades of orange-brown.",
        "common_errors": [
          "Using pre-mixed colours from pots instead of mixing from primaries",
          "Not observing the actual colour closely enough — painting from assumption"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Applying paint with awareness of colour relationships (complementary, harmonious, warm, cool) and varying techniques (wash, layering, impasto).",
        "example_task": "Paint a landscape using a warm colour palette for the foreground and cool colours for the background to create depth.",
        "example_response": "I used warm oranges, reds and yellows in the foreground to make it feel close. The background uses cool blues and greys, which recede. I applied the foreground thickly with visible brushstrokes for texture and the background as a thin wash for smoothness. The warm/cool contrast creates a sense of distance.",
        "common_errors": [
          "Using colours randomly without considering their relationships",
          "Applying paint the same way throughout without varying technique"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Painting with control and intention, using colour, tone and brushwork to express ideas or create specific visual effects, drawing on knowledge of how artists use paint.",
        "example_task": "Paint a scene that captures a mood (e.g. a stormy sky, a peaceful garden). Explain how your colour and technique choices create the mood.",
        "example_response": "I painted a stormy sky using dark greys, purples and flashes of yellow-white. I applied the paint thickly with sweeping, diagonal brushstrokes to show the wind. I blended the clouds while wet to make them look turbulent. The ground is darker and calmer, using horizontal strokes that contrast with the wild sky. I was inspired by how Turner uses thick, swirling paint to capture weather.",
        "common_errors": [
          "Painting a literal scene without considering mood or atmosphere",
          "Not connecting technical choices (colour, brushwork) to expressive intentions"
        ]
      }
    ]
  },
  {
    "concept_id": "AD-KS2-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Using materials such as clay, wire or card to create simple three-dimensional forms with basic control.",
        "example_task": "Make a simple clay pot using the coil or pinch technique.",
        "example_response": "I started with a ball of clay and used my thumb to push a hole in the middle. I pinched the walls up and outward, turning the pot as I went, making the walls an even thickness.",
        "common_errors": [
          "Making the walls too thin so the pot collapses",
          "Not turning the piece while working, so it becomes lopsided"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Planning and constructing three-dimensional work with awareness of form, surface treatment and structural integrity.",
        "example_task": "Design and make a clay vessel inspired by Greek pottery. Plan the form and decoration before starting.",
        "example_response": "I sketched the amphora shape first — narrow base, wide body, narrow neck with two handles. I used coils to build up the walls, smoothing each layer. I added handles by scoring and slipping coil pieces. Before firing, I carved a geometric pattern around the widest part, inspired by Greek key patterns.",
        "common_errors": [
          "Not planning the form before building, resulting in structural problems",
          "Adding decoration without considering how it relates to the overall form"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Creating sculptures that demonstrate technical skill, creative thinking and awareness of how form, material and surface interact to create meaning.",
        "example_task": "Create a sculpture that communicates an idea or emotion. Explain your material and design choices.",
        "example_response": "I made a wire and tissue paper sculpture of a bird in flight to represent freedom. The wire armature gives the structure and the tissue paper stretched over the wings lets light through, suggesting lightness. The wings are spread wide and angled upward. I chose wire because it can be bent into flowing curves, and tissue because it is fragile and translucent — the opposite of heavy, which supports the idea of freedom and flight.",
        "common_errors": [
          "Focusing on technical execution without connecting to an idea or intention",
          "Not considering how the choice of material contributes to the meaning"
        ]
      }
    ]
  },
  {
    "concept_id": "AD-KS2-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Using a sketchbook to record simple observations and ideas through drawings and notes.",
        "example_task": "In your sketchbook, draw three objects from the classroom. Write a note about what interests you about each one.",
        "example_response": "I drew the plant, the clock and my pencil case. The plant has interesting leaf shapes. The clock has a round face with numbers. My pencil case has a zip pattern that would make a good drawing subject.",
        "common_errors": [
          "Treating the sketchbook as a finished work rather than a place for exploration",
          "Only using the sketchbook when told to rather than as a regular habit"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using a sketchbook to collect ideas, experiment with techniques, and develop thinking over time, not just record finished work.",
        "example_task": "Use your sketchbook to explore three different approaches to drawing a tree. Try different media and techniques.",
        "example_response": "First I drew a tree in pencil with careful observation of the bark texture. Then I tried the same tree in charcoal, focusing on the overall shape and shadows. Third, I drew just the leaves using coloured pencil to explore the range of greens. Each approach showed me something different about the tree.",
        "common_errors": [
          "Doing the same approach three times instead of genuinely experimenting",
          "Not annotating experiments with reflections on what worked and what didn't"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using a sketchbook as an integral part of the creative process, developing ideas through multiple iterations, collecting references and reflecting on progress.",
        "example_task": "Use your sketchbook to develop a design for a final piece. Show at least three stages of development from initial idea to final plan.",
        "example_response": "Page 1: Initial idea sketches — five quick thumbnails of different compositions. Page 2: Research — I stuck in a photograph of the landscape and colour swatches from artists who painted similar scenes. Page 3: I developed my preferred composition larger, trying different colour palettes alongside. Page 4: Final plan with annotations showing exactly which colours, techniques and materials I will use. The sketchbook shows how my idea changed from a simple idea to a thought-through plan.",
        "common_errors": [
          "Jumping from first idea to final piece without development stages",
          "Not using the sketchbook to explore alternatives and make decisions"
        ]
      }
    ]
  },
  {
    "concept_id": "AD-KS2-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recalling the name and one fact about an artist, architect or designer studied in class.",
        "example_task": "Tell me one thing about the artist we have been studying.",
        "example_response": "We studied William Morris. He designed patterns with flowers and leaves for wallpaper and fabric.",
        "common_errors": [
          "Confusing the artists studied or mixing up their work",
          "Not being able to recall specific details beyond the name"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing the distinctive features of an artist's work and placing them in their historical period, explaining why their work matters.",
        "example_task": "What makes Hokusai's 'The Great Wave' distinctive? When and where was it created?",
        "example_response": "Hokusai was a Japanese artist who created 'The Great Wave' around 1831. It shows a huge wave about to crash, with Mount Fuji small in the background. It is distinctive because of the dramatic composition — the wave is much bigger than the mountain — and the use of blue and white. It was a woodblock print, which meant many copies could be made. It influenced European artists when they first saw Japanese art.",
        "common_errors": [
          "Describing only what the artwork shows without discussing technique or context",
          "Not connecting the artwork to its historical and cultural period"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Comparing artists from different times and cultures, explaining how context shapes their work, and drawing on this knowledge to inform their own creative practice.",
        "example_task": "Compare two landscape artists from different periods or cultures. How did their context influence their approach?",
        "example_response": "Constable painted English countryside in the 1800s with realistic detail and natural light — he wanted to capture the beauty of the landscape he knew. Hockney painted the same English landscape 200 years later using bright, almost unnatural colours on an iPad. Both love the English landscape but Constable worked from nature with oils, reflecting Romantic values, while Hockney uses digital tools that reflect our technological age. In my own landscape painting, I combined realistic observation with brighter, more expressive colour — influenced by both artists.",
        "common_errors": [
          "Listing facts about artists without making meaningful comparisons",
          "Not connecting knowledge of artists to their own creative work"
        ]
      }
    ]
  },
  {
    "concept_id": "AD-KS2-C006",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Trying new approaches and accepting that not everything will work perfectly, being willing to experiment.",
        "example_task": "Try a technique you haven't used before. It's okay if it doesn't turn out perfectly — what did you learn?",
        "example_response": "I tried printmaking with a polystyrene tile. My first print was messy because I used too much ink. I learned that a thin, even layer of ink works better. The second print was much clearer.",
        "common_errors": [
          "Refusing to try something new for fear of failure",
          "Giving up after one attempt instead of learning from mistakes"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Deliberately experimenting with techniques, materials or compositions to discover unexpected effects, building on what works.",
        "example_task": "Experiment with three different ways of applying paint to paper. Which creates the most interesting effect?",
        "example_response": "I tried splattering, dragging with a palette knife, and blowing through a straw. Splattering created random spots. The palette knife made thick, textured stripes. Blowing through a straw made branching patterns like tree roots. I liked the straw technique best and will use it in my final piece for the tree background.",
        "common_errors": [
          "Experimenting but not reflecting on or building on the results",
          "Not recording experiments so they can be referred to later"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Approaching creative work with genuine experimentation and risk-taking, developing personal ideas through iterative making, and reflecting critically on creative decisions.",
        "example_task": "Develop a piece of artwork through at least three iterations, changing something significant each time based on what you learn.",
        "example_response": "Version 1: I painted a cityscape but the buildings looked flat and lifeless. Version 2: I added collaged newspaper text to the buildings, giving them texture and a sense of the city's busy life. This was more interesting but the sky was empty. Version 3: I added a dramatic sky using wax resist, creating rain streaks. The combination of painting, collage and wax resist gives the piece energy that a single technique couldn't achieve. Each version taught me something that improved the next.",
        "common_errors": [
          "Treating each version as a completely new piece rather than developing the same idea",
          "Not being willing to change something that isn't working"
        ]
      }
    ]
  }
]
