[
  {
    "concept_id": "BU-KS4-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Identifies what enterprise means (starting and running a business), names reasons people start businesses (e.g. being their own boss, earning money, filling a gap in the market), and describes basic business aims such as survival and profit.",
        "example_task": "Explain two reasons why someone might start their own business and state two objectives a new business might have.",
        "example_response": "Reason 1: They have spotted a gap in the market for a product that does not currently exist locally. Reason 2: They want to be their own boss and make their own decisions. Objectives: survival in the first year and making enough profit to reinvest in growing the business.",
        "common_errors": [
          "Confusing aims (general long-term goals like profit) with objectives (specific measurable targets like '10% profit margin in year 1')",
          "Assuming all businesses start with the aim of maximising profit — many social enterprises prioritise community benefit"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explains the characteristics of successful entrepreneurs (risk-taking, innovation, determination), distinguishes between different business ownership structures (sole trader, partnership, Ltd), and describes how business objectives change over time (from survival to growth to profit maximisation).",
        "example_task": "Compare the advantages and disadvantages of operating as a sole trader versus a private limited company (Ltd).",
        "example_response": "Sole trader: advantages include simple to set up, full control over decisions, and all profits kept. Disadvantages include unlimited liability (personal assets at risk if the business fails), harder to raise finance, and heavy workload. Private limited company (Ltd): advantages include limited liability (shareholders lose only their investment), easier to raise capital by selling shares, and appears more professional. Disadvantages include more complex to set up (legal registration, articles of association), profits shared with shareholders, and accounts must be filed publicly.",
        "common_errors": [
          "Confusing limited liability with no liability — shareholders can still lose their investment, just not personal assets beyond that",
          "Not understanding that a sole trader can still employ staff — 'sole' refers to ownership, not workforce size"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses how entrepreneurial decisions are influenced by market conditions, competition, and economic context. Evaluates the risks and rewards of business decisions, and applies concepts to case study scenarios involving real businesses.",
        "example_task": "A social enterprise that makes reusable water bottles wants to expand from online-only to opening a physical shop. Analyse the risks and rewards of this decision.",
        "example_response": "Rewards: physical presence increases brand visibility and trust, allows customers to see and handle products before purchasing (reducing returns), creates local employment (aligned with social enterprise values), and potentially attracts walk-in trade from the local market. Risks: significant fixed costs (rent, rates, utilities, staff) increase the break-even point, cash flow pressure before the shop generates sufficient revenue, opportunity cost (capital could be invested in scaling online operations with lower overheads), and the shop may cannibalise online sales rather than creating new ones. Analysis: the decision should be evaluated against the social enterprise's objectives — if community engagement and local employment are core aims, the shop has value beyond profit. A market analysis of the local area (footfall, competition, demographics) would reduce uncertainty before committing.",
        "common_errors": [
          "Listing only risks or only rewards without balancing the analysis",
          "Not connecting the analysis to the specific type of business — the decision framework for a social enterprise differs from a purely profit-maximising firm"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Critically evaluates the relationship between entrepreneurship, economic conditions, and social impact. Analyses complex business decisions considering multiple stakeholder perspectives, ethical dimensions, and long-term strategic implications.",
        "example_task": "Evaluate the claim that 'entrepreneurs are the driving force of economic growth.' Consider different economic perspectives and provide evidence for and against.",
        "example_response": "For: Schumpeter's theory of creative destruction positions entrepreneurs as innovators who introduce new products, processes, and business models that displace existing firms, driving productivity gains and economic growth (e.g. Amazon disrupting retail, Uber disrupting taxis). Entrepreneurs create employment directly and through supply chains. Empirical evidence: SMEs account for 60% of UK private sector employment. Against: many new businesses fail (60% within 5 years), destroying resources and jobs. Much 'entrepreneurship' is necessity-driven (self-employment due to lack of alternatives) rather than innovation-driven, contributing little to productivity growth. Structural factors (infrastructure, education, legal frameworks) may matter more than individual entrepreneurs — Silicon Valley succeeds because of Stanford, venture capital, and immigration policy, not individual genius. Furthermore, some entrepreneurial innovation has negative externalities (gig economy reducing worker protections, tech platforms concentrating wealth). Evaluation: entrepreneurship is a necessary but insufficient condition for growth. The quality of entrepreneurship (innovative vs. replicative), the institutional environment that supports it, and the distribution of its benefits all determine whether it serves broad economic growth or narrow private enrichment.",
        "common_errors": [
          "Presenting entrepreneurship as universally positive without considering the failure rate, opportunity cost, and distributional effects",
          "Not distinguishing between different types of entrepreneurship — innovation-driven and necessity-driven entrepreneurship have very different economic effects"
        ]
      }
    ]
  },
  {
    "concept_id": "BU-KS4-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Identifies the purpose of market research (finding out what customers want) and names the four Ps of the marketing mix (product, price, place, promotion).",
        "example_task": "Explain what market research is and name two methods a business could use to find out about customer preferences.",
        "example_response": "Market research is gathering information about customer needs, preferences, and the market to help make better business decisions. Two methods: questionnaires (asking customers structured questions about their preferences) and focus groups (discussing a product idea with a small group of potential customers to get detailed opinions).",
        "common_errors": [
          "Confusing primary research (gathered first-hand by the business) with secondary research (existing data from other sources)",
          "Stating the purpose of market research is 'to sell more products' rather than to understand customer needs and inform decisions"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Distinguishes between primary and secondary research, qualitative and quantitative data, and applies the marketing mix to specific business scenarios. Explains how elements of the marketing mix are interrelated.",
        "example_task": "A new cafe is opening in a town centre. Recommend a marketing mix (product, price, place, promotion) and explain how the elements are connected.",
        "example_response": "Product: high-quality artisan coffee and homemade cakes — differentiated from chain coffee shops. Price: premium pricing (£3.50 for a latte) justified by the quality positioning — too low would undermine the artisan image. Place: town centre location with high footfall near offices (targeting lunchtime trade). Promotion: social media (Instagram food photography), opening week discount (10% off with a flyer), and loyalty card (every 10th coffee free). Connections: the premium price supports the artisan product positioning — discounting too heavily would contradict the quality message. The town centre place with office proximity determines the product range (takeaway options, quick lunch items) and the promotion channels (LinkedIn ads targeting local professionals).",
        "common_errors": [
          "Treating the four Ps as independent decisions rather than showing how they must be consistent with each other",
          "Recommending low prices for a premium product, not understanding that price communicates quality"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses market research data to identify trends and justify marketing decisions. Evaluates the effectiveness of different marketing strategies for different market segments. Applies concepts such as market segmentation, targeting, and positioning.",
        "example_task": "A sportswear company's market research shows that 60% of their customers are aged 16-25, but 30% of revenue comes from the over-40 segment who buy premium products. Recommend a marketing strategy that addresses both segments.",
        "example_response": "The data reveals two distinct segments with different value propositions: a large volume segment (16-25, price-sensitive, trend-driven) and a smaller high-value segment (40+, premium, quality/performance-driven). Strategy: maintain the core product range and social media marketing (TikTok, Instagram influencers) for the youth segment. Simultaneously, develop a premium sub-brand with higher-quality materials, more subdued branding, and targeted marketing through different channels (Facebook, running magazines, sports event sponsorship). The sub-brand prevents cannibalisation — the youth brand's cool factor is not diluted by association with older customers. Pricing: the youth range uses competitive pricing (penetration or competitive matching), while the premium sub-brand uses price skimming at launch. Risk: stretching across two segments can dilute brand identity. Mitigation: keep the sub-brands visually distinct with separate social media accounts.",
        "common_errors": [
          "Recommending a single marketing approach for all segments rather than tailoring the mix to each segment's characteristics",
          "Ignoring the revenue data and focusing only on customer volume — the over-40 segment is more profitable per customer"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Critically evaluates marketing theory and practice, analyses the ethical dimensions of marketing, and assesses the impact of digital technology and data analytics on modern marketing strategy.",
        "example_task": "Evaluate the ethical implications of using customer data and targeted advertising in digital marketing. Consider both business and consumer perspectives.",
        "example_response": "Digital marketing enables unprecedented precision — behavioural data (browsing history, purchase patterns, location) allows hyper-targeted advertising. Business benefits: higher conversion rates, lower cost per acquisition, and reduced marketing waste. Consumer benefits: more relevant advertising, personalised recommendations. However, ethical concerns are significant: (1) Consent and transparency — many consumers do not understand the extent of data collection (GDPR requires informed consent, but 'accept all cookies' defaults exploit inattention). (2) Manipulation risk — targeted advertising to vulnerable groups (children, problem gamblers, people in financial difficulty) raises exploitation concerns. (3) Filter bubbles — algorithmic targeting limits consumer exposure to alternatives, reducing genuine market competition. (4) Privacy erosion — the accumulation of behavioural data creates detailed personal profiles that consumers cannot easily control or delete. (5) Power asymmetry — businesses have sophisticated analytical tools; individual consumers cannot match this information advantage. Regulation (GDPR, proposed Online Safety Bill) attempts to rebalance, but enforcement lags behind technology. Ethical marketing should apply a reasonable consumer test: would a consumer who fully understood the data collection and targeting still engage? If the business relies on consumer ignorance, the practice is ethically questionable regardless of its legality.",
        "common_errors": [
          "Discussing only the business benefits of data-driven marketing without critically evaluating the consumer and societal implications",
          "Treating legal compliance as sufficient for ethical marketing — an action can be legal but still exploitative"
        ]
      }
    ]
  },
  {
    "concept_id": "BU-KS4-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Understands that businesses need to manage their money, knows the difference between revenue (money in) and costs (money out), and recognises that profit equals revenue minus costs.",
        "example_task": "A business sells 200 products at £10 each. The total costs are £1500. Calculate the revenue and profit.",
        "example_response": "Revenue = 200 × £10 = £2000. Profit = Revenue - Costs = £2000 - £1500 = £500.",
        "common_errors": [
          "Confusing revenue with profit — stating £2000 is the profit",
          "Not understanding that costs must be subtracted from revenue to find profit"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Calculates and interprets cash flow forecasts, distinguishes between fixed and variable costs, calculates break-even output, and explains the difference between cash and profit.",
        "example_task": "A business has fixed costs of £3000 per month. Each product costs £5 to make and sells for £15. Calculate the break-even output and explain why a profitable business might still have cash flow problems.",
        "example_response": "Contribution per unit = £15 - £5 = £10. Break-even = Fixed costs / Contribution per unit = £3000 / £10 = 300 units. A profitable business might have cash flow problems because profit is calculated over a period (e.g. yearly) while cash flow is about timing. If the business sells on credit (customers pay in 60 days) but must pay suppliers immediately, it can show an annual profit while running out of cash to pay this month's wages and rent. Cash flow is about when money arrives, not whether it will eventually arrive.",
        "common_errors": [
          "Confusing break-even output (number of units) with break-even revenue (in pounds)",
          "Stating that 'if a business is profitable it cannot have cash flow problems' — timing differences between income and expenditure are critical"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Constructs and analyses financial statements (profit and loss accounts, cash flow forecasts), calculates and interprets financial ratios (gross profit margin, net profit margin), and recommends actions to improve financial performance.",
        "example_task": "A business has revenue of £500,000, cost of sales of £300,000, and overheads of £150,000. Calculate the gross profit margin and net profit margin. The industry average net margin is 15%. Recommend two actions to improve performance.",
        "example_response": "Gross profit = £500,000 - £300,000 = £200,000. Gross profit margin = (200,000/500,000) × 100 = 40%. Net profit = £200,000 - £150,000 = £50,000. Net profit margin = (50,000/500,000) × 100 = 10%. The net margin is below the 15% industry average, while gross margin at 40% is healthy — the problem lies in overheads, not cost of sales. Recommendation 1: Review overhead costs — renegotiate rent, switch to remote working to reduce office space, or consolidate supplier contracts for better terms. Recommendation 2: Increase revenue without proportionally increasing overheads — cross-sell to existing customers (lower acquisition cost than new customers) or increase prices by 5% (if the market supports it, this would add £25,000 to net profit, raising the margin to 15%).",
        "common_errors": [
          "Recommending 'cut costs' or 'increase sales' generically without identifying which specific costs are the problem",
          "Not comparing financial ratios to industry benchmarks — a 10% margin might be excellent in grocery retail but poor in software"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Critically evaluates financial data in the context of business strategy, market conditions, and stakeholder interests. Analyses the limitations of financial statements, considers the ethical dimensions of financial decision-making, and assesses how short-term financial pressures can conflict with long-term sustainability.",
        "example_task": "A publicly listed company reports strong quarterly profits but has cut R&D spending by 40% and reduced employee training budgets to zero. Evaluate this financial performance from multiple stakeholder perspectives.",
        "example_response": "Shareholders (short-term): appear to benefit from higher profits and potential dividend increases. The share price may rise on the quarterly report. Shareholders (long-term): R&D cuts reduce future product pipeline — in technology or pharmaceutical sectors, this can be fatal within 3-5 years. The company is consuming its future to pay for its present. Employees: zero training budget reduces skill development, increases turnover (talented staff leave for firms that invest in them), and may increase error rates — a hidden cost not visible in this quarter's figures. Customers: reduced R&D means fewer new products and potentially declining quality as the company extracts value from existing products without reinvesting. Society: short-termism driven by quarterly reporting pressure is a systemic problem — it discourages the long-term investment that drives innovation and productivity growth. Evaluation: the profit figure is misleading without context. Accounting standards require revenue and cost matching, but cutting R&D and training creates a timing asymmetry — the cost reduction appears immediately in profits, but the consequences (weaker products, higher turnover) appear in future periods. Warren Buffett's principle is relevant: 'A business that cuts costs on human capital and innovation is a business eating its seed corn.' The reported profit is real but unsustainable.",
        "common_errors": [
          "Evaluating financial performance only through the lens of current period profit without considering the sustainability of the profit drivers",
          "Not recognising that financial statements are backward-looking — they report what has happened, not whether it is repeatable"
        ]
      }
    ]
  },
  {
    "concept_id": "BU-KS4-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Understands that businesses need employees, recognises that workers need motivation, and can name basic ways businesses motivate staff (pay, bonuses, friendly workplace).",
        "example_task": "Name three ways a business can motivate its employees.",
        "example_response": "Paying a good wage so employees feel fairly rewarded, offering training so employees can develop new skills, and giving employees some control over how they do their work so they feel trusted and valued.",
        "common_errors": [
          "Listing only financial methods of motivation and ignoring non-financial motivators",
          "Assuming that more pay always leads to more motivation without considering other factors"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explains motivation theories (Maslow's hierarchy of needs, Herzberg's two-factor theory, Taylor's scientific management) and applies them to explain business decisions about pay, job design, and working conditions.",
        "example_task": "Use Herzberg's two-factor theory to explain why a pay rise might not increase employee motivation in a factory with poor working conditions.",
        "example_response": "Herzberg distinguished between hygiene factors (pay, working conditions, company policy) and motivators (achievement, recognition, responsibility, interesting work). Hygiene factors prevent dissatisfaction but do not create motivation — they are necessary but not sufficient. If working conditions are poor (hygiene factor unmet), employees are dissatisfied. A pay rise addresses another hygiene factor but does not fix the poor conditions. Even if pay increases, dissatisfaction from poor conditions remains. Furthermore, pay is a hygiene factor — increasing it removes dissatisfaction about pay but does not create positive motivation. True motivation requires motivator factors such as recognition, responsibility, and meaningful work.",
        "common_errors": [
          "Stating that hygiene factors 'don't matter' — they must be adequate to prevent dissatisfaction, even though they don't create motivation",
          "Confusing Herzberg's hygiene factors with Maslow's lower-level needs — the theories overlap but are not identical"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses HR management decisions using motivation theory, evaluates different organisational structures and their impact on employees, and applies recruitment, selection, and training concepts to case study scenarios.",
        "example_task": "A tech startup is growing from 10 to 50 employees. Analyse how its HR practices should change, using motivation theory to support your recommendations.",
        "example_response": "At 10 employees, informal HR practices work: flat structure, face-to-face communication, intrinsic motivation from working closely with the founder (Maslow's self-actualisation/Herzberg's motivators — autonomy, purpose). At 50 employees: formalisation is needed. Organisational structure: introduce team leaders and clear roles to prevent confusion and duplication (span of control becomes unmanageable without layers). Recruitment: formal processes (job descriptions, structured interviews, skills testing) replace the founder's network hiring — necessary for fairness and legal compliance. Motivation challenge: employees hired early had autonomy and founder access (strong motivators). New employees may feel more distant — Herzberg would suggest enriching roles with variety and decision-making authority rather than relying on hierarchical management. Training: systematic onboarding and development programmes replace the 'learn by doing' approach — important for both skill development and employee retention (Maslow's esteem needs). Communication: regular team meetings and transparent updates replace informal conversations. The key risk is that formalisation creates bureaucracy that demotivates the original team — the startup must balance structure with the flexibility that attracted early employees.",
        "common_errors": [
          "Recommending rigid hierarchical structures without considering that they may damage the motivational environment that made the startup successful",
          "Applying motivation theories generically without tailoring recommendations to the specific organisational context"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Critically evaluates motivation theories and HRM practices, analyses the ethical dimensions of employment practices, and assesses how labour market changes (gig economy, automation, remote working) are transforming human resource management.",
        "example_task": "Evaluate whether motivation theories developed in the 20th century are still relevant to the modern workplace, considering the gig economy, remote working, and generational differences.",
        "example_response": "Maslow (1943) and Herzberg (1959) assumed long-term employment relationships where employer and employee have mutual obligations. The gig economy disrupts this: gig workers (Uber drivers, Deliveroo riders) have no employment security (Maslow's safety needs unmet), no career progression (esteem needs), and limited autonomy over how work is done (Herzberg's motivators absent). Taylor's piece-rate model ironically fits the gig economy better — payment per delivery, optimisation of individual output — but gig workers report high dissatisfaction despite flexible working, supporting Herzberg's point that hygiene factors must be met first. Remote working challenges both theories differently: self-actualisation may increase (more autonomy, less commuting) but belonging needs suffer (isolation, reduced team cohesion). Generational research suggests younger workers prioritise purpose and work-life balance over pay and promotion — aligning more with Herzberg's motivators than Taylor's assumptions. Evaluation: the core insights remain valid — people need security, belonging, recognition, and meaningful work. But the theories assumed a specific employment model (stable, full-time, on-site) that is fragmenting. Modern HRM must adapt: flexible contracts that still provide security, digital community-building for remote teams, and purpose-driven cultures that attract talent. The theories need updating, not replacing — they identified universal human needs, even if the workplace structures through which those needs are met have changed.",
        "common_errors": [
          "Dismissing historical motivation theories entirely because the modern workplace looks different",
          "Not recognising that the gig economy creates a tension between flexibility (valued by some workers) and security (needed by all), which motivation theory helps to analyse"
        ]
      }
    ]
  },
  {
    "concept_id": "BU-KS4-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Identifies that businesses affect and are affected by people and groups beyond the owners, and can name basic stakeholders (customers, employees, owners, local community).",
        "example_task": "Name four stakeholders of a supermarket and explain what each one wants from the business.",
        "example_response": "Customers want good quality products at fair prices. Employees want fair pay and good working conditions. Shareholders (owners) want the business to make profit so they receive dividends. The local community wants the supermarket to provide jobs and not cause traffic or noise problems.",
        "common_errors": [
          "Listing stakeholders without explaining what each stakeholder wants (their objectives/interests)",
          "Forgetting that the government is a stakeholder — it wants businesses to pay taxes and obey laws"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explains how stakeholder interests can conflict with each other, describes how external factors (economic, technological, environmental, legal) affect businesses, and analyses how businesses respond to changes in the external environment.",
        "example_task": "Explain how a decision to close a factory and move production overseas might create a stakeholder conflict. Identify which stakeholders benefit and which lose.",
        "example_response": "Benefits: shareholders gain from lower production costs and higher profits. Customers may benefit from lower prices. The overseas community gains employment. Losses: UK employees lose their jobs. The local UK community loses spending power, which affects other local businesses. UK suppliers lose contracts. The government loses tax revenue. Conflict: shareholders' interest in profit maximisation directly conflicts with employees' interest in job security and the community's interest in local economic stability. The business must manage this conflict — legally (redundancy procedures, consultation periods) and reputationally (negative publicity can damage brand value and reduce customer loyalty, offsetting cost savings).",
        "common_errors": [
          "Presenting the decision as purely financial without analysing the social and reputational costs",
          "Assuming all stakeholder conflicts have a clear 'right answer' — often the business must make trade-offs"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses the business environment using frameworks (PESTLE, stakeholder mapping), evaluates how businesses balance competing stakeholder demands, and assesses the impact of government policy, globalisation, and technological change on business strategy.",
        "example_task": "Conduct a PESTLE analysis for a UK electric vehicle manufacturer and identify the two most significant factors affecting its strategic decisions.",
        "example_response": "Political: UK government ban on new petrol/diesel car sales from 2035, plus subsidies for EV buyers (grant of up to £2,500) — strongly favourable. Economic: cost-of-living pressures reducing consumer spending on high-value items; high interest rates increasing borrowing costs for both the company and customers using car finance. Social: growing environmental awareness increasing demand for EVs; but 'range anxiety' and charging infrastructure concerns remain barriers. Technological: rapid battery technology improvement reducing costs and increasing range; but the pace of change means today's models risk rapid obsolescence. Legal: tightening emissions regulations (ULEZ expansion); EU battery regulation requiring recycling and ethical sourcing of materials. Environmental: pressure to demonstrate full lifecycle sustainability (mining of lithium and cobalt raises ethical concerns). Most significant: (1) Political — the 2035 ban creates guaranteed long-term demand, making the market direction certain. (2) Technological — battery costs and range are the key competitive differentiators. The company that achieves the best range at the lowest cost will dominate. Investment in R&D is therefore more important than marketing spend.",
        "common_errors": [
          "Listing PESTLE factors without analysing their relative importance or how they interact",
          "Treating all factors as equally significant rather than identifying which ones are most likely to determine strategic success"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Critically evaluates stakeholder theory and corporate social responsibility, analyses the tension between shareholder value and wider stakeholder interests, and assesses how globalisation, regulation, and societal expectations are reshaping the relationship between business and society.",
        "example_task": "Evaluate Milton Friedman's claim that 'the social responsibility of business is to increase its profits.' Consider stakeholder theory, CSR evidence, and recent corporate behaviour.",
        "example_response": "Friedman (1970) argued that managers' sole duty is to shareholders — spending corporate money on social causes is effectively taxing shareholders without their consent. This view underpinned the shareholder primacy model that dominated Anglo-American capitalism. Counter-arguments: (1) Freeman's stakeholder theory argues that businesses depend on all stakeholders (employees, customers, communities) and long-term profitability requires maintaining these relationships — exploiting any stakeholder for short-term profit is strategically self-defeating. (2) Empirical evidence: research (Eccles et al., 2014) shows that companies with strong ESG (Environmental, Social, Governance) performance outperform peers over 18-year periods — suggesting CSR and profitability are complementary, not competing. (3) Employee retention: companies with strong social purpose attract and retain talent, reducing recruitment costs. However, sceptics note: (1) Much corporate CSR is 'greenwashing' — marketing expenditure disguised as social responsibility. (2) The business case for CSR only works when the market rewards ethical behaviour — in commodity markets with price-sensitive consumers, ethical sourcing increases costs without price premiums. (3) Friedman's core point remains valid: if businesses pursue social goals inefficiently, resources would be better deployed through taxation and government spending, which has democratic accountability. Evaluation: the dichotomy between profit and social responsibility is false — but only in functioning markets with informed consumers and effective regulation. Where market failures exist (environmental externalities, information asymmetry), regulation must supplement voluntary CSR. The best evidence suggests stakeholder-oriented businesses are more sustainable, but this requires genuine integration of stakeholder interests into strategy, not superficial CSR reporting.",
        "common_errors": [
          "Accepting either Friedman's or stakeholder theory uncritically without examining the evidence and conditions under which each applies",
          "Equating CSR with charity — genuine CSR is about how the core business operates (supply chain ethics, environmental impact, employee treatment), not philanthropic donations"
        ]
      }
    ]
  },
  {
    "concept_id": "BU-KS4-C006",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Understands that businesses make products or deliver services, and that this involves using resources (materials, workers, equipment). Can name basic steps in production.",
        "example_task": "Describe the main steps involved in producing a wooden table in a furniture workshop.",
        "example_response": "Design the table (draw plans and measurements). Source the wood from a supplier. Cut the wood to size using saws. Join the pieces together (screws, glue, or joints). Sand the surfaces smooth. Apply a finish (varnish or paint). Quality check the finished table. Package and deliver to the customer.",
        "common_errors": [
          "Omitting the quality control step — checking the product meets standards before delivery",
          "Not mentioning the sourcing of materials as a key production step"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Distinguishes between production methods (job, batch, flow), explains the role of quality control and quality assurance, and describes how businesses manage their supply chain to ensure materials arrive when needed.",
        "example_task": "Compare job production and flow production. Explain which would be more suitable for manufacturing (a) wedding cakes and (b) canned drinks.",
        "example_response": "Job production: one item made at a time, customised to individual requirements, highly skilled workers, high unit cost. Suitable for wedding cakes — each one is unique to the customer's design, size, and flavour requirements. Flow production: continuous production of identical items on an assembly line, low skilled workers can operate machines, low unit cost due to economies of scale. Suitable for canned drinks — millions of identical cans are produced daily, and consumer demand requires consistency and high volume. The key difference is customisation versus standardisation: job production maximises flexibility, flow production maximises efficiency.",
        "common_errors": [
          "Stating that flow production is 'better' than job production without recognising that the appropriate method depends on the product and market",
          "Confusing batch production (a set quantity of identical items) with flow production (continuous production)"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses how businesses improve operational efficiency through methods such as lean production, just-in-time (JIT) stock management, and kaizen (continuous improvement). Evaluates the trade-offs between efficiency, flexibility, and quality in operations management.",
        "example_task": "Evaluate the benefits and risks of a car manufacturer adopting just-in-time (JIT) stock management.",
        "example_response": "Benefits: dramatically reduced stock holding costs (warehousing, insurance, deterioration — Toyota estimated 20-30% cost reduction), improved cash flow (not tying up capital in stock), less waste from obsolete or damaged stock, and quality problems are identified immediately (small batches mean defects are caught before thousands are produced). Risks: extreme vulnerability to supply chain disruption (the 2021 semiconductor shortage halted production lines globally because manufacturers had no buffer stock), requires reliable suppliers with guaranteed delivery times, any delay stops the entire production line (downtime costs can be enormous — estimated £10,000+ per minute for a car production line), and requires strong supplier relationships and geographical proximity. Evaluation: JIT works best in stable environments with reliable supply chains. The COVID-19 pandemic exposed its fragility — many manufacturers have since adopted 'just-in-case' buffer stocks for critical components while maintaining JIT for non-critical parts. The optimal approach balances efficiency with resilience.",
        "common_errors": [
          "Presenting JIT as universally beneficial without acknowledging its vulnerability to supply chain disruption",
          "Not recognising that JIT requires a complete supply chain transformation, not just reducing stock levels"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Critically evaluates how technology, globalisation, and sustainability pressures are transforming business operations. Analyses complex supply chain decisions considering ethical sourcing, environmental impact, and geopolitical risk alongside cost and efficiency.",
        "example_task": "Evaluate the tension between efficiency (global supply chains, lowest-cost sourcing) and resilience (local sourcing, diversified suppliers) in post-pandemic operations management. What should a UK manufacturer prioritise?",
        "example_response": "Pre-pandemic operations management prioritised efficiency: global supply chains sourced from the lowest-cost producer (often China), JIT minimised stock, and single-source supplier relationships maximised bargaining power and quality consistency. COVID-19 and the Suez Canal blockage exposed the fragility: single points of failure in long supply chains caused cascading shutdowns. Post-pandemic, resilience requires: (1) dual/multi-sourcing — using multiple suppliers across different geographies (increases cost but reduces disruption risk), (2) nearshoring — moving some production closer to the end market (e.g. Eastern Europe instead of East Asia, reducing lead times from 8 weeks to 1-2 weeks), (3) strategic buffer stock for critical components (abandoning pure JIT for a hybrid model), (4) digital supply chain visibility (real-time tracking and predictive analytics to identify risks earlier). However, resilience costs money: diversified supply chains have higher per-unit costs, buffer stock ties up capital, and nearshoring sacrifices labour cost advantages. The optimal balance depends on the product: for high-value, time-sensitive products (medical devices, automotive), resilience justifies the premium. For commoditised, low-margin products (fast fashion, basic electronics), cost efficiency may still dominate. A UK manufacturer should adopt a tiered approach: resilience for critical inputs, efficiency for commodity inputs, and continuous scenario planning to adjust the balance as geopolitical conditions evolve. The era of optimising purely for cost is over — risk-adjusted total cost of ownership is the new decision framework.",
        "common_errors": [
          "Treating the efficiency-resilience trade-off as binary rather than recognising that different components within the same product may warrant different sourcing strategies",
          "Not considering that 'reshoring' to the UK faces practical constraints — skills shortages, higher labour costs, and limited manufacturing infrastructure after decades of offshoring"
        ]
      }
    ]
  }
]
