[
  {
    "concept_id": "DT-KS2-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Carrying out basic research before designing: examining an existing product or asking a simple question about user needs.",
        "example_task": "Before designing a new pencil case, look at three existing pencil cases. What do you notice about them?",
        "example_response": "They all have a zip or fastener. The biggest one holds more but is harder to fit in a bag. The smallest one is easy to carry but only fits a few pencils.",
        "common_errors": [
          "Looking at products without making observations about design features",
          "Starting to design without doing any research"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Conducting structured research (user interviews, product analysis, or contextual investigation) and using findings to create design criteria.",
        "example_task": "Interview three classmates about what they want in a pencil case. Use their answers to write your design criteria.",
        "example_response": "I asked three people. They all wanted a pencil case that holds at least 10 items, is easy to open with one hand, and fits in their bag. Two wanted a pocket for a rubber. Criteria: must hold 10+ items, open with one hand, fit in a standard school bag, include a small pocket.",
        "common_errors": [
          "Writing criteria based on own preferences rather than research findings",
          "Conducting research but not connecting it to the design brief"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using multiple research methods to inform a design, translating findings into specific, measurable design criteria, and justifying design choices with evidence.",
        "example_task": "Research, design and justify a storage solution for a classroom art area. Use at least two research methods.",
        "example_response": "I surveyed the class about what art materials they use most, and I measured the shelf space available. I also analysed an existing storage system to see what works. My criteria: must fit in a 60cm x 40cm space, hold brushes upright so they don't get bent, separate paints from paper, and be accessible to the shortest pupil. I chose a tiered rack design because the survey showed brushes and paints are used most, and tiered storage makes best use of the limited height.",
        "common_errors": [
          "Designing a solution that doesn't address the actual user needs identified in research",
          "Not being able to trace design decisions back to specific research findings"
        ]
      }
    ]
  },
  {
    "concept_id": "DT-KS2-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Drawing a labelled sketch of a design idea showing the main features and materials.",
        "example_task": "Draw your design for a phone stand. Label the parts and what materials you will use.",
        "example_response": "I drew a phone stand with a back support and a front lip. Labels: 'back support — card', 'base — wood', 'front lip — card strip to stop phone sliding'.",
        "common_errors": [
          "Drawing without any labels or annotations",
          "Drawing an artistic picture rather than a design that could be made"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using annotated sketches with dimensions, and creating at least one alternative design to compare options.",
        "example_task": "Draw two different designs for the phone stand. Add measurements and explain which you would choose and why.",
        "example_response": "Design A is a simple angled back rest, 12cm tall and 8cm wide. Design B is a box shape with a slot. I chose Design A because it uses less material and is easier to make, but Design B would be more stable. I'll add a wider base to Design A to fix the stability problem.",
        "common_errors": [
          "Not including dimensions so the design cannot be accurately made",
          "Not comparing the designs against criteria — just choosing a favourite"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Communicating designs using annotated sketches, cross-sections or exploded diagrams, with dimensions and construction notes sufficient for someone else to follow.",
        "example_task": "Create a design drawing for your project that another pupil could use to make the product without asking you questions.",
        "example_response": "I drew a front view and a side cross-section showing how the layers fit together. I included all measurements in cm, listed materials for each part, numbered the assembly steps, and drew an exploded diagram showing how the three pieces slot together. I also noted where I would use glue and where I would use screws.",
        "common_errors": [
          "Drawing only one view when multiple views are needed to understand the design",
          "Not including enough detail for someone else to build from the drawing"
        ]
      }
    ]
  },
  {
    "concept_id": "DT-KS2-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying gears, pulleys and cams in existing products or construction kits and describing what movement they create.",
        "example_task": "Look at this gear mechanism. What happens when you turn the big gear?",
        "example_response": "When I turn the big gear, the small gear turns too but it goes in the opposite direction. The small gear also spins faster than the big gear.",
        "common_errors": [
          "Not noticing that meshed gears turn in opposite directions",
          "Thinking both gears turn at the same speed"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explaining how gears, pulleys or cams change the speed, direction or type of movement, and incorporating a simple mechanism into a product.",
        "example_task": "Add a cam mechanism to your toy so that a figure moves up and down when you turn a handle.",
        "example_response": "I attached an egg-shaped cam to the axle. When I turn the handle, the axle spins and the cam pushes the follower up and down. The egg shape makes it go up slowly and drop down quickly.",
        "common_errors": [
          "Using a round cam and wondering why the follower doesn't move up and down",
          "Not securing the cam to the axle so it slips instead of turning"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Selecting and combining mechanical systems to achieve a specific movement in a designed product, explaining the mechanical advantage and how components interact.",
        "example_task": "Design a fairground ride model that uses gears to make the ride spin more slowly than the handle you turn. Explain your gear choice.",
        "example_response": "I used a small driver gear with 10 teeth connected to a large driven gear with 30 teeth. This gives a 3:1 ratio, so the ride spins three times slower than I turn the handle. This makes it look realistic — real fairground rides don't spin as fast as you turn a crank. The large gear is attached to the ride platform.",
        "common_errors": [
          "Choosing gears without considering the ratio and its effect on speed",
          "Not being able to explain why the mechanism produces the desired movement"
        ]
      }
    ]
  },
  {
    "concept_id": "DT-KS2-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Building a simple working series circuit with a battery, switch and one output component (bulb or buzzer).",
        "example_task": "Connect a battery, switch and bulb so the bulb lights up when the switch is on.",
        "example_response": "I connected a wire from the battery to the switch, then from the switch to the bulb, then from the bulb back to the battery. When I close the switch, the bulb lights up.",
        "common_errors": [
          "Leaving a gap in the circuit so current cannot flow",
          "Not understanding that the switch must be closed for the circuit to work"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Incorporating a working circuit into a designed product and using a circuit diagram with standard symbols to plan it.",
        "example_task": "Design a lighthouse model with a light that can be switched on and off. Draw the circuit diagram first.",
        "example_response": "My circuit has a battery, a switch and an LED. I drew the diagram using the standard symbols. The LED goes in the top of the lighthouse model and the switch is on the outside so you can turn the light on and off. The battery is hidden inside the base.",
        "common_errors": [
          "Not using standard circuit symbols in the diagram",
          "Placing the LED the wrong way round (LEDs only work in one direction)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Designing and building a product with a more complex circuit incorporating multiple components, and troubleshooting when the circuit doesn't work.",
        "example_task": "Build a model alarm system with a buzzer that sounds when a door opens, and an LED that shows the system is armed.",
        "example_response": "I used a switch as the 'door sensor' — when the door opens, the switch closes and the buzzer sounds. A separate switch keeps the LED on to show the system is active. When I tested it, the buzzer didn't work — I traced the circuit and found a loose wire at the battery terminal. After fixing it, both the LED and buzzer work correctly.",
        "common_errors": [
          "Not being able to diagnose why a circuit isn't working (checking connections systematically)",
          "Designing a circuit that is too complex to debug"
        ]
      }
    ]
  },
  {
    "concept_id": "DT-KS2-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Using a simple program to control one output (e.g. turning an LED on and off using a micro:bit or similar device).",
        "example_task": "Write a program that makes an LED blink on and off every second.",
        "example_response": "I used three blocks: 'turn LED on', 'wait 1 second', 'turn LED off', 'wait 1 second', all inside a 'forever' loop.",
        "common_errors": [
          "Forgetting to put the instructions in a loop so the LED only blinks once",
          "Not including a wait command so the blink is too fast to see"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Programming a device to respond to a sensor input by controlling an output, integrating this into a DT product.",
        "example_task": "Program a night light that turns on automatically when the room gets dark, using the micro:bit's light sensor.",
        "example_response": "I read the light level from the sensor. If the level is below 50, I turn the LED on. If it is above 50, I turn it off. I put this in a forever loop so it keeps checking. I built a card housing for the micro:bit so it looks like a bedside lamp.",
        "common_errors": [
          "Not setting an appropriate threshold value for the sensor",
          "Testing the program without integrating it into the product design"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Designing a product that uses computing control purposefully, programming multiple inputs and outputs, and evaluating the program as part of the product evaluation.",
        "example_task": "Design and program a smart plant watering reminder that uses a moisture sensor and displays a message when the plant needs water.",
        "example_response": "My program reads the moisture sensor every 10 minutes. If the reading is below 30, it displays 'Water me!' on the LED matrix and plays a sound. If the level is fine, it shows a happy face. I tested with dry and wet soil. In my evaluation, I noted the threshold needed adjusting — 30 was too low for some plants. The program is part of the product design, not separate from it.",
        "common_errors": [
          "Treating the programming as a separate computing task rather than part of the DT project",
          "Not testing and refining the threshold values for real-world conditions"
        ]
      }
    ]
  },
  {
    "concept_id": "DT-KS2-C006",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Measuring and cutting materials to a marked line with reasonable accuracy using basic tools.",
        "example_task": "Measure and cut a piece of card that is 20cm long. Use a ruler and pencil to mark it first.",
        "example_response": "I put the ruler along the edge, marked 20cm with a pencil, drew a line across using the ruler, then cut along the line. My piece is 20cm.",
        "common_errors": [
          "Not measuring from the zero mark on the ruler",
          "Cutting without marking first, leading to inaccurate lengths"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Measuring, marking out and cutting with accuracy across different materials, understanding that accuracy in early stages prevents problems later.",
        "example_task": "Mark out and cut three pieces of wood that are all exactly 12cm long. They need to be the same length to fit together.",
        "example_response": "I measured each piece carefully using a ruler, marking clearly with a pencil line all the way around. I used a saw and cut just outside the line, then sanded to the exact mark. I checked all three against each other — they match.",
        "common_errors": [
          "Measuring only one piece carefully and estimating the others",
          "Cutting on the line rather than just outside it, losing material and ending up too short"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Working with precision across the full making process, selecting appropriate tools and techniques for each material, and explaining how accuracy affects the quality of the finished product.",
        "example_task": "Make a box with a lid that fits snugly. All edges must be straight and the lid must close properly.",
        "example_response": "I measured and marked all pieces on a cutting mat with a steel ruler. I scored fold lines with a bone folder so they fold cleanly. I cut with a craft knife against the ruler for straight edges. The lid fits because I made it 2mm larger than the box opening on each side — this tolerance means it sits on top without being too loose or too tight. If my measurements had been even 5mm off, the lid wouldn't fit.",
        "common_errors": [
          "Not planning for tolerance — making the lid exactly the same size as the box so it doesn't fit",
          "Using imprecise tools (scissors instead of a craft knife) for work that requires straight edges"
        ]
      }
    ]
  },
  {
    "concept_id": "DT-KS2-C007",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying simple material properties (strong, flexible, waterproof, soft) and choosing a material for a stated purpose.",
        "example_task": "Which material would be better for a waterproof bag: cotton or plastic? Why?",
        "example_response": "Plastic would be better because it is waterproof. Cotton would absorb water and the things inside would get wet.",
        "common_errors": [
          "Choosing based on colour or familiarity rather than functional properties",
          "Not being able to name the relevant property that makes the material suitable"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Considering both functional and aesthetic properties when selecting materials, and explaining the trade-offs between them.",
        "example_task": "Choose a material for a book cover. It must be strong and look attractive. What are the trade-offs?",
        "example_response": "Card is strong but looks plain unless I decorate it. Fabric looks attractive and has nice textures but is harder to keep clean and might not be stiff enough. I chose card with a fabric covering — the card provides strength and the fabric provides the attractive appearance.",
        "common_errors": [
          "Considering only function or only aesthetics, not both",
          "Not recognising that combining materials can solve trade-off problems"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Analysing materials systematically against multiple criteria and making justified selections, considering functional performance, aesthetic quality and fitness for purpose.",
        "example_task": "You are designing packaging for a fragile gift. Compare three possible materials and select the best one. Justify your choice.",
        "example_response": "Corrugated card: strong, lightweight, protects well, but looks plain. Foam: excellent protection, but expensive and not easy to wrap neatly. Tissue with bubble wrap: looks attractive outside, protects inside, lightweight, affordable. I chose tissue with bubble wrap because it scores well on all criteria — protection, appearance, cost and weight. The combination solves the problem better than any single material.",
        "common_errors": [
          "Choosing a material without comparing alternatives",
          "Not using criteria systematically — just going with initial instinct"
        ]
      }
    ]
  },
  {
    "concept_id": "DT-KS2-C008",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Examining a product and describing its purpose, materials and one feature of how it works.",
        "example_task": "Look at this torch. What is it for? What is it made of? How does it work?",
        "example_response": "It is for seeing in the dark. It is made of plastic and has glass over the light. You press the button and the light comes on — there must be a battery and a bulb inside.",
        "common_errors": [
          "Describing only the outside appearance without thinking about how it works",
          "Not identifying the purpose beyond the obvious"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Analysing a product using a structured framework: purpose, user, materials, construction, mechanisms and fitness for purpose.",
        "example_task": "Investigate this pencil sharpener. Analyse it using our framework: who uses it, what it's made of, how it's constructed, and how well it works.",
        "example_response": "Purpose: sharpening pencils. Users: schoolchildren. Materials: plastic body, steel blade. Construction: the blade is screwed into the body at a specific angle. Mechanism: the pencil turns against the angled blade which shaves off wood and graphite. Fitness for purpose: works well for standard pencils but can't sharpen thick ones. The shavings container is small and fills up quickly.",
        "common_errors": [
          "Skipping parts of the analytical framework",
          "Describing without analysing — saying what it is but not how well it performs"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Comparing products systematically, evaluating strengths and weaknesses, and using findings to inform their own design work.",
        "example_task": "Compare two different water bottles. Which is better designed? How will your findings inform your own design?",
        "example_response": "Bottle A: steel, keeps water cold, durable, but heavy and expensive. Bottle B: plastic, lightweight, cheap, but scratches easily and doesn't insulate. Bottle A is better for long use; Bottle B is better for young children who might drop it. For my design, I would combine ideas: a lightweight material with insulation, and a secure lid like Bottle A's screw cap rather than Bottle B's flip top which leaks.",
        "common_errors": [
          "Declaring one product 'better' without considering different user needs",
          "Analysing products without connecting findings to their own design work"
        ]
      }
    ]
  },
  {
    "concept_id": "DT-KS2-C009",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recalling a significant designer, inventor or design event and stating what they did or created.",
        "example_task": "Who was Isambard Kingdom Brunel and what did he design?",
        "example_response": "Brunel was a famous engineer. He designed bridges, tunnels and ships, including the Great Western Railway and the SS Great Britain.",
        "common_errors": [
          "Confusing the individual with another historical figure",
          "Not being able to name a specific creation or achievement"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing the problem a designer or inventor was solving and explaining how their solution changed people's lives.",
        "example_task": "What problem was James Dyson trying to solve with his vacuum cleaner? How did his invention change things?",
        "example_response": "Traditional vacuum cleaners used bags that clogged up and lost suction over time. Dyson invented a bagless vacuum using cyclone technology that doesn't lose suction. This changed vacuum cleaners because now most are bagless. It shows how one person's frustration with an existing product can lead to a better design.",
        "common_errors": [
          "Describing the invention without explaining the problem it solved",
          "Not connecting the invention to its impact on everyday life"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining how a design innovation reflects its historical and cultural context, and discussing how design and technology have evolved over time.",
        "example_task": "How did the Industrial Revolution change the way products were made? What were the benefits and drawbacks?",
        "example_response": "Before the Industrial Revolution, products were made by hand, one at a time, by skilled craftspeople. Machines allowed mass production — making many identical items quickly and cheaply. This made products affordable for more people but meant factory workers did repetitive jobs in poor conditions. Skilled craft workers lost their livelihoods. Design also changed — products were designed for machine production, not individual craftsmanship. Today we still benefit from mass production but are returning to valuing handmade quality.",
        "common_errors": [
          "Presenting the Industrial Revolution as purely positive or purely negative",
          "Not connecting historical changes in production to modern design and manufacturing"
        ]
      }
    ]
  },
  {
    "concept_id": "DT-KS2-C010",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Following a simple recipe to prepare a dish, demonstrating safe food handling and basic techniques (washing, chopping, mixing).",
        "example_task": "Follow this recipe to make a fruit salad. Wash, peel and chop the fruit safely.",
        "example_response": "I washed the grapes and apple. I peeled the orange. I used the bridge technique to hold and chop the apple into small pieces. I mixed all the fruit in a bowl.",
        "common_errors": [
          "Not washing hands or fruit before starting",
          "Using the knife unsafely — cutting towards the body or using the wrong grip"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using a range of cooking techniques (chopping, grating, boiling, baking) with increasing independence, and understanding why food hygiene matters.",
        "example_task": "Make a simple pasta sauce using chopping, frying and simmering techniques.",
        "example_response": "I washed my hands and put on an apron. I chopped onions using the claw grip to protect my fingers. I fried the onions in oil on a low heat until soft. I added tinned tomatoes and herbs and simmered the sauce for 15 minutes, stirring occasionally. I cleaned up as I went.",
        "common_errors": [
          "Having the heat too high and burning food",
          "Not understanding why simmering is different from boiling"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Planning and cooking a dish as part of the design-make-evaluate cycle: researching, adapting a recipe, cooking it, and evaluating the result against criteria.",
        "example_task": "Design and cook a healthy savoury snack for your class. Research, adapt a recipe, cook it, and evaluate.",
        "example_response": "I researched what snacks the class enjoys and checked for allergies. I adapted a flapjack recipe to make it savoury by replacing sugar with cheese and herbs. I measured ingredients accurately, mixed, pressed into a tin and baked for 20 minutes at 180°C. In evaluation, the class rated flavour 4/5 and texture 3/5. I would add more cheese next time for stronger flavour and press the mixture more firmly for better texture.",
        "common_errors": [
          "Cooking without first designing or adapting the recipe",
          "Not connecting the cooking process to the DT design-make-evaluate cycle"
        ]
      }
    ]
  },
  {
    "concept_id": "DT-KS2-C011",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying some foods that grow at certain times of year in the UK and understanding that food comes from farms.",
        "example_task": "Which of these fruits grow in the UK in summer: strawberries, bananas, apples, oranges?",
        "example_response": "Strawberries grow in the UK in summer. Apples grow in the UK too but in autumn. Bananas and oranges don't grow in the UK because it's too cold.",
        "common_errors": [
          "Thinking all fruit is available year-round regardless of season",
          "Not knowing which fruits grow in the UK and which are imported"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explaining what seasonality means and why eating seasonal, local food can be better for the environment.",
        "example_task": "What does 'seasonal food' mean? Why might it be better to eat strawberries in June rather than January?",
        "example_response": "Seasonal food means food that naturally grows at a particular time of year. UK strawberries grow in June and are fresh. In January, strawberries have to be flown from Spain or grown in heated greenhouses, which uses lots of energy and fuel. Seasonal strawberries taste better, cost less and have a smaller environmental impact.",
        "common_errors": [
          "Not connecting food miles and greenhouse growing to environmental impact",
          "Thinking 'seasonal' means the same thing as 'organic'"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Tracing a food product from source to plate, explaining each stage of production, processing and distribution, and evaluating the environmental and ethical implications.",
        "example_task": "Trace the journey of a bar of chocolate from cocoa farm to shop shelf. What are the ethical and environmental issues?",
        "example_response": "Cocoa beans are grown on farms in West Africa (primary production). They are fermented, dried and shipped to factories in Europe (transport). At the factory, they are roasted, ground, mixed with sugar and milk, and moulded into bars (secondary processing). The bars are packaged, distributed to shops and sold (tertiary sector). Ethical issues: some cocoa farmers are paid very little, and child labour has been reported. Environmental issues: shipping adds to carbon emissions, and deforestation for cocoa farming destroys habitats. Fairtrade chocolate addresses some ethical concerns by guaranteeing a fair price.",
        "common_errors": [
          "Describing the journey without addressing ethical or environmental implications",
          "Presenting a one-sided view without acknowledging complexity"
        ]
      }
    ]
  }
]
