[
  {
    "concept_id": "DT-KS1-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Following a simple design-make-evaluate sequence with adult guidance, understanding that making involves planning before starting.",
        "example_task": "Before you make your puppet, draw a picture of what you want it to look like.",
        "example_response": "I drew my puppet with a big head, two arms and a pointy hat. I want to use felt for the body.",
        "common_errors": [
          "Starting to make immediately without any planning",
          "Drawing a picture that has no connection to what they intend to make"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Completing the design-make-evaluate cycle with some independence, referring back to their design during making and identifying one improvement after.",
        "example_task": "Make your puppet, then compare it to your design. What went well? What would you change?",
        "example_response": "I followed my design and the body shape is right. The arms keep falling off because I used tape — next time I would use stitching or a stronger join.",
        "common_errors": [
          "Abandoning the design completely during making without reflecting on why",
          "Evaluating only the appearance and not the function of the product"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using the design-make-evaluate cycle independently, making purposeful changes during making based on testing, and evaluating against the original design criteria.",
        "example_task": "Design, make and evaluate a container that holds at least five pencils and stands up by itself. Test it during making and improve if needed.",
        "example_response": "My design was a tube shape but when I tested it, it kept falling over. I added a wider base using extra card, which made it stable. It holds seven pencils, which is more than five. My criteria said it must stand up and hold five pencils — it does both.",
        "common_errors": [
          "Not testing during making and only discovering problems at the end",
          "Not connecting the evaluation back to the original design criteria"
        ]
      }
    ]
  },
  {
    "concept_id": "DT-KS1-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Stating who a product is for and one thing it must do, with adult prompts.",
        "example_task": "Who will use the bag you are making? What must it do?",
        "example_response": "The bag is for me. It must hold my reading book.",
        "common_errors": [
          "Giving vague criteria like 'it must be good' or 'it must be nice'",
          "Not identifying a user for the product"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Generating two or three simple, checkable design criteria that address function and user needs.",
        "example_task": "Write three rules your bag must follow to be successful.",
        "example_response": "1. It must hold a reading book without it falling out. 2. It must have a handle I can carry. 3. It must be strong enough not to tear.",
        "common_errors": [
          "Writing criteria that cannot be tested or checked",
          "Focusing only on aesthetics without addressing function"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Creating design criteria independently that address function, aesthetics and user needs, then using them to evaluate the finished product.",
        "example_task": "Write design criteria for a pencil case for a Year 1 pupil. After making it, check each criterion.",
        "example_response": "Criteria: 1. Must hold at least 6 pencils. 2. Must open and close easily for small hands. 3. Must be colourful and appealing to a 5-year-old. 4. Must be strong enough for daily use. Evaluation: Holds 8 pencils (pass), fastener works easily (pass), I used bright fabric (pass), stitching is secure (pass).",
        "common_errors": [
          "Writing criteria after making rather than before",
          "Not checking each criterion individually during evaluation"
        ]
      }
    ]
  },
  {
    "concept_id": "DT-KS1-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying different materials by name (card, fabric, wood, plastic) and describing one property of each.",
        "example_task": "Feel these materials. What is each one called? Is it bendy or stiff?",
        "example_response": "This is card — it is a bit stiff but I can bend it. This is wood — it is very stiff. This is fabric — it is very bendy.",
        "common_errors": [
          "Not knowing the names of common materials",
          "Describing only how materials look, not how they feel or behave"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Choosing a material for a specific purpose and explaining why it is suitable based on its properties.",
        "example_task": "You are making a rain hat. Which material would you choose: paper, plastic or wool? Explain why.",
        "example_response": "I would choose plastic because it is waterproof. Paper would get soggy in the rain and wool would absorb the water.",
        "common_errors": [
          "Choosing materials based on colour preference rather than functional properties",
          "Not being able to explain why a material is or isn't suitable"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Comparing materials systematically and selecting the most appropriate one by weighing up multiple properties against design criteria.",
        "example_task": "You need a material for a bridge in your model village. It must be strong, stiff and light. Compare card, wood and plastic. Which is best?",
        "example_response": "Wood is strong and stiff but heavy. Card is light but not very strong — it bends under weight. Thin plastic can be stiff and light but might crack. I think thin wood (lolly sticks) would be best because it is strong enough, fairly stiff, and not too heavy for the model.",
        "common_errors": [
          "Considering only one property instead of weighing up several",
          "Not recognising that the 'best' material depends on the specific requirements"
        ]
      }
    ]
  },
  {
    "concept_id": "DT-KS1-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Building a simple freestanding structure from given materials, exploring how to stop it falling over.",
        "example_task": "Use these cardboard tubes and tape to build a tower that stands up on its own.",
        "example_response": "I stood three tubes up and taped them together. Then I spread them out at the bottom so it didn't wobble.",
        "common_errors": [
          "Building a tall, narrow structure that immediately falls over",
          "Using excessive tape or glue instead of thinking about the structure's shape"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explaining why some structures are stronger than others and using shapes like triangles to add strength.",
        "example_task": "Make a bridge from paper that can hold a toy car. How can you make the paper stronger?",
        "example_response": "I folded the paper into a zigzag shape, like a concertina. This made it much stiffer than a flat piece of paper. The folds act like little walls that stop the paper bending.",
        "common_errors": [
          "Believing thicker material is always stronger, without considering shape",
          "Not understanding why folding or triangulating makes structures stronger"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Designing and building a structure that meets a specific brief, explaining how the shape, materials and joining methods contribute to its strength and stability.",
        "example_task": "Design and build a shelter for a toy animal that is at least 15cm tall and can support a book placed on top.",
        "example_response": "I made four corner pillars from rolled newspaper tubes because tubes are stronger than flat paper. I used triangular braces between the pillars to stop them leaning. The roof is corrugated card for stiffness. It is 18cm tall and held the book. The triangles and tubes make it strong even though the materials are light.",
        "common_errors": [
          "Building without considering load-bearing requirements",
          "Not being able to explain why their design choices contribute to strength"
        ]
      }
    ]
  },
  {
    "concept_id": "DT-KS1-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Creating a simple moving mechanism (lever or slider) with adult support, observing that pushing or pulling creates movement.",
        "example_task": "Use a split pin to attach this card arm to the body. Push the arm — what happens?",
        "example_response": "When I push the arm it moves around the split pin. The split pin is in the middle and the arm swings up and down.",
        "common_errors": [
          "Fixing the split pin too tightly so the mechanism cannot move",
          "Not understanding that the split pin is the pivot point"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Incorporating a mechanism (lever, slider or wheel and axle) into a product to create intentional movement.",
        "example_task": "Make a moving picture where a character waves their arm using a lever mechanism.",
        "example_response": "I cut out a character and a separate arm. I attached the arm with a split pin at the shoulder. I added a card strip at the back so I can push it from behind to make the arm wave.",
        "common_errors": [
          "Creating movement that doesn't relate to the product's purpose",
          "Making the mechanism visible from the front when it should be hidden"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Choosing and combining appropriate mechanisms for a design brief, explaining how the mechanism works and why they selected it.",
        "example_task": "Design a card with a moving part for a younger child. Choose the best mechanism and explain your choice.",
        "example_response": "I chose a slider mechanism because it is simple and safe for a small child to use — they just pull a tab. I made a fish that slides across a sea scene. The slider is a card strip that moves through two slots. I chose this instead of a lever because the sliding movement looks like swimming, which matches the fish design.",
        "common_errors": [
          "Choosing a mechanism without considering the user or the intended movement",
          "Not being able to explain how the mechanism converts the input motion to the output"
        ]
      }
    ]
  },
  {
    "concept_id": "DT-KS1-C006",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Naming some foods from different food groups and understanding that eating different types of food keeps us healthy.",
        "example_task": "Sort these foods into groups: apple, bread, chicken, butter, carrot. Which group helps us grow?",
        "example_response": "Fruits: apple, carrot. Bread and cereals: bread. Meat: chicken. Fats: butter. Chicken helps us grow because it has protein.",
        "common_errors": [
          "Not recognising that a carrot is a vegetable, not a fruit",
          "Thinking one food group is 'bad' rather than needed in smaller amounts"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explaining why a varied diet is important and giving examples of meals that include foods from several groups.",
        "example_task": "Plan a lunch that includes foods from at least three food groups. Explain why variety matters.",
        "example_response": "Sandwich with bread (grains), chicken (protein) and lettuce (vegetable), plus an apple (fruit) and milk (dairy). Variety matters because no single food has everything our body needs — we need different nutrients from different foods to stay healthy and have energy.",
        "common_errors": [
          "Planning a meal from only one food group",
          "Describing foods as 'healthy' or 'unhealthy' in absolute terms rather than discussing balance"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using the Eatwell Guide to plan balanced meals and explaining what different nutrients do for the body.",
        "example_task": "Using the Eatwell Guide, plan a balanced day of meals. Explain how each food group contributes to health.",
        "example_response": "Breakfast: porridge (carbohydrates for energy) with berries (vitamins). Lunch: jacket potato (carbs) with beans (protein for growth) and cheese (calcium for bones). Dinner: rice with fish (protein and healthy fats) and vegetables (fibre and vitamins). The Eatwell Guide shows the biggest section should be starchy foods and fruit/veg, with smaller portions of protein and dairy.",
        "common_errors": [
          "Not understanding the proportions shown on the Eatwell Guide",
          "Confusing what different nutrients do (e.g. thinking protein gives energy)"
        ]
      }
    ]
  },
  {
    "concept_id": "DT-KS1-C007",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying whether common foods come from plants or animals.",
        "example_task": "Sort these foods into 'from a plant' and 'from an animal': milk, apple, egg, bread, cheese, potato.",
        "example_response": "From a plant: apple, potato. From an animal: milk, egg, cheese. Bread is made from wheat, which is a plant.",
        "common_errors": [
          "Not knowing that bread comes from wheat (a plant)",
          "Thinking cheese comes from a plant because it doesn't look like it came from an animal"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing the journey of a food from its source to the plate, identifying at least two stages.",
        "example_task": "Where does milk come from? Describe the journey from the farm to your glass.",
        "example_response": "Milk comes from cows on a farm. The farmer milks the cows using a machine. The milk goes to a factory where it is heated to make it safe (pasteurised) and put in bottles or cartons. Then it is taken to the shop in a lorry and we buy it.",
        "common_errors": [
          "Thinking milk comes directly from the shop without any processing",
          "Not knowing that pasteurisation is a necessary step for safety"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining that food production involves farming, processing and transport, and beginning to understand seasonality — that some foods grow at certain times of year.",
        "example_task": "Why can we buy strawberries in winter even though they grow in summer in the UK?",
        "example_response": "Strawberries grow naturally in the UK in summer. In winter, the strawberries in shops are either grown in heated greenhouses in the UK or flown in from warmer countries like Spain or Morocco. This uses energy for heating or transport. Eating seasonal food is better for the environment because it doesn't need as much energy to produce.",
        "common_errors": [
          "Thinking all food in shops is grown locally",
          "Not connecting food miles and seasonality to environmental impact"
        ]
      }
    ]
  },
  {
    "concept_id": "DT-KS1-C008",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Naming common tools (scissors, hole punch, ruler) and demonstrating safe handling with adult supervision.",
        "example_task": "Show me how to carry scissors safely across the classroom.",
        "example_response": "I hold the scissors closed with the blades pointing down and my hand over the blades. I walk, not run.",
        "common_errors": [
          "Carrying scissors open or with blades pointing upward",
          "Running while carrying tools"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Selecting the correct tool for a task and using it with reasonable control, following safety rules independently.",
        "example_task": "You need to cut this fabric and this card. Which tool is best for each?",
        "example_response": "I will use fabric scissors for the fabric because they are sharper and designed for cloth. I will use normal scissors for the card. I need to keep my fingers away from the blades and cut on the table, not in the air.",
        "common_errors": [
          "Using the wrong type of scissors for the material",
          "Cutting towards the body instead of away from it"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using a range of tools with increasing accuracy and control, measuring and marking before cutting, and maintaining a safe and organised workspace.",
        "example_task": "Measure and cut a piece of card that is exactly 15cm by 10cm. Mark it out first using a ruler and pencil.",
        "example_response": "I measured 15cm along the bottom edge and made a mark, then 10cm up the side and made a mark. I used the ruler to draw straight lines connecting the marks. Then I cut carefully along the lines. My piece is 15cm by 10cm.",
        "common_errors": [
          "Cutting without marking out first, leading to inaccurate results",
          "Not holding the ruler steady while drawing lines, causing wobbly cuts"
        ]
      }
    ]
  },
  {
    "concept_id": "DT-KS1-C009",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Joining two pieces of material together using a simple method such as glue or tape.",
        "example_task": "Join these two pieces of card together so they stay attached.",
        "example_response": "I put glue on the edge of one piece and pressed the other piece onto it. I held them together while the glue dried.",
        "common_errors": [
          "Using too much glue so the join is weak and soggy",
          "Not holding the pieces together while the adhesive sets"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Choosing between joining methods (glue, tape, staples, split pins, stitching) based on whether the join needs to be permanent or temporary, rigid or flexible.",
        "example_task": "You want to attach an arm to a puppet so it can move. Which joining method should you use and why?",
        "example_response": "I would use a split pin because the arm needs to move. Glue would stick it permanently and it wouldn't swing. The split pin lets the arm pivot at the shoulder.",
        "common_errors": [
          "Using a permanent join when the brief requires movement",
          "Not considering the functional requirements of the join"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using a range of joining and finishing techniques with skill, selecting methods that are appropriate for the materials and the design intent.",
        "example_task": "Make a fabric pouch using stitching. Add a decorative finish.",
        "example_response": "I used running stitch to join two pieces of felt, keeping my stitches even and close together so nothing falls out. For decoration, I used a contrasting thread to sew a pattern on the front before joining the pieces. The stitching is both functional (holding it together) and decorative.",
        "common_errors": [
          "Making stitches too far apart so the join is weak",
          "Not considering how the finishing will look on the completed product"
        ]
      }
    ]
  },
  {
    "concept_id": "DT-KS1-C010",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Looking at a product and saying what they like or do not like about it, using simple language.",
        "example_task": "Look at this toy. What do you think is good about it?",
        "example_response": "I like that it is colourful and the wheels spin. The wheels make it fun to play with.",
        "common_errors": [
          "Giving only a personal preference without any reasoning",
          "Not being able to articulate what makes the product effective"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Analysing a product by considering its purpose, materials, user and how well it works, using guided questions.",
        "example_task": "Look at this lunchbox. Who is it for? What is it made of? Does it do its job well?",
        "example_response": "It is for a child to carry lunch to school. It is made of plastic, which is waterproof and easy to clean. It closes with a clip so food stays inside. It does its job well because it keeps food safe, but it is quite hard to open — a younger child might struggle with the clip.",
        "common_errors": [
          "Evaluating only the appearance and not the function",
          "Not considering the user's needs when analysing the product"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Evaluating their own product and products made by others against design criteria, identifying strengths, weaknesses and specific improvements.",
        "example_task": "Evaluate the vehicle you made. Check each design criterion. What would you improve?",
        "example_response": "Criterion 1: Must roll — yes, the wheels turn smoothly (pass). Criterion 2: Must carry a small figure — the figure sits in the cab but falls out on bumps (partial pass). Criterion 3: Must look like a real vehicle — it has a cab, wheels and a trailer (pass). Improvement: I would add sides to the cab so the figure doesn't fall out, using card strips glued upright.",
        "common_errors": [
          "Saying everything is perfect without identifying genuine areas for improvement",
          "Suggesting improvements that are unrelated to the design criteria"
        ]
      }
    ]
  }
]
