[
  {
    "concept_id": "EN-Y5-C036",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that words are made of smaller meaningful parts and using this knowledge to attempt pronunciation and meaning of unfamiliar words when reading.",
        "example_task": "You see the word 'uncomfortable' in your reading book. Break it into parts to help you read it and work out what it means.",
        "example_response": "'Un' means not, 'comfort' means being relaxed and at ease, 'able' means can be. So uncomfortable means not able to be comfortable.",
        "common_errors": [
          "Attempting to sound the word out phonetically without breaking it into meaningful parts",
          "Identifying syllables rather than morphemes"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using knowledge of common prefixes, suffixes and roots to decode and understand unfamiliar words encountered across subjects, with some teacher prompting.",
        "example_task": "In your science book you read 'microscope'. Break it into parts, explain what each part means, and think of another word that uses each part.",
        "example_response": "'Micro' means small (like microphone, which picks up small sounds). 'Scope' means to look at (like telescope, which helps you look at far away things). So microscope means something that helps you look at very small things.",
        "common_errors": [
          "Knowing common prefixes but not recognising Greek or Latin roots",
          "Identifying the parts correctly but not using the knowledge to aid spelling"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Independently applying morphological and etymological knowledge to decode, comprehend and spell unfamiliar vocabulary across all subjects, recognising word families and using this knowledge as a learning strategy.",
        "example_task": "Your history text mentions 'democracy'. Use your knowledge of word parts and origins to explain what it means and link it to other words from the same roots.",
        "example_response": "'Demo' comes from the Greek 'demos' meaning people, and 'cracy' comes from 'kratos' meaning rule or power. So democracy means rule by the people. Other words with 'demos' include demographic (describing the people in a population). Other words with 'cracy' include aristocracy (rule by the best or the nobles) and bureaucracy (rule by officials). Knowing these roots helps me understand and spell related political vocabulary.",
        "common_errors": [
          "Explaining the meaning correctly but not connecting the roots to other words in the same family",
          "Not applying etymological knowledge to predict or check spellings"
        ]
      }
    ]
  }
]