[
  {
    "concept_id": "EN-Y5-C037",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Writing legibly with consistent letter formation, maintaining a steady size and spacing that can be read by others.",
        "example_task": "Copy this paragraph in your best handwriting. Focus on keeping your letters the same size and on the line.",
        "example_response": "The pupil produces legible handwriting with most letters formed correctly and sitting on the line, though speed is slow and some letter joins are inconsistent.",
        "common_errors": [
          "Inconsistent letter sizes, with ascenders and descenders not clearly differentiated",
          "Letters sitting above or below the line rather than on it"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writing fluently with joined handwriting at a reasonable speed, making choices about when to join and when to leave letters unjoined.",
        "example_task": "Write a short paragraph about your weekend. Aim for fluent, joined handwriting. Then label a science diagram underneath using neat, unjoined print.",
        "example_response": "The pupil produces joined handwriting for the paragraph at a comfortable pace. For the diagram labels, they switch to clear, unjoined print that is easy to read alongside the drawing.",
        "common_errors": [
          "Using joined writing for diagram labels where print would be clearer",
          "Writing very slowly because fluency has not been developed"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Writing legibly, fluently and with increasing speed, making deliberate choices about letter shape, joining, and writing implement based on the task and audience.",
        "example_task": "Your teacher sets three tasks: rough notes for a science experiment, a neat copy of a poem for display, and filling in a form with capital letters. Explain how your handwriting approach will differ for each.",
        "example_response": "For rough notes, I will write quickly in joined handwriting because speed matters more than neatness and only I need to read them. For the poem display, I will write carefully and neatly, possibly using a calligraphy pen, because it needs to look good for an audience. For the form, I will use unjoined capital letters because forms need clear, separate letters that anyone can read. The standard of handwriting depends on the purpose.",
        "common_errors": [
          "Using the same handwriting approach for all tasks without adapting to purpose",
          "Not understanding why unjoined writing is appropriate in some contexts"
        ]
      }
    ]
  }
]