[
  {
    "concept_id": "EN-Y5-C024",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Rewriting a short paragraph in fewer words while keeping the main meaning, with teacher modelling of the process.",
        "example_task": "This paragraph has 40 words. Rewrite it in 20 words or fewer, keeping the main idea: 'The ancient Egyptians believed that when a pharaoh died, their spirit would need their body in the afterlife. For this reason, they developed a process called mummification to preserve the body.'",
        "example_response": "The ancient Egyptians mummified pharaohs to preserve their bodies for the afterlife.",
        "common_errors": [
          "Deleting random sentences rather than identifying and keeping the essential meaning",
          "Producing a version that is shorter but loses the key point"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Condensing a longer passage by identifying essential information and rewriting in own words, distinguishing between core meaning and illustrative examples.",
        "example_task": "Read this 80-word paragraph about the Romans in Britain. Reduce it to about 30 words in your own words.",
        "example_response": "The Romans invaded Britain in AD 43 and ruled for nearly 400 years. They built roads, towns and forts, and introduced new laws, language and customs that shaped British life.",
        "common_errors": [
          "Keeping interesting examples while losing the main argument",
          "Writing a shorter passage that is still copied rather than rewritten in own words"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Producing a polished precis of a multi-paragraph text that retains all essential meaning in approximately one-third of the original length, written as coherent continuous prose.",
        "example_task": "Read this 150-word extract about renewable energy. Write a precis of approximately 50 words that covers all the key points.",
        "example_response": "Renewable energy sources such as wind, solar and hydroelectric power generate electricity without depleting natural resources or producing harmful emissions. Although initial costs are high and output depends on weather conditions, renewable technology is improving rapidly. Many countries are investing heavily in renewables to combat climate change and reduce dependence on fossil fuels.",
        "common_errors": [
          "Writing a version that is shorter by removing sentences rather than reconceiving the content",
          "Producing bullet points or notes rather than continuous prose"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Writing a precis that not only condenses content but preserves the argument structure and tone of the original, demonstrating critical judgement about what constitutes essential versus peripheral information.",
        "example_task": "Read this 200-word persuasive text arguing that all children should learn to cook. Write a precis of about 65 words that preserves the argument structure (claim, evidence, counterargument, conclusion).",
        "example_response": "The author argues that cooking should be compulsory in schools because it promotes healthy eating, builds life skills and connects to science and mathematics. Research cited shows children who cook at home eat more vegetables. Critics suggest time constraints make this impractical, but the author counters that cooking integrates multiple curriculum areas. The conclusion asserts that the long-term health benefits justify the investment.",
        "common_errors": [
          "Condensing the content but losing the argument structure (claim, evidence, counter, conclusion)",
          "Inserting personal opinion rather than faithfully representing the original author's position"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C025",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Using basic time connectives (then, next, after that) to link ideas within a paragraph.",
        "example_task": "Rewrite these three sentences as one paragraph, adding words to link them together: 'We arrived at the museum. We bought our tickets. We went into the dinosaur gallery.'",
        "example_response": "We arrived at the museum and first we bought our tickets. After that, we went into the dinosaur gallery.",
        "common_errors": [
          "Using 'then' repeatedly as the only linking word",
          "Joining all sentences with 'and' without varying the connective"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using a range of cohesive devices within paragraphs (then, after that, this, firstly) and beginning to link paragraphs using adverbials of time, place or number.",
        "example_task": "Write two paragraphs about a school trip. Use at least three different cohesive devices, including one that links the two paragraphs together.",
        "example_response": "First, we boarded the coach at 9 o'clock. During the journey, Mr Harris explained what we would see at the castle. Meanwhile, everyone was too excited to sit still. Later that morning, we arrived at the castle gates. The ancient walls towered above us. Inside the courtyard, a guide was waiting to take us on a tour.",
        "common_errors": [
          "Using only time connectives without varying with place or manner",
          "Starting a new paragraph without any link to the previous one"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Deploying a wide range of cohesive devices deliberately and appropriately, organised by function (time, place, number, addition, contrast, consequence), to build coherent, well-structured texts.",
        "example_task": "Write a non-fiction explanation of how a river changes from source to mouth. Use cohesive devices to link your paragraphs, choosing devices that reflect the logical relationship between ideas (not just time order).",
        "example_response": "A river begins as a small stream high in the mountains, fed by rainfall and melting snow. At this stage, the water flows quickly downhill, cutting a narrow V-shaped valley into the rock. As a result, the river carries loose stones and sediment downstream. Further along its course, the river widens and slows. Consequently, it begins to deposit some of the sediment it has been carrying, forming flat flood plains on either side. In contrast to the steep upper valley, the landscape here is gentle and low-lying. Finally, the river reaches the sea at its mouth, where the remaining sediment is deposited to form a delta or estuary.",
        "common_errors": [
          "Using cohesive devices that do not match the logical relationship (writing 'however' when 'therefore' is needed)",
          "Inserting devices mechanically without ensuring they genuinely connect the ideas"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using cohesive devices with subtlety and variety, including pronoun references, synonyms, and tense choices as well as adverbials, to create seamless, professional-sounding prose.",
        "example_task": "Read your own extended writing from last week. Identify three places where cohesion could be improved. Rewrite those sections and explain what you changed and why.",
        "example_response": "Original: 'The Vikings invaded Britain. The Vikings came from Scandinavia. The Vikings wanted land and treasure.' Revised: 'The Vikings invaded Britain in the 8th century. These Scandinavian warriors were driven by a desire for new land and treasure.' I replaced the repeated noun 'The Vikings' with the pronoun reference 'These Scandinavian warriors', which avoids repetition while adding information. I also combined the three short sentences into two, using the cohesive device 'driven by' to show the cause-and-effect relationship between where they came from and why they invaded.",
        "common_errors": [
          "Identifying problems but not being able to articulate why the revision is better",
          "Over-correcting by removing all repetition, making the text unclear about what 'they' or 'this' refers to"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C026",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying who a piece of writing is for and what it is trying to do when given clear examples.",
        "example_task": "Look at these two texts: a letter to a friend and a letter to the headteacher. Who is the audience for each? What is the purpose of each?",
        "example_response": "The letter to a friend is for someone I know well. Its purpose is to share news in a chatty way. The letter to the headteacher is for an adult in authority. Its purpose is to request something politely.",
        "common_errors": [
          "Describing what the text says rather than who it is for and what it is trying to do",
          "Not understanding that audience and purpose affect the language choices"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying audience, purpose and form before writing, and making some deliberate language choices that reflect this awareness.",
        "example_task": "You need to write about why your school should get a new playground. Your teacher gives you two options: a persuasive letter to the local council, or a poster for the school noticeboard. Which form would you choose and why? How would the language differ?",
        "example_response": "I would choose the letter to the council because it can include detailed arguments. The language would be formal and polite because I am writing to adults in authority. I would use phrases like 'I am writing to request' and give evidence for my points. A poster would need to be short, eye-catching and use simpler language because it is for a quick glance, not a careful read.",
        "common_errors": [
          "Choosing a form without explaining why it suits the purpose",
          "Using the same register regardless of audience"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Consistently identifying audience, purpose and form before writing, selecting appropriate forms using other writing as models, and making conscious language and structural choices throughout the writing process.",
        "example_task": "Write the opening paragraph of a newspaper report about a local event AND the opening of a diary entry about the same event. Explain how audience and purpose changed your choices.",
        "example_response": "Newspaper: 'Hundreds of residents gathered in Victoria Park on Saturday for the annual Summer Fair, which raised over two thousand pounds for the local hospital.' Diary: 'What an amazing day! The Summer Fair was brilliant. Mum let me go on the bouncy castle three times and I won a goldfish.' In the newspaper report I used third person, formal language and the most important fact first because the audience is the general public and the purpose is to inform. In the diary I used first person, informal language and personal feelings because the audience is myself and the purpose is to record my experience.",
        "common_errors": [
          "Writing in the correct form but not varying the language to reflect the different audiences",
          "Treating audience as a box to tick rather than a genuine influence on every language choice"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Adapting writing flexibly for different audiences and purposes within the same piece, and evaluating how published writers make audience and purpose choices.",
        "example_task": "A charity wants to raise money for clean water in developing countries. They need three texts: a fundraising letter to parents, a fact sheet for children, and a social media post. Write the opening of each and explain how you adapted your choices.",
        "example_response": "Parent letter: 'Dear Parent/Carer, Every child deserves access to clean drinking water. Your donation of just five pounds could provide safe water for a family for a month.' Child fact sheet: 'Did you know? 1 in 10 people around the world do not have clean water to drink. That is like 3 children in every class having no safe water at home.' Social media: 'Clean water changes everything. Five pounds. One family. One month. Donate now.' Each adapts to its audience: formal and emotional for parents, accessible and relatable for children, punchy and shareable for social media. The purpose is the same (fundraising) but the form, register and techniques change completely.",
        "common_errors": [
          "Using the same tone and register across all three versions",
          "Not explaining the specific choices made for each audience"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C027",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Writing a simple narrative with a character, a setting and a basic sequence of events, including some dialogue with correct punctuation.",
        "example_task": "Write the opening of a story set in a forest. Include a character, describe the setting, and write at least two lines of dialogue.",
        "example_response": "The forest was dark and quiet. Liam walked slowly along the path, looking at the tall trees. 'I think we are lost,' he said to his sister. 'No we are not,' she replied. 'The map says we go left.'",
        "common_errors": [
          "Describing the setting with a list of adjectives rather than creating a sense of place",
          "Writing dialogue as isolated exchanges disconnected from the action"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writing narratives that use description to build atmosphere and character, and integrating dialogue with action rather than presenting it in isolation.",
        "example_task": "Rewrite this flat narrative to create atmosphere: 'It was night. The house was old. Sarah went inside. She was scared.'",
        "example_response": "The last sliver of daylight disappeared behind the rooftops as Sarah stood before the house. Its windows stared back at her like hollow eyes. She pushed the door and it groaned open. Inside, the air smelled of dust and something older. Sarah's hand trembled on the doorframe.",
        "common_errors": [
          "Telling emotions directly ('she was scared') rather than showing them through action and description",
          "Overloading description so that the pace of the narrative is lost"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Writing narratives that deliberately build character, setting and atmosphere through carefully chosen description and dialogue, integrating dialogue to convey character and advance action.",
        "example_task": "Write a scene where two characters disagree about something. Use dialogue to show their different personalities and use description to create the atmosphere. Do not tell the reader how the characters feel; show it through what they say and do.",
        "example_response": "'We should turn back,' whispered Priya, pulling her coat tighter around her shoulders. The rain hammered against the windows of the abandoned station. Marcus did not look up from the map. 'We have come too far to give up now,' he said, tracing a line with his finger. 'The bridge is only half a mile from here.' Priya stared at the dark shapes of the trees outside. A branch scraped across the glass like fingernails on a blackboard. 'Half a mile in that?' she said. Marcus folded the map with a sharp snap. 'Stay here if you want. I am going.'",
        "common_errors": [
          "Using dialogue only for information exchange rather than to reveal character",
          "Separating description and dialogue into different paragraphs instead of weaving them together"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Making deliberate authorial choices about how and when to use description, action and dialogue for maximum effect, drawing on techniques observed in published authors.",
        "example_task": "Write the same short scene twice: first, telling the story mainly through dialogue; second, telling it mainly through description and action with very little dialogue. Explain which version works better and why.",
        "example_response": "Version 1 (dialogue): 'They have taken the bridge,' gasped Leo. 'What do we do now?' Ava did not answer immediately. 'We swim,' she said. Version 2 (description): Leo stopped at the riverbank. Where the bridge had been, there was nothing but broken timber and churning water. He looked at Ava. She looked at the river. Then she began to take off her shoes. Both versions tell the same story but create different effects. Version 1 is faster and more dramatic because the dialogue drives the pace. Version 2 builds more tension because the reader has to infer what Ava is thinking. I think Version 2 is stronger here because the silence is more powerful than words.",
        "common_errors": [
          "Writing two versions that are essentially the same with minor differences",
          "Not analysing which version is more effective for the specific story being told"
        ]
      }
    ]
  }
]