[
  {
    "concept_id": "EN-Y4-C013",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying the root word within a familiar word that has a prefix or suffix.",
        "example_task": "What is the root word in each of these: unhappy, playing, darkness?",
        "example_response": "unhappy → happy, playing → play, darkness → dark",
        "common_errors": [
          "Removing too many letters (e.g., 'play' → 'pla')",
          "Confusing root word with the first syllable"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using known root words to read and understand unfamiliar words by identifying how prefixes and suffixes change meaning.",
        "example_task": "You come across the word 'misunderstand' in your reading. Break it into parts and explain what it means.",
        "example_response": "mis- means wrongly, and the root word is 'understand'. So misunderstand means to understand something wrongly or incorrectly.",
        "common_errors": [
          "Knowing the root word but not how the prefix changes its meaning",
          "Pronouncing the word but not using root knowledge to work out meaning"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Applying root word knowledge alongside etymology to read aloud and comprehend unfamiliar words across subjects.",
        "example_task": "In your science book, you read: 'Herbivores consume only vegetation.' Use root word knowledge to explain what 'herbivore' and 'vegetation' mean.",
        "example_response": "Herbi- comes from the Latin word for plant (like 'herb') and -vore means eater (like 'devour'). So a herbivore is a plant-eater. Vegetation comes from the Latin root 'vegetare' meaning to grow, so vegetation means plants and growing things.",
        "common_errors": [
          "Guessing meaning from the sound of the word rather than analysing its parts",
          "Knowing one root but not connecting it to related words"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using root word families to predict the meanings of multiple unfamiliar words and explain the connections between them.",
        "example_task": "The Latin root 'port' means 'to carry'. List four words containing this root and explain how 'carry' connects to each meaning.",
        "example_response": "Transport — carry across (trans = across). Export — carry out (ex = out of a country). Import — carry in. Portable — able to be carried. They all connect to the idea of carrying or moving things from one place to another.",
        "common_errors": [
          "Including words that contain 'port' but are not etymologically related (e.g., 'portico')",
          "Giving definitions without explaining the root connection"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C014",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising common prefixes and suffixes in words and reading them aloud correctly.",
        "example_task": "Read these words aloud and underline the prefix or suffix: impossible, cheerful, disappear, hopeless.",
        "example_response": "im-possible, cheer-ful, dis-appear, hope-less. [Reads each word aloud with correct pronunciation]",
        "common_errors": [
          "Misreading 'impossible' as 'im-poss-ible' with wrong stress",
          "Not recognising 'dis-' as a prefix in 'disappear'"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using prefix and suffix knowledge to decode unfamiliar words in reading, understanding how they modify the root word's meaning.",
        "example_task": "Read this sentence: 'The magician made the rabbit reappear.' You know 'appear' means to come into sight. What does 'reappear' mean and how do you know?",
        "example_response": "Reappear means to appear again. I know because 're-' means again or back, so adding it to 'appear' means to come into sight again — the rabbit had disappeared and then came back.",
        "common_errors": [
          "Reading the word correctly but not connecting the prefix to its meaning",
          "Confusing re- (again) with other meanings"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Applying knowledge of a wide range of prefixes and suffixes from English Appendix 1 to read aloud and understand new vocabulary, testing different pronunciations.",
        "example_task": "Read this passage aloud: 'The irresponsible inventor created an indescribable contraption.' Explain how you worked out how to pronounce and understand the underlined words.",
        "example_response": "[Reads passage aloud fluently] 'Irresponsible' has the prefix ir- meaning 'not' and the root 'responsible', so it means not responsible. For 'indescribable', I know in- means 'not' and the root is 'describe' with the suffix -able meaning 'able to be'. So indescribable means not able to be described — it's so unusual you can't find words for it.",
        "common_errors": [
          "Not recognising that ir-, il-, im- are all variants of the 'not' prefix",
          "Stripping affixes from words that are not truly prefixed (e.g., thinking 'include' has the prefix 'in-')"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining how the same prefix or suffix can have different meanings in different words, using etymology to distinguish.",
        "example_task": "The prefix 'in-' can mean 'not' (invisible) or 'into' (inject). Sort these words into two groups based on the meaning of 'in-': incomplete, inform, invisible, insect, inhale, inaccurate.",
        "example_response": "'Not': incomplete (not complete), invisible (not visible), inaccurate (not accurate). 'Into/in': inform (to put knowledge into someone), inhale (to breathe in). 'Insect' is tricky — 'in' here comes from Latin 'insectum' meaning 'cut into', because insects have segmented bodies. So it is the 'into' meaning.",
        "common_errors": [
          "Assuming 'in-' always means 'not'",
          "Not recognising that some words beginning with 'in' are not actually prefixed"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C015",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Reading aloud common exception words from the Years 3-4 list with correct pronunciation.",
        "example_task": "Read these words aloud: though, thought, through, enough, caught, answer, different.",
        "example_response": "[Reads each word correctly: /ðəʊ/, /θɔːt/, /θruː/, /ɪˈnʌf/, /kɔːt/, /ˈɑːnsə/, /ˈdɪfrənt/]",
        "common_errors": [
          "Confusing 'though' and 'thought' in pronunciation",
          "Pronouncing the 'w' in 'answer'"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Spelling common exception words correctly in isolation and noting the unusual letter-sound correspondences.",
        "example_task": "Your teacher dictates: 'different', 'describe', 'favourite', 'knowledge', 'sentence'. Write them correctly and circle the tricky part in each word.",
        "example_response": "different (circling 'er' — sounds like it could be 'ent'), describe (circling 'des' — sounds like 'dis'), favourite (circling 'ou' — easy to forget), knowledge (circling 'kn' — silent k), sentence (circling 'ence' — could be 'ance')",
        "common_errors": [
          "Spelling 'diffrent' (missing the second 'e')",
          "Writing 'discribe' instead of 'describe'"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Spelling all Years 3-4 exception words correctly in dictated sentences and independent writing.",
        "example_task": "Write from dictation: 'It was a different experience from what we expected. The whole group decided to continue the experiment, although it was difficult.'",
        "example_response": "It was a different experience from what we expected. The whole group decided to continue the experiment, although it was difficult.",
        "common_errors": [
          "Spelling 'experience' correctly in isolation but writing 'expirence' when focusing on content",
          "Writing 'diffacult' for 'difficult'"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining why exception words are spelt unusually, using knowledge of etymology or historical spelling patterns.",
        "example_task": "Why is there a silent 'k' in 'knowledge' and a silent 'w' in 'answer'? What does this tell us about how English has changed?",
        "example_response": "In Old English, the 'k' in 'knowledge' was actually pronounced — people said 'k-nowledge'. Over hundreds of years, English speakers stopped saying the 'k' sound before 'n', but the spelling stayed the same. Similarly, 'answer' comes from Old English 'andswaru', where the 'w' sound was spoken. The spelling kept the old letters even after pronunciation changed, which is why English has so many silent letters.",
        "common_errors": [
          "Making up an explanation rather than connecting to language history",
          "Assuming silent letters are random mistakes rather than historical evidence"
        ]
      }
    ]
  }
]