[
  {
    "concept_id": "EN-KS3-C042",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Aware that persuasive techniques exist but uses them randomly or not at all in own writing.",
        "example_task": "Use a rhetorical question and a rule of three in a paragraph persuading people to recycle.",
        "example_response": "Do you recycle? You should because it is good for the planet. Recycling helps the environment, the animals and the world.",
        "common_errors": [
          "Using rhetorical devices mechanically without understanding their purpose",
          "Deploying a rule of three where the items do not build or develop"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Uses common rhetorical devices (rhetorical questions, tricolon, emotive language, direct address) with some awareness of their persuasive effect.",
        "example_task": "Write a paragraph using at least three rhetorical devices to persuade your audience that public libraries should remain free.",
        "example_response": "How would you feel if you could not afford to open a book? Public libraries are not just buildings full of shelves -- they are lifelines, classrooms and sanctuaries for people who have nowhere else to go. Charging for library use would punish the poorest members of our community: the children who do their homework there because they have no desk at home, the unemployed who search for jobs on library computers, the elderly who come for warmth and company. Can we really call ourselves a civilised society if we put a price on knowledge?",
        "common_errors": [
          "Using devices only at the beginning or end rather than throughout",
          "Including so many devices that the argument becomes cluttered"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Deploys rhetorical devices strategically and with control, understanding how each technique contributes to the overall persuasive structure.",
        "example_task": "Write a persuasive passage that builds to a climax using anaphora (repetition at the start of successive sentences or clauses).",
        "example_response": "[Writes a passage where anaphora is used deliberately to build cumulative rhetorical force. The repeated phrase develops meaning with each repetition rather than simply restating the same point. Other devices (contrast, direct address, precise vocabulary) work alongside the anaphora rather than competing with it. The passage builds to a climactic final sentence where the anaphora resolves or breaks, creating impact through the disruption of the established pattern.]",
        "common_errors": [
          "Using anaphora that is repetitive rather than cumulative",
          "Not varying the rhythm and content enough between repetitions to maintain interest"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Uses rhetorical devices with the sophistication of a skilled orator, understanding that the most effective rhetoric is invisible -- the audience feels the effect without noticing the technique.",
        "example_task": "Write a persuasive piece where the rhetorical technique is so well integrated that it enhances the argument without drawing attention to itself.",
        "example_response": "[Writes a polished persuasive piece where rhetorical devices are woven seamlessly into the argument. The reader is persuaded not because they can identify techniques but because the writing is compelling, logical and moving. The piece demonstrates that mastery of rhetoric means knowing when not to use a technique as much as knowing when to use one. Restraint, precision and authenticity of voice are as important as technical range.]",
        "common_errors": [
          "Overusing devices to demonstrate range rather than deploying them for effect",
          "Prioritising technical display over genuine persuasion"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C043",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Uses basic descriptive language in writing but does not consciously apply literary devices learned from reading.",
        "example_task": "Write a description of a storm using at least one literary device (simile, metaphor, personification).",
        "example_response": "The storm was really loud and scary. The rain was like bullets hitting the window. It was very dark.",
        "common_errors": [
          "Using cliched comparisons ('rain like bullets', 'dark as night')",
          "Including only one device as a token effort rather than integrating techniques throughout"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Applies literary devices from reading to own writing with growing confidence, using imagery, symbolism and figurative language to create effects.",
        "example_task": "Write a description of a market scene using sensory imagery and at least two different literary devices.",
        "example_response": "The market breathed. It exhaled the warm, yeasty scent of fresh bread and inhaled the sharp cries of stallholders competing for attention. Towers of oranges glowed like small suns, casting their own light into the grey morning. A fishmonger's hands moved in a blur of silver scales, performing the same ancient choreography his father had danced before him.",
        "common_errors": [
          "Using literary devices that clash with each other or with the mood of the piece",
          "Overloading description with so many devices that it becomes overwrought"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Transfers literary techniques from reading into own writing with control and purpose, understanding that literary devices should serve meaning rather than decorate it.",
        "example_task": "Write a paragraph of creative writing that uses an extended metaphor to characterise a person.",
        "example_response": "[Writes a paragraph where a single metaphor is sustained and developed to reveal character: for example, comparing a strict teacher to a lighthouse -- steady, revolving, alternately illuminating and leaving in shadow, essential for navigation but impossible to approach. The extended metaphor reveals multiple aspects of the character through different facets of the comparison, demonstrating that the writer understands metaphor as a thinking tool, not a decoration.]",
        "common_errors": [
          "Establishing the metaphor but not developing it across the paragraph",
          "Using literary devices in isolation rather than allowing them to work together"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Uses literary devices with originality and restraint, creating writing where technique serves vision, and demonstrates a personal writing style developed through wide reading.",
        "example_task": "Write a descriptive piece that uses literary technique to create a specific emotional response in the reader.",
        "example_response": "[Writes a piece where literary techniques are deployed with the precision and originality of a published writer. The imagery is fresh, not derivative. The devices serve an emotional or thematic purpose that the student can articulate. The writing demonstrates a personal voice -- a way of seeing and expressing that has been shaped by wide reading but is distinctly the student's own. The piece shows that the student has internalised techniques from reading and can deploy them creatively rather than imitatively.]",
        "common_errors": [
          "Imitating a specific author's style rather than developing their own",
          "Using technique to impressive effect but without emotional truth"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C044",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Writes without considering who will read the piece, using the same register and tone regardless of the intended audience.",
        "example_task": "Who is the audience for this piece of writing? How should that affect the way you write?",
        "example_response": "It is for my teacher. I should write neatly.",
        "common_errors": [
          "Equating audience awareness with presentation quality rather than content and register",
          "Not distinguishing between different audiences at all"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Recognises that different audiences require different approaches and makes basic adjustments to vocabulary, formality and content.",
        "example_task": "Write the opening sentence of a text about healthy eating for: (a) primary school children, (b) adult readers of a broadsheet newspaper.",
        "example_response": "(a) Did you know that eating fruit and vegetables helps your body grow strong and fight off germs? (b) The relationship between diet and long-term health outcomes has been a subject of sustained public debate, yet the evidence remains unequivocal: dietary choices in childhood establish patterns that persist throughout life.",
        "common_errors": [
          "Adjusting only vocabulary (simpler or harder words) without also adjusting tone, structure and content",
          "Making audience adjustments only at the start and not sustaining them"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Adapts all aspects of writing -- vocabulary, sentence structure, tone, content selection, level of formality and rhetorical strategy -- to suit the specific audience, sustaining the adaptation throughout.",
        "example_task": "Write a paragraph about climate change for a teenage magazine and then rewrite it for a government report. Explain the differences.",
        "example_response": "[Writes two distinct paragraphs on the same topic. The teenage magazine version uses second person ('you'), shorter sentences, relatable examples, accessible vocabulary and an engaging tone. The government report version uses impersonal constructions, passive voice, technical vocabulary, hedging language ('evidence suggests'), formal structure and data-driven content. The student explains that the magazine reader needs to be engaged and empowered while the government reader needs to be informed and convinced by evidence.]",
        "common_errors": [
          "Adapting register but not content selection (both versions include the same information)",
          "Overdoing the informality for teenage audiences or the formality for official ones"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Demonstrates sophisticated audience awareness by constructing texts that anticipate reader responses, challenge reader assumptions, and position the reader strategically.",
        "example_task": "Write a piece that deliberately positions the reader to feel a particular emotion before revealing information that challenges that feeling.",
        "example_response": "[Writes a piece that opens by building sympathy for a character or situation using techniques that create emotional identification. Midway through, new information is introduced that complicates the reader's initial response. The piece ends by forcing the reader to re-evaluate their first reaction. The student demonstrates understanding that audience awareness is not just about matching register -- it is about strategically controlling the reader's experience through the sequence of information and the management of emotional response.]",
        "common_errors": [
          "Manipulating the reader without a clear purpose for doing so",
          "Making the strategic positioning too obvious, which undermines its effectiveness"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C045",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Writes without a clear sense of purpose, producing text that does not consistently inform, persuade, entertain or explain.",
        "example_task": "What is the purpose of this piece of writing? Are you trying to inform, persuade, entertain or explain?",
        "example_response": "I am just writing about it. I suppose I am trying to tell people about it.",
        "common_errors": [
          "Not having a clear purpose before beginning to write",
          "Mixing purposes inconsistently within a single piece"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifies the purpose of their writing and makes some adjustments to approach, though purpose may not be sustained throughout the piece.",
        "example_task": "Write the opening of a piece that informs, and then the opening of a piece that persuades, about the same topic.",
        "example_response": "Inform: 'The UK produces approximately 26 million tonnes of household waste per year, of which 45% is currently recycled.' Persuade: 'Every time you throw a plastic bottle in the general waste bin, you are choosing to add to the 14 million tonnes of unrecycled waste that poisons our planet each year.'",
        "common_errors": [
          "Beginning with a clear purpose but drifting into a different one",
          "Not recognising when their writing has shifted purpose"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Writes with sustained awareness of purpose, making consistent choices about content, tone, evidence and structure that serve the intended aim throughout the piece.",
        "example_task": "Write a complete piece that has a clear primary purpose but also achieves a secondary one (e.g. a piece that primarily informs but also subtly persuades).",
        "example_response": "[Writes a piece that consistently serves its primary purpose while also achieving a secondary effect. For example, an informative article about food banks that, through its selection of details and human-interest focus, also subtly persuades the reader that more support is needed. The student can articulate both the primary and secondary purpose and explain how specific choices serve each one.]",
        "common_errors": [
          "Allowing the secondary purpose to overwhelm the primary one",
          "Not being able to articulate what the secondary purpose is or how it is achieved"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Controls purpose with sophistication, understanding that the most effective writing often achieves multiple purposes simultaneously and that purpose can shift strategically within a single piece.",
        "example_task": "Write a piece that shifts purpose mid-way through for deliberate effect (e.g. begins as information and shifts to argument, or begins as entertainment and becomes serious).",
        "example_response": "[Writes a piece that begins in one mode (e.g. humorous observation about school life) and deliberately shifts to another (e.g. a serious argument about the pressure students face). The shift is controlled and purposeful -- the humour disarms the reader and establishes trust, which makes the serious argument more impactful when it arrives. The student demonstrates understanding that purpose shifts can be a rhetorical strategy, not a failure of consistency.]",
        "common_errors": [
          "Making the shift too abrupt, jarring the reader",
          "Not signalling the shift clearly enough for the reader to follow"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C046",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Submits first drafts as finished work without revising for coherence, or revises only surface features (spelling, neatness).",
        "example_task": "Read your essay back and check if it flows logically from one point to the next.",
        "example_response": "It seems fine. I checked the spelling and it is all correct.",
        "common_errors": [
          "Equating revision with proofreading",
          "Not re-reading work from the reader's perspective"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Revises writing for coherence when prompted, identifying and correcting obvious gaps in logic or flow, and adding linking phrases between paragraphs.",
        "example_task": "Read your essay and identify one place where the argument jumps from one idea to another without a clear connection. Fix it.",
        "example_response": "[Identifies a paragraph transition that lacks a connecting idea and adds a discourse marker or bridging sentence. For example, adding 'This evidence also supports a wider argument about...' between two paragraphs that previously sat side by side without connection.]",
        "common_errors": [
          "Adding connecting words ('however', 'furthermore') without actually connecting the ideas",
          "Fixing transitions between paragraphs but not within them"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Revises independently for coherence at paragraph, section and whole-text level, ensuring that ideas build logically and that the reader can follow the argument's development.",
        "example_task": "Revise your essay to ensure each paragraph advances the argument. Delete or restructure any paragraph that does not contribute to the overall coherence.",
        "example_response": "[Restructures the essay by moving a paragraph that appeared too early (before the evidence it depends on), combining two paragraphs that made the same point, and adding a bridging sentence that connects the counter-argument section to the conclusion. The revised version has a clear logical progression that the original draft lacked.]",
        "common_errors": [
          "Revising sentences but not the overall structure of the argument",
          "Being reluctant to delete or significantly restructure material"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Revises with the discipline and skill of an experienced writer, understanding that coherence is achieved through the relationship between ideas at every level of the text.",
        "example_task": "Take a piece of your own writing and produce a revised version that is shorter but more coherent. Explain what you cut and why.",
        "example_response": "[Produces a tighter version that removes redundant points, combines overlapping paragraphs, and sharpens transitions so that each sentence leads inevitably to the next. The student explains their revision decisions: 'I removed paragraph 3 because it repeated a point already made more effectively in paragraph 1. I moved the counter-argument earlier because it now serves as a springboard for my strongest evidence. I cut 200 words total and the piece is more persuasive because every remaining word contributes to the argument.' The student demonstrates understanding that shorter writing is often more coherent writing.]",
        "common_errors": [
          "Cutting material without improving the relationships between remaining sections",
          "Being unable to articulate why specific revision decisions improve coherence"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C048",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Writes in the order ideas occur without considering whether a different structure would be more effective.",
        "example_task": "Could the paragraphs in your essay be in a different order? Would that make it better?",
        "example_response": "I wrote them in the order I thought of them. I think it is fine.",
        "common_errors": [
          "Not recognising that paragraph order is a choice that affects the reader's experience",
          "Writing in chronological order by default even when another structure would be more effective"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Recognises that structure affects effectiveness and can reorder paragraphs or sections when prompted, though may not initiate structural editing independently.",
        "example_task": "Your essay has your strongest argument in paragraph 2 and your weakest in paragraph 4. Should you swap them? Why or why not?",
        "example_response": "I should move my strongest argument to the end because that is what the reader will remember. If I put my weakest argument last, the essay will end on a disappointing note. I will also move my counter-argument earlier so I can address it before building to my strongest point.",
        "common_errors": [
          "Moving paragraphs without considering how this affects transitions and flow",
          "Not considering different structural options (e.g. saving the strongest point for last vs leading with it)"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Edits the structure of writing independently, reorganising paragraphs and sections to improve the argument's logic, pacing and impact.",
        "example_task": "Restructure your essay to build towards a climactic final argument rather than presenting points in order of importance.",
        "example_response": "[Restructures the essay with intention: begins with context-setting, moves through evidence that builds in persuasive force, places the counter-argument strategically so that the rebuttal leads into the strongest argument, and concludes with a paragraph that synthesises everything into a compelling final position. Transitions are rewritten to reflect the new order.]",
        "common_errors": [
          "Restructuring without rewriting transitions, creating a disjointed feel",
          "Making structural changes that improve one aspect but damage another"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Makes sophisticated structural decisions that shape the reader's experience, understanding how the architecture of a piece of writing creates meaning beyond its content.",
        "example_task": "Experiment with two different structures for the same essay content and explain which is more effective and why.",
        "example_response": "[Presents two versions: one structured as a linear argument (point, evidence, analysis, conclusion) and one as a narrative essay (opens with an anecdote, moves to analysis, returns to the anecdote at the end for circular structure). Explains that the linear version is more logically rigorous but the narrative version is more emotionally engaging. Evaluates which structure serves the specific purpose and audience better, demonstrating that structural editing is not about finding the 'right' order but about choosing the order that best serves the writer's purpose.]",
        "common_errors": [
          "Treating structural editing as rearranging rather than reimagining",
          "Not evaluating the effect of structural changes on the reader's experience"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C081",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Gives up on writing tasks quickly, produces minimal text, or avoids writing altogether when the task seems demanding.",
        "example_task": "Write for 15 minutes without stopping. If you get stuck, write about being stuck.",
        "example_response": "[Writes 3-4 sentences then stops. When encouraged, adds another sentence or two but struggles to sustain any momentum.]",
        "common_errors": [
          "Stopping at the first point of difficulty rather than pushing through",
          "Believing that good writing happens effortlessly and that struggle means failure"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sustains writing for extended periods when given structure and encouragement, pushing through difficulty with some persistence.",
        "example_task": "Write continuously for 20 minutes on the topic provided. Try not to stop writing.",
        "example_response": "[Writes for the full 20 minutes with only brief pauses. The quality may vary -- some sections are more developed than others -- but the student sustains the effort. May write about the difficulty ('I am not sure what to say next but I will keep going') before finding a new direction.]",
        "common_errors": [
          "Writing for the required time but padding with repetition",
          "Maintaining quantity but losing quality as the task continues"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Writes with sustained stamina and focus across extended tasks, understanding that difficulty is a normal part of the writing process and that pushing through it produces better work.",
        "example_task": "Complete a 500-word essay in one sitting. Reflect on where you found it hardest and how you kept going.",
        "example_response": "[Completes the essay at a consistent standard. Reflection: 'The hardest part was the third paragraph where I ran out of evidence and had to think of a new angle. I kept going by re-reading my introduction to remind myself of my argument, and then I found I could approach the point from a different direction. The paragraph that came out of the struggle is actually my strongest one.']",
        "common_errors": [
          "Completing extended tasks but not reflecting on the process",
          "Not recognising that the difficult sections often produce the best writing"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Approaches extended writing with disciplined stamina, managing energy across a long piece, understanding that writing resilience is a learnable skill rather than a fixed trait.",
        "example_task": "Write a 600-word piece and describe your strategies for maintaining quality throughout.",
        "example_response": "[Completes a polished 600-word piece. Describes strategies: 'I plan before I write so I know where the piece is going. I write the sections I feel most confident about first, then tackle the harder parts when I have momentum. When I hit a block, I skip that section and come back to it. I build in a brief re-reading pause after each paragraph to check I am still on track. I save 5 minutes at the end for revision because the last paragraph written is usually the one that needs the most editing.' The student demonstrates metacognitive awareness of their own writing process.]",
        "common_errors": [
          "Having strategies but not being flexible enough to adapt them when they do not work",
          "Relying on one strategy rather than having a repertoire"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C082",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Views the first draft as the final product and resists revising, believing that good writing should be right first time.",
        "example_task": "Would you like to go back and improve your writing before submitting it?",
        "example_response": "No, I think it is done. If I change things it will just get worse.",
        "common_errors": [
          "Believing that revision means the first draft was a failure",
          "Fearing that changes will make the writing worse rather than better"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Accepts that revision improves writing and engages with it when guided, though may still view it as correcting mistakes rather than as a creative process.",
        "example_task": "Read your first draft and identify one sentence that could be improved. Rewrite it.",
        "example_response": "[Identifies a vague or clumsy sentence and rewrites it with greater clarity or precision. Shows willingness to change text but may still treat revision as fixing errors rather than developing ideas.]",
        "common_errors": [
          "Revising at sentence level only, not considering larger structural or argumentative improvements",
          "Treating revision as correction rather than development"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Views revision as an integral part of the writing process, actively seeking opportunities to improve vocabulary, argument, structure and impact.",
        "example_task": "Revise your essay with three specific goals: (1) improve one vocabulary choice, (2) strengthen one argument, (3) improve one transition.",
        "example_response": "[Makes targeted improvements: replaces 'good' with 'compelling' because it is more precise; adds a specific example to support a claim that was previously unsupported; rewrites a transition from 'Also' to 'This evidence also undermines the counter-argument that...' to create a stronger link between paragraphs. Can explain why each revision improves the writing.]",
        "common_errors": [
          "Making changes for the sake of change rather than for improvement",
          "Revising the easy parts and avoiding the sections that need the most work"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Embraces revision as the stage where writing becomes genuinely good, approaching it with rigour, creativity and a willingness to make significant changes.",
        "example_task": "Take your best piece of writing from this term and revise it substantially. Be prepared to explain every change.",
        "example_response": "[Produces a significantly revised version that is noticeably stronger. Changes include restructuring the argument for greater impact, replacing several generic phrases with precise vocabulary, cutting a paragraph that was redundant, and rewriting the conclusion to synthesise rather than repeat. The student explains: 'I was proud of the first draft but I knew it could be better. The hardest revision was cutting the second paragraph -- I liked it, but it did not advance the argument. Removing it made the essay tighter and more focused. Revision is not about fixing mistakes; it is about seeing possibilities the first draft could not see.']",
        "common_errors": [
          "Being unable to articulate why revisions improve the writing",
          "Making only surface changes and claiming to have revised substantially"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C087",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Begins writing immediately without planning, or produces plans that are essentially first drafts written in note form.",
        "example_task": "Before you write your essay, spend five minutes planning. Show me your plan.",
        "example_response": "[Produces a few scattered words or a single sentence summary. The 'plan' does not include structure, paragraph topics or a sense of the argument's development.]",
        "common_errors": [
          "Believing that planning wastes time rather than saves it",
          "Not knowing what a useful plan looks like"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Creates plans that include paragraph topics and some key points, providing a basic roadmap for the writing task.",
        "example_task": "Write a paragraph plan for an essay on how the writer creates tension in a text you have studied.",
        "example_response": "Paragraph 1: Introduction -- the writer creates tension through language, structure and pacing. Paragraph 2: Language -- analyse the use of short sentences and violent imagery. Paragraph 3: Structure -- analyse how the scene builds to a climax. Paragraph 4: Conclusion -- the tension serves the theme of conflict.",
        "common_errors": [
          "Planning paragraph topics but not the specific evidence or analysis each will contain",
          "Creating a plan but then abandoning it during writing"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Creates detailed, purposeful plans that include paragraph topics, key evidence, analytical points and a sense of how the argument develops, then follows and adapts the plan during writing.",
        "example_task": "Write a detailed plan for an analytical essay. Include specific quotations you will use and the analytical point each will support.",
        "example_response": "[Creates a plan with: thesis statement; 3-4 paragraph topics each with a specific quotation identified and the analytical point it will support; a note on how the argument builds from one paragraph to the next; a planned approach to the counter-argument; a note on how the conclusion will synthesise rather than repeat. The plan is detailed enough to guide writing but flexible enough to allow for development during the draft.]",
        "common_errors": [
          "Over-planning to the point where the plan becomes a draft",
          "Planning content but not the argumentative progression"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Plans strategically, selecting the planning method best suited to the task and their own writing process, and treats planning as a thinking tool rather than a administrative requirement.",
        "example_task": "Plan a piece of writing using whatever planning method works best for you. Explain why you chose this approach.",
        "example_response": "[Uses a planning method suited to the task -- perhaps a mind map for creative writing (allowing associative thinking) or a structured outline for an argument (requiring logical sequencing). Explains: 'For this essay I used a numbered outline because the argument needs to build in a specific order. But for a creative piece I would use a mind map because I need to follow ideas and connections rather than a predetermined structure. Planning is not a separate stage from thinking -- it IS the thinking. The plan is where I discover what I want to say; the draft is where I discover how to say it.' The student demonstrates metacognitive awareness of different planning strategies and their purposes.]",
        "common_errors": [
          "Always using the same planning method regardless of the task",
          "Planning as a box-ticking exercise rather than a genuine thinking process"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C088",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Treats the first draft as the final product, writing with the expectation that the text should be finished in one attempt.",
        "example_task": "Write a first draft of your essay. Remember, this is not the final version.",
        "example_response": "[Writes carefully and slowly, trying to make every sentence perfect, and becomes frustrated when the writing does not come out right. Treats the first draft as if it is being submitted for marking.]",
        "common_errors": [
          "Trying to write a perfect first draft rather than getting ideas down",
          "Spending too long on individual sentences rather than completing the whole draft"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Understands that a first draft is a working document and writes with some willingness to leave imperfections for later revision.",
        "example_task": "Write your first draft quickly, focusing on getting your ideas down. You can improve it later.",
        "example_response": "[Writes more fluently, accepting that some sentences are rough and can be improved. May mark sections with notes like 'need better word here' or 'add evidence'. Completes the draft rather than getting stuck on perfecting early paragraphs.]",
        "common_errors": [
          "Writing quickly but then not returning to revise",
          "Leaving too many sections unfinished, producing a draft that is too incomplete to revise"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Uses drafting as a productive stage in the writing process, understanding that the purpose of a first draft is to discover and develop ideas, not to produce finished prose.",
        "example_task": "Write a first draft and then annotate it to show what you would change in revision.",
        "example_response": "[Completes a full draft and then annotates it with specific revision notes: 'this paragraph should move to after paragraph 3', 'replace this vague phrase with a specific example', 'the argument jumps here -- need a bridging sentence', 'this is my weakest point -- either develop it or cut it'. The annotations show that the student reads their own draft critically and has concrete plans for improvement.]",
        "common_errors": [
          "Annotating surface issues (spelling, grammar) but not structural or argumentative ones",
          "Identifying problems without proposing solutions"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Treats drafting as a creative process where ideas develop through the act of writing, understanding that the best insights often emerge during drafting rather than during planning.",
        "example_task": "Write a first draft and then reflect on how the act of writing changed your understanding of the topic.",
        "example_response": "[Completes a draft and reflects: 'When I started, I planned to argue that the character is a straightforward villain. But while writing paragraph 3, I realised the evidence actually supports a more nuanced reading -- the character's actions are villainous but their motivation is understandable. The draft changed my argument. My revised thesis will be that the character is morally complex rather than simply evil. This is better than my original plan because it engages with the text more honestly. The first draft was not a failure -- it was the thinking process that produced a better argument.' The student demonstrates understanding that writing is a form of thinking, not just a record of thoughts already formed.]",
        "common_errors": [
          "Sticking rigidly to the original plan even when drafting reveals a better direction",
          "Not reflecting on what the drafting process taught them about the topic"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C089",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Does not proof-read work before submitting it, or reads through once without catching errors.",
        "example_task": "Read your work carefully and correct any mistakes in spelling, punctuation or grammar.",
        "example_response": "[Glances at the work briefly and says 'it looks fine' without catching several obvious errors.]",
        "common_errors": [
          "Reading for meaning rather than for accuracy, so errors are invisible",
          "Not knowing what to look for when proof-reading"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Proof-reads with some effectiveness, catching and correcting common errors in spelling, punctuation and grammar when prompted.",
        "example_task": "Proof-read this paragraph. There are three errors. Find and correct them.",
        "example_response": "[Finds and corrects 2 out of 3 errors, typically catching spelling mistakes and missing full stops but missing more subtle errors like comma splices or subject-verb agreement.]",
        "common_errors": [
          "Catching only the most obvious errors (spelling) and missing punctuation or grammar errors",
          "Proof-reading too quickly to catch anything"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Proof-reads systematically and effectively, using strategies like reading aloud, reading backwards, or focusing on one error type at a time, and catches most errors.",
        "example_task": "Proof-read your essay using a systematic method. Describe your process.",
        "example_response": "[Describes and demonstrates a systematic process: 'First I read the whole piece aloud to catch awkward phrasing and missing words. Then I read it again focusing only on punctuation -- checking commas, apostrophes and sentence boundaries. Third, I checked my personal error list: I know I often confuse 'their/there/they're' and use comma splices, so I searched specifically for these. I found and corrected four errors including one comma splice and one incorrect apostrophe.']",
        "common_errors": [
          "Having a systematic method but not applying it consistently",
          "Not maintaining a personal list of frequent errors"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Proof-reads with the precision and self-awareness of an experienced writer, catching virtually all errors and understanding that accuracy is not merely correctness but a dimension of writing quality.",
        "example_task": "Proof-read your work and explain how technical accuracy contributes to the effectiveness of your writing.",
        "example_response": "[Produces virtually error-free writing and explains: 'Accuracy is not just about following rules -- it is about the reader's trust. A comma splice in an argument about education undermines the writer's credibility because the reader thinks: if you cannot control a sentence, why should I trust your control of an argument? Accurate punctuation also creates meaning: I used a semi-colon between two related clauses because I wanted to show the logical connection between them. A full stop would have separated them too sharply; a comma would have been grammatically incorrect. Technical accuracy is not the boring bit of writing -- it is the craft that makes everything else work.']",
        "common_errors": [
          "Proof-reading effectively but not recognising the relationship between accuracy and credibility",
          "Achieving accuracy through caution (avoiding complex punctuation) rather than through skill (using it correctly)"
        ]
      }
    ]
  }
]
