[
  {
    "concept_id": "EN-Y4-C016",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Choosing a book to read independently and explaining why they chose it.",
        "example_task": "Choose a book from the class library. Tell your partner why you picked it.",
        "example_response": "I chose this book because I like the cover — it has a dragon on it and I like fantasy stories. Also, my friend said it was really good.",
        "common_errors": [
          "Choosing a book that is far too easy or too hard",
          "Unable to give any reason for the choice"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Reading a range of texts including books they would not normally choose, and talking about what they enjoyed or found interesting.",
        "example_task": "This week you read a poetry book chosen by your teacher. Write two sentences about what you thought of it — even if it wasn't your usual choice.",
        "example_response": "I don't usually choose poetry, but I liked the poem about the storm because the words made me feel like I was actually there. Some poems were confusing, but I liked the funny ones about school.",
        "common_errors": [
          "Dismissing unfamiliar genres without genuine engagement",
          "Only commenting on whether they 'liked' it without saying anything specific"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Reading widely across fiction, poetry, plays, non-fiction and reference texts, discussing preferences and making recommendations to others.",
        "example_task": "Write a book recommendation for the class display. Include what the book is about, who would enjoy it, and what makes it special.",
        "example_response": "I recommend 'The Wild Robot' by Peter Brown. It is about a robot called Roz who wakes up on an island and has to learn to survive in the wild. I would recommend it to anyone who likes nature and adventure. What makes it special is that it makes you think about what it means to belong — even if you are different from everyone around you.",
        "common_errors": [
          "Writing a plot summary without evaluation",
          "Recommending only to people who like the same genres they do"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Reflecting on how reading habits and preferences have developed over time, and seeking out unfamiliar authors and genres independently.",
        "example_task": "Write a reading reflection: How have your reading tastes changed since Year 2? What book changed your mind about a genre?",
        "example_response": "In Year 2, I only read funny books like Tom Gates. I didn't think I liked serious stories. Then in Year 3, my teacher read us 'The Boy at the Back of the Class' and I cried at the end. That changed my mind about realistic fiction because I realised stories about real problems can be just as gripping as funny ones. Now I choose a mix — I still love comedy but I also read historical fiction and even some poetry.",
        "common_errors": [
          "Listing books read without reflecting on how tastes have changed",
          "Claiming to enjoy everything without genuine self-awareness about preferences"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C017",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that different types of text look different and are read in different ways.",
        "example_task": "Look at these three texts: a story opening, a recipe, and a dictionary page. How is each one organised differently?",
        "example_response": "The story is written in paragraphs with long sentences. The recipe has a list of ingredients and numbered steps. The dictionary page has words in bold with definitions after them, in alphabetical order.",
        "common_errors": [
          "Describing only the content, not the structure",
          "Not noticing presentational features like bold text or numbering"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Reading different text types using appropriate strategies — skimming for gist, scanning for specific information, close reading for understanding.",
        "example_task": "You need to find out what year the Great Fire of London happened. Which reading strategy would you use with this encyclopaedia entry — and why wouldn't you read the whole thing?",
        "example_response": "I would scan the text for a date, looking for numbers. I wouldn't read the whole thing because I only need one specific fact, and scanning is faster than reading every word.",
        "common_errors": [
          "Reading the entire text from start to finish regardless of purpose",
          "Not knowing how to scan — reading slowly until they happen upon the answer"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Understanding how text structure serves purpose and choosing the appropriate reading approach for different texts and purposes.",
        "example_task": "You have three texts about climate change: a newspaper article, a science textbook entry, and a poem. Explain how you would read each one differently and what you would expect to learn from each.",
        "example_response": "The newspaper article — I would skim the headline and opening paragraph for the main news, then read more carefully if it is relevant. I'd expect recent events and opinions. The science textbook — I would use the subheadings to find the section I need, then read closely and take notes. I'd expect facts and explanations. The poem — I would read it slowly, more than once, paying attention to the language and imagery. I'd expect feelings and ideas rather than facts.",
        "common_errors": [
          "Approaching all three texts in the same way",
          "Not recognising that a poem requires a different kind of reading from a textbook"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating how effectively a text's structure serves its purpose and suggesting how it could be reorganised for a different purpose or audience.",
        "example_task": "This information about rainforests is written as a report with subheadings. How would you restructure it if you wanted to persuade people to protect rainforests?",
        "example_response": "The report presents facts neutrally under headings like 'Location' and 'Climate'. To make it persuasive, I would reorganise it to start with a shocking statistic about deforestation to hook the reader. Then I would use the facts about biodiversity and oxygen to build an emotional argument. I would add a section about what readers can do to help, and end with a powerful image or quote. The structure would move from problem to solution rather than listing facts.",
        "common_errors": [
          "Suggesting minor changes (add pictures) rather than structural reorganisation",
          "Not connecting structural choices to the change in purpose"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C018",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Using alphabetical order to the first letter to locate a word in a dictionary.",
        "example_task": "Put these words in alphabetical order and find 'ancient' in the dictionary: ancient, bridge, castle.",
        "example_response": "ancient, bridge, castle. [Finds 'ancient' in the A section] Ancient means very, very old — from a long time ago.",
        "common_errors": [
          "Searching in the wrong alphabetical section",
          "Giving up if the word is not on the first page they open"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using the first two or three letters to navigate efficiently and selecting the correct definition when multiple meanings are given.",
        "example_task": "Look up the word 'light' in the dictionary. It has several meanings. Which meaning fits this sentence: 'The feather was as light as air'?",
        "example_response": "The dictionary gives several meanings for 'light': 1) brightness from the sun or a lamp, 2) not heavy, 3) pale in colour. In 'The feather was as light as air', the correct meaning is number 2: not heavy.",
        "common_errors": [
          "Selecting the first definition without checking it fits the context",
          "Not reading beyond the first meaning listed"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using a dictionary efficiently to check meanings of words encountered in reading, using guide words and knowledge of first two or three letters to locate words quickly.",
        "example_task": "While reading, you encounter: 'The knight's quest was perilous.' Look up 'perilous' and 'quest' in under one minute each. Use the guide words at the top of the page to help.",
        "example_response": "'Perilous' — I looked in the P section, used guide words to find 'per-' words quickly. Perilous means full of danger or risk. 'Quest' — I looked in the Q section. Quest means a long search for something important, like a journey to find treasure or truth.",
        "common_errors": [
          "Not using guide words, instead turning pages one by one",
          "Looking up the word but not connecting the definition back to the sentence"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using a dictionary as part of a broader vocabulary strategy — checking definitions, exploring word origins, and noting related words.",
        "example_task": "Look up 'benevolent' in the dictionary. Find its meaning, its origin, and two related words from the same root.",
        "example_response": "Benevolent means kind and generous, wanting to help others. It comes from the Latin 'bene' meaning 'well' and 'volens' meaning 'wishing' — so it literally means well-wishing. Related words: benefit (a good thing, from 'bene' + 'facere' = to do), and volunteer (from the same Latin root 'vol' meaning to wish or be willing).",
        "common_errors": [
          "Finding the definition but not exploring the etymology",
          "Identifying related words by sound rather than by shared root meaning"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C019",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Retelling a familiar fairy tale, myth or legend with key events in the correct order.",
        "example_task": "Retell the story of Theseus and the Minotaur. Include the beginning, the problem, and how it was solved.",
        "example_response": "There was a terrible monster called the Minotaur that lived in a maze under the palace. Every year, young people were sent into the maze to be eaten. Theseus volunteered to go in and kill the Minotaur. A princess called Ariadne gave him a ball of string so he could find his way out. He fought the Minotaur and escaped by following the string back.",
        "common_errors": [
          "Missing key plot events",
          "Confusing details from different myths"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying common themes and features across fairy tales, myths or legends from different traditions.",
        "example_task": "You have read Cinderella and the Egyptian story of Rhodopis. What features do both stories share?",
        "example_response": "Both stories have a poor girl who is treated badly by others. Both have a special item (a glass slipper and a golden sandal) that helps the girl be recognised. Both end with the girl being chosen by a powerful man. Both have a magical helper.",
        "common_errors": [
          "Listing plot events rather than identifying shared features",
          "Only noticing surface similarities (both have shoes) without identifying deeper patterns"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Discussing how myths and legends reflect the values and beliefs of the culture that produced them, with examples from different traditions.",
        "example_task": "Compare a Greek myth and a Norse myth. What do they tell us about what each culture valued?",
        "example_response": "In Greek myths, heroes like Odysseus succeed through cleverness and strategy — the Greeks valued intelligence and cunning. In Norse myths, heroes like Thor succeed through strength and bravery in battle — the Norse valued physical courage and honour. The Greek gods live on sunny Mount Olympus; the Norse gods live in cold, harsh Asgard. This reflects the different environments and values of Mediterranean and Scandinavian cultures.",
        "common_errors": [
          "Describing the myths without connecting them to cultural values",
          "Assuming all myths teach the same lessons"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Analysing how mythological themes appear in modern stories and explaining why these themes endure across time and cultures.",
        "example_task": "How does the myth of Icarus connect to any modern story, film or real-life situation you know? Why do you think this theme keeps appearing?",
        "example_response": "Icarus flew too close to the sun despite his father's warning, and his wax wings melted. This theme appears in modern stories too — for example, in Charlie and the Chocolate Factory, the children who ignore warnings (like Augustus Gloop eating too much) face consequences. The theme keeps appearing because people in every culture need to learn about the dangers of ignoring good advice and being overconfident. It is a universal lesson about hubris — thinking you know better than everyone else.",
        "common_errors": [
          "Making a superficial connection (both involve flying) rather than a thematic one",
          "Not explaining why the theme endures"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C020",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying the main theme of a familiar book using simple language.",
        "example_task": "What is 'The Lion, the Witch and the Wardrobe' mainly about? Not the plot — the big idea.",
        "example_response": "It is mainly about the fight between good and evil. Aslan represents good and the White Witch represents evil.",
        "common_errors": [
          "Retelling the plot instead of identifying the theme",
          "Giving a very surface-level answer ('it's about lions')"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying themes and genre conventions in different types of books, with examples from the text.",
        "example_task": "You have been reading a detective story. What conventions of detective stories can you find? Give examples from the book.",
        "example_response": "Detective stories usually have: a crime or mystery at the start (in our book, the jewels are stolen); a detective who looks for clues (Inspector Drake finds a muddy footprint); red herrings that mislead (the butler seems suspicious but is innocent); and a reveal at the end where the detective explains everything.",
        "common_errors": [
          "Listing plot events without connecting them to genre conventions",
          "Confusing conventions with personal preferences"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Tracking how a theme develops across a whole text and explaining how the author conveys it through characters, events and language.",
        "example_task": "In 'The Firework Maker's Daughter', how does the theme of determination develop from the beginning to the end of the story?",
        "example_response": "At the beginning, Lila is determined to become a firework-maker even though her father says no. Her determination is shown through her secret experiments. In the middle, she faces the dangerous journey to the fire fiend, and her determination is tested when she nearly gives up. By the end, her determination is rewarded — she creates the most beautiful firework. The author shows that determination means facing real danger and doubt, not just wanting something.",
        "common_errors": [
          "Identifying the theme at the start but not tracking how it develops",
          "Confusing theme development with plot summary"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Comparing how the same theme is handled differently in two or more books, evaluating which treatment is more effective.",
        "example_task": "Both 'Skellig' and 'The Secret Garden' explore the theme of healing. How does each author handle this theme, and which do you find more powerful?",
        "example_response": "In 'The Secret Garden', healing is literal — the garden heals Colin's body and Mary's loneliness. The author uses nature as a symbol of recovery. In 'Skellig', healing is more mysterious — we are not sure if Skellig is an angel or a strange person, and the baby's recovery feels almost magical. I find Skellig more powerful because the uncertainty makes the healing feel fragile and precious, whereas in The Secret Garden it feels more certain and safe.",
        "common_errors": [
          "Describing each book separately without genuine comparison",
          "Evaluating based on personal enjoyment rather than how effectively the theme is conveyed"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C021",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Reading aloud a short poem with basic expression, varying volume for emphasis.",
        "example_task": "Read aloud the poem 'The Owl and the Pussycat' (first verse). Try to make it sound interesting, not flat.",
        "example_response": "[Reads with some variation in tone, emphasising rhyming words and slowing for the final line]",
        "common_errors": [
          "Reading in a flat monotone",
          "Rushing through without pausing at line endings"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Preparing a performance of a poem or play script, making choices about intonation and tone to convey meaning.",
        "example_task": "Prepare to perform the witches' chant from Macbeth: 'Double, double toil and trouble; Fire burn and cauldron bubble.' How will you use your voice to create atmosphere?",
        "example_response": "[Starts quietly, building volume] 'Double, double [rhythmic, like a spell] toil and trouble; [voice rises] Fire BURN [emphasis] and cauldron BUBBLE [drawn out, sinister]'",
        "common_errors": [
          "Performing loudly throughout without variation",
          "Not connecting vocal choices to the mood of the text"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Performing poems and play scripts showing clear understanding through deliberate use of intonation, tone, volume, pace and action.",
        "example_task": "Perform two contrasting poems: a funny poem and a serious poem. Show through your performance that you understand the different moods.",
        "example_response": "[Funny poem: quick pace, varied pitch, exaggerated emphasis, pauses for comic timing. Serious poem: slower pace, quieter volume, measured pauses, sincere tone with careful emphasis on key images]",
        "common_errors": [
          "Performing both poems in the same style",
          "Using exaggerated expression that obscures rather than conveys meaning"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Analysing how performance choices affect the audience's understanding and making different interpretive choices for the same text.",
        "example_task": "Perform the same poem twice with two different interpretations. Explain what you changed and how it altered the meaning.",
        "example_response": "First time, I read 'I wandered lonely as a cloud' in a sad, slow voice because the speaker is alone. Second time, I read it in a dreamy, peaceful voice because the speaker is enjoying being alone in nature. I changed the pace and tone — sad version had long pauses and falling intonation; peaceful version had a lilting rhythm and rising inflections. The same words can mean different things depending on how you read them.",
        "common_errors": [
          "Making only superficial changes (louder/quieter) rather than interpretive ones",
          "Unable to explain how the changes affected meaning"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C022",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying words or phrases in a text that they find interesting or effective.",
        "example_task": "Read this description: 'The moon hung like a silver coin in the velvet sky.' Which words do you find effective? Why?",
        "example_response": "I like 'silver coin' because it helps me picture exactly what the moon looked like — round and shiny. I also like 'velvet sky' because velvet is soft and dark, just like the night sky.",
        "common_errors": [
          "Saying 'I like the description' without identifying specific words",
          "Identifying words but not explaining why they are effective"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Discussing how an author's word choices create specific effects on the reader, using terms like simile and alliteration.",
        "example_task": "Read: 'The snake slithered silently through the silver grass.' What techniques has the author used and what effect do they create?",
        "example_response": "The author uses alliteration — 's' sounds in 'snake slithered silently silver'. The repeated 's' sound mimics the hissing of a snake and makes the sentence feel smooth and sneaky, like the snake itself.",
        "common_errors": [
          "Naming the technique without explaining the effect",
          "Saying 'it makes it more interesting' without being specific about how"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Analysing how language choices work together to create mood, atmosphere or character, discussing the author's likely intention.",
        "example_task": "Read this extract where the character enters an abandoned house. How does the author use language to create a sense of unease?",
        "example_response": "The author uses short sentences — 'The door creaked. Dust hung in the air.' — which create tension because each sentence feels like a step into danger. The verb 'creaked' sounds like the noise it describes. The metaphor 'shadows swallowed the hallway' makes the darkness feel alive and threatening. Together, these choices make the reader feel nervous, as if something bad is about to happen.",
        "common_errors": [
          "Listing techniques without explaining how they work together",
          "Analysing individual words without connecting them to the overall mood"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating whether an author's language choices are effective and suggesting alternatives, explaining how the effect would change.",
        "example_task": "The author writes: 'The storm raged furiously.' Evaluate this phrase. Is it effective? How could it be improved?",
        "example_response": "'Raged furiously' is a bit redundant because 'raged' already suggests fury — the adverb doesn't add much. A more effective alternative might be: 'The storm tore at the rooftops' because the verb 'tore' is more specific and visual, and 'at the rooftops' gives a concrete image. Or simply 'The storm raged' — sometimes removing a word makes the writing stronger.",
        "common_errors": [
          "Assuming published writing is always perfect and cannot be improved",
          "Suggesting alternatives that are weaker than the original without recognising it"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C023",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that poems come in different forms and identifying basic features like rhyme and rhythm.",
        "example_task": "Listen to two poems: a limerick and a haiku. What is different about them?",
        "example_response": "The limerick is longer (five lines), it rhymes, and it's funny. The haiku is very short (three lines), it doesn't rhyme, and it's about nature.",
        "common_errors": [
          "Noticing only whether the poem rhymes or not",
          "Thinking all poems must rhyme"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying different poetry forms by their characteristics, including free verse, narrative poetry and acrostic poems.",
        "example_task": "Read these three poems and identify the form of each: a narrative poem that tells a story, a free verse poem with no regular pattern, and an acrostic where the first letters spell a word.",
        "example_response": "Poem A is narrative poetry because it tells the story of a journey with characters and events. Poem B is free verse because it has no rhyme scheme or regular rhythm — the lines are different lengths. Poem C is an acrostic because the first letters of each line spell WINTER.",
        "common_errors": [
          "Confusing free verse with badly written poetry",
          "Thinking narrative poetry must rhyme"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Understanding how the form of a poem shapes its content and effect, appreciating that poets make deliberate choices about form.",
        "example_task": "Why do you think the poet chose to write about loneliness as a haiku rather than as a long narrative poem? What effect does the short form create?",
        "example_response": "A haiku has only 17 syllables, so the poet has to choose every word very carefully. This compression mirrors loneliness itself — the feeling of being small and alone. If the poet had written a long narrative poem, the reader might feel the loneliness less because there would be more words surrounding it. The shortness of the haiku makes the feeling intense and immediate.",
        "common_errors": [
          "Saying the poet chose haiku because they like haiku, without analysing the effect",
          "Not connecting the form to the content or theme"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Writing the same idea in two different poetic forms and explaining how the form changed the effect.",
        "example_task": "Write about a thunderstorm as a haiku and as a four-line rhyming poem. Which works better and why?",
        "example_response": "Haiku: 'Black clouds gather close / Lightning splits the heavy sky / Rain drums on the roof.' Rhyming: 'The thunder crashes, loud and deep, / The lightning flashes while we sleep, / The rain comes pouring, fierce and fast, / Until the angry storm has passed.' The haiku captures one frozen moment — it feels immediate and intense. The rhyming poem tells the whole story of the storm from start to finish. For a thunderstorm, I think the haiku works better because storms are sudden and powerful, which matches the compressed form.",
        "common_errors": [
          "Writing both versions about the storm without analysing how the form changes the effect",
          "Judging the rhyming version as 'better' just because it is longer"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C024",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Noticing when a text stops making sense and rereading to try to fix the problem.",
        "example_task": "Read this passage silently. Put your hand up when you reach a part that does not make sense. Then reread it.",
        "example_response": "[Identifies the confusing sentence and rereads it] 'I got confused here because it says the character went left, but earlier it said the door was on the right. When I reread it, I realised the character turned around first.'",
        "common_errors": [
          "Continuing past confusing parts without noticing",
          "Rereading but still not identifying what was confusing"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using multiple fix-up strategies when comprehension breaks down: rereading, reading on, and using context to infer word meanings.",
        "example_task": "Read this passage. When you come to a word you don't know, try three things: reread the sentence, read the next sentence, then use the surrounding words to guess the meaning.",
        "example_response": "I didn't know the word 'apprehensive'. First, I reread: 'She felt apprehensive as she approached the dark cave.' Then I read on: 'Her heart was racing and her palms were sweating.' From the context — dark cave, racing heart, sweating — I think apprehensive means nervous or worried.",
        "common_errors": [
          "Using only one strategy (always rereading) without trying others",
          "Skipping unknown words entirely"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Monitoring comprehension independently while reading, deploying a range of fix-up strategies including morphological analysis and dictionary use.",
        "example_task": "Read this non-fiction text about habitats. Note three places where you had to pause and use a strategy to maintain understanding. Record what you did.",
        "example_response": "1. 'Biodiversity' — I broke it into parts: 'bio' (life) + 'diversity' (variety) = variety of life. 2. 'The ecosystem maintains equilibrium' — I reread and realised 'equilibrium' means balance, because the paragraph was about how predators and prey keep each other in check. 3. 'Photosynthesis converts carbon dioxide' — I knew 'photo' means light and 'synthesis' means putting together, so photosynthesis is using light to put things together (making food from sunlight).",
        "common_errors": [
          "Monitoring word-level understanding but missing paragraph-level meaning",
          "Not recognising when meaning has broken down at a higher level"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Recognising different types of comprehension difficulty (unfamiliar vocabulary, complex sentence structure, background knowledge gaps) and selecting the appropriate strategy for each.",
        "example_task": "Explain the difference between not understanding a word, not understanding a sentence, and not understanding a whole paragraph. What strategy would you use for each?",
        "example_response": "If I don't understand a word, I use morphology or a dictionary. If I don't understand a sentence, I reread it and try breaking it into clauses — often the problem is a long sentence with several subordinate clauses, and I need to find the main clause first. If I don't understand a whole paragraph, the problem is usually background knowledge — I might need to read a simpler text about the same topic first, or ask someone to explain the concept.",
        "common_errors": [
          "Using the same strategy regardless of the type of difficulty",
          "Not recognising that sometimes the problem is background knowledge, not reading skill"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C025",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Asking simple questions about a text to check understanding of what happened.",
        "example_task": "After reading Chapter 1, write two questions about what happened that you could ask a partner.",
        "example_response": "Where did the character find the key? Why was the dog barking at the door?",
        "common_errors": [
          "Asking questions so simple they can be answered without reading the text",
          "Writing statements rather than questions"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Generating questions at different levels — literal, inferential and evaluative — to deepen understanding.",
        "example_task": "Write three questions about the chapter you just read: one that can be answered from the text, one that requires you to read between the lines, and one that asks for your opinion.",
        "example_response": "Literal: What did the character eat for breakfast? Inferential: Why do you think the character chose to walk to school alone rather than wait for her friends? Evaluative: Do you think the character made the right decision? Why?",
        "common_errors": [
          "Writing three literal questions despite the instruction to vary types",
          "Not understanding the difference between inferential and evaluative questions"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using questioning as a reading strategy to deepen comprehension, generating questions before, during and after reading.",
        "example_task": "Before you read Chapter 5, write a prediction question. While reading, write a clarification question. After reading, write an evaluation question.",
        "example_response": "Before: Based on the cliffhanger in Chapter 4, will the character escape from the locked room? During: The text mentions a 'secret passage' — when was this built and who knows about it? After: The character betrayed her friend to escape. Was this justified, given the danger she was in?",
        "common_errors": [
          "Asking all questions after reading rather than at each stage",
          "Generating questions without attempting to answer them"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Asking questions about the author's choices and craft, going beyond the story to examine how and why the text was constructed.",
        "example_task": "Write two questions about the author's craft in this chapter — not about what happens, but about how the author tells the story.",
        "example_response": "Why does the author wait until the final paragraph to reveal that the narrator is actually the villain? How does the short sentence 'She was gone.' at the end of page 34 create a different effect from a longer sentence like 'She had disappeared into the darkness of the forest'?",
        "common_errors": [
          "Asking content questions rather than craft questions",
          "Asking vague questions about craft ('Why is the writing good?') rather than specific ones"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C026",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Making a simple inference about a character's feeling from an obvious textual clue.",
        "example_task": "Read: 'Tom slammed his bedroom door and threw his bag on the floor.' How is Tom feeling? How do you know?",
        "example_response": "Tom is feeling angry. I know because he slammed the door and threw his bag, which are things you do when you are cross.",
        "common_errors": [
          "Stating the emotion without referring to the text",
          "Confusing what the text says with what they would feel in that situation"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Inferring a character's feelings or motives from less obvious clues, citing specific evidence from the text.",
        "example_task": "Read: 'Priya smiled at everyone as she walked in, but her hands were clenched tight inside her pockets.' What can you infer about how Priya is really feeling?",
        "example_response": "I think Priya is nervous or anxious even though she is pretending to be happy. The smile suggests she wants people to think she is confident, but her clenched hands show she is tense. She is hiding her true feelings.",
        "common_errors": [
          "Only noticing the smile and inferring she is happy",
          "Inferring a feeling but not explaining which evidence supports it"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Drawing inferences about characters' feelings, thoughts and motives from their actions, speech and the author's descriptions, justifying with precise textual evidence.",
        "example_task": "Read this extract where the father says goodbye to his daughter at the school gates. What does the text suggest about the father's feelings? Use evidence from at least two places in the text.",
        "example_response": "The text suggests the father is sad about his daughter growing up. Evidence: he 'held her hand a moment longer than necessary' — the word 'necessary' shows he knows she doesn't need him to hold her hand anymore but he doesn't want to let go. Also, 'he watched until she disappeared through the doors' — the fact he watches her until she is completely gone shows he is reluctant to leave and perhaps worried about her.",
        "common_errors": [
          "Providing evidence from only one part of the text",
          "Making inferences that are plausible but not supported by the specific text"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Considering multiple possible interpretations of a character's actions or words, evaluating which inference is best supported by the evidence.",
        "example_task": "Read: 'When the teacher asked who had broken the window, Kai stared at his shoes.' There are several possible reasons for Kai's reaction. Suggest two different interpretations and explain which the text best supports.",
        "example_response": "Interpretation 1: Kai broke the window and feels guilty — staring at his shoes is a sign of shame, avoiding eye contact. Interpretation 2: Kai knows who did it but doesn't want to tell — he avoids the teacher's gaze because he doesn't want to be a snitch. The text best supports interpretation 1 because looking down is more commonly associated with personal guilt than with protecting someone else. However, we would need to read further to be sure.",
        "common_errors": [
          "Only considering one interpretation",
          "Choosing the interpretation they prefer without evaluating which has stronger textual support"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C027",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Making a simple prediction about what will happen next based on an obvious clue in the text.",
        "example_task": "Read: 'The sky turned black and the wind began to howl.' What do you think will happen next?",
        "example_response": "I think there will be a big storm because the sky turning black and the howling wind are signs that bad weather is coming.",
        "common_errors": [
          "Making a random prediction unrelated to the text",
          "Stating what they want to happen rather than what the evidence suggests"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Making predictions based on details stated in the text and knowledge of genre conventions.",
        "example_task": "You are reading a mystery story. The detective has found a muddy footprint near the window and the butler was seen cleaning his shoes late at night. What do you predict?",
        "example_response": "I predict the butler might be the suspect because he was cleaning his shoes, which could mean he was hiding muddy evidence. But in mystery stories, the obvious suspect is often a red herring, so the author might be trying to mislead us.",
        "common_errors": [
          "Not using genre knowledge to inform the prediction",
          "Making a prediction without citing specific textual evidence"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Making predictions from both stated and implied details, weighing different possibilities and explaining which is most likely.",
        "example_task": "The main character has been secretly learning to ride a horse even though her parents forbid it. The village horse show is next week. What do you think will happen? Give two possible predictions and say which is more likely.",
        "example_response": "Prediction 1: She enters the horse show secretly and wins, proving to her parents she is capable. Prediction 2: Her parents discover her secret before the show and there is a confrontation. I think prediction 2 is more likely because the author has been building tension about the secret — the near-discovery on page 45 and the guilty feelings on page 52 suggest the author is leading towards a dramatic reveal, not a simple happy ending.",
        "common_errors": [
          "Making only one prediction without considering alternatives",
          "Predicting based on genre alone without using specific text details"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating predictions after reading further, analysing which clues were reliable and which were deliberately misleading.",
        "example_task": "Earlier, you predicted the butler was guilty. Now that you have finished the chapter, were you right? Which clues misled you and which were accurate?",
        "example_response": "I was wrong — it was actually the gardener. The muddy shoes were a red herring planted by the author to make us suspect the butler. The real clue was on page 23, where the gardener said he 'hadn't been near the house all evening' — we now know this was a lie. The author deliberately used the butler's suspicious behaviour to distract us from the gardener's lie. This taught me to pay attention to what characters say, not just what they do.",
        "common_errors": [
          "Blaming themselves for being wrong rather than analysing the author's technique",
          "Not revisiting earlier predictions to reflect on the reading process"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C028",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying the main idea of a single paragraph.",
        "example_task": "Read this paragraph about penguins. What is the main idea? Say it in one sentence.",
        "example_response": "The main idea is that penguins have special features that help them survive in very cold places.",
        "common_errors": [
          "Giving a detail rather than the main idea",
          "Retelling the whole paragraph rather than summarising"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying the main idea of each paragraph in a short text and listing them in order.",
        "example_task": "Read this three-paragraph text about the water cycle. Write one sentence for the main idea of each paragraph.",
        "example_response": "Paragraph 1: Water evaporates from oceans and lakes when heated by the sun. Paragraph 2: The water vapour rises and cools to form clouds. Paragraph 3: Water falls back to earth as rain or snow and the cycle starts again.",
        "common_errors": [
          "Writing detailed summaries instead of one-sentence main ideas",
          "Missing the main idea and selecting a supporting detail instead"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Synthesising main ideas from multiple paragraphs into a coherent overall summary, distinguishing essential information from supporting detail.",
        "example_task": "Read this article about plastic pollution (five paragraphs). Write a summary of no more than three sentences that captures the main ideas.",
        "example_response": "Plastic pollution is a growing global problem, with millions of tonnes entering the oceans every year. It harms marine life because animals mistake it for food or become entangled in it. Reducing single-use plastics and improving recycling are the most effective solutions.",
        "common_errors": [
          "Writing a paragraph-by-paragraph retelling rather than a synthesised summary",
          "Including minor details while omitting key ideas"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Summarising a complex multi-paragraph text, identifying how the author has structured the argument or information, and noting what has been emphasised or omitted.",
        "example_task": "Summarise this article about deforestation in three sentences. Then explain: what has the author emphasised, and what important information is missing?",
        "example_response": "Summary: Deforestation destroys habitats for millions of species and contributes to climate change. The Amazon rainforest has lost 17% of its forest cover in the last 50 years. International agreements and consumer choices can help reduce the rate of destruction. The author emphasises the environmental damage but does not discuss why people cut down forests — poverty, farming, and economic development. The argument would be stronger if it acknowledged these reasons and suggested solutions that address them.",
        "common_errors": [
          "Summarising accurately but not analysing what is emphasised or omitted",
          "Assuming the author's focus is the complete picture"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C029",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying basic presentational features in a non-fiction text and saying what they do.",
        "example_task": "Look at this information page about volcanoes. What features help you find information quickly?",
        "example_response": "The title tells me the topic. The subheadings help me find sections about different things, like 'Types of volcano' and 'Famous eruptions'. The diagram shows the inside of a volcano with labels.",
        "common_errors": [
          "Describing the content rather than the features",
          "Not recognising that headings and diagrams serve a navigational purpose"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explaining how language and structural features contribute to meaning in both fiction and non-fiction.",
        "example_task": "In this story extract, the author uses very short paragraphs during the chase scene. Why?",
        "example_response": "The short paragraphs create a sense of speed and urgency. Each paragraph feels like a quick breath, which matches the character running. If the paragraphs were long, the scene would feel slower and less exciting.",
        "common_errors": [
          "Noticing short paragraphs but not connecting this to the effect on the reader",
          "Describing the feature without analysing its purpose"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Analysing how language, structure and presentation work together to shape the reader's response in a variety of text types.",
        "example_task": "Compare how this newspaper article and this encyclopaedia entry present information about sharks. How do the language and presentation differ?",
        "example_response": "The newspaper uses a dramatic headline ('Killer Sharks Spotted Off Coast!'), emotional vocabulary ('terrifying', 'deadly') and short punchy paragraphs to create fear and grab attention. The encyclopaedia uses a neutral heading ('Great White Shark'), factual language ('can grow up to 6 metres') and longer paragraphs with subheadings for organised reference. The newspaper wants to excite the reader; the encyclopaedia wants to inform.",
        "common_errors": [
          "Comparing content rather than language and presentation",
          "Not connecting the differences to the different purposes of each text"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating whether structural and presentational choices are effective for their intended purpose and audience, suggesting improvements.",
        "example_task": "This leaflet about healthy eating is aimed at Year 4 children. Evaluate how effectively the layout and language serve this audience. Suggest one improvement.",
        "example_response": "The leaflet uses bright colours and cartoon characters, which appeal to Year 4 children. The bullet points make the advice easy to follow. However, the language in the second section ('macronutrients', 'calorific intake') is too technical for 8-9 year olds and would be better replaced with simpler terms like 'the main food groups' and 'the energy in food'. The author has matched the visual presentation to the audience but not the vocabulary.",
        "common_errors": [
          "Evaluating the design but not the language, or vice versa",
          "Suggesting improvements that do not relate to the specific audience"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C030",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Finding a specific piece of information in a non-fiction text using the contents page or index.",
        "example_task": "Use the index of this book about animals to find out what page tells you about elephant migration.",
        "example_response": "I looked in the index under 'E' for elephant, then found 'migration' listed as a sub-topic on page 34.",
        "common_errors": [
          "Flipping through the book randomly rather than using the index",
          "Looking for the exact phrase 'elephant migration' and not finding it because it is listed differently"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Retrieving information from a non-fiction text and recording it using key words and brief notes rather than copying.",
        "example_task": "Read this page about Roman baths. Make notes about three key facts using bullet points and your own words — do NOT copy sentences from the text.",
        "example_response": "• Romans bathed daily — part of social life, not just cleaning. • Bath water heated by underground fires (hypocaust system). • Baths had different temperature rooms: cold (frigidarium), warm, hot.",
        "common_errors": [
          "Copying whole sentences from the text",
          "Writing notes that are too brief to be useful later"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Researching a question that requires information from multiple sections or sources, selecting relevant information and paraphrasing it.",
        "example_task": "Using two different sources, find out how the Ancient Egyptians preserved dead bodies (mummification). Record the key steps in your own words.",
        "example_response": "From both sources, the key steps were: 1) Remove internal organs and store in canopic jars. 2) Dry the body using natron salt for 40 days. 3) Wrap the body in linen bandages with amulets between the layers. 4) Place in a decorated coffin (sarcophagus). Source 1 also mentioned that the brain was removed through the nose, which Source 2 didn't include.",
        "common_errors": [
          "Using only one source when asked for two",
          "Not noting differences between sources"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Cross-referencing information from multiple sources, evaluating consistency and reliability, and presenting findings in an organised format.",
        "example_task": "Research the question: 'Did Viking invaders or Viking settlers have a bigger impact on Britain?' Use at least two sources. Present your findings in a table comparing the evidence.",
        "example_response": "[Creates a comparison table] Viking as invaders: raided monasteries (both sources agree); destroyed towns (Source 1); caused fear and disruption (Source 2). Viking as settlers: established Danelaw with own laws (both agree); introduced new words to English (Source 2 only); traded with other countries (Source 1). Both sources suggest settlement had a longer-lasting impact, though Source 1 emphasises the violence more than Source 2.",
        "common_errors": [
          "Presenting all information without organising it around the research question",
          "Accepting all sources as equally reliable without evaluation"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C031",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Sharing a personal response to a book read to them or read independently.",
        "example_task": "Tell your partner one thing you enjoyed about the book and one thing that surprised you.",
        "example_response": "I enjoyed the part where the dog rescued the little girl because it was really exciting. I was surprised that the old man turned out to be kind — I thought he was going to be the villain.",
        "common_errors": [
          "Only retelling the plot without sharing a personal response",
          "Saying 'I liked it' without specifying what or why"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Participating in a book discussion by supporting views with evidence from the text, listening to and responding to others' ideas.",
        "example_task": "In your group, discuss: Is the main character brave or foolish? Listen to others and respond to their points.",
        "example_response": "I think she is brave because she goes into the cave to save her brother even though she is terrified — the text says 'her knees were shaking'. But I see your point, Amir — she didn't tell anyone where she was going, which was foolish. Maybe she is both brave and foolish at the same time.",
        "common_errors": [
          "Ignoring others' points and only sharing own opinion",
          "Not using evidence from the text to support views"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Participating in discussion about books, taking turns, listening to others, and comparing texts with each other and with personal experience.",
        "example_task": "Discuss your class novel in your book group. Compare it with another book you have read on a similar theme.",
        "example_response": "This book reminds me of 'Kensuke's Kingdom' because both are about children who end up alone and have to survive. But in our book, the character chose to leave, whereas Michael in Kensuke's Kingdom fell off a boat by accident. That changes how I feel about them — I admire Michael more because he copes with something he didn't choose, but our character is braver because she chose the risk.",
        "common_errors": [
          "Making a superficial comparison ('both have a child in them')",
          "Dominating the discussion without allowing others to contribute"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Offering and supporting alternative interpretations of a text, recognising that there is not always one 'right' reading.",
        "example_task": "Your class has two different views about the ending of your book. Some think it is happy; others think it is sad. Present both interpretations with evidence and explain why the author might have created an ambiguous ending.",
        "example_response": "The ending could be happy because the character finally returns home and is reunited with her family — 'She saw the kitchen light on and ran.' But it could also be sad because she has changed so much that home feels different — 'Everything was exactly the same, and yet nothing was.' The author might have made the ending ambiguous deliberately because real life doesn't always have neat happy endings, and the character's experience has changed her permanently. The reader has to decide which interpretation they believe.",
        "common_errors": [
          "Arguing strongly for one interpretation without acknowledging the other",
          "Not connecting the ambiguity to a possible authorial purpose"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C064",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Expressing a simple personal opinion about a book with a basic reason.",
        "example_task": "What did you think of the book you just finished? Give one reason.",
        "example_response": "I really enjoyed it because the main character was funny and I wanted to know what happened next.",
        "common_errors": [
          "Saying 'it was good' without any reason",
          "Confusing a summary with an opinion"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Justifying a view about a book with specific reference to the text.",
        "example_task": "Did you enjoy the ending of the book? Explain your answer with evidence from the story.",
        "example_response": "I found the ending satisfying because all the clues from earlier came together. For example, the broken compass from Chapter 2 turned out to be the key to solving the mystery. It made me want to reread the book to spot clues I missed.",
        "common_errors": [
          "Giving a general opinion without specific textual reference",
          "Only discussing the plot without evaluating the quality of writing"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Independently justifying views about reading, evaluating specific aspects such as character, plot, language and themes.",
        "example_task": "Write a book review that evaluates at least three aspects: character, plot and language. Would you recommend it?",
        "example_response": "The characters in 'The Explorer' are well-developed — Con's stubbornness makes her realistic, not just likeable. The plot builds tension effectively, especially the piranha scene, which made me hold my breath. The language is beautiful — Rundell describes the jungle so vividly that I felt like I was there. I would recommend this book to anyone who enjoys adventure stories with real depth.",
        "common_errors": [
          "Focusing only on plot",
          "Evaluating as 'good' or 'bad' without explaining what makes it so"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating books critically, considering who the intended audience is and how effectively the book achieves its purpose.",
        "example_task": "Who do you think this book was written for? How effectively does it reach that audience? Would it work for a different audience?",
        "example_response": "I think 'The Boy at the Back of the Class' was written for children aged 8-11 to help them understand the refugee experience. It works brilliantly because it tells the story from a child's perspective, so the reader can relate. The vocabulary is accessible but the themes are serious. For an adult audience, the simplicity might feel too gentle — an adult novel about refugees would include more of the harsh realities. But for its intended audience, it is exactly right because it builds empathy without overwhelming.",
        "common_errors": [
          "Not considering audience at all",
          "Assuming all books are written for people like themselves"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C065",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Sustaining silent reading for 5-10 minutes and being able to recall what was read.",
        "example_task": "Read silently for 10 minutes. Then tell your partner what happened in the pages you read.",
        "example_response": "In the chapter I read, the character found a secret room behind the bookshelf. Inside there were old maps and a strange compass. She decided to take the compass but leave the maps.",
        "common_errors": [
          "Turning pages without actually processing the content",
          "Not being able to recall any details after reading"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Reading silently for sustained periods (15+ minutes), applying comprehension strategies independently.",
        "example_task": "Read your book silently for 15 minutes. In your reading journal, write one question the text raised for you and one prediction.",
        "example_response": "Question: Why did the character's mother keep looking out of the window? She seems worried about something we don't know about yet. Prediction: I think someone is coming to visit who the mother doesn't want the character to meet — maybe the father who left.",
        "common_errors": [
          "Reading for 15 minutes but not engaging actively enough to generate questions",
          "Choosing a book too easy to require active comprehension"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Reading silently with good understanding across a range of text types, monitoring comprehension and applying all strategies independently.",
        "example_task": "During silent reading time, read a chapter of your novel AND a page of a non-fiction text. Compare the different ways you read each one.",
        "example_response": "For my novel, I read more quickly because I am absorbed in the story and the vocabulary is familiar. I slowed down during the descriptive passage because I wanted to picture the scene. For the non-fiction text about space, I read more slowly and reread one paragraph because the explanation of gravity was confusing. I also looked at the diagram to help me understand. I read fiction for the experience and non-fiction for information, so my approach is different.",
        "common_errors": [
          "Reading both texts at the same pace and in the same way",
          "Not noticing that comprehension strategies differ by text type"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Reflecting on own reading habits and development, setting personal reading goals, and choosing appropriately challenging texts.",
        "example_task": "Assess your own reading: What types of texts do you read most confidently? Where do you need to push yourself? Set a specific goal.",
        "example_response": "I am most confident reading fiction — I can read novels quickly and understand complex plots and characters. I find non-fiction harder, especially texts with lots of technical vocabulary like science books. I also avoid poetry because I find it confusing when there is no story. My goal for this term is to read one non-fiction book about a topic I'm interested in (probably space) and to read at least five poems and try to enjoy them. I'll use the morphology skills we've learned to help with unfamiliar vocabulary in both.",
        "common_errors": [
          "Setting vague goals ('read more') rather than specific ones",
          "Not being honest about areas of difficulty"
        ]
      }
    ]
  }
]