[
  {
    "concept_id": "EN-Y5-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that longer words can be broken into smaller meaningful parts (root, prefix, suffix) when prompted by the teacher.",
        "example_task": "Look at the word 'unhelpful'. Can you find the root word inside it? What has been added to the beginning and the end?",
        "example_response": "The root word is 'help'. 'Un' has been added to the beginning and 'ful' has been added to the end.",
        "common_errors": [
          "Splitting the word into syllables (un-help-ful) rather than morphemes",
          "Identifying the root as 'helpful' rather than 'help'"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Breaking unfamiliar words into root, prefix and suffix with increasing independence, and using the parts to make a reasonable guess at meaning.",
        "example_task": "You come across the word 'misinform' in a newspaper article. Break it into its parts and explain what you think it means.",
        "example_response": "The root word is 'inform', which means to tell someone something. The prefix 'mis-' means wrongly. So 'misinform' means to tell someone something that is wrong.",
        "common_errors": [
          "Identifying the root but not connecting the prefix meaning to the whole word",
          "Confusing 'mis-' with 'miss' and guessing the word relates to missing something"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Independently analysing unfamiliar words by identifying root, prefix and suffix, explaining how each part contributes to overall meaning, and connecting words within the same word family.",
        "example_task": "Look at these words: spectator, spectacle, spectacular, inspect, specimen. What root do they share? What does the root mean? Explain how each word uses the root.",
        "example_response": "They all share the Latin root 'spec' or 'spect', which means to look or see. A spectator is someone who looks at something. A spectacle is something worth looking at. Spectacular means amazing to look at. Inspect means to look closely at something. Specimen is something you look at carefully to study it.",
        "common_errors": [
          "Identifying the shared letter pattern but not connecting it to a shared meaning",
          "Assuming all words with similar letter strings share a root when they do not"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Applying morphological analysis flexibly and automatically across all subjects, explaining how spelling is motivated by meaning rather than sound, and using morphological knowledge to self-correct spelling of unfamiliar words.",
        "example_task": "In science, you encounter the word 'photosynthesis'. Break it into its morphemes, explain what each part means, and list two other words that use each morpheme.",
        "example_response": "'Photo' comes from the Greek for light, like photograph and photon. 'Synthesis' comes from Greek meaning putting together, like synthetic and synthesiser. So photosynthesis means putting together using light, which is how plants make food using sunlight. Knowing the root 'photo' means light also helps me spell it correctly because it starts with 'ph' not 'f', since it comes from Greek.",
        "common_errors": [
          "Analysing the word correctly but not transferring the knowledge to spelling decisions in other contexts",
          "Treating morphological analysis as a reading-only skill rather than applying it to writing and spelling"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Understanding that English words come from different languages and that some words share a common origin.",
        "example_task": "The words 'telephone', 'television' and 'telescope' all start with 'tele-'. Your teacher tells you 'tele-' comes from Greek and means 'far away'. What do you think each word means?",
        "example_response": "Telephone means hearing from far away. Television means seeing from far away. Telescope means looking at things far away.",
        "common_errors": [
          "Guessing meanings based on personal association rather than the Greek root",
          "Not understanding that 'tele-' carries its own meaning separate from the rest of the word"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using knowledge of common Greek and Latin roots to work out meanings of unfamiliar words, with some teacher support.",
        "example_task": "Sort these words into two groups based on their root: autograph, transport, biography, export, paragraph, portable. Group 1 uses the Greek root 'graph' (writing). Group 2 uses the Latin root 'port' (to carry).",
        "example_response": "Graph group: autograph (writing your own name), biography (writing about a life), paragraph (a section of writing). Port group: transport (carry across), export (carry out), portable (able to be carried).",
        "common_errors": [
          "Sorting by surface features such as word length rather than by root meaning",
          "Placing 'paragraph' in the wrong group because 'para-' is unfamiliar"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Independently identifying Greek and Latin roots in unfamiliar vocabulary, using etymological knowledge as a practical tool for spelling and comprehension across subjects.",
        "example_task": "You are reading a history text and encounter the word 'aqueduct'. Using your knowledge of Latin roots ('aqua' = water, 'duct' = to lead), explain what it means. Then list two other words that use each root.",
        "example_response": "An aqueduct is a structure that leads water from one place to another. 'Aqua' appears in aquarium (a place for water creatures) and aquatic (relating to water). 'Duct' appears in conduct (to lead or guide) and deduct (to lead away or take away).",
        "common_errors": [
          "Knowing the word's meaning from context but failing to connect it to the etymological roots",
          "Using etymology as a curiosity rather than applying it to predict spellings of related words"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Drawing on etymological knowledge independently to decode complex vocabulary, explain historical layers of English, and make connections between cognates across modern languages.",
        "example_task": "Why do we have two words for the same animal: 'cow' (the animal in the field) and 'beef' (the meat on the plate)? What does this tell us about the history of English?",
        "example_response": "The word 'cow' comes from Old English, which was spoken by Anglo-Saxon farmers who looked after the animals. The word 'beef' comes from French ('boeuf'), which was spoken by the Norman rulers who ate the meat. This tells us that after the Norman Conquest in 1066, English had two layers of vocabulary: Anglo-Saxon words for everyday things and French words for more formal or upper-class things. This is why we also have 'sheep' and 'mutton', 'pig' and 'pork'.",
        "common_errors": [
          "Giving a correct historical explanation but not connecting it to other word pairs that show the same pattern",
          "Assuming all English words come from one language rather than recognising multiple historical layers"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying the root word within a familiar word that has a prefix or suffix attached.",
        "example_task": "What is the root word in each of these: playing, unkind, hopeless?",
        "example_response": "Playing: play. Unkind: kind. Hopeless: hope.",
        "common_errors": [
          "Including the suffix as part of the root (saying 'playing' is the root of 'playing')",
          "Removing letters that are actually part of the root (saying 'hop' is the root of 'hopeless')"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying root words within more complex words and beginning to group words into word families around a shared root.",
        "example_task": "Find the root word shared by: sign, signal, signature, design, resign. Write the root and explain how all five words are connected.",
        "example_response": "The root word is 'sign'. A signal is a sign to tell you something. A signature is where you write your sign. Design means to draw a plan or sign. Resign means to sign away from your position.",
        "common_errors": [
          "Identifying the shared letters but not explaining the shared meaning",
          "Missing that 'design' contains the root 'sign' because the pronunciation changes"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Reliably identifying roots within unfamiliar words and using root knowledge to predict meaning and spelling across subjects, including words where the root is less obvious.",
        "example_task": "Create a word web for the root 'struct' (meaning to build). Find at least four words, explain each, and show how knowing the root helps you spell them.",
        "example_response": "Structure means something that is built. Construct means to build something. Destruction means the act of breaking down what was built. Instruct means to build knowledge in someone's mind. Knowing the root 'struct' helps me spell these words because I know the 'ct' ending comes from the root, even though I might not hear it clearly when I say 'destruction'.",
        "common_errors": [
          "Including words that look similar but do not share the root",
          "Identifying the root correctly but not applying the knowledge to spelling"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Understanding that adding a prefix to a verb changes its meaning, with teacher support to identify the prefix and its effect.",
        "example_task": "Add the prefix 're-' to each verb and explain what the new word means: do, build, write.",
        "example_response": "Redo means to do again. Rebuild means to build again. Rewrite means to write again.",
        "common_errors": [
          "Changing the spelling of the root word when adding the prefix",
          "Not understanding that 're-' consistently means 'again'"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using several verb prefixes (re-, mis-, dis-, over-, de-) with understanding of their meanings, and choosing the correct prefix for a given context.",
        "example_task": "Choose the correct prefix (re-, mis-, dis-, over-) to complete each sentence: She wanted to ___appear from the room. He ___understood the instructions. The teacher asked them to ___do the homework. Be careful not to ___cook the pasta.",
        "example_response": "Disappear: 'dis' means not or opposite, so disappear means to stop appearing. Misunderstood: 'mis' means wrongly, so he understood wrongly. Redo: 're' means again, so do it again. Overcook: 'over' means too much, so cook it too much.",
        "common_errors": [
          "Confusing 'dis-' and 'mis-' because both suggest something negative",
          "Adding 'dis-' to words where 'un-' is standard"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using all five verb prefixes (dis-, de-, mis-, over-, re-) accurately and independently in writing, understanding how each changes meaning, and noting that the root word spelling does not change.",
        "example_task": "Write five sentences using a different verb prefix in each (dis-, de-, mis-, over-, re-). Underline the prefix and explain the meaning it adds.",
        "example_response": "The magician made the rabbit disappear. (dis- = not/opposite) The builders will demolish the old factory. (de- = reverse/undo) I mislabelled my science diagram and got confused. (mis- = wrongly) The chef overcooked the steak until it was burnt. (over- = too much) I need to recharge my tablet before school. (re- = again)",
        "common_errors": [
          "Doubling the first letter of the root incorrectly (writing 'dissappear' when the root is 'appear')",
          "Using 'de-' and 'dis-' interchangeably without recognising that 'de-' implies reversal while 'dis-' implies negation"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Selecting verb prefixes deliberately for precise effect in extended writing, recognising subtle differences between prefixes, and identifying prefixed verbs in reading to support comprehension.",
        "example_task": "Explain the difference in meaning between these pairs: discover/uncover, overwork/rework. Then explain why 'misapprove' is not a real word while 'disapprove' is.",
        "example_response": "Discover means to find something for the first time. Uncover means to remove a covering to reveal something hidden. Overwork means to work too much. Rework means to work on something again to improve it. 'Misapprove' is not a real word because 'mis-' means wrongly, and you cannot wrongly approve in that way. 'Disapprove' works because 'dis-' means not or opposite, so it means the opposite of approve.",
        "common_errors": [
          "Assuming all prefix combinations produce valid words without checking",
          "Not recognising that the same root can take different prefixes with significantly different meanings"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that certain suffixes (-ate, -ise, -ify) turn nouns or adjectives into verbs, with teacher-provided examples.",
        "example_task": "Your teacher writes: active + -ate = activate. What do you think 'activate' means? Now try: simple + -ify = ?",
        "example_response": "Activate means to make something active or to turn it on. Simple + -ify = simplify, which means to make something simple.",
        "common_errors": [
          "Adding the suffix without adjusting the spelling (writing 'simpleify' instead of 'simplify')",
          "Not understanding that the suffix creates a verb"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Converting familiar nouns and adjectives into verbs using -ate, -ise and -ify, with awareness of which suffix typically attaches to which root.",
        "example_task": "Turn each word into a verb using -ate, -ise or -ify: apology, class, memory, pure, advert.",
        "example_response": "Apologise (to say sorry). Classify (to put into groups). Memorise (to learn by heart). Purify (to make pure). Advertise (to make an advert for something).",
        "common_errors": [
          "Applying the wrong suffix (writing 'classate' instead of 'classify')",
          "Using the American spelling '-ize' instead of the British '-ise'"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using verb-forming suffixes productively and accurately in writing, applying correct spelling rules when the root word changes, and identifying these verbs in non-fiction text.",
        "example_task": "Read this science paragraph and find three verbs formed using -ate, -ise or -ify. For each, identify the root word and explain the word class change.",
        "example_response": "Evaporate: from the Latin root 'evapor' (meaning steam), -ate makes it a verb meaning to turn into vapour. Identify: from 'identity' (a noun), -ify makes it a verb meaning to recognise what something is. Equalise: from 'equal' (an adjective), -ise makes it a verb meaning to make things equal.",
        "common_errors": [
          "Identifying the verb but not explaining the word class change from noun or adjective to verb",
          "Struggling with roots that are not complete English words"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C006",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that some words contain letters that are not pronounced and beginning to learn common examples.",
        "example_task": "Listen to the teacher say these words: knight, lamb, write. Which letter in each word is silent?",
        "example_response": "Knight: the 'k' is silent. Lamb: the 'b' is silent. Write: the 'w' is silent.",
        "common_errors": [
          "Identifying the wrong silent letter (saying the 'g' is silent in 'knight' rather than the 'k')",
          "Omitting the silent letter when writing (spelling 'nite' instead of 'knight')"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Spelling a growing set of words with silent letters correctly and grouping them by pattern.",
        "example_task": "Sort these words by their silent letter: knock, doubt, wreck, psalm, castle, knee, crumb, wrestle, pneumonia, listen.",
        "example_response": "Silent k: knock, knee. Silent b: doubt, crumb. Silent w: wreck, wrestle. Silent p: psalm, pneumonia. Silent t: castle, listen.",
        "common_errors": [
          "Misspelling by omitting the silent letter in written work (writing 'dout' for 'doubt')",
          "Not recognising the silent letter in less common words like 'pneumonia'"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Spelling words with silent letters accurately and understanding that silent letters often reflect the word's historical pronunciation or etymology.",
        "example_task": "The word 'knight' has a silent 'k'. Hundreds of years ago, English speakers actually pronounced the 'k' sound. Why do you think we still keep the 'k' in the spelling? Can you think of other words where this happens?",
        "example_response": "We keep the 'k' because the spelling was fixed before the pronunciation changed, so the spelling is like a fossil showing how the word used to sound. Other words like this include 'knee' and 'know', which all used to have a pronounced 'k' before the 'n'. Similarly, 'gh' in words like 'knight' and 'thought' used to make a sound like the Scottish 'ch' in 'loch'.",
        "common_errors": [
          "Understanding the historical explanation but not using it as a memory aid for correct spelling",
          "Over-generalising and inserting silent letters in words that do not have them"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using etymological knowledge to explain silent letters in unfamiliar words and connecting silent letter patterns to word families where the letter reappears.",
        "example_task": "The word 'solemn' has a silent 'n'. But in the word 'solemnity', the 'n' is pronounced. What does this tell you? Can you find other word pairs like this?",
        "example_response": "The 'n' in 'solemn' is silent when the word stands alone, but it reappears when you add the suffix in 'solemnity'. This shows the 'n' is really part of the word's structure and the spelling preserves it. The same thing happens with 'sign' and 'signature', 'bomb' and 'bombard', 'autumn' and 'autumnal'. The spelling keeps the letter because it appears in related words.",
        "common_errors": [
          "Explaining the pattern for one pair but not generalising to other word families",
          "Not recognising that spelling preserves morphological relationships across a word family"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C007",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying that some words sound the same but are spelt differently and have different meanings, using common Y5 pairs.",
        "example_task": "Choose the correct word: 'My mum gave me some good (advice/advise).' 'I need to (practise/practice) my spellings.'",
        "example_response": "My mum gave me some good advice. I need to practise my spellings.",
        "common_errors": [
          "Choosing the wrong spelling because both sound identical in speech",
          "Not knowing which form is the noun and which is the verb"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Applying the noun (-ce) and verb (-se) rule to distinguish between advice/advise, practice/practise, licence/license, and device/devise.",
        "example_task": "Fill in the gap with the correct form. Remember: nouns end in -ce, verbs end in -se. 'The doctor will (advice/advise) you.' 'You need a (licence/license) to drive.' 'She had to (devise/device) a plan.'",
        "example_response": "The doctor will advise you, because advise is the verb so it ends in -se. You need a licence to drive, because licence is the noun so it ends in -ce. She had to devise a plan, because devise is the verb so it ends in -se.",
        "common_errors": [
          "Knowing the rule but misidentifying whether the word is a noun or verb in the sentence",
          "Applying the -ce/-se rule to words where it does not apply"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Reliably selecting the correct form of Y5 homophones and commonly confused words in independent writing, including affect/effect, stationary/stationery, and principal/principle.",
        "example_task": "Write four sentences, each using one word from a different commonly confused pair correctly. Underline the word and explain your choice.",
        "example_response": "The weather had a big effect on our sports day. (Effect is the noun meaning the result. Affect is the verb meaning to influence.) The principal of the school welcomed the visitors. (Principal means the main person. Principle means a rule or belief.) I bought new stationery for school. (Stationery with an 'e' means paper and pens. Stationary with an 'a' means not moving.) We walked farther along the path than planned. (Farther is for physical distance. Further is for additional or abstract ideas.)",
        "common_errors": [
          "Using 'effect' as a verb when 'affect' is needed, the most common error in this pair",
          "Using memory aids inconsistently or forgetting them under time pressure in independent writing"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using all Y5 homophone and confusable word pairs accurately in extended writing and explaining the etymological or grammatical reasons for the distinctions.",
        "example_task": "A younger pupil asks: 'Why does English have so many words that sound the same but are spelt differently?' Write an explanation they could understand.",
        "example_response": "English has lots of homophones because words from different languages or different original words ended up sounding the same over time, even though their meanings stayed different. For example, 'stationary' (not moving) comes from the Latin 'stationarius', while 'stationery' (paper and pens) comes from 'stationer', a person who sold from a stall. If we spelt them the same way, readers would not know which meaning was intended. The different spellings actually help readers, even though they make things harder for writers.",
        "common_errors": [
          "Giving a general answer without citing specific etymological examples",
          "Not recognising that homophones serve a useful disambiguation function in written English"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C008",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that words ending in the /shus/ sound can be spelt -cious or -tious, and spelling familiar examples with support.",
        "example_task": "Look at these words: delicious, cautious. They both end with a /shus/ sound but are spelt differently. Copy each word and underline the ending.",
        "example_response": "Delicious ends in -cious. Cautious ends in -tious.",
        "common_errors": [
          "Spelling the ending as '-shus' or '-shous' based on the sound alone",
          "Not noticing the difference between -cious and -tious"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using the root-word rule to choose between -cious and -tious: root ending in -ce usually takes -cious; root containing -tion usually takes -tious.",
        "example_task": "Apply the rule to spell these words. First identify the root, then choose -cious or -tious: grace, ambition, malice, caution.",
        "example_response": "Grace ends in -ce, so gracious (-cious). Ambition contains -tion, so ambitious (-tious). Malice ends in -ce, so malicious (-cious). Caution contains -tion, so cautious (-tious).",
        "common_errors": [
          "Applying -cious as a default for all words without checking the root",
          "Forgetting to remove the ending of the root before adding the suffix"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Spelling a range of -cious and -tious words accurately in independent writing, applying the root-word rule consistently and noting exceptions.",
        "example_task": "Spell each word correctly in a sentence: vicious, infectious, conscious, precious, suspicious. For 'suspicious', explain why it might be tricky.",
        "example_response": "The vicious storm damaged the school roof. The infectious disease spread quickly. She was conscious of everyone watching. The ring was made of precious gold. The detective became suspicious. 'Suspicious' is tricky because 'suspicion' contains -tion, so you might expect -tious, but it is actually spelt -cious. It is an exception to the rule.",
        "common_errors": [
          "Spelling 'suspicious' as 'suspitious' by over-applying the -tion rule",
          "Misspelling 'conscious' because the root 'conscience' is itself difficult"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C009",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that words ending in the /shul/ sound can be spelt -cial or -tial, and spelling familiar examples with support.",
        "example_task": "Look at these words: special, partial. They both end with a /shul/ sound. One is spelt -cial and one is -tial. Copy each and underline the ending.",
        "example_response": "Special ends in -cial. Partial ends in -tial.",
        "common_errors": [
          "Spelling the ending as '-shul' or '-shial' based on the sound",
          "Not distinguishing between the two possible spellings"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Applying the vowel/consonant rule: -cial usually follows a vowel letter; -tial usually follows a consonant letter.",
        "example_task": "Use the rule to decide: -cial or -tial? Look at the letter before the ending: offi___, essen___, artifi___, confiden___.",
        "example_response": "Official: 'i' is a vowel, so -cial. Essential: 'n' is a consonant, so -tial. Artificial: 'i' is a vowel, so -cial. Confidential: 'n' is a consonant, so -tial.",
        "common_errors": [
          "Confusing vowel and consonant letters when applying the rule",
          "Defaulting to -tial for all words regardless of the preceding letter"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Spelling -cial and -tial words accurately in independent writing, including awareness of exceptions where the rule does not apply cleanly.",
        "example_task": "Spell these words correctly: spatial, facial, initial, commercial. 'Initial' and 'commercial' appear to break the vowel/consonant rule. Can you explain why?",
        "example_response": "Facial: 'a' is a vowel, so -cial follows the rule. Spatial: 'a' is a vowel but it is -tial, which breaks the rule. Initial: 'i' is a vowel but it is -tial, another exception. Commercial: 'r' is a consonant but it is -cial, another exception. These exceptions exist because the spelling relates to the root words (initiate, commerce) rather than following the vowel/consonant rule perfectly.",
        "common_errors": [
          "Spelling 'initial' as 'inicial' by over-applying the vowel rule",
          "Not recognising that exceptions often relate to the etymology of the root word"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C010",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that some words end in -ant/-ance and others end in -ent/-ence, and that these endings sound very similar in speech.",
        "example_task": "Look at these word pairs: important/importance, different/difference. What do you notice about the endings?",
        "example_response": "Important and importance both use 'ant' and 'ance'. Different and difference both use 'ent' and 'ence'. The adjective ending matches the noun ending.",
        "common_errors": [
          "Not noticing that the adjective and noun forms share the same vowel (a or e)",
          "Guessing randomly between -ant and -ent because they sound identical"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using related word forms to choose the correct spelling: if a related word has an -ation ending, use -ant/-ance/-ancy; after soft c, soft g or qu, use -ent/-ence/-ency.",
        "example_task": "Use the -ation clue to decide: -ant or -ent? Hesit___ (think: hesitation). Observ___ (think: observation). Innoc___ (is there an -ation form?).",
        "example_response": "Hesitant, because hesitation has -ation, so -ant. Observant, because observation has -ation, so -ant. Innocent, because there is no word 'innocation', so this must be -ent and needs to be learnt.",
        "common_errors": [
          "Applying the -ation rule but arriving at the wrong form because the related word is unfamiliar",
          "Not realising that some words simply need to be memorised"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Spelling words with -ant/-ance/-ancy and -ent/-ence/-ency accurately in independent writing, using related word forms and learned exceptions systematically.",
        "example_task": "Sort these words into -ant or -ent columns and explain the strategy you used: tolerant, obedient, relevant, frequent, reluctant, elegant.",
        "example_response": "Tolerant: toleration has -ation, so -ant. Obedient: no -ation form, learnt as -ent. Relevant: no clear -ation form but -ant (must learn). Frequent: after 'qu', so -ent. Reluctant: no clear rule, must learn as -ant. Elegant: no -ation form, learnt as -ant. Some follow rules and some must be memorised.",
        "common_errors": [
          "Over-relying on the -ation clue and getting stuck when no -ation word exists",
          "Spelling inconsistently within the same piece of writing"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C011",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that words can end in -able or -ible and that both endings mean 'able to be' or 'can be'.",
        "example_task": "What do these words have in common: washable, comfortable, visible, horrible? What does the ending mean?",
        "example_response": "They all have an ending that means 'can be' or 'able to be'. Washable means it can be washed. Comfortable means it can give comfort. Visible means it can be seen. Horrible means it can cause horror.",
        "common_errors": [
          "Not recognising that -able and -ible carry the same meaning",
          "Guessing which ending to use with no strategy"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Applying the default rule: if a complete root word can be heard before the ending, use -able; if not, use -ible.",
        "example_task": "Decide: -able or -ible? Can you hear a complete word before the ending? enjoy___, poss___, reason___, terr___.",
        "example_response": "Enjoyable: I can hear 'enjoy', a complete word, so -able. Possible: 'poss' is not a complete word, so -ible. Reasonable: I can hear 'reason', so -able. Terrible: 'terr' is not a complete word, so -ible.",
        "common_errors": [
          "Thinking 'comfort' is not a complete word and writing 'comfortible'",
          "Applying -ible as a default because it appears in many common words"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Spelling -able and -ible words accurately in independent writing, including words where the root changes before the suffix and using the -ation clue.",
        "example_task": "Spell each word correctly and explain the rule: adorable, sensible, changeable, incredible, reliable.",
        "example_response": "Adorable: 'adore' is a complete root and adoration has -ation, so -able. Sensible: 'sens' is not a complete word, so -ible. Changeable: 'change' is complete so -able, but the 'e' is kept to preserve the soft 'g' sound. Incredible: 'incred' is not complete, so -ible. Reliable: 'rely' is complete so -able, and the 'y' changes to 'i' before the suffix.",
        "common_errors": [
          "Dropping the 'e' in 'changeable' and 'noticeable' where it must be kept for the soft sound",
          "Not applying the 'y to i' rule in words like 'reliable'"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C012",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Using a dictionary to find the meaning and spelling of a given word, navigating using alphabetical order.",
        "example_task": "Find the word 'prejudice' in the dictionary. Write down its meaning and check your spelling is correct.",
        "example_response": "Prejudice means an unfair opinion about someone formed without knowing the facts. I had spelt it 'predjudice' but the dictionary shows it is 'prejudice' with no 'd' before the 'j'.",
        "common_errors": [
          "Looking up the word letter by letter rather than using the first two or three letters to navigate quickly",
          "Copying the first definition without checking it fits the context"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using the first three or four letters to locate words rapidly and selecting the appropriate definition when multiple meanings are given.",
        "example_task": "Find the word 'current' in the dictionary as quickly as you can. It has more than one meaning. Write down two different meanings and a sentence for each.",
        "example_response": "Meaning 1: happening now, belonging to the present time. 'The current Year 5 topic is the Victorians.' Meaning 2: a flow of water, air or electricity. 'The river had a strong current that carried the leaves downstream.'",
        "common_errors": [
          "Selecting only the first definition and not reading through all available meanings",
          "Taking a long time to find the word because of inefficient alphabetical navigation"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using dictionaries independently and efficiently to check spelling, confirm meaning, and support comprehension of new vocabulary encountered across all subjects.",
        "example_task": "In your geography textbook you read: 'The terrain was mountainous and inhospitable.' Use the dictionary to check the meaning of 'inhospitable' and explain how the definition helps you understand the sentence better.",
        "example_response": "Inhospitable means harsh and difficult to live in. The dictionary also shows it can mean unwelcoming. In this sentence it means the mountainous land was harsh and not a place where people could easily live or travel. The prefix 'in-' means not, and 'hospitable' means welcoming, so the word literally means not welcoming.",
        "common_errors": [
          "Looking up the word but not connecting the definition back to the original sentence",
          "Not noticing that morphological analysis (in- + hospitable) could also help decode the word"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using dictionaries that include etymological information to deepen understanding, and explaining when a dictionary is more useful than context clues or morphological analysis.",
        "example_task": "You encounter the word 'ambiguous' in a maths problem. Use morphological analysis, context clues and the dictionary. Which strategy was most helpful and why?",
        "example_response": "From context, I could tell it meant something unclear because the question said the instructions were ambiguous and needed rewriting. From morphology, 'ambi-' means both (like ambidextrous) but I was not sure about '-guous'. The dictionary confirmed it means having more than one possible meaning. Here the dictionary was most helpful because the morphology only gave me part of the answer and the context gave me a rough sense but not the precise meaning.",
        "common_errors": [
          "Relying on one strategy alone without cross-checking",
          "Not recognising that different words require different vocabulary strategies"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C013",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Understanding what a thesaurus does and using it to find a synonym for a given word.",
        "example_task": "Use the thesaurus to find two different words that mean the same as 'happy'.",
        "example_response": "Joyful and delighted.",
        "common_errors": [
          "Choosing a word that looks interesting without checking it truly means the same thing",
          "Not understanding the difference between a dictionary and a thesaurus"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using a thesaurus to find synonyms and selecting one that fits the context and meaning of a specific sentence.",
        "example_task": "In this sentence, replace 'nice' with a more precise word using the thesaurus: 'We had a nice day at the seaside.'",
        "example_response": "We had a wonderful day at the seaside. I chose 'wonderful' rather than 'pleasant' because 'wonderful' shows we really enjoyed it, while 'pleasant' sounds more ordinary.",
        "common_errors": [
          "Selecting the longest or most unusual synonym without checking it fits the sentence",
          "Replacing the word without considering whether the new word changes the intended meaning"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using a thesaurus systematically to improve vocabulary choices in writing, considering connotation and register, and checking unfamiliar synonyms in a dictionary.",
        "example_task": "You are writing a formal letter to the headteacher. The thesaurus gives these synonyms for 'ask': request, beg, demand, enquire, implore. Which would you choose and why? Which would you avoid?",
        "example_response": "I would choose 'request' because it is formal and polite, which suits a letter to the headteacher. 'Enquire' could also work if I am asking a question. I would avoid 'beg' and 'implore' because they sound desperate, and 'demand' because it sounds rude. The right synonym depends on the register and tone, not just the meaning.",
        "common_errors": [
          "Choosing a synonym that is technically accurate but wrong for the register",
          "Using thesaurus words to sound impressive without checking they mean exactly what is intended"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating subtle differences between near-synonyms and explaining how connotation, register and precision affect word choice in different contexts.",
        "example_task": "Explain the difference between thin, slender, skinny, scrawny and gaunt. In what kind of writing would each be most appropriate?",
        "example_response": "Thin is neutral and could be used anywhere. Slender is positive and elegant, good for describing a character attractively in a story. Skinny is informal and slightly negative, good for casual description. Scrawny suggests being too thin and weak, good for creating sympathy or showing hardship. Gaunt means thin in a way that looks ill or exhausted, good for creating atmosphere in a story about suffering. A thesaurus would list them all as synonyms, but choosing the right one depends on the effect you want.",
        "common_errors": [
          "Treating all synonyms as interchangeable without recognising differences in connotation",
          "Not connecting word choice decisions to the intended audience and purpose of the writing"
        ]
      }
    ]
  }
]