[
  {
    "concept_id": "EN-Y4-C052",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Writing compound sentences using coordinating conjunctions (and, but, or, so).",
        "example_task": "Join these pairs of sentences using 'and', 'but', 'or' or 'so': 'It was raining. We stayed inside.' / 'She wanted chocolate. She chose vanilla.'",
        "example_response": "It was raining, so we stayed inside. She wanted chocolate, but she chose vanilla.",
        "common_errors": [
          "Using 'and' for every join rather than choosing the appropriate conjunction",
          "Missing the comma before the conjunction"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writing complex sentences using common subordinating conjunctions (when, if, because, although).",
        "example_task": "Expand these sentences by adding a subordinate clause using the conjunction in brackets: 'The dog barked (when).' 'We went outside (although).'",
        "example_response": "The dog barked when the postman knocked on the door. We went outside although it was raining heavily.",
        "common_errors": [
          "Writing a fragment instead of a complete subordinate clause",
          "Placing the subordinate clause in a way that creates an unclear sentence"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using a range of subordinating conjunctions to create multi-clause sentences with varied structure, placing subordinate clauses in different positions.",
        "example_task": "Write three sentences about a school trip using three different subordinating conjunctions. In at least one sentence, put the subordinate clause at the beginning.",
        "example_response": "Although the bus journey took two hours, nobody complained because the scenery was beautiful. While the guide explained the history of the castle, some children took notes in their sketchbooks. We ate our packed lunches before we explored the dungeons, since the teacher warned us it would be dark and damp.",
        "common_errors": [
          "Using only 'when' and 'because' rather than varying conjunctions",
          "Forgetting the comma when the subordinate clause comes first"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Varying sentence length and structure deliberately for effect, choosing between simple, compound and complex sentences purposefully.",
        "example_task": "Write a short paragraph that uses a mix of simple, compound and complex sentences. Explain why you varied the sentence lengths.",
        "example_response": "'The forest was silent. Although she had walked this path a hundred times before, something felt different today. The trees stood closer together, their branches tangling overhead like bony fingers, and the usual birdsong had stopped. She froze.' I used a short simple sentence first to set a calm scene, then a complex sentence to build unease, a long compound-complex sentence to create a sense of being overwhelmed, and a final two-word sentence for dramatic impact.",
        "common_errors": [
          "Writing all sentences the same length",
          "Varying sentence length randomly rather than for deliberate effect"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C053",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising the present perfect tense when it appears in sentences.",
        "example_task": "Which sentence uses the present perfect tense? A) 'I ate my lunch.' B) 'I have eaten my lunch.' C) 'I am eating my lunch.'",
        "example_response": "B) 'I have eaten my lunch.' It uses 'have' + past participle.",
        "common_errors": [
          "Choosing the present continuous (C) because it contains 'am'",
          "Not recognising 'have eaten' as a tense form"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Forming the present perfect correctly using have/has + past participle, including common irregular forms.",
        "example_task": "Rewrite these in the present perfect: 'I go to France.' 'She writes a letter.' 'They see the film.'",
        "example_response": "I have gone to France. She has written a letter. They have seen the film.",
        "common_errors": [
          "Using the simple past form instead of the past participle ('I have went' instead of 'I have gone')",
          "Confusing 'has' and 'have' (using 'have' with 'she')"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Choosing appropriately between the present perfect and simple past based on meaning, understanding the difference.",
        "example_task": "Choose the correct form and explain why: 'I (lost / have lost) my keys.' — said when you still can't find them. 'I (lost / have lost) my keys.' — said when telling a story about last week.",
        "example_response": "'I have lost my keys' — when you still can't find them, because the present perfect connects a past event to the present situation (the keys are still missing). 'I lost my keys' — when telling a story about last week, because the simple past describes a completed event in the past (you may have found them since).",
        "common_errors": [
          "Using both forms interchangeably without understanding the difference in meaning",
          "Always using simple past because it feels more natural"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using the present perfect deliberately in writing for specific effects, and explaining when formal writing requires it.",
        "example_task": "Rewrite this informal text using the present perfect where appropriate: 'Scientists found a new species. They studied it for months. They published their results.'",
        "example_response": "'Scientists have found a new species. They have studied it for months and have now published their results.' The present perfect is better here because this is a formal report about recent research that is still relevant. 'Have found' tells the reader this is new — the discovery connects to now. If I wrote 'found', it would sound like old news.",
        "common_errors": [
          "Using present perfect for all sentences without considering whether the connection to the present is relevant",
          "Not recognising that formal and scientific writing often prefers the present perfect for recent events"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C054",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Replacing a repeated noun with a pronoun to avoid repetition in a pair of sentences.",
        "example_task": "Improve these sentences by replacing the repeated name with a pronoun: 'Asha went to the shop. Asha bought some bread.'",
        "example_response": "Asha went to the shop. She bought some bread.",
        "common_errors": [
          "Not knowing which pronoun to use",
          "Replacing the name in the first sentence rather than the second"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Choosing between nouns and pronouns to maintain clarity within a paragraph.",
        "example_task": "This paragraph is unclear because of too many pronouns: 'She told her that she would help her.' Rewrite it clearly.",
        "example_response": "Maya told Priya that she would help her with the project. [Now clear who is helping whom because the names replace the ambiguous pronouns.]",
        "common_errors": [
          "Not recognising that the original was unclear",
          "Replacing all pronouns with nouns, creating repetitive writing"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using pronouns and nouns strategically for cohesion and clarity, checking that every pronoun has a clear referent.",
        "example_task": "Edit this paragraph to improve pronoun use: 'Tom and Marcus went to the park. He kicked the ball. He caught it. He threw it back to him.'",
        "example_response": "Tom and Marcus went to the park. Tom kicked the ball and Marcus caught it. He threw it back, and they continued their game. [First use of names establishes who is who, then pronouns are used where the referent is clear, and names are reintroduced when needed to avoid ambiguity.]",
        "common_errors": [
          "Leaving ambiguous pronouns ('He' — which boy?)",
          "Over-correcting by using names in every sentence"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Analysing how published authors use pronouns and nouns for cohesion and deliberately applying these patterns in own writing.",
        "example_task": "Find an example in your reading book where the author uses a pronoun to create suspense or surprise. Explain how it works.",
        "example_response": "In Chapter 1, the author writes: 'Someone was watching from the shadows. They had been there all night.' The pronoun 'they' creates suspense because the reader doesn't know who is watching. If the author had written the character's name, the mystery would be spoilt. Later, when the character is revealed, the switch from 'they' to the name creates a moment of surprise. I used this technique in my own story — I referred to the villain as 'the figure' and 'they' for three paragraphs before revealing who it was.",
        "common_errors": [
          "Not noticing how authors use pronouns deliberately",
          "Copying the technique without understanding why it works"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C055",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Using basic conjunctions and adverbs to show time and cause: and, but, so, because, then, next.",
        "example_task": "Join these sentences using an appropriate conjunction: 'It was cold. We put on our coats.'",
        "example_response": "It was cold, so we put on our coats. OR: We put on our coats because it was cold.",
        "common_errors": [
          "Using 'and' when 'because' or 'so' would show the causal relationship",
          "Not recognising the difference between time and cause connectives"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using a wider range of conjunctions, adverbs and prepositions to express time, place and cause.",
        "example_task": "Rewrite this passage replacing 'then' with more varied time connectives: 'Then we went to the beach. Then we built sandcastles. Then we had ice cream. Then we went home.'",
        "example_response": "First, we went to the beach. After finding a good spot, we built sandcastles. Later, we had ice cream by the pier. Eventually, when the sun began to set, we went home.",
        "common_errors": [
          "Overusing one connective (usually 'then')",
          "Using connectives that don't accurately reflect the relationship"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using a range of connectives for different purposes: time (meanwhile, subsequently), cause (therefore, consequently), contrast (however, although) and purpose (so that, in order to).",
        "example_task": "Write four sentences about a school event, each using a different type of connective: one for time, one for cause, one for contrast, one for purpose.",
        "example_response": "Meanwhile, the Year 3 children were setting up their stalls in the hall. (time) Consequently, the playground was quieter than usual. (cause) However, the weather was too wet for the outdoor activities. (contrast) The teachers moved everything inside so that the event could continue. (purpose)",
        "common_errors": [
          "Using only time connectives rather than varying the type",
          "Using a connective incorrectly (e.g., 'however' where 'therefore' is needed)"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Selecting connectives to control the logical flow of an argument or explanation, understanding that the choice of connective shapes meaning.",
        "example_task": "The sentence 'The experiment failed' can be followed by different connectives. Write three continuations using 'because', 'however' and 'therefore'. How does the connective change the direction?",
        "example_response": "'The experiment failed because the temperature was too high.' (explains the cause — looks backwards). 'The experiment failed; however, the data revealed something unexpected.' (introduces a contrast — changes direction). 'The experiment failed; therefore, we redesigned the method.' (shows a consequence — looks forwards). The connective completely changes what the reader expects next.",
        "common_errors": [
          "Not recognising how different connectives change the logical direction",
          "Using connectives interchangeably without attending to their specific meanings"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C056",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising a fronted adverbial in a sentence and understanding that it tells you when, where or how.",
        "example_task": "Underline the fronted adverbial in each sentence: 'Cautiously, the fox crept forward.' 'After lunch, we went outside.' 'At the top of the hill, they stopped.'",
        "example_response": "Cautiously, (how) / After lunch, (when) / At the top of the hill, (where)",
        "common_errors": [
          "Underlining the subject rather than the adverbial",
          "Not recognising multi-word fronted adverbials ('At the top of the hill')"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writing sentences with fronted adverbials followed by a comma, using a range of adverbial types.",
        "example_task": "Write three sentences about a character exploring a cave, each starting with a different type of fronted adverbial: time, place, manner.",
        "example_response": "Early the next morning, she packed her torch and rope. (time) Deep inside the cave, the walls glittered with crystals. (place) Nervously, she stepped across the narrow ledge. (manner)",
        "common_errors": [
          "Forgetting the comma after the fronted adverbial",
          "Only using single-word adverbs ('Slowly,') rather than adverbial phrases"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using fronted adverbials purposefully to vary sentence openings and create specific effects in writing.",
        "example_task": "Rewrite this passage so that at least two sentences start with fronted adverbials. Keep the other sentences as they are to create variety.",
        "example_response": "Original: 'The ship sailed into the harbour. The crew cheered. The captain smiled and waved at the crowd. They had been at sea for six months.' Revised: 'Slowly and majestically, the ship sailed into the harbour. The crew cheered. With a broad smile, the captain waved at the crowd. They had been at sea for six months.' [Two fronted adverbials add variety without overusing the pattern.]",
        "common_errors": [
          "Starting every sentence with a fronted adverbial, creating a repetitive pattern",
          "Using fronted adverbials that add nothing to the meaning"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Choosing the position of adverbials deliberately for effect and explaining how moving an adverbial changes emphasis.",
        "example_task": "Take this sentence: 'The fox crept cautiously through the garden.' Rewrite it with the adverbial in three different positions. Which is most effective and why?",
        "example_response": "1. 'Cautiously, the fox crept through the garden.' (emphasis on caution — the reader feels the tension from the start). 2. 'The fox crept cautiously through the garden.' (emphasis on the fox — we see the fox first, then how it moves). 3. 'The fox crept through the garden cautiously.' (emphasis shifts to the garden — the setting matters, and 'cautiously' at the end lingers in the reader's mind). For a tense scene, version 1 is most effective because the adverbial at the front immediately sets the mood.",
        "common_errors": [
          "Assuming the fronted position is always best",
          "Not recognising that moving an adverbial changes the emphasis and effect"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C057",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising direct speech in a text and understanding that inverted commas show the exact words spoken.",
        "example_task": "Underline the words that are actually spoken in this sentence: The teacher said, \"Please sit down quietly.\"",
        "example_response": "Please sit down quietly [These are the words the teacher actually said, shown by the inverted commas.]",
        "common_errors": [
          "Underlining the whole sentence including 'The teacher said'",
          "Not understanding the difference between direct speech and reported speech"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Punctuating direct speech with inverted commas, comma after reporting clause, and correct end punctuation inside the speech marks.",
        "example_task": "Punctuate this sentence: Tom shouted Watch out the bridge is breaking",
        "example_response": "Tom shouted, \"Watch out! The bridge is breaking!\"",
        "common_errors": [
          "Missing the comma after 'shouted'",
          "Placing the exclamation mark after the closing inverted comma"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Punctuating direct speech accurately in all positions: speech after reporting clause, speech before reporting clause, and interrupted speech. New speaker on a new line.",
        "example_task": "Write a short dialogue between two characters (at least four lines). Include speech before and after the reporting clause, and start a new line for each new speaker.",
        "example_response": "\"I don't think we should go in there,\" whispered Amir.\n\"Why not?\" asked Zara, peering through the door.\nAmir pointed at the floor. \"Look at those footprints. Someone has been here recently.\"\n\"Then we need to find out who,\" said Zara, stepping inside.",
        "common_errors": [
          "Not starting a new line for each speaker",
          "Misplacing punctuation when speech comes before the reporting clause ('\"I don't think so.\" whispered Amir' — should be comma, not full stop)"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using direct speech purposefully in narrative, varying reporting verbs and integrating speech with action and description.",
        "example_task": "Rewrite this dull dialogue to make it more effective: 'Tom said, \"I am scared.\" Priya said, \"Me too.\" Tom said, \"Let's go home.\"'",
        "example_response": "Tom's voice cracked. \"I'm scared,\" he admitted, gripping the torch so tightly his knuckles turned white.\nPriya nodded but said nothing for a moment. Then, barely above a whisper: \"Me too.\"\nA branch snapped somewhere in the darkness. \"That's it,\" Tom said, already backing away. \"We're going home.\"\n[I varied the reporting verbs (admitted, said), added action between speech, and used a short paragraph for dramatic pacing.]",
        "common_errors": [
          "Using 'said' for every line of dialogue",
          "Writing speech in isolation without integrating it with action or description"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C058",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Expanding a simple noun by adding an adjective before it.",
        "example_task": "Expand these nouns by adding one adjective: 'the dog', 'a castle', 'the forest'.",
        "example_response": "the scruffy dog, a crumbling castle, the dark forest",
        "common_errors": [
          "Adding a vague adjective ('nice', 'big') rather than a precise one",
          "Not understanding what an adjective does"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Expanding noun phrases by adding multiple modifiers before the noun.",
        "example_task": "Expand 'the man' into a detailed noun phrase using at least two modifiers.",
        "example_response": "the tall, weather-beaten old man",
        "common_errors": [
          "Adding redundant modifiers ('the big, large, huge man')",
          "Not ordering adjectives naturally (size before age before colour)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Expanding noun phrases with modifiers before AND after the noun, using prepositional phrases for precision.",
        "example_task": "Expand 'a teacher' into a noun phrase with modifiers before and after the noun. Use a prepositional phrase.",
        "example_response": "the strict maths teacher with curly hair and round glasses",
        "common_errors": [
          "Only adding modifiers before the noun",
          "Creating noun phrases so long they become unwieldy"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using expanded noun phrases purposefully for precise, vivid description, choosing details that serve characterisation or atmosphere.",
        "example_task": "Write two expanded noun phrases for the same character — one to make them seem friendly and one to make them seem threatening. Only change the modifiers.",
        "example_response": "Friendly: 'the smiling old man with kind eyes and a warm, well-worn coat'. Threatening: 'the silent old man with watchful eyes and a long, dark coat'. The same basic noun ('old man') creates completely different impressions depending on the modifiers chosen. 'Smiling' vs 'silent', 'kind' vs 'watchful', 'warm' vs 'dark' — each adjective shifts the reader's feeling.",
        "common_errors": [
          "Using expanded noun phrases that are decorative rather than purposeful",
          "Not recognising that modifier choice shapes the reader's interpretation"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C059",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Understanding that -s on a noun can mean either 'more than one' or 'belonging to'.",
        "example_task": "Does the -s mean plural or possessive? 'The cats sat on the mat.' / 'The cat's bowl was empty.'",
        "example_response": "cats = plural (more than one cat). cat's = possessive (the bowl belongs to the cat).",
        "common_errors": [
          "Not seeing any difference between the two uses of -s",
          "Thinking all words ending in -s need an apostrophe"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Distinguishing between plural -s and possessive -s in sentences and using apostrophes correctly.",
        "example_task": "Add apostrophes ONLY where needed: 'The dogs were barking. The dogs bowl was broken. Three cats climbed the trees. The cats whiskers twitched.'",
        "example_response": "The dogs were barking. (plural — no apostrophe) The dog's bowl was broken. (possessive — apostrophe) Three cats climbed the trees. (plural — no apostrophe) The cat's whiskers twitched. (possessive — apostrophe, assuming one cat)",
        "common_errors": [
          "Adding apostrophes to plurals ('the dog's were barking')",
          "Missing possessive apostrophes"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Consistently distinguishing plural, singular possessive and plural possessive in independent writing.",
        "example_task": "Write three sentences about a school: one with a regular plural, one with a singular possessive, and one with a plural possessive.",
        "example_response": "The children played in the playground. (plural) The teacher's desk was covered in marking. (singular possessive) The pupils' work was displayed on the walls. (plural possessive)",
        "common_errors": [
          "Confusing singular and plural possessive placement",
          "Getting it right in exercises but reverting to errors in free writing"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining the rule clearly, including irregular plurals, and correcting all apostrophe errors in a passage.",
        "example_task": "Correct this passage and explain each correction: 'The womens' team won their match's. The captain's trophy was the teams' proudest moment. The childrens coats were left behind.'",
        "example_response": "'The women's team' — 'women' is already plural and doesn't end in -s, so add 's. 'their matches' — 'matches' is just plural, no possession, so no apostrophe. 'The captain's trophy was the team's proudest moment' — the trophy belongs to the captain (singular possessive); the moment belongs to the team (singular possessive, one team). 'The children's coats' — 'children' is an irregular plural, so add 's just like 'women's'.",
        "common_errors": [
          "Treating 'women' and 'children' as regular plurals",
          "Not being able to articulate the rule clearly"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C060",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising common Standard English verb forms when presented alongside non-standard alternatives.",
        "example_task": "Which is Standard English? A) 'We was playing outside.' B) 'We were playing outside.'",
        "example_response": "B) 'We were playing outside' is Standard English.",
        "common_errors": [
          "Not hearing a difference between the two forms",
          "Choosing the form that matches their spoken dialect"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using Standard English verb forms in writing: were (not was with plural subjects), did (not done), saw (not seen).",
        "example_task": "Correct these sentences to Standard English: 'I done my homework.' 'We was late for school.' 'She seen a rainbow.'",
        "example_response": "I did my homework. We were late for school. She saw a rainbow.",
        "common_errors": [
          "Inconsistent correction (fixing one but not another)",
          "Overcorrecting natural informal speech in dialogue"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Consistently using Standard English verb inflections in formal writing while understanding that non-standard forms are acceptable in informal speech and dialogue.",
        "example_task": "Write a formal paragraph about a school trip using Standard English. Then write a line of dialogue where a character uses non-standard English naturally.",
        "example_response": "Formal: 'The children were delighted when they saw the castle. They had done extensive research beforehand, so they recognised many features.' Dialogue: '\"We was proper excited when we seen the dungeon!\" laughed Jake.' [Standard English in the narrative; non-standard in the dialogue to reflect natural speech.]",
        "common_errors": [
          "Using non-standard forms in formal writing",
          "Correcting dialogue to Standard English when the character would naturally use dialect"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining why Standard English exists as a convention for formal contexts without devaluing dialect, and identifying the specific non-standard forms common in their region.",
        "example_task": "Explain to a younger child: Why do we use Standard English in formal writing? Does that mean dialect is wrong?",
        "example_response": "Standard English is the version of English used in formal writing, exams and official documents. It exists so that everyone across the country uses the same grammar in these situations, which avoids confusion. But dialect is NOT wrong — it is a natural part of how people speak in their community. A sentence like 'I done it' follows its own grammatical rules and is perfectly understood by speakers of that dialect. We learn Standard English as an additional tool, like learning to use a different register — not because our home language is inferior.",
        "common_errors": [
          "Saying dialect is 'wrong' or 'lazy' rather than different",
          "Not being able to explain why Standard English matters in formal contexts"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C061",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Grouping related sentences together in a basic paragraph with a clear topic.",
        "example_task": "These six sentences are about two topics — dogs and cats. Sort them into two paragraphs.",
        "example_response": "Paragraph 1 (dogs): Dogs are loyal pets. They need walking every day. Many breeds love to play fetch.\nParagraph 2 (cats): Cats are independent animals. They groom themselves. Most cats enjoy sleeping in sunny spots.",
        "common_errors": [
          "Mixing sentences from both topics in one paragraph",
          "Not understanding what makes sentences 'related'"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writing paragraphs with a clear topic sentence that tells the reader what the paragraph is about.",
        "example_task": "Write a paragraph about your school's playground. Start with a topic sentence.",
        "example_response": "Our school playground is divided into three different areas. The main area is a large tarmac space with painted lines for games. Next to it, there is a grass field where we play football at lunchtime. Finally, there is a quiet garden area with benches where children can read or talk.",
        "common_errors": [
          "Starting with a detail rather than a topic sentence",
          "Including information that does not relate to the topic"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Organising writing into coherent paragraphs with topic sentences, supporting details, and cohesive links within and between paragraphs.",
        "example_task": "Write three connected paragraphs about a topic of your choice. Each paragraph should have a topic sentence, and the paragraphs should link to each other.",
        "example_response": "[Three paragraphs with clear topic sentences, supporting details, and linking devices between paragraphs: 'Another important aspect...', 'In addition to this...', 'Finally...'. Pronoun references across paragraphs are clear. Each paragraph focuses on one main idea.]",
        "common_errors": [
          "Writing three disconnected paragraphs without links between them",
          "Including topic sentences but then wandering off-topic within the paragraph"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using paragraph structure strategically — varying paragraph length for effect and using topic sentences to control the reader's understanding.",
        "example_task": "Explain how the paragraph structure of your persuasive text helps build the argument. Why did you order the paragraphs this way?",
        "example_response": "I put my weakest argument first and my strongest last, so the reader finishes with the most convincing point. My first paragraph introduces the issue with a question to hook the reader. Paragraphs 2-4 each present one argument, getting stronger. My final paragraph is deliberately short — just two sentences — because I want the call to action to feel punchy and memorable. Long final paragraphs lose their persuasive force.",
        "common_errors": [
          "Ordering paragraphs randomly rather than strategically",
          "Not being able to explain why the paragraph structure serves the purpose"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C062",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising and naming the four new Year 4 grammatical terms: determiner, pronoun, possessive pronoun, adverbial.",
        "example_task": "Match each term to the correct example: determiner / pronoun / possessive pronoun / adverbial. Options: 'the', 'she', 'mine', 'quickly'.",
        "example_response": "the = determiner, she = pronoun, mine = possessive pronoun, quickly = adverbial",
        "common_errors": [
          "Confusing 'determiner' with 'adjective'",
          "Not knowing what 'adverbial' means"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying determiners, pronouns, possessive pronouns and adverbials in sentences.",
        "example_task": "In this sentence, identify: the determiner, the pronoun, and the adverbial. 'The dog quickly chased the cat, and it escaped.'",
        "example_response": "Determiners: 'The' (before dog) and 'the' (before cat). Pronoun: 'it' (replacing 'the cat'). Adverbial: 'quickly' (tells us how the dog chased).",
        "common_errors": [
          "Missing the second 'the' as a determiner",
          "Confusing the pronoun with the subject"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using all Year 4 terminology accurately when discussing reading and writing, understanding the function each word class serves.",
        "example_task": "Explain the function of each underlined word using the correct grammatical term: 'Every morning, she walked her dog through the park. The exercise was good for them both. It was theirs — a shared routine.'",
        "example_response": "'Every' = determiner (tells us which morning — all of them). 'She' = pronoun (replaces the character's name). 'Her' = possessive determiner (shows the dog belongs to her). 'the' = determiner. 'them' = pronoun (refers to both character and dog). 'theirs' = possessive pronoun (stands alone, showing shared ownership).",
        "common_errors": [
          "Confusing possessive determiners (my, your, her) with possessive pronouns (mine, yours, hers)",
          "Knowing the terms but not being able to explain the function"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining why determiners, pronouns and adverbials matter for effective writing, using examples from own or published texts.",
        "example_task": "How does the choice of determiner change meaning? Compare: 'A dog ran across the road' with 'The dog ran across the road' and 'My dog ran across the road.'",
        "example_response": "'A dog' — we don't know which dog; it's any dog, a general statement. 'The dog' — a specific dog that the reader already knows about; the determiner creates familiarity. 'My dog' — personal possession; the reader immediately cares more because it belongs to the narrator. Determiners are tiny words but they completely change how the reader relates to the noun. In story writing, moving from 'a dog' to 'the dog' to 'my dog' is actually a technique for increasing the reader's emotional connection.",
        "common_errors": [
          "Treating determiners as unimportant 'small words'",
          "Not connecting grammatical knowledge to writing effect"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C063",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying similes in a text and understanding that they compare two things using 'like' or 'as'.",
        "example_task": "Find the simile in this sentence: 'The stars sparkled like diamonds scattered across black velvet.'",
        "example_response": "The simile is 'like diamonds scattered across black velvet'. It compares the stars to diamonds to show how bright and beautiful they are.",
        "common_errors": [
          "Identifying the simile but not explaining the comparison",
          "Confusing simile with metaphor"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Understanding and using common figurative language (simile, metaphor, personification) and choosing precise vocabulary.",
        "example_task": "Replace the underlined words with more precise or figurative alternatives: 'The wind was very strong. The trees moved a lot. The rain came down.'",
        "example_response": "The wind howled like a wounded animal. The trees thrashed and writhed. The rain hammered down in sheets.",
        "common_errors": [
          "Using clichéd figurative language ('as fast as lightning')",
          "Replacing with another vague word rather than a precise or figurative one"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using figurative language purposefully in own writing and distinguishing shades of meaning among related words.",
        "example_task": "These words all mean 'walk': stroll, march, trudge, creep, stride. Write five sentences, each using a different word. How does the word choice change the meaning?",
        "example_response": "She strolled through the garden, enjoying the sunshine. (relaxed, happy) The soldiers marched in perfect lines. (disciplined, purposeful) He trudged home through the rain. (tired, reluctant) The cat crept along the wall towards the bird. (slow, careful, secretive) She strode into the room with confidence. (bold, powerful) Each word means 'walk' but carries different connotations about speed, mood and intention.",
        "common_errors": [
          "Using all five words as simple synonyms without varying the meaning",
          "Not explaining how the shade of meaning differs"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Creating original figurative language and selecting academic vocabulary precisely, explaining the effect of specific word choices.",
        "example_task": "Write an original simile or metaphor for 'the moon'. Avoid clichés. Explain why your comparison works.",
        "example_response": "'The moon hung above the city like a forgotten streetlamp, casting its pale light on no one in particular.' This works because it makes the moon seem lonely and purposeless — a streetlamp that nobody needs. It also connects the moon to an urban setting rather than the usual nature imagery, which makes it feel fresh. The word 'forgotten' gives the moon personality through personification.",
        "common_errors": [
          "Defaulting to clichés ('the moon was like a silver coin')",
          "Creating a comparison that doesn't make logical sense"
        ]
      }
    ]
  }
]