[
  {
    "concept_id": "EN-Y3-C054",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Joining two simple sentences using 'and', 'but' or 'because' to create a longer sentence.",
        "example_task": "Join these two sentences using and, but or because: 'It was raining. We went outside.'",
        "example_response": "'It was raining but we went outside.'",
        "common_errors": [
          "Using 'and' as the default conjunction regardless of the relationship between the clauses",
          "Not choosing the conjunction that best expresses the meaning (e.g., 'and' where 'but' is needed)"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writing sentences with subordinate clauses using when, if, because or although, with the subordinate clause in the standard (final) position.",
        "example_task": "Write three sentences about a school trip, each using a different conjunction: when, because, although.",
        "example_response": "'We cheered when the coach arrived. We were excited because we had never visited a castle before. We still had fun although it rained all day.'",
        "common_errors": [
          "Using only 'because' and not varying the conjunction",
          "Writing fragments rather than complete multi-clause sentences (e.g., 'Because it was raining.')"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Writing multi-clause sentences with subordinate clauses in varied positions (initial and final), using a wider range of conjunctions including while, after, before and until.",
        "example_task": "Write a paragraph that includes at least two multi-clause sentences. Place one subordinate clause at the start and one at the end. Use different conjunctions.",
        "example_response": "'Before the sun had fully risen, the farmer was already working in the fields. He checked each row of vegetables carefully while the birds sang around him. Although the work was hard, he enjoyed the quiet morning until the village began to stir.'",
        "common_errors": [
          "Missing the comma when the subordinate clause comes first",
          "Over-using multi-clause sentences so that all sentences sound the same"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using multi-clause sentences with control and variety, choosing conjunction and clause position for deliberate effect on meaning and rhythm.",
        "example_task": "Rewrite this passage to vary the sentence structures. Some sentences should be multi-clause, some simple. Choose conjunctions and positions that create the best effect.",
        "example_response": "(Rewrites with deliberate variety: 'The forest was silent. Although she had been walking for hours, Maya felt no closer to the edge. She stopped. If she turned back now, she would reach the village before dark — but something ahead caught her eye.' Uses short sentences for tension and multi-clause for explanation.)",
        "common_errors": [
          "Making every sentence multi-clause rather than varying for effect",
          "Choosing conjunctions that create awkward or confusing sentence structures"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C055",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising simple past tense verbs in sentences and understanding that they describe actions that have already happened.",
        "example_task": "Underline the past tense verb in each sentence: 'She walked to school. He ate his lunch. They played in the park.'",
        "example_response": "'Walked, ate, played.' (All three correctly identified.)",
        "common_errors": [
          "Underlining the noun instead of the verb",
          "Not recognising irregular past tense forms like 'ate' as past tense"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Understanding the difference between simple past and present perfect with teacher modelling, and identifying examples of each.",
        "example_task": "Sort these sentences into 'simple past' and 'present perfect': 'She went home.' 'She has gone home.' 'I ate dinner.' 'I have eaten dinner.'",
        "example_response": "'Simple past: She went home. I ate dinner. Present perfect: She has gone home. I have eaten dinner.'",
        "common_errors": [
          "Not seeing the difference between the two forms because both refer to past events",
          "Thinking 'has/have' always signals present tense"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using the present perfect form correctly in own writing and speech, understanding the difference in meaning from the simple past.",
        "example_task": "Write two sentences about the same event — one in the simple past and one in the present perfect. Explain the difference in meaning.",
        "example_response": "'Simple past: I visited the museum. Present perfect: I have visited the museum. The simple past tells you it happened and finished — it could have been any time. The present perfect suggests it's relevant now — maybe I'm telling someone I've already been so I don't need to go again.'",
        "common_errors": [
          "Using 'has went' or 'have went' instead of the correct 'has gone' or 'have gone'",
          "Using simple past where present perfect would be more appropriate (e.g., 'I already did it' instead of 'I have already done it')"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Choosing between simple past and present perfect deliberately for effect in writing, and explaining why one form is more appropriate than the other in specific contexts.",
        "example_task": "Read this newspaper report that uses simple past throughout. Rewrite the opening using the present perfect where it would be more appropriate. Explain your changes.",
        "example_response": "'Original: The council closed the park yesterday. Changed: The council has closed the park. I used present perfect because the park is still closed now — it's ongoing. The simple past would suggest it was closed and then reopened. Present perfect makes it clear the closure is still in effect, which is more relevant for a current news report.'",
        "common_errors": [
          "Changing all verbs to present perfect rather than selecting where it's more appropriate",
          "Explaining the grammatical difference without understanding the difference in meaning"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C056",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising when a name is repeated too many times in a piece of writing.",
        "example_task": "Read this: 'Tom went to the shop. Tom bought some bread. Tom walked home. Tom ate the bread.' What is wrong with this writing?",
        "example_response": "'It says Tom too many times. It sounds boring and repetitive.'",
        "common_errors": [
          "Not noticing the repetition because the sentences make grammatical sense individually",
          "Thinking the problem is the sentence structure rather than the noun repetition"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Replacing repeated nouns with pronouns in a short passage to reduce repetition.",
        "example_task": "Rewrite this passage, replacing some of the repeated name 'Maya' with 'she' or 'her': 'Maya loved painting. Maya picked up Maya's brush. Maya painted a sunset.'",
        "example_response": "'Maya loved painting. She picked up her brush. She painted a sunset.'",
        "common_errors": [
          "Replacing every instance of the name, including where the name is needed for clarity",
          "Using the wrong pronoun form (e.g., 'her went' instead of 'she went')"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Choosing appropriately between nouns and pronouns in own writing to avoid repetition while maintaining clarity about who is being referred to.",
        "example_task": "Write a paragraph about two characters interacting. Use pronouns to avoid repetition but make sure it's always clear who you are referring to.",
        "example_response": "'Amir showed his drawing to Priya. She smiled and told him it was brilliant. He blushed and looked away, but Priya could see he was pleased.'",
        "common_errors": [
          "Using 'he' or 'she' when two characters of the same gender are in the scene, creating ambiguity",
          "Over-using pronouns so the reader loses track of who is being discussed"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using a varied range of referring expressions (names, pronouns, noun phrases like 'the tall girl' or 'his best friend') to maintain cohesion and add information simultaneously.",
        "example_task": "Write a passage about a character that uses at least three different ways to refer to them without using their name every time.",
        "example_response": "'Ella raced to the finish line. The fastest runner in Year 3 had done it again. She threw her arms in the air as her teammates surrounded their champion.'",
        "common_errors": [
          "Using the same referring expression repeatedly rather than varying",
          "Creating confusion by using too many different expressions for the same character"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C057",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Using a simple time conjunction (then, and then) to connect two events in writing.",
        "example_task": "Join these events into one sentence using 'then': 'She ate breakfast. She went to school.'",
        "example_response": "'She ate breakfast and then she went to school.'",
        "common_errors": [
          "Using 'and then' repeatedly without varying the connective",
          "Not connecting the events — writing them as separate sentences every time"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using a range of conjunctions and adverbs to express time (when, after, before, next, soon) and cause (because, so) in sentences.",
        "example_task": "Rewrite these sentences using a different time or cause word each time: 'She was cold. She put on her coat.' 'It was late. He went to bed.'",
        "example_response": "'Because she was cold, she put on her coat. After it got late, he went to bed.'",
        "common_errors": [
          "Defaulting to 'because' for cause and 'then' for time rather than varying vocabulary",
          "Using a connective that doesn't express the intended relationship (e.g., using 'when' where 'because' is needed)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using conjunctions, adverbs and prepositions to express time, place and cause in extended writing, choosing the most appropriate word for each context.",
        "example_task": "Write a paragraph about a journey. Use at least three different words to show time or cause: choose from when, before, after, while, because, so, therefore, during, until.",
        "example_response": "'Before the sun rose, the family packed the car. During the long drive, the children played games while their parents navigated. Because the motorway was busy, they took a different route. They finally arrived after three hours on the road.'",
        "common_errors": [
          "Using connectives but not varying them — repeating the same two or three",
          "Placing time and cause words incorrectly in the sentence, creating awkward constructions"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Selecting precisely between conjunctions, adverbs and prepositions to express subtle differences in time and cause, using them to create cohesion across paragraphs.",
        "example_task": "Write a passage where you use time and cause connectives to link events across at least two paragraphs. Choose words that show whether events happen at the same time, one after another, or one causes the other.",
        "example_response": "'While the archaeologists carefully brushed the soil away, Professor Khan examined the map. Meanwhile, her assistant photographed each new discovery. Because the dig had already produced several unusual finds, the team decided to extend their stay.\n\nConsequently, they needed more supplies from the nearby village. Before they could continue, the equipment had to be replaced. Nevertheless, the delay proved worthwhile — during the extra week, they uncovered the most significant artefact of all.'",
        "common_errors": [
          "Using only simple time connectives (then, next) rather than more precise options (meanwhile, consequently)",
          "Not recognising the difference between simultaneous events (while, during) and sequential events (after, then)"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C058",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising a fronted adverbial in a sentence when it is pointed out, and understanding that it tells you when, where or how.",
        "example_task": "In this sentence, the underlined part is a fronted adverbial: 'Slowly, the cat crept across the garden.' What does it tell you?",
        "example_response": "'It tells you how the cat moved — slowly.'",
        "common_errors": [
          "Confusing the fronted adverbial with the subject of the sentence",
          "Not understanding what 'fronted' means — thinking any adverb is a fronted adverbial"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Adding a simple fronted adverbial to the beginning of a given sentence and using a comma after it.",
        "example_task": "Add a fronted adverbial to the start of each sentence. Remember the comma! 'The children ran outside.' 'She opened the box.'",
        "example_response": "'After lunch, the children ran outside. Carefully, she opened the box.'",
        "common_errors": [
          "Forgetting the comma after the fronted adverbial",
          "Adding a single adverb that works but not extending to adverbial phrases"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using fronted adverbials of time, place and manner in own writing to add variety and detail, consistently using a comma after them.",
        "example_task": "Write a paragraph using at least three different fronted adverbials — one about when, one about where, and one about how.",
        "example_response": "'Early in the morning, the fisherman prepared his boat. Down by the harbour, the seagulls circled overhead. With great care, he loaded his nets and set off across the calm water.'",
        "common_errors": [
          "Using only time adverbials (First, Then, Next) rather than varying type",
          "Over-using fronted adverbials so that every sentence starts with one"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using fronted adverbials deliberately for effect — to control pace, create atmosphere or shift the reader's attention — and varying sentence openings.",
        "example_task": "Write a tense scene using fronted adverbials. Use them to control the pace — slower for suspense, faster for action.",
        "example_response": "'Deep in the forest, something stirred. Without warning, a branch cracked above her head. In a flash, she ducked. Heart pounding, she pressed herself against the tree. Only when the silence returned did she dare to look up.'",
        "common_errors": [
          "Using fronted adverbials mechanically rather than for deliberate effect",
          "Not varying between sentences with and without fronted adverbials"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C059",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising speech marks (inverted commas) in a text and understanding that they show the words someone actually said.",
        "example_task": "Look at this sentence: 'Hello,' said the teacher. What part shows the words the teacher actually said? How do you know?",
        "example_response": "'The word Hello is what the teacher said. I know because it has speech marks around it.'",
        "common_errors": [
          "Not understanding what the speech marks indicate",
          "Thinking the whole sentence is spoken rather than just the words inside the speech marks"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writing a simple sentence of dialogue with speech marks around the spoken words and a reporting clause.",
        "example_task": "Write what the character says, with speech marks in the right place: The boy said I am hungry.",
        "example_response": "'The boy said, \"I am hungry.\"'",
        "common_errors": [
          "Putting speech marks around the whole sentence including the reporting clause",
          "Forgetting to open or close the speech marks"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Punctuating direct speech correctly in own writing, including speech marks, commas, reporting clauses and new lines for new speakers.",
        "example_task": "Write a short conversation between two characters (at least 4 lines of dialogue). Punctuate the speech correctly.",
        "example_response": "'\"Where are we going?\" asked Lily.\n\"To the old lighthouse,\" replied Jack. \"I found a key that might open the door.\"\n\"Are you sure it's safe?\" she whispered.\n\"Only one way to find out,\" he said with a grin.'",
        "common_errors": [
          "Not starting a new line for each new speaker",
          "Placing the comma after the closing speech mark rather than before it"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using direct speech effectively in narrative writing, varying the position of reporting clauses and using dialogue to reveal character and advance the plot.",
        "example_task": "Write a scene where dialogue reveals something important about the characters. Vary where you place the reporting clause (beginning, middle, end of the speech).",
        "example_response": "'\"I need to tell you something,\" Mia said quietly.\nJack stopped walking. \"What is it?\"\n\"The map,\" she began, looking away, \"isn't quite accurate.\"\n\"What do you mean, not accurate?\" His voice was sharp now.\nMia took a deep breath. \"I drew it from memory. I may have got the cave entrance wrong.\"'",
        "common_errors": [
          "Using 'said' for every reporting clause rather than varying the verb or adding description",
          "Writing dialogue that doesn't serve a purpose in the story (e.g., greetings and small talk)"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C060",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that a prefix is a group of letters added to the beginning of a word that changes its meaning.",
        "example_task": "What is the prefix in 'superhero'? What does 'super' mean?",
        "example_response": "'The prefix is super. It means above or beyond — so a superhero is a hero who is more powerful than a normal hero.'",
        "common_errors": [
          "Thinking the prefix is part of the original word rather than an addition",
          "Not connecting the prefix meaning to the word meaning"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Adding the prefixes super-, anti- and auto- to root words and explaining how the prefix changes the meaning.",
        "example_task": "Add the prefix super-, anti- or auto- to these root words to make new words: market, social, graph. Explain what each new word means.",
        "example_response": "'Supermarket — a very large market (super means above/beyond). Antisocial — against being social (anti means against). Autograph — writing by yourself/your own signature (auto means self).'",
        "common_errors": [
          "Choosing the wrong prefix for the root word",
          "Spelling the prefix incorrectly when joining to the root (e.g., 'anti-social' — hyphen use varies)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using nouns formed with prefixes super-, anti- and auto- correctly in own writing, demonstrating understanding of their meaning.",
        "example_task": "Write three sentences, each using a different noun formed with super-, anti- or auto-. Make sure the meaning is clear from the context.",
        "example_response": "'The autobiography told the story of the explorer's life in her own words. The doctor gave the patient an antiseptic cream to prevent infection. The superstore was so enormous that it took twenty minutes to walk from one end to the other.'",
        "common_errors": [
          "Using the word without understanding the prefix meaning (e.g., using 'antiseptic' without understanding 'anti' means against)",
          "Creating non-existent words by adding prefixes to inappropriate roots"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using knowledge of prefix meanings to work out the meaning of unfamiliar words and to create or explore new word formations.",
        "example_task": "You encounter the word 'autopilot' for the first time. Using your knowledge of the prefix auto-, explain what you think it means. Can you think of other auto- words?",
        "example_response": "'Auto means self, so autopilot must mean something that pilots itself — a system that flies a plane without a person controlling it. Other auto- words: automatic (working by itself), automobile (a vehicle that moves by itself), autonomy (self-governing).'",
        "common_errors": [
          "Knowing the prefix meaning but not applying it to work out unfamiliar words",
          "Confusing similar-sounding prefixes (e.g., anti- and ante-)"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C061",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Choosing between 'a' and 'an' before familiar words when the rule is modelled.",
        "example_task": "Choose a or an: ___ apple, ___ book, ___ elephant, ___ cat.",
        "example_response": "'An apple, a book, an elephant, a cat.'",
        "common_errors": [
          "Not knowing the rule — guessing randomly",
          "Thinking 'an' is used before any word starting with a vowel letter, without considering sound"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Applying the a/an rule based on the initial sound of the following word, including some exceptions.",
        "example_task": "Choose a or an: ___ hour, ___ uniform, ___ umbrella, ___ European country.",
        "example_response": "'An hour (silent h, starts with a vowel sound), a uniform (starts with a y sound), an umbrella (starts with a vowel sound), a European country (starts with a y sound).'",
        "common_errors": [
          "Writing 'a hour' because h is a consonant letter, ignoring the silent h",
          "Writing 'an uniform' because u is a vowel letter, ignoring the /y/ sound"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Consistently using the correct article in own writing, applying the rule based on sound not spelling.",
        "example_task": "Write sentences using the correct article before each of these words: honest person, useful tool, unusual event, one-eyed pirate.",
        "example_response": "'She was an honest person who always told the truth. A useful tool in the kitchen is a wooden spoon. It was an unusual event that surprised everyone. A one-eyed pirate stood on the deck.'",
        "common_errors": [
          "Inconsistency — sometimes applying the rule correctly and sometimes not",
          "Not checking whether the article sounds right when the sentence is read aloud"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining the a/an rule accurately, including why it is based on sound rather than spelling, and identifying and correcting errors in others' writing.",
        "example_task": "A pupil has written 'an uniform' and 'a hour'. Explain why both are wrong and teach them the correct rule.",
        "example_response": "'An uniform is wrong because uniform starts with a y sound (/juː/), which is a consonant sound, so it should be a uniform. A hour is wrong because the h in hour is silent, so the word starts with a vowel sound (/aʊ/), and it should be an hour. The rule is about the sound the next word starts with, not the letter — that's why it's an honest mistake but a happy day.'",
        "common_errors": [
          "Explaining the rule in terms of letters rather than sounds",
          "Knowing the rule but not being able to explain it clearly to someone else"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C062",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that some words are related because they share a common part.",
        "example_task": "Look at these words: play, player, playing, playful. What part do they all share?",
        "example_response": "'They all have the word play in them.'",
        "common_errors": [
          "Grouping words that sound similar but aren't related (e.g., 'play' and 'place')",
          "Not seeing 'play' as a separate word within 'playful'"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Generating words that belong to the same word family by adding prefixes and suffixes to a root word.",
        "example_task": "Start with the root word 'help'. How many words can you make from this word family?",
        "example_response": "'Help, helped, helping, helper, helpful, unhelpful, helpless, helplessly.'",
        "common_errors": [
          "Including words that sound similar but are not from the same root (e.g., 'helicopter')",
          "Only adding one type of affix (e.g., only -ing and -ed) rather than exploring the full family"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using word family knowledge to understand unfamiliar words in reading and to generate vocabulary for writing.",
        "example_task": "You encounter the word 'insoluble' in a science text. You know the word 'solve'. Use word family knowledge to work out what 'insoluble' might mean.",
        "example_response": "'Solve means to find the answer. Solution means the answer (or something dissolved). The prefix in- means not. So insoluble probably means something that cannot be solved or cannot be dissolved.'",
        "common_errors": [
          "Identifying the root word but not connecting it to the meaning of the unfamiliar word",
          "Not recognising roots when the spelling changes slightly (e.g., solve → solution)"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Exploring word families that span across word classes and using morphological knowledge to make connections between words with shared Latin or Greek roots.",
        "example_task": "Explore the word family based on the root 'sign'. Generate as many related words as you can. Can you explain how they all connect back to the idea of a sign or mark?",
        "example_response": "'Sign, signal, signature, signed, signing, design, designer, resign, resignation, significant, insignificant, assign, assignment. They all connect to the idea of making a mark or indicating something. A signature is your personal mark. To resign means to sign away your position. Significant means important enough to be marked or noticed.'",
        "common_errors": [
          "Including words that share letters but not the root meaning (e.g., 'sing' is not in the 'sign' family)",
          "Generating words without explaining how they connect in meaning"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C063",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Understanding that a paragraph is a group of sentences about the same topic, separated from other paragraphs by a gap.",
        "example_task": "Look at this text. How many paragraphs are there? What is each one about?",
        "example_response": "'There are three paragraphs. The first is about what the animal looks like. The second is about where it lives. The third is about what it eats.'",
        "common_errors": [
          "Counting sentences instead of paragraphs",
          "Not being able to identify what each paragraph is about"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writing related sentences together in a paragraph, keeping to one topic per paragraph in non-fiction writing.",
        "example_task": "Write two paragraphs about your school: one about the building and one about the playground. Keep each topic in its own paragraph.",
        "example_response": "(Two distinct paragraphs. First: describes the school building — brick, two storeys, big windows. Second: describes the playground — markings, climbing frame, field. No mixing of topics.)",
        "common_errors": [
          "Mixing topics within a paragraph (e.g., describing the playground in the building paragraph)",
          "Writing all information as one continuous block"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using paragraphs consistently in extended writing to group related material, starting new paragraphs for changes in time, place, topic or speaker.",
        "example_task": "Write a page of a story using at least three paragraphs. Each paragraph should have a clear reason for starting.",
        "example_response": "(Three or more well-organised paragraphs. Paragraph breaks at logical points: a time change, a place change, or a shift in focus. Each paragraph contains sentences that relate to each other.)",
        "common_errors": [
          "Breaking paragraphs at arbitrary points rather than meaningful shifts",
          "Understanding when to start a new paragraph in theory but not applying it consistently in writing"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using paragraphs as a structural tool, including linking between paragraphs with connectives or topic sentences, and varying paragraph length for effect.",
        "example_task": "Write a non-fiction text about an animal of your choice using at least four paragraphs. Each paragraph should have a topic sentence. Link paragraphs together so the text flows.",
        "example_response": "(Four well-structured paragraphs with clear topic sentences: 'The Arctic fox is perfectly adapted to survive in freezing temperatures.' Paragraphs linked with connectives: 'In addition to its thick fur...', 'However, the Arctic fox faces new threats...'. Paragraph length varies — the conclusion is shorter for emphasis.)",
        "common_errors": [
          "Writing paragraphs that are self-contained but don't connect to each other",
          "Using topic sentences that are too vague to guide the paragraph content"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C064",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying a heading in a non-fiction text and understanding that it tells the reader what the section is about.",
        "example_task": "Point to the heading on this page. What does it tell you?",
        "example_response": "'The heading says Where Penguins Live. It tells me this section is about the places penguins are found.'",
        "common_errors": [
          "Confusing the heading with the first sentence of the text",
          "Not understanding the purpose of a heading"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writing a clear heading and sub-headings for a non-fiction text when guided by a plan.",
        "example_task": "You are writing about healthy eating. Write a main heading and three sub-headings to organise your information.",
        "example_response": "'Heading: Healthy Eating. Sub-headings: Why Is Healthy Eating Important?, The Five Food Groups, Planning a Balanced Meal.'",
        "common_errors": [
          "Writing sub-headings that are too vague (e.g., 'More Information' or 'Other Stuff')",
          "Writing sub-headings that are full sentences rather than concise labels"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using headings and sub-headings purposefully in own non-fiction writing to organise content and help the reader navigate the text.",
        "example_task": "Write an information report about a topic of your choice. Use a main heading and at least three sub-headings. Make sure the information under each sub-heading matches it.",
        "example_response": "(Report with clear, informative heading and well-matched sub-headings. For example, 'Fascinating Foxes' with sub-headings 'What Do Foxes Look Like?', 'Where Do Foxes Live?', 'What Do Foxes Eat?', 'Foxes in Towns and Cities'. All content under each sub-heading is relevant.)",
        "common_errors": [
          "Including information under the wrong sub-heading",
          "Using headings that don't accurately represent the content beneath them"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Choosing headings and sub-headings that are informative, engaging and accurately reflect the hierarchical structure of the information.",
        "example_task": "Write an information leaflet with headings that are both informative and engaging. Use at least one heading that is a question and one that creates interest.",
        "example_response": "(Leaflet with engaging headings like 'Did You Know Octopuses Have Three Hearts?', 'Masters of Disguise: How Octopuses Hide', 'Smarter Than You Think'. Sub-headings are clearly subordinate to main headings. The hierarchical relationship is clear.)",
        "common_errors": [
          "Prioritising catchy headings at the expense of clarity",
          "Not distinguishing between the level of headings and sub-headings"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C065",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising and naming basic grammatical terms from Year 2 (noun, verb, adjective, adverb) in familiar contexts.",
        "example_task": "In this sentence, point to a noun, a verb and an adjective: 'The happy dog ran quickly.'",
        "example_response": "'Dog is a noun. Ran is a verb. Happy is an adjective.'",
        "common_errors": [
          "Confusing nouns and adjectives, or verbs and adverbs",
          "Identifying words by position rather than function (e.g., thinking the first word is always the noun)"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying Year 3 grammatical terms (preposition, conjunction, prefix, clause) in sentences with teacher support.",
        "example_task": "In this sentence, find a preposition and a conjunction: 'The cat sat under the table because it was scared.'",
        "example_response": "'Under is a preposition — it tells you where the cat sat. Because is a conjunction — it joins the two parts of the sentence.'",
        "common_errors": [
          "Confusing prepositions with adverbs (e.g., thinking 'under' is always an adverb)",
          "Not distinguishing between conjunctions and prepositions when they share the same word (e.g., 'before' can be either)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using Year 3 grammatical terminology accurately when discussing reading and writing, including clause, subordinate clause, conjunction, preposition, prefix, direct speech, inverted commas.",
        "example_task": "Identify the main clause and the subordinate clause in this sentence: 'Although the storm raged outside, the children felt safe inside the cabin.' Name the conjunction.",
        "example_response": "'The main clause is the children felt safe inside the cabin because it makes sense on its own. The subordinate clause is although the storm raged outside because it cannot stand alone. The conjunction is although.'",
        "common_errors": [
          "Confusing the main clause with the subordinate clause",
          "Identifying the conjunction but not understanding how it creates a subordinate clause"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using grammatical terminology precisely and confidently to analyse and discuss texts, explaining how grammatical choices contribute to meaning and effect.",
        "example_task": "Analyse this sentence using grammatical terminology: 'Before dawn, the exhausted explorers crept silently through the dense jungle because they knew danger was close.'",
        "example_response": "'Before dawn is a fronted adverbial (preposition phrase) telling us when. The main clause is the exhausted explorers crept silently through the dense jungle. Exhausted and dense are adjectives modifying the nouns. Silently is an adverb modifying the verb crept. Because they knew danger was close is a subordinate clause joined by the conjunction because, explaining why they crept. The author uses the subordinate clause at the end to create a sense of threat.'",
        "common_errors": [
          "Identifying word classes without discussing their function or effect",
          "Knowing the terminology but applying it mechanically rather than using it to deepen understanding"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C066",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Understanding that people can speak in different ways and that there is no single 'correct' way to speak in all situations.",
        "example_task": "Listen to these two ways of saying the same thing: 'I done my homework' and 'I did my homework'. Are both ways of speaking used by real people?",
        "example_response": "'Yes, some people say I done and some say I did. Both are used, but they're different.'",
        "common_errors": [
          "Thinking that non-Standard English is 'wrong' in all contexts",
          "Not recognising that they already use different forms of English in different situations"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying common differences between Standard and non-Standard English verb forms when examples are provided.",
        "example_task": "Which of these uses Standard English? 'We was playing.' 'We were playing.' 'He done it.' 'He did it.'",
        "example_response": "'We were playing is Standard English — not we was. He did it is Standard English — not he done it.'",
        "common_errors": [
          "Not being confident which form is Standard English because the non-standard form sounds natural",
          "Feeling that identifying Standard English means their dialect is being criticised"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using Standard English verb forms in writing, particularly for subject-verb agreement and common irregular verbs, and understanding when Standard English is expected.",
        "example_task": "Rewrite these sentences in Standard English: 'She were really happy.' 'They was going to the shop.' 'He seen the film yesterday.'",
        "example_response": "'She was really happy. They were going to the shop. He saw the film yesterday.'",
        "common_errors": [
          "Inconsistently applying Standard English — correcting some verbs but not others",
          "Applying Standard English in exercises but reverting to dialect forms in free writing"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Understanding why Standard English exists, when it is appropriate, and how dialect is valued in different contexts including in literature and dialogue writing.",
        "example_task": "Explain why a character in a story might speak in dialect while the narrator uses Standard English. Can you think of a book that does this?",
        "example_response": "'A character might speak in dialect because it shows where they are from and makes them feel real. The narrator uses Standard English so all readers can understand the story. In some books, like stories set in different regions, characters say things like ain't or nowt and this makes them authentic. The author is choosing — dialect isn't wrong, it's a deliberate choice for character voice.'",
        "common_errors": [
          "Thinking Standard English is always 'better' rather than understanding it is appropriate in certain contexts",
          "Not understanding that dialect in dialogue is a positive literary choice, not an error"
        ]
      }
    ]
  }
]