[
  {
    "concept_id": "EN-Y6-C024",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that many complex words contain Latin or Greek roots and that knowing the root can help with spelling, with teacher-provided examples.",
        "example_task": "Your teacher writes the root 'rupt' on the board and tells you it comes from Latin meaning 'to break'. Spell these three words and explain how the root helps: interrupt, erupt, corrupt.",
        "example_response": "Interrupt means to break into something, like breaking into a conversation. Erupt means to break out, like a volcano breaking out. Corrupt means to break apart or damage, like breaking something so it does not work properly. Knowing 'rupt' means break helps me spell all three because I know the 'rupt' part is always the same.",
        "common_errors": [
          "Spelling the root incorrectly because the pupil relies on sound alone, writing 'eruppt' or 'interupt' with a single 'r'",
          "Understanding the meaning connection but not using it as a spelling strategy"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using knowledge of Latin and Greek roots to spell words with predictable patterns, and beginning to notice how prefixes attach to roots without changing the root spelling.",
        "example_task": "The Latin root 'scribe/script' means 'to write'. Spell each of these words and underline the root: describe, inscription, prescription, transcription. What do you notice about how the root changes?",
        "example_response": "Describe: 'scribe' is the root. Inscription: 'script' is the root. Prescription: 'script' again. Transcription: 'script' again. The root changes form between 'scribe' (when it is a verb) and 'script' (when a suffix is added). Knowing this helps me spell both forms correctly because 'scr' at the start is always the same, and I know whether to use 'ibe' or 'ipt' based on what comes after.",
        "common_errors": [
          "Misspelling 'inscription' as 'inscrition' by dropping the 'p' because it is not clearly heard",
          "Not recognising that 'scribe' and 'script' are forms of the same root"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Applying morphological and etymological knowledge independently to spell complex words, including words with assimilated prefixes (where the prefix changes to match the root) and words where the root is less obvious.",
        "example_task": "Spell these words correctly and explain the morphology: illegible, correspond, accommodation, unnecessary. For each, identify the prefix and root and explain any spelling patterns caused by how the prefix meets the root.",
        "example_response": "Illegible: the prefix 'in-' (meaning not) changes to 'il-' before 'l' in 'legible' (able to be read, from Latin 'legere'). This is why there are two l's. Correspond: 'cor-' is a form of 'con-' (meaning together) before 'r' in 'respond'. Two r's because the prefix changes to match the root. Accommodation: 'ac-' is a form of 'ad-' (meaning towards) before 'c' in 'commodation', giving two c's. Then 'mod' relates to 'modus' (measure/manner) giving two m's when the prefix meets the root. Unnecessary: 'un-' (meaning not) plus 'necessary', which already starts with 'n', giving two n's.",
        "common_errors": [
          "Writing single consonants where assimilation produces doubles, such as 'acommodation' or 'ilegible'",
          "Knowing the correct spelling from memory but not being able to explain the morphological reason for the double letters"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using morphological and etymological knowledge as a systematic strategy for spelling unfamiliar words, predicting likely spellings of words not previously encountered, and explaining spelling patterns to others.",
        "example_task": "You encounter the word 'indefatigable' for the first time. Using morphological analysis, predict its spelling and meaning. Then check in a dictionary. Explain your reasoning step by step.",
        "example_response": "I will break it down: 'in-' means not. 'De-' means completely or down. 'Fatig' looks like it relates to 'fatigue', which comes from Latin 'fatigare' meaning to tire. '-able' means able to be. So 'indefatigable' should mean not able to be tired out, or tireless. For the spelling: 'in' keeps its form because the next letter is 'd', not a letter that triggers assimilation. 'De' is a standard prefix. 'Fatig' follows the Latin root. '-able' rather than '-ible' because there is a recognisable root word 'fatigue'. The dictionary confirms: 'persisting tirelessly.' My morphological prediction was correct for both meaning and spelling.",
        "common_errors": [
          "Attempting to spell the word phonetically and producing 'indefatiggable' or 'indefatigueable' without using morphological analysis",
          "Correctly analysing the morphology but then not using the analysis to determine the actual spelling"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y6-C036",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Spelling most words from the Years 3 and 4 statutory word list correctly and beginning to learn words from the Years 5 and 6 list, applying basic spelling rules from earlier years.",
        "example_task": "Spell these ten words from the Years 5 and 6 word list from dictation: accommodate, committee, environment, immediately, opportunity, parliament, recommend, sincerely, temperature, vegetable.",
        "example_response": "The pupil spells at least six of the ten words correctly, showing familiarity with the statutory list. They may make errors on the words with double letters or unstressed vowels.",
        "common_errors": [
          "Writing 'accomodate' with one 'm' or 'comittee' with one 'm' because the double letters are not clearly pronounced",
          "Writing 'enviroment' by omitting the unstressed 'n' before the 'm' because it is barely audible in speech"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Spelling most words from the Years 5 and 6 statutory word list correctly in dictation and beginning to use them accurately in independent writing, using strategies such as mnemonics, morphological analysis and look-cover-write-check.",
        "example_task": "Choose five words from the Years 5 and 6 word list that you find difficult. For each, write the correct spelling and describe a strategy that helps you remember it.",
        "example_response": "Necessary: one collar (c) and two socks (s) helps me remember one 'c' and two 's's. Rhythm: the mnemonic 'Rhythm Has Your Two Hips Moving' gives me the first letter of each. Conscience: it contains the word 'science', which I already know how to spell. Privilege: 'privi' not 'privi' because there is no 'd' sound; I think of it as 'private' without the 'te' plus 'lege'. Mischievous: the root is 'mischief' plus '-ous', and there is no 'i' after the 'v' even though many people say 'mis-CHEEV-ee-us'.",
        "common_errors": [
          "Spelling statutory words correctly in spelling tests but reverting to errors in independent writing when attention is on content",
          "Relying on a single strategy (usually look-cover-write-check) rather than selecting the best strategy for each word"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Spelling all words from the Years 5 and 6 statutory word list accurately in independent writing, applying all primary spelling rules and patterns consistently, and self-correcting errors during editing.",
        "example_task": "Write a formal letter to your local MP about an environmental issue. Use at least eight words from the Years 5 and 6 statutory word list naturally in your writing. After writing, proofread specifically for spelling accuracy.",
        "example_response": "Dear Ms Thompson, I am writing to you because I am concerned about the environment in our community. I believe there is an excellent opportunity to develop our neighbourhood park. The government has a responsibility to acknowledge this issue and I would appreciate your recommendation for how our community might proceed. I sincerely hope you will recognise the significance of this matter. The pupil uses statutory words naturally within their writing and catches any errors during proofreading.",
        "common_errors": [
          "Avoiding statutory list words in free writing because the pupil is unsure of the spelling, using simpler synonyms instead",
          "Spelling the words correctly but in an artificial way that suggests they were inserted to demonstrate the list rather than used naturally"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Spelling with consistent accuracy across all contexts, demonstrating secure knowledge of all primary spelling rules and patterns, identifying and explaining patterns within the statutory word list, and using spelling knowledge to attempt ambitious vocabulary beyond the list.",
        "example_task": "Sort these words from the statutory list into groups based on spelling patterns or etymological features. You choose the categories. Explain the rule or pattern each group shares: accommodate, accompany, aggressive, appreciate, attached, communicate, correspond, exaggerate, interrupt, sufficient.",
        "example_response": "Group 1 - Assimilated prefix 'ad-' (meaning towards): accommodate (ad + com = acc), accompany (ad + com = acc), appreciate (ad + prec = app), attached (ad + tach = att), aggressive (ad + gress = agg), exaggerate (ex + ag + ger = agg). The prefix changes its last letter to match the root, which causes double consonants. Group 2 - Latin prefix 'con-/com-' (meaning together): communicate (com + mun), correspond (cor + respond). Group 3 - Latin prefix 'inter-' (meaning between): interrupt (inter + rupt). Group 4 - Latin suffix pattern '-ent/-ient': sufficient (from Latin 'sufficere'). Seeing these patterns means I do not need to memorise each word individually; I can use the morphology to predict the double letters.",
        "common_errors": [
          "Sorting words by surface features such as word length or first letter rather than by meaningful morphological or etymological patterns",
          "Identifying the groups correctly but not articulating the spelling rule that each group demonstrates"
        ]
      }
    ]
  }
]
