[
  {
    "concept_id": "EN-Y6-C012",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifies a named language or structural technique in a short extract when directed to look for it, and describes what it does in simple terms.",
        "example_task": "Read this extract: 'The author begins with a short, dramatic sentence: \"She was gone.\" Then uses a long, detailed paragraph describing the empty room.' What technique has the author used with sentence length and what does it do?",
        "example_response": "The author uses a short sentence first to shock the reader, then a long sentence to slow things down and show how empty the room feels without her.",
        "common_errors": [
          "Identifies the technique but cannot explain what it does beyond 'it makes it interesting'",
          "Describes only the content of the sentences rather than the effect of their structure"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifies multiple language and structural choices in an extract and describes their effect on the reader, beginning to use the identify-describe pattern with some technical vocabulary.",
        "example_task": "Read this opening paragraph from a story. Identify two language or structural choices the author has made and explain what effect each one has on the reader.",
        "example_response": "The author uses a rhetorical question at the start ('Have you ever wondered what it would be like to disappear?') which draws the reader in by making them think about the answer. The second technique is a list of three ('cold, dark, and utterly silent') which builds up the atmosphere and makes the setting feel threatening. Both techniques make the reader want to keep reading.",
        "common_errors": [
          "Identifies techniques but describes effects vaguely ('it makes the reader feel something')",
          "Treats 'identify' and 'describe' as the same step rather than separating what the technique is from what it does"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Constructs a three-move analytical response (identify, describe, evaluate) that critically assesses why the author chose specific language and structural techniques and how effectively they achieve their purpose.",
        "example_task": "Read this extract where the author describes a storm at sea. Analyse how the author uses language and structure to create a sense of danger. You should identify techniques, describe their effect, and evaluate how well they work.",
        "example_response": "The author uses the metaphor 'the sea roared like a wounded beast' to personify the ocean as something alive and aggressive. This makes the reader feel that the sea is a predator, not just a natural force. The short, fragmented sentences ('Waves crashed. Wood splintered. Voices drowned.') mirror the chaos by giving the reader no time to breathe between events. I think the metaphor is effective because it transforms the sea from a setting into an antagonist, but the short sentences are even more powerful because their rhythm physically recreates the jolting, relentless impact of the storm. Together, the language and structure work to place the reader inside the danger rather than watching it from a distance.",
        "common_errors": [
          "Identifies and describes but stops short of evaluating whether the techniques are effective and why",
          "Analyses each technique in isolation without discussing how they work together to create a cumulative effect"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Critically evaluates authorial choices by considering whether techniques are original or conventional, how different readers might respond, and whether the language and structure serve the text's wider purpose. Constructs a sustained analytical argument rather than a list of observations.",
        "example_task": "Read these two extracts that both describe loneliness. Author A writes in long, flowing sentences with soft imagery. Author B writes in fragmented, sparse prose with no figurative language at all. Which approach is more effective for conveying loneliness, and why? Consider whether the techniques are well-chosen for the subject matter.",
        "example_response": "Author A's long sentences with imagery like 'silence pooled in every corner like still water' create a melancholy, reflective mood. The technique suits a character who is aware of their loneliness and dwells on it. However, the imagery risks becoming decorative rather than functional: describing loneliness beautifully could undermine the discomfort it should create. Author B's fragmented prose ('Tuesday. Nothing. Wednesday. Nothing again.') strips away comfort and forces the reader to experience the monotony directly. The absence of figurative language is itself a technique: there is nothing to soften or romanticise the experience. For a Year 6 reader, Author B's approach may be more effective because it does not require the reader to decode metaphors; it enacts loneliness through structure rather than describing it through language. The more sophisticated insight is that sometimes what an author leaves out is as powerful as what they put in.",
        "common_errors": [
          "Declares one approach universally 'better' without considering audience or purpose",
          "Evaluates only the language choices without considering how structure contributes independently to meaning"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y6-C017",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Reads from at least two different text types (e.g. fiction and non-fiction) when directed, and can name the type of text they are reading.",
        "example_task": "This week, choose one fiction book and one non-fiction book from the class library. After reading both, write one sentence about each explaining what type of text it is.",
        "example_response": "I read 'Kensuke's Kingdom' which is fiction because it is a made-up adventure story. I also read 'Extreme Planet' which is non-fiction because it gives real facts about weather.",
        "common_errors": [
          "Identifies the text type but confuses fiction based on real events with non-fiction",
          "Reads two books of the same type without recognising the lack of range"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Reads across at least four text types (fiction, non-fiction, poetry, and one other such as plays or reference texts) and can describe how each type requires different reading approaches.",
        "example_task": "Look at your reading record for this half-term. Have you read from at least four different types of text? For each type, explain one way you read it differently from the others.",
        "example_response": "I read a novel (Holes), a non-fiction book about the Amazon, a poetry collection by Roger McGough, and a play script (Macbeth for Kids). I read the novel from start to finish to follow the plot. The non-fiction I dipped in and out of using the index. The poetry I read aloud to hear the rhythm. The play script I read imagining different voices for each character.",
        "common_errors": [
          "Lists the texts but does not reflect on different reading approaches required by each type",
          "Reads four texts but all within fiction, counting different genres as different 'types'"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Reads genuinely widely across fiction, non-fiction, poetry, plays, and reference materials from different genres, periods and cultures, selecting texts for both pleasure and purpose. Articulates the value of reading breadth and makes connections across texts.",
        "example_task": "Create a reading map for this term showing at least six texts you have read. For each, note the text type, genre, period or cultural origin, why you chose it, and one connection you can make to another text on your map.",
        "example_response": "1. 'Refugee Boy' by Benjamin Zephaniah (contemporary fiction, British-Ethiopian setting) - chosen for class reading; connects to the newspaper article about refugees because both show what it means to leave home. 2. Newspaper article on refugee crisis (non-fiction, current affairs) - read during guided reading; connects to Refugee Boy for the same topic from a factual perspective. 3. 'The Highwayman' by Alfred Noyes (narrative poem, early 20th century) - chosen because we studied ballads; connects to the play script because both use dramatic tension. 4. Macbeth adapted script (play, Shakespeare, 17th century) - class drama; connects to Greek myths because both feature ambition and downfall. 5. 'Greek Myths' retold by Marcia Williams (traditional stories, Ancient Greek) - chosen for personal reading; connects to Macbeth through the theme of hubris. 6. Encyclopaedia Britannica online entry on volcanoes (reference, contemporary) - used for geography homework; connects to the non-fiction book because both present factual information but in different formats.",
        "common_errors": [
          "Lists a wide range but cannot make meaningful connections between texts from different types or cultures",
          "Treats breadth as a tick-box exercise rather than reflecting on what each type of reading offers"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Reads widely and independently with genuine intellectual curiosity, actively seeking texts beyond the familiar. Reflects critically on how reading different genres, periods and cultures broadens understanding, and advocates for reading breadth with specific examples.",
        "example_task": "Write a short piece for younger pupils explaining why it matters to read widely. Use examples from your own reading to show how different types of text have changed the way you think about something.",
        "example_response": "Reading widely matters because each type of text teaches you something different. When I read 'Private Peaceful' by Michael Morpurgo, I understood World War One through one soldier's fear. But when I read the non-fiction book 'The War to End All Wars', I understood the same war through facts, maps and photographs. Neither gave the full picture alone: the novel made me feel it, the non-fiction made me understand it. Reading poetry by Grace Nichols taught me that language can carry the rhythm of Caribbean speech, which I would never have discovered if I only read books by British authors. And reading a play script taught me that words on a page are instructions for performance, not just something to read quietly. Every type of text opens a door that the others cannot.",
        "common_errors": [
          "Makes general claims about reading being 'good for you' without specific examples of how different texts contributed different understanding",
          "Confuses reading widely with reading a large quantity of the same type of text"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y6-C018",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifies whether a poem is rhyming or non-rhyming, and can name at least one poetic form (such as haiku or limerick) when given examples.",
        "example_task": "Read these three poems. One is a haiku, one is a limerick, and one is free verse. Match each poem to its form. How did you decide?",
        "example_response": "Poem A is the haiku because it has three lines and is very short. Poem B is the limerick because it rhymes and is funny. Poem C is free verse because it does not rhyme and the lines are different lengths.",
        "common_errors": [
          "Identifies the limerick by humour alone without noticing the rhyme scheme",
          "Thinks all short poems are haiku regardless of syllable pattern"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifies the form of a poem (ballad, sonnet, free verse, narrative poem, haiku) and names poetic devices such as metaphor, alliteration, onomatopoeia and repetition, explaining what each does in simple terms.",
        "example_task": "Read 'The Charge of the Light Brigade' by Tennyson. What poetic form is it? Find two poetic devices and describe their effect.",
        "example_response": "It is a narrative poem that tells the story of a battle, written in a ballad-like rhythm. Repetition: 'Cannon to right of them, cannon to left of them, cannon in front of them' repeats the word 'cannon' to surround the reader with the sound and danger of the guns, just as the soldiers were surrounded. Onomatopoeia: 'Volleyed and thundered' uses sounds that imitate the noise of battle, making the reader hear the explosions.",
        "common_errors": [
          "Identifies devices but describes effects vaguely ('makes it sound good')",
          "Confuses the form of the poem with its subject matter ('it is a war poem' rather than naming the form)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Understands the conventions and purposes of different poetic forms (ballad, sonnet, free verse, narrative poem, haiku) and evaluates how poets use form and language together to create meaning and effect.",
        "example_task": "Read this sonnet and this free verse poem, both about loss. How does the form of each poem contribute to the way it explores the theme? Evaluate which form is more effective for this subject.",
        "example_response": "The sonnet uses 14 lines with a strict rhyme scheme, which creates a sense of control and containment. This suits the theme of loss because the speaker seems to be holding grief in check, keeping it within the structure. The volta at line 9 shifts from describing the loss to reflecting on its meaning. The free verse poem has no set structure: lines break at unexpected places, some are very short, and there is no rhyme. This creates a feeling of grief that is uncontrolled and raw, as if the speaker cannot impose order on their feelings. I think the free verse is more effective for loss because grief often does not follow a pattern, and the broken structure mirrors this. However, the sonnet shows that restraint can be powerful too: the reader senses the emotion pressing against the form.",
        "common_errors": [
          "Discusses the language of each poem without connecting it to the form",
          "States that free verse is 'easier' or 'less skilled' without understanding that the absence of formal constraints is a deliberate choice"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Analyses how poets make deliberate choices about form, structure and language that are inseparable from meaning. Compares poets' approaches and evaluates how form can reinforce, undercut or complicate the surface meaning of a poem.",
        "example_task": "Compare how two poets use form to shape meaning. Poet A writes a haiku about a vast ocean. Poet B writes an epic-length narrative poem about a single raindrop. What is each poet doing by choosing a form that seems to contradict their subject?",
        "example_response": "Poet A captures the vast ocean in just 17 syllables. The contradiction between the tiny form and the enormous subject forces the reader to see the ocean as a single moment of perception rather than a physical expanse. The haiku says: vastness can be held in stillness. Poet B does the opposite: an epic poem about a raindrop makes something tiny feel monumental. The length and narrative structure give the raindrop a journey, a character, almost a life story. Both poets use the mismatch between form and subject to change how the reader perceives scale. This is a sophisticated technique because it means the form is not just a container for the content; it actively argues with it, and the meaning emerges from the tension between the two.",
        "common_errors": [
          "Treats form as decoration rather than meaning-making, analysing language without connecting it to structural choices",
          "Assumes a poem's form must 'match' its subject and cannot see how deliberate mismatch creates meaning"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y6-C019",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifies the beginning, middle and end of a story, and can retell the main events in sequence.",
        "example_task": "Read this short story. What happens at the beginning, in the middle, and at the end? Retell the main events in order.",
        "example_response": "At the beginning, a girl called Leila finds a strange key in her grandmother's garden. In the middle, she discovers a locked door behind the shed and uses the key to open it, finding a hidden garden full of unusual plants. At the end, her grandmother explains that the garden belonged to Leila's great-grandmother and now it belongs to her.",
        "common_errors": [
          "Includes too many minor details instead of identifying main events",
          "Retells events out of sequence"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifies narrative stages beyond beginning-middle-end, using terms such as opening, build-up, problem, climax and resolution, and can label these stages in a text.",
        "example_task": "Read this chapter from a class novel. Label where the opening, build-up, problem, climax and resolution occur. Write one sentence for each stage.",
        "example_response": "Opening: The chapter begins with Marcus arriving at his new school, feeling nervous. Build-up: He gradually notices that something is strange about the locked classroom on the top floor. Problem: He hears sounds coming from inside and decides to investigate, but a teacher catches him. Climax: He finds a way back at night and discovers the room is full of old science equipment and a half-finished experiment. Resolution: The head teacher explains that the room belonged to a former teacher and invites Marcus to restart the science club.",
        "common_errors": [
          "Confuses the build-up with the problem, labelling the first difficulty as the main problem",
          "Identifies the climax as the final event rather than the moment of highest tension"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Identifies and names the full range of narrative structure elements (orientation, complication, rising action, climax, falling action, resolution, and where present, denouement) and explains how the structure shapes the reader's experience.",
        "example_task": "Map the narrative structure of the class novel using the terms orientation, complication, rising action, climax, resolution and denouement. For each stage, explain what the author achieves by structuring the story this way.",
        "example_response": "Orientation (Chapters 1-2): The author introduces the setting and characters slowly, building the reader's attachment to the protagonist before any conflict. Complication (Chapter 3): The protagonist discovers a secret, which creates the central question driving the plot. Rising action (Chapters 4-7): Each chapter increases the stakes with new obstacles and revelations. The author delays the answer to build suspense. Climax (Chapter 8): The confrontation scene is the most tense moment; the author uses short chapters and cliffhangers here. Resolution (Chapter 9): The conflict is resolved but not perfectly, which feels realistic. Denouement (final chapter): The author shows life returning to normal but changed, which signals that the events had lasting impact. The structure works because the author controls pacing: slow orientation makes us care, rapid rising action makes us anxious, and a measured resolution avoids feeling rushed.",
        "common_errors": [
          "Labels the stages correctly but does not explain how the structure affects the reader's experience",
          "Treats narrative structure as a fixed template rather than recognising that authors vary it deliberately"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Analyses how authors manipulate, subvert or layer narrative structure for deliberate effect, comparing structural choices across texts and evaluating how non-linear or unconventional structures create different kinds of meaning.",
        "example_task": "Compare the narrative structure of two novels you have read. One follows a conventional structure; the other does something unusual (such as starting at the end, using multiple timelines, or withholding the resolution). Why did each author choose their structure? Which is more effective?",
        "example_response": "In 'Holes' by Louis Sachar, the story uses three interweaving timelines: Stanley's present, his ancestor's past, and the history of the town. The conventional novel would tell these in order, but Sachar withholds information from each timeline so the reader only understands the full picture when the threads converge in the final chapters. This makes the structure itself a kind of puzzle that mirrors the theme of fate and interconnection. In 'Wonder' by R.J. Palacio, the structure is more conventional in timeline but uses multiple narrators. Each section retells overlapping events from a different viewpoint, so the 'complication' shifts depending on who is speaking. Sachar's structure is more ambitious because it asks the reader to hold three timelines in mind and trust that they will connect. Palacio's is more accessible but still structurally inventive because it shows that the same events have different meanings for different people. Both authors use structure as a meaning-making tool, not just a container for events.",
        "common_errors": [
          "Describes the structures accurately but does not evaluate why the author chose them or what they add to meaning",
          "Assumes conventional structure is always less sophisticated than experimental structure"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y6-C020",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifies where a story takes place and picks out descriptive words that tell the reader about the setting.",
        "example_task": "Read this extract. Where does the scene take place? Find three words or phrases the author uses to describe the setting.",
        "example_response": "The scene takes place in a forest at night. Three descriptive words and phrases: 'twisted branches', 'moonlit path', 'damp, earthy smell'.",
        "common_errors": [
          "Names the setting but cannot find specific descriptive language from the text",
          "Picks out words that describe characters rather than setting"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifies how an author uses specific types of descriptive language (sensory detail, adjectives, figurative language) to create a sense of place, and describes the atmosphere the setting creates.",
        "example_task": "Read this extract describing a house. What atmosphere does the author create? Identify two techniques used to build the setting and explain what mood they create.",
        "example_response": "The author creates a creepy, abandoned atmosphere. The sensory detail 'dust hung in the air like grey curtains' uses a simile to make the reader picture how thick and old the dust is, suggesting nobody has been there for a long time. The sound imagery 'floorboards groaned under each step' personifies the house as if it is protesting the intrusion, which makes the reader feel unwelcome and uneasy.",
        "common_errors": [
          "Identifies the atmosphere ('creepy') but cannot explain which specific language creates it",
          "Lists descriptive words without connecting them to the overall atmosphere"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Analyses how authors create setting through selective detail, sensory language and figurative language, and explains how setting functions in the narrative (establishing mood, reflecting character, foreshadowing events, or carrying symbolic meaning).",
        "example_task": "Read this extract where a character returns to a childhood home that has changed. Analyse how the author uses setting to convey the character's feelings. Consider what details the author selects and what they leave out.",
        "example_response": "The author selects details that show decay and change: 'the garden gate hung off one hinge', 'paint peeled from the front door like sunburnt skin', 'the apple tree had been cut down, leaving a stump like a pulled tooth'. Each detail is something the character remembers differently, so the setting becomes a way of showing loss without the character having to say 'I am sad'. The similes are all physical and slightly painful ('sunburnt', 'pulled tooth'), linking the house's deterioration to bodily discomfort. The author leaves out any positive details, even though the sun is shining, which tells us the character is filtering the scene through grief. The setting functions not just as a backdrop but as an externalisation of the character's inner state.",
        "common_errors": [
          "Analyses the descriptive language in isolation without connecting setting to character or theme",
          "Does not notice what the author has deliberately chosen to include or exclude"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluates how authors use setting as a narrative device that carries meaning beyond physical description, comparing approaches across texts and assessing how setting interacts with character, theme and structure.",
        "example_task": "Compare how two authors use setting. In Text A, the author describes the setting in rich, detailed prose. In Text B, the author barely describes the setting at all. What does each approach achieve? Is one more effective than the other?",
        "example_response": "In Text A, the detailed description of the moor ('heather stretched in every direction, bruised purple under a sky the colour of wet slate') creates a specific, vivid place that dominates the story. The setting feels like a character in its own right, and the pathetic fallacy ('bruised', 'wet slate') tells the reader how to feel before any event occurs. The risk is that it can slow the pace. In Text B, the setting is almost absent: 'a room, a chair, a window'. The minimalism forces the reader to fill in the gaps from their own experience, which makes the story feel universal rather than specific. The absence of description also keeps the focus entirely on dialogue and action, which suits a tense, fast-paced narrative. Text A controls the reader's imagination; Text B trusts it. Neither approach is inherently better. Text A is more effective when setting carries thematic weight; Text B is more effective when the author wants the reader to become a co-creator of the world. The choice reveals what each author thinks the reader's role should be.",
        "common_errors": [
          "Assumes detailed description is always 'better writing' without considering the purpose of minimalism",
          "Analyses setting as a standalone feature without evaluating how it interacts with pacing, character and theme"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y6-C021",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifies what a character is like using direct description from the text, picking out words and phrases the author uses to describe the character.",
        "example_task": "Read this extract where a new character is introduced. What words and phrases does the author use to tell us what the character is like? What kind of person do they seem to be?",
        "example_response": "The author says the character has 'sharp, watchful eyes' and 'a smile that never quite reached her face'. She seems like someone who is alert and careful, maybe someone who does not trust other people easily.",
        "common_errors": [
          "Describes what the character does rather than what the author tells us about them",
          "States a trait ('she is clever') without pointing to the words in the text that show this"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifies characterisation through at least two methods (direct description, dialogue, action, or other characters' reactions) and explains what each reveals about the character.",
        "example_task": "How does the author show us what the main character is like in this extract? Find evidence from at least two different methods: what the author tells us directly, what the character says, what the character does, or how others react to them.",
        "example_response": "Through dialogue: the character says 'I don't need anyone's help, thank you', which shows he is proud and independent. Through other characters' reactions: his classmates 'exchanged glances and stepped back', which suggests they find him difficult or intimidating. Together, this tells us the character pushes people away, probably because he is not used to being helped.",
        "common_errors": [
          "Identifies only one method of characterisation and repeats it",
          "Describes the character's traits without linking them to specific evidence from the text"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Identifies and evaluates the full range of characterisation techniques (direct description, dialogue, action, other characters' responses, internal thought) and explains how the author uses 'show, don't tell' to build a complex, layered character.",
        "example_task": "Choose a character from the class novel. Analyse how the author builds our understanding of this character using at least three different techniques. Evaluate how the 'show, don't tell' principle applies.",
        "example_response": "In 'Skellig', David Almond characterises Michael through multiple techniques. Direct description is minimal: we learn little about Michael's appearance. Instead, Almond shows character through action: Michael crawls into the filthy garage alone, which shows his curiosity and bravery. Through dialogue, Michael asks blunt, direct questions ('What are you?'), revealing his honesty and refusal to pretend things are normal. Through internal thought, we learn Michael is frightened about his baby sister but tries to hide it. Other characters' responses reveal more: his parents are distracted by the baby, which explains Michael's isolation. Almond uses 'show, don't tell' extensively: he never writes 'Michael was brave and lonely'; instead, every action, word and thought builds this picture. The effect is that the reader discovers Michael's character gradually, which mirrors how we get to know real people.",
        "common_errors": [
          "Lists the techniques without evaluating how they work together to create a unified impression",
          "Explains 'show, don't tell' as a rule rather than analysing how the author applies it in specific moments"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluates how authors create complex, contradictory or developing characters, analysing how characterisation techniques serve the narrative's wider themes and comparing approaches across texts.",
        "example_task": "Compare how two authors create a character who changes over the course of a novel. How does each author show the change? Which approach is more convincing and why?",
        "example_response": "In 'Goodnight Mister Tom', Michelle Magorian shows William's transformation through a gradual shift in his physical actions. At the start, William flinches at touch and speaks in whispers. By the end, he runs, shouts and embraces people. The physical change externalises his emotional growth, and Magorian relies on 'showing' throughout. In 'The Boy at the Back of the Class' by Onjali Rauf, Ahmet's change is shown more through other characters' responses: at first they are curious and uncertain, then protective, and finally they treat him as an equal. This means the reader understands Ahmet's development through the community around him rather than from inside his head. Magorian's approach is more psychologically convincing because the reader tracks William's internal change through its physical manifestations. Rauf's approach is more socially convincing because it shows that a person's transformation depends on the people around them, not just their own resilience. Both authors use the arc of character change to carry their central theme: Magorian argues that safety heals; Rauf argues that belonging heals.",
        "common_errors": [
          "Compares characters rather than comparing the techniques the authors use to create those characters",
          "Discusses character change without connecting it to the author's wider thematic purpose"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y6-C022",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Distinguishes between a clear statement of fact and a clear statement of opinion when the two are presented side by side.",
        "example_task": "Read these two sentences: A: 'The Great Wall of China is over 13,000 miles long.' B: 'The Great Wall of China is the most amazing building in the world.' Which is a fact and which is an opinion? How do you know?",
        "example_response": "A is a fact because the length can be measured and checked. B is an opinion because 'most amazing' is a personal judgement; someone else might think a different building is more amazing.",
        "common_errors": [
          "Thinks facts are 'true things' and opinions are 'false things' rather than understanding that facts can be verified and opinions cannot",
          "Classifies a strong opinion as a fact because the speaker sounds confident"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifies fact and opinion when they are woven together in the same paragraph, recognising opinion-signal words and phrases such as 'I believe', 'arguably', 'it is clear that', and evaluative adjectives.",
        "example_task": "Read this paragraph from a travel website about Paris. Highlight the facts in one colour and the opinions in another. How does the writer mix them together?",
        "example_response": "Facts: 'Paris is the capital of France', 'The Eiffel Tower was completed in 1889', 'Over 30 million tourists visit each year'. Opinions: 'the most romantic city in the world', 'unmissable', 'There is simply no better place'. The writer mixes facts and opinions by placing a factual statement next to an opinion so the opinion seems equally reliable. For example, placing 'Over 30 million tourists visit' next to 'unmissable' makes the opinion seem backed by evidence.",
        "common_errors": [
          "Misses opinion disguised by factual-sounding language ('It is clear that...' presented as if it were a fact)",
          "Thinks statistics are always facts without considering that they can be selective or misleading"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Reliably distinguishes fact from opinion in a range of non-fiction texts, including cases where opinion is presented without explicit markers, and evaluates how the blurring of fact and opinion affects the text's reliability and purpose.",
        "example_task": "Read this newspaper editorial about whether schools should ban mobile phones. Identify three facts and three opinions. Then explain how the writer uses facts to make their opinions seem more convincing. Is this text reliable?",
        "example_response": "Facts: 'A 2023 survey found 72% of teachers reported classroom disruption from phones', 'The French government banned phones in schools in 2018', 'Most UK schools already restrict phone use during lessons'. Opinions: 'Phones are destroying children's ability to concentrate', 'The evidence is overwhelming', 'Any responsible school should act immediately'. The writer places the survey statistic directly before the opinion 'The evidence is overwhelming', which makes the reader feel the opinion is proven rather than argued. The word 'overwhelming' is an opinion word disguised as an assessment of evidence. The text is partly reliable because it uses real facts, but the opinions are presented as if they are conclusions that follow inevitably from the facts, which is a persuasion technique rather than balanced reporting.",
        "common_errors": [
          "Accepts opinions as facts because they are placed next to genuine statistics",
          "Does not recognise that the selection of which facts to include is itself a form of bias"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluates how writers in different text types (adverts, speeches, editorials, reports) deliberately use the boundary between fact and opinion to persuade, and explains the specific strategies used to make opinion appear authoritative.",
        "example_task": "Read this political speech extract: 'As we all know, this policy has failed. The figures speak for themselves: unemployment has risen by 2% this year. It is time for change.' Analyse every sentence. Which parts are fact, which are opinion, and what strategies does the speaker use to blur the boundary?",
        "example_response": "'As we all know' is a strategy called presupposition: it presents the speaker's opinion as shared common knowledge, making it harder for the audience to disagree without feeling isolated. 'This policy has failed' is an opinion disguised as a fact: whether a policy has 'failed' depends on what criteria you use, but the speaker presents it as self-evident. 'The figures speak for themselves' is a rhetorical trick that claims objectivity ('the figures', not 'I') while actually interpreting the data in one direction. 'Unemployment has risen by 2% this year' is a verifiable fact, but placed between two opinions, it appears to prove both of them. 'It is time for change' is an opinion presented as a logical conclusion. The speaker's strategy is to sandwich one genuine fact between multiple opinions so the whole paragraph feels factual. The most sophisticated technique is 'as we all know', because it pre-empts disagreement by implying consensus that may not exist.",
        "common_errors": [
          "Identifies only the explicit opinion ('it is time for change') and misses the more subtle strategies",
          "Does not recognise that the sequencing of facts and opinions is itself a persuasion technique"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y6-C023",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifies a simple similarity or difference between two texts on the same topic when guided by the teacher, using basic comparative language.",
        "example_task": "We have read two descriptions of London: one from a modern travel guide and one from a Victorian novel. What is one thing that is the same and one thing that is different?",
        "example_response": "Both texts describe the River Thames. The modern guide says London is 'vibrant and multicultural', but the Victorian novel describes it as 'grey with smoke and fog'. London has changed a lot since Victorian times.",
        "common_errors": [
          "Describes each text separately without making a direct comparison",
          "Compares only surface features ('one is longer') rather than content or style"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Makes comparisons between two texts noting similarities and differences in content, viewpoint and presentation, using comparative language such as 'whereas', 'similarly', 'in contrast'.",
        "example_task": "Compare how animals are presented in a David Attenborough book and a Roald Dahl story. Consider both what is said about animals and how each writer presents them.",
        "example_response": "In the Attenborough text, animals are presented factually and with respect. He describes their behaviour using scientific vocabulary and treats them as real creatures. In contrast, Roald Dahl uses animals as characters with human emotions and speech. Whereas Attenborough wants the reader to understand animals, Dahl wants the reader to laugh at human behaviour by seeing it mirrored in animals. Similarly, both writers clearly admire animals, but they show this in different ways: Attenborough through detailed observation, Dahl through affectionate exaggeration.",
        "common_errors": [
          "Summarises each text in turn without making direct comparisons using comparative language",
          "Compares what each text says without comparing how they say it"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Makes structured comparisons within and across texts, considering content, viewpoint, technique and purpose, and organises comparative analysis using point-evidence-explanation for each comparison.",
        "example_task": "Compare how two texts present the theme of courage. Text A is a newspaper article about a child who raised money for charity after an illness. Text B is an extract from a novel about a character facing a bully. How does each text present courage differently? Consider viewpoint, technique and purpose.",
        "example_response": "Both texts present courage, but they define it differently. The newspaper article presents courage as a public, visible quality: the child is described as 'brave' and 'inspiring' by other people, and the writer uses quotations from family and doctors to build a factual portrait of courage. The viewpoint is external: we see the child through other people's eyes. The novel presents courage as internal and private: the character does not feel brave and describes their hands shaking and their voice cracking. The viewpoint is first-person, so the reader experiences the fear alongside the character. The article's purpose is to inform and celebrate, so courage is presented as something to admire from the outside. The novel's purpose is to explore human experience, so courage is presented as something that coexists with fear. The techniques match the purposes: the article uses third-person factual reporting to create distance and admiration; the novel uses first-person sensory detail to create intimacy and empathy.",
        "common_errors": [
          "Compares at a surface level ('both are about courage') without analysing how each text constructs its version of the theme",
          "Does not connect the comparison to each text's purpose and viewpoint"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluates how the same subject is transformed by genre, form, purpose and audience, constructing sustained comparative analysis that leads to a conclusion about what comparison reveals.",
        "example_task": "You have read three texts about climate change: a scientific report, a protest speech, and a poem. Each presents the same subject through a different form. What does comparing them reveal about how form shapes meaning? Which is the most powerful and for whom?",
        "example_response": "The scientific report presents climate change through data: temperatures, percentages, projections. Its power lies in authority and precision, but its formal register and passive voice ('It has been observed that...') creates emotional distance. The protest speech uses repetition, direct address and imperatives ('Act now. There is no Planet B.') to create urgency. It sacrifices nuance for emotional impact, and its power depends on a sympathetic audience. The poem uses imagery of melting ice and drowning landscapes to make the reader feel loss physically. It is the most ambiguous: it does not tell the reader what to think but creates an emotional space for reflection. Comparing the three reveals that form does not just present content differently; it constructs different relationships between the subject and the reader. The report asks the reader to understand. The speech asks the reader to act. The poem asks the reader to feel. The 'most powerful' depends on the audience: for a politician, the report; for a crowd, the speech; for an individual sitting alone, the poem. The comparison itself is the insight: no single form captures the full truth, which is why we need all three.",
        "common_errors": [
          "Ranks the texts by personal preference without considering audience and purpose",
          "Analyses each text separately and adds a comparison at the end rather than building comparative analysis throughout"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y6-C043",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Reads a short text aloud with reasonable accuracy and appropriate pace, pausing at full stops and commas, though may lose fluency with unfamiliar or polysyllabic words.",
        "example_task": "Read this page from the class novel aloud. Try to read smoothly, pausing at punctuation and reading at a pace that sounds like natural speech.",
        "example_response": "The pupil reads the page at a steady pace, pausing at full stops and commas. They read most words accurately but hesitate on 'magnificent' and 'extraordinary', sounding them out before continuing. The reading sounds like speech rather than word-by-word decoding.",
        "common_errors": [
          "Reads too quickly to observe punctuation, running sentences together",
          "Stops and restarts at polysyllabic words, breaking the flow of meaning"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Reads aloud with fluency and expression across a full chapter or extended passage, adjusting pace and tone to match the content, and reads silently with sustained concentration for at least 15 minutes.",
        "example_task": "Read this chapter silently. When you have finished, tell me what happened and share one part you found interesting. Then read your favourite paragraph aloud with expression.",
        "example_response": "The pupil reads silently for 18 minutes without losing focus. They accurately summarise the chapter's events and identify a specific paragraph they enjoyed. When reading aloud, they adjust their pace for a tense scene, slow down for a descriptive passage, and use different voices to distinguish characters in dialogue.",
        "common_errors": [
          "Reads silently but cannot recall key events, suggesting decoding without comprehension",
          "Reads aloud accurately but in a flat monotone without adjusting expression to match content"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Reads fluently, accurately and with sustained engagement across whole novels and extended non-fiction texts, maintaining comprehension and critical awareness throughout. Reads independently for at least 20 minutes with concentration and can discuss what they have read with insight.",
        "example_task": "Over the next two weeks, read this novel independently. Keep a brief reading journal: after each session, note how many pages you read, one thing you noticed about the writing, and one question the text raised for you.",
        "example_response": "Session 1 (25 mins, 18 pages): I noticed the author uses very short chapters which made me want to keep reading. Question: Why does the author not reveal the character's name until page 12? Session 2 (30 mins, 22 pages): The dialogue feels realistic because characters interrupt each other. Question: Is the narrator reliable? They seem to leave things out. Session 3 (20 mins, 15 pages): The pace slowed down in the middle section. I think the author did this deliberately to show the character's boredom. Question: Will the subplot about the sister become important later?",
        "common_errors": [
          "Reads for the required time but the journal shows only plot summary with no observations about craft or critical questions",
          "Maintains concentration for short texts but loses stamina and comprehension midway through a novel"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Reads independently with stamina, fluency and critical engagement across challenging and extended texts, including those above chronological age expectations. Self-monitors comprehension, adjusts reading strategies for different text types, and contributes perceptive insights to discussion that go beyond the text.",
        "example_task": "Choose a novel that challenges you. Read it independently over three weeks. Prepare a short presentation for the class in which you discuss one aspect of the writing craft that you think other readers should notice.",
        "example_response": "I read 'The Graveyard Book' by Neil Gaiman, which is written for slightly older readers. The craft feature I want to talk about is how Gaiman uses each chapter as a self-contained story within the larger novel. Each chapter has its own beginning, middle and end, like an episode, but together they form Bod's complete journey from baby to teenager. This means you can enjoy each chapter on its own, but the real meaning only emerges when you see how Bod changes across all of them. I think Gaiman chose this structure because the book is about growing up, and each chapter represents a stage of childhood. The structure mirrors the content. I also noticed that I had to adjust how I read it: I could not skim because the self-contained chapters meant I might miss a detail that became important three chapters later.",
        "common_errors": [
          "Chooses a challenging text but cannot articulate what makes it challenging or how they adapted their reading",
          "Presents a book review (liked it / did not like it) rather than an analysis of a specific craft feature"
        ]
      }
    ]
  }
]
