[
  {
    "concept_id": "EN-KS3-C028",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Attempts expository essays but struggles with formal register, clear structure, and sustained analysis, tending to rely on personal opinion or narrative.",
        "example_task": "Write the opening paragraph of an essay explaining why school uniforms are beneficial.",
        "example_response": "I think school uniforms are good because they make everyone look the same. My school has a uniform and I like it because I do not have to decide what to wear.",
        "common_errors": [
          "Using first-person anecdotal style rather than formal analytical register",
          "Beginning with 'I think' rather than an authoritative topic sentence"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writes expository essays with a recognisable structure (introduction, body, conclusion) and attempts formal register, though may lapse into informal language or lose focus.",
        "example_task": "Write the opening paragraph of an essay explaining how Dickens presents poverty in 'A Christmas Carol'.",
        "example_response": "In 'A Christmas Carol', Charles Dickens presents poverty as a serious social problem that the wealthy have a duty to address. He uses the character of Scrooge to represent rich people who ignore the suffering of the poor. Through the visits of the three ghosts, Dickens shows Scrooge the human cost of his selfishness and argues that generosity is both a moral obligation and a source of happiness.",
        "common_errors": [
          "Including too much plot summary in the introduction",
          "Stating the argument without signposting how the essay will develop it"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Writes well-structured formal expository essays with a clear thesis, topic sentences, embedded evidence and analytical paragraphs that sustain a coherent argument.",
        "example_task": "Write a paragraph from the body of an essay analysing how Shakespeare presents ambition in 'Macbeth'.",
        "example_response": "Shakespeare presents ambition as a force that corrupts moral judgement, most powerfully through Macbeth's soliloquy in Act 1 Scene 7. Macbeth acknowledges that Duncan is a good king who 'hath borne his faculties so meek' and that killing him would violate every bond of loyalty, hospitality and kinship. The word 'meek' emphasises Duncan's gentleness, making the planned murder appear even more monstrous. Yet Macbeth concludes that he has 'no spur to prick the sides of my intent, but only vaulting ambition'. The equestrian metaphor is revealing: ambition is a rider that drives Macbeth forward without moral direction. The modifier 'vaulting' suggests ambition that overreaches itself, foreshadowing the inevitable fall. Shakespeare's argument is precise: Macbeth knows the murder is wrong, names the reasons it is wrong, and does it anyway. Ambition does not blind him to morality -- it overrides morality, which makes it more dangerous than ignorance.",
        "common_errors": [
          "Analysing the quotation without connecting it back to the essay's central argument",
          "Writing analytically about one text detail without placing it in the context of the wider work"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Writes sophisticated expository essays that develop a nuanced, original argument with precision, embedding evidence fluently and demonstrating critical independence.",
        "example_task": "Write the conclusion of an essay arguing that 'Macbeth' is ultimately a play about self-deception rather than ambition.",
        "example_response": "If 'Macbeth' were simply a play about ambition, it would end at the murder. Macbeth achieves what he desires; the story should be over. But the play's remaining three acts are dominated not by ambition but by the systematic construction and collapse of self-deception. Macbeth tells himself the witches' second prophecy protects him; he tells himself that Banquo's ghost is 'unreal mockery'; he tells himself that each additional murder restores security rather than deepening tyranny. Lady Macbeth's sleepwalking -- the unconscious mind betraying the conscious lie of 'a little water clears us of this deed' -- dramatises the cost of sustained self-deception. Shakespeare's argument is that ambition provides the initial impulse, but self-deception sustains the crime. The play's real tragedy is not that Macbeth killed a king but that he spent the remainder of his life lying to himself about what that act meant. The dagger soliloquy's question -- 'Is this a dagger which I see before me?' -- is not about a hallucination; it is about a man choosing to believe what he needs to believe in order to do what he has already decided to do.",
        "common_errors": [
          "Restating the essay's points rather than synthesising them into a final argument",
          "Not demonstrating critical independence -- merely summarising established critical views"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C029",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Writes narratives that focus on plot events in chronological order without developing character, setting or reflective commentary.",
        "example_task": "Write a short narrative essay about a time you learned something important.",
        "example_response": "One day I went to school and had a really bad day. My friends were not talking to me. I was upset. Then at lunch my teacher helped me sort it out. I learned that you should talk about problems instead of ignoring them.",
        "common_errors": [
          "Telling events in order without developing any single moment in depth",
          "Stating the lesson explicitly rather than allowing it to emerge from the narrative"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writes narrative essays with some development of character, setting and reflective commentary, using basic narrative techniques.",
        "example_task": "Write the opening of a narrative essay about a journey that changed your perspective.",
        "example_response": "The train pulled out of the station slowly, the platform sliding away like a memory you cannot quite hold. I pressed my forehead against the cold glass and watched the city shrink. I was thirteen and I had never been further north than Birmingham. Everything I knew -- my school, my street, my corner shop -- was being replaced by fields that seemed to stretch forever. I did not know it then, but by the time I returned, I would see everything differently.",
        "common_errors": [
          "Including too many events rather than developing a single significant moment",
          "Using reflective commentary that tells the reader what to think rather than showing it through narrative"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Writes narrative essays that combine vivid storytelling with reflective analysis, using narrative technique deliberately to structure the reader's experience.",
        "example_task": "Write a narrative essay paragraph that uses a specific moment to illustrate a broader insight.",
        "example_response": "My grandmother's kitchen smelled of turmeric and disappointment. She stood at the stove, stirring a pot she had stirred ten thousand times before, and for the first time I noticed how small her world had become. The kitchen that had once seemed enormous -- a kingdom of steam and spice and stories -- was just a room with peeling wallpaper and a window that looked onto a brick wall. I was seeing it with teenage eyes now, measuring it against the world outside, and the comparison was cruel. What I did not understand until years later was that the smallness of the room had nothing to do with the size of the life lived in it. My grandmother had raised five children, survived a war, crossed an ocean, and reinvented herself in a language she had learned at forty. The kitchen was not her prison; it was her empire. I was the one who had shrunk it, by confusing geography with significance.",
        "common_errors": [
          "Developing the reflective insight without grounding it in specific sensory detail",
          "Making the reflection too abstract or philosophical, losing the narrative voice"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Writes narrative essays of literary quality, integrating storytelling and reflection seamlessly, with precise control of voice, structure and imagery.",
        "example_task": "Write a narrative essay that uses a structural device (circular structure, fragmented timeline, or contrasting perspectives) to enhance its meaning.",
        "example_response": "The letter arrived on a Tuesday. I know this because Tuesdays were the day my father came home early, and he was standing in the hallway when I picked it up from the mat. A thin envelope, the kind that means a single page, the kind that means the answer is short enough to be final. I turned it over twice. The university crest was embossed, not printed -- I remember thinking this mattered, that embossing meant they had invested in the stationery, which meant they had invested in the answer. I opened it in my room with the door locked, which tells you everything about the relationship between hope and privacy. What the letter said is less important than what it did. It divided my life into before and after, as cleanly as a blade through paper. Before: I was the first person in my family who might go to university. After: I was the first person in my family who would. The difference was a single word -- 'unconditional' -- and the weight of that word settled on me like snow: soft, but impossible to ignore, and transformative. By Wednesday, the letter was on the fridge, held by a magnet from a seaside town we had visited when I was six. My father stood in the hallway again, but this time he was not standing -- he was filling it.",
        "common_errors": [
          "Using structural devices for their own sake rather than to enhance meaning",
          "Losing the personal voice in pursuit of literary technique"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C030",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Struggles to write at length, producing short pieces that lack development, or loses coherence and quality as writing extends beyond a paragraph.",
        "example_task": "Write at least one page about a topic of your choice.",
        "example_response": "I like football. Football is a good sport because it is fun and exciting. My favourite team is [team]. They won last week. I play football at lunchtime with my friends. [writing trails off or becomes repetitive]",
        "common_errors": [
          "Repeating the same point in different words to fill space",
          "Quality declining noticeably after the first paragraph"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writes at length with some sustained quality, using paragraphs to organise ideas, though may lose focus or coherence in longer pieces.",
        "example_task": "Write a 300-word response explaining your view on a topic you care about.",
        "example_response": "[Writes 300 words with clear paragraphs and a recognisable argument, though the final paragraph may drift from the original point or repeat earlier content. The quality is sustained through the first half but wavers in the second.]",
        "common_errors": [
          "Losing the thread of the argument in longer pieces",
          "Running out of ideas and padding the final section"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Writes extended pieces of 500+ words that sustain quality, coherence and focus throughout, with each paragraph advancing the argument or narrative.",
        "example_task": "Write a 500-word essay arguing for or against a school policy change.",
        "example_response": "[Writes a complete 500-word essay with a clear introduction, three developed body paragraphs each making a distinct point with evidence, and a conclusion that synthesises rather than repeats. Quality is sustained throughout. Paragraphs are linked with discourse markers that show the argument's progression.]",
        "common_errors": [
          "Maintaining quality but losing argumentative progression (paragraphs that could be in any order)",
          "Writing extended pieces that are long but not purposeful"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Writes extended pieces with sustained quality, structural control and developing complexity, where length serves purpose rather than merely demonstrating stamina.",
        "example_task": "Write an extended analytical essay of 600+ words with a developing argument.",
        "example_response": "[Writes a 600+ word essay where each section builds on the previous one, introducing complexity and qualification. The argument does not simply repeat its thesis but develops it: early paragraphs establish the claim, middle paragraphs introduce counter-arguments and nuance, and the conclusion reaches a position more sophisticated than the opening thesis. The writing sustains precision and engagement throughout.]",
        "common_errors": [
          "Writing at length without building complexity (the final paragraph could have been written after the introduction)",
          "Confusing length with quality"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C031",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Writes stories that focus on what happens (plot events) without developing character, setting or language, often rushing to a conclusion.",
        "example_task": "Write the opening of a story set in an unfamiliar place.",
        "example_response": "One day a boy went to a strange land. It was really weird and different. He met a girl who said she could help him. They went on an adventure together.",
        "common_errors": [
          "Telling what happens without showing it through descriptive detail",
          "Introducing too many events without developing any one of them"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writes stories with some development of character, setting and atmosphere, using descriptive language and basic narrative techniques like dialogue.",
        "example_task": "Write the opening of a story that creates a sense of mystery.",
        "example_response": "The house had been empty for years. That was what everyone said, and that was what I believed until the night I saw the light. It was small -- just a flicker in the upstairs window, there and gone like a firefly. I stood on the pavement, my breath making ghosts in the cold air, and told myself it was a reflection. But reflections do not move from room to room.",
        "common_errors": [
          "Creating atmosphere in the opening but abandoning it once the plot starts",
          "Using cliched imagery ('it was a dark and stormy night')"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Writes creative fiction with deliberate control of narrative technique, including character voice, atmospheric description, pacing and structural choices.",
        "example_task": "Write a story opening that establishes character through voice rather than description.",
        "example_response": "The thing about Tuesdays is that nobody expects anything from them. Mondays are for dread, Wednesdays for endurance, Fridays for relief. But Tuesdays? Tuesdays just happen to you. Which is why, when Mrs Patterson asked me to stay behind after maths, I did not feel anxious or curious or anything at all. It was a Tuesday. Whatever she wanted would be small, forgettable, a footnote in a day designed for footnotes. I was wrong about that. I was wrong about most things that term, but this was the wrongness that mattered.",
        "common_errors": [
          "Establishing a distinctive voice in the opening but not sustaining it",
          "Over-explaining the character's feelings rather than letting voice reveal them"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Writes creative fiction of genuine literary quality, with original voice, controlled structure, precise imagery and thematic resonance.",
        "example_task": "Write a complete short story (400-500 words) that uses a single image or object as a unifying device.",
        "example_response": "[Writes a complete short story where a single object (e.g. a pair of shoes, a photograph, a key) appears at the beginning, middle and end, each time carrying different significance as the narrative develops. The prose is precise and controlled, with imagery that serves characterisation and theme rather than decoration. The story has a clear arc but avoids neat resolution, trusting the reader to infer meaning. Voice is distinctive and sustained throughout.]",
        "common_errors": [
          "Using the unifying device mechanically rather than allowing its significance to develop naturally",
          "Prioritising literary technique over emotional truth"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C032",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Writes scripts that consist mainly of dialogue without stage directions, dramatic structure or distinct character voices.",
        "example_task": "Write a short scene between two characters who disagree about something.",
        "example_response": "Character 1: I think we should go to the park.\nCharacter 2: No, I want to stay home.\nCharacter 1: But it is sunny outside.\nCharacter 2: I do not care. I am staying here.",
        "common_errors": [
          "Writing dialogue that could belong to any character -- no distinctive voices",
          "Omitting stage directions entirely"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writes scripts with some stage directions, basic dramatic structure and attempts at distinct character voices.",
        "example_task": "Write a scene where a character reveals a secret to another character. Include stage directions.",
        "example_response": "MAYA: (sitting at the kitchen table, fidgeting with a mug) There is something I need to tell you.\nJAKE: (not looking up from his phone) Yeah?\nMAYA: Jake. Put the phone down.\n(JAKE looks up. He sees her face and slowly puts the phone on the table.)\nJAKE: What is it?\nMAYA: (long pause) I am leaving. At the end of the month.",
        "common_errors": [
          "Stage directions that describe emotions ('she said sadly') rather than actions",
          "Dialogue that tells the audience information the characters would already know"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Writes scripts with effective dramatic structure, distinct character voices, meaningful stage directions and awareness of how the text would work in performance.",
        "example_task": "Write a scene that creates dramatic tension through what characters do NOT say, using subtext and stage directions to convey unspoken meaning.",
        "example_response": "The kitchen. Evening. MUM is washing dishes. SARAH enters, drops her school bag heavily.\n\nMUM: (not turning around) How was school?\nSARAH: Fine.\n(Silence. MUM scrubs a pot that is already clean.)\nMUM: Mrs Cooper phoned.\n(SARAH's hand freezes on the fridge door.)\nSARAH: Oh.\nMUM: She said you were not in registration this morning.\n(Long pause. The tap runs. MUM turns it off but still does not turn around.)\nSARAH: I was late. The bus--\nMUM: (quietly) Do not. (She turns around, dish towel in her hands, wringing it.) Just do not.\n\nThe scene relies on physical action (the clean pot, the frozen hand, the wrung towel) and silence to communicate what the dialogue avoids. The audience infers the full situation from the gap between what is said and what is shown.",
        "common_errors": [
          "Relying on dialogue alone without using stage directions to create subtext",
          "Making subtext too obvious, undermining the dramatic tension"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Writes scripts that demonstrate sophisticated understanding of dramatic form, including structural choices about scene ordering, the relationship between text and performance, and how theatrical conventions create meaning.",
        "example_task": "Write a scene that uses a theatrical convention (aside, monologue, non-naturalistic staging, split stage) to create an effect that naturalistic dialogue alone could not achieve.",
        "example_response": "[Writes a scene using split staging where two characters in different locations speak simultaneously, their lines overlapping and echoing. One character prepares for a job interview, rehearsing confident answers; the other sits in the interview panel, rehearsing sympathetic rejections. The parallel staging reveals that both are performing versions of themselves, and that the interview -- ostensibly an honest exchange -- is a ritual of mutual pretence. A naturalistic scene would show one side; the split staging shows the gap between preparation and reality, making an argument about the theatricality of everyday life.]",
        "common_errors": [
          "Using theatrical conventions as gimmicks rather than as meaningful structural choices",
          "Not considering how the convention would work in actual performance"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C033",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Writes verse that uses rhyme as the primary organising principle, often at the expense of meaning, with limited control of form or imagery.",
        "example_task": "Write a short poem about a place that is important to you.",
        "example_response": "My room is where I like to be / It is the place that is just for me / I sit and play and have some fun / Until the day is almost done.",
        "common_errors": [
          "Forcing rhymes that distort meaning or produce awkward phrasing",
          "Writing in a sing-song rhythm that does not serve the poem's content"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writes poems that use imagery and some poetic devices, with growing control of line breaks and an understanding that poetry is about more than rhyme.",
        "example_task": "Write a poem about an everyday object, using imagery to make the reader see it differently.",
        "example_response": "The Kettle\nIt sits, squat and patient,\nA silver Buddha on the worktop,\nHumming its morning mantra\nUntil it screams --\nBrief, furious, then silent.\nSteam ghosts rise and vanish\nLike ideas you almost had\nBefore the day swallowed them.",
        "common_errors": [
          "Including imagery that does not serve the poem's overall meaning",
          "Using line breaks randomly rather than for deliberate effect"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Writes poems with deliberate control of form, imagery, voice and line, understanding how poetic techniques create specific effects and making choices that serve the poem's meaning.",
        "example_task": "Write a poem that uses a specific poetic form (sonnet, villanelle, free verse with a structural pattern) deliberately.",
        "example_response": "[Writes a poem in a chosen form where the form itself contributes to meaning -- for example, a poem about restriction written in a strict form to mirror the feeling of constraint, or a poem about freedom in expanding free verse stanzas. The imagery is precise and original, the voice is distinctive, and the line breaks are purposeful. The poem demonstrates understanding that form is not decoration but meaning.]",
        "common_errors": [
          "Choosing a form without considering how it relates to the poem's content",
          "Sacrificing meaning to maintain the formal pattern"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Writes poetry of genuine quality, with original voice, precise and surprising imagery, and structural choices that create layers of meaning.",
        "example_task": "Write a poem that uses an extended metaphor sustained across at least 12 lines.",
        "example_response": "[Writes a poem where a single metaphor is developed with increasing complexity across the whole piece. The metaphor opens with a clear comparison, extends through specific and surprising details, and arrives at a conclusion that transforms the reader's understanding of both the subject and the image. The language is precise -- every word earns its place. The poem demonstrates that the writer understands poetry as a form of thinking, not just a form of expression.]",
        "common_errors": [
          "Allowing the extended metaphor to become predictable or mechanical",
          "Using imagery that is decorative rather than illuminating"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C034",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Writes presentation notes that are essentially full scripts to be read aloud, without considering the differences between written and spoken communication.",
        "example_task": "Write notes for a two-minute talk about your favourite hobby.",
        "example_response": "[Writes a full paragraph to be read word-for-word, with no bullet points, no rhetorical structure and no consideration of audience engagement.]",
        "common_errors": [
          "Writing a full script rather than structured notes",
          "Not considering how spoken delivery differs from reading"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writes structured presentation notes with key points, some spoken language features (direct address, rhetorical questions) and a clear organisational plan.",
        "example_task": "Write notes for a presentation persuading your class to support a charity. Include an opening hook and three key points.",
        "example_response": "Opening: Ask 'How many of you have eaten a hot meal today?' (pause for response). Explain that 1 in 5 children in the UK do not know where their next meal is coming from.\nPoint 1: What the charity does -- provides school breakfasts to children in poverty.\nPoint 2: Why it matters -- hungry children cannot concentrate, learn or succeed.\nPoint 3: What we can do -- fundraising ideas that are fun and achievable.\nClosing: Repeat the opening question to create a circular structure.",
        "common_errors": [
          "Writing notes that are too detailed to be used flexibly",
          "Including spoken language features only in the opening and losing them in the body"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Writes polished presentation scripts or structured notes that use rhetorical technique, audience engagement strategies and a clear spoken voice, understanding the conventions of effective oral communication.",
        "example_task": "Write a polished script for a three-minute speech arguing that young people's voices should be heard in politics.",
        "example_response": "[Writes a speech with a strong opening (statistic, anecdote or provocative question), three clearly structured arguments each supported by evidence, rhetorical devices used purposefully (tricolon, anaphora, direct address), acknowledgement and rebuttal of counter-arguments, and a memorable closing that returns to the opening theme. The script is written for the ear -- sentences are shorter, rhythm matters, and complex ideas are expressed with clarity.]",
        "common_errors": [
          "Writing a speech that reads well on paper but would be difficult to deliver",
          "Overusing rhetorical devices so they lose impact"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Writes presentations and speeches that demonstrate sophisticated understanding of how spoken language works differently from written language, crafting text that is designed for oral impact.",
        "example_task": "Write a speech that uses the structure and rhythm of spoken language to create emotional impact.",
        "example_response": "[Writes a speech that uses the specific techniques of oral rhetoric: varied sentence length for rhythm, deliberate pauses marked in the text, anaphora that builds cumulative power, shifts in register between formal argument and personal anecdote, and a structure that builds towards a climactic moment. The speech demonstrates awareness that spoken language is experienced in time -- the audience cannot re-read, so clarity, repetition and emotional pacing are essential. The writer has crafted text that would be powerful when delivered but might seem repetitive on the page, showing understanding of the difference between reading and listening.]",
        "common_errors": [
          "Writing text that works on the page but does not account for the temporal nature of listening",
          "Not considering how pauses, emphasis and vocal delivery interact with the written text"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C035",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Writes arguments that assert opinions without evidence, reasoning or acknowledgement of opposing views.",
        "example_task": "Write a paragraph arguing that homework should be abolished.",
        "example_response": "Homework should be abolished because it is boring and nobody likes doing it. Students already spend all day at school so they should not have to do more work at home. It is not fair.",
        "common_errors": [
          "Asserting opinions without supporting evidence",
          "Using emotional language ('it is not fair') rather than reasoned argument"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writes arguments with identifiable claims supported by some evidence or reasoning, though the argument may be one-sided and the evidence general.",
        "example_task": "Write a paragraph arguing that school starting times should be changed. Include at least one piece of evidence.",
        "example_response": "Schools should start later because research shows that teenagers' body clocks are different from adults'. A study found that adolescents produce melatonin later in the evening, which means they naturally fall asleep later and need to sleep later in the morning. Starting school at 8:30 forces teenagers to learn when their brains are not fully awake. Later start times could improve concentration, attendance and mental health.",
        "common_errors": [
          "Citing evidence vaguely ('a study found') without specificity",
          "Not addressing any counter-arguments"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Writes sustained persuasive arguments with clear claims, specific evidence, logical reasoning, acknowledgement and rebuttal of counter-arguments, and appropriate rhetorical techniques.",
        "example_task": "Write a letter to your headteacher arguing for a specific change to school policy. Include evidence, acknowledge a counter-argument and rebut it.",
        "example_response": "[Writes a formal letter with clear paragraphing, each paragraph making a distinct point supported by evidence. Acknowledges a likely objection ('Some may argue that this would be too expensive, however...') and provides a reasoned rebuttal. Uses formal register appropriate to the audience. Concludes with a specific, actionable request rather than a vague call for change.]",
        "common_errors": [
          "Acknowledging a counter-argument without effectively rebutting it",
          "Losing formal register in the more passionate sections of the argument"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Writes arguments of genuine persuasive power, with sophisticated structure, compelling evidence, strategic use of rhetoric and a voice that is both authoritative and engaging.",
        "example_task": "Write an opinion piece for a newspaper arguing a position on a social issue. Your piece should be compelling enough to change minds.",
        "example_response": "[Writes a polished opinion piece with a provocative opening that challenges assumptions, a body that builds the argument through a combination of evidence, anecdote and analysis, strategic concessions that demonstrate fairness while strengthening the overall position, and a conclusion that reframes the debate rather than simply restating the argument. The piece demonstrates awareness of its audience (newspaper readers) and adapts its register, evidence and rhetorical strategy accordingly. The voice is distinctive, confident and persuasive.]",
        "common_errors": [
          "Writing persuasively but without sufficient evidence to convince a sceptical reader",
          "Adopting an aggressive or dismissive tone that alienates rather than persuades"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C036",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Writes letters without clear awareness of the conventions of the form or the need to adapt register to audience.",
        "example_task": "Write a formal letter to a local councillor about an issue in your area.",
        "example_response": "Dear Councillor, I am writing to say that our park is really rubbish and needs fixing. The swings are broken and there is litter everywhere. Please sort it out. Thanks, [name]",
        "common_errors": [
          "Using informal register in a formal letter ('really rubbish', 'sort it out')",
          "Not following letter conventions (no address, no date, informal sign-off)"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writes letters with appropriate conventions (address, date, salutation, sign-off) and attempts to match register to audience, though may lapse between formal and informal.",
        "example_task": "Write a formal letter complaining about poor service at a local business.",
        "example_response": "[Writes a letter with correct formatting, opening with 'Dear Sir/Madam', stating the complaint clearly, providing specific details, and closing with 'Yours faithfully'. The register is mostly formal but may include informal phrases. The letter states the complaint but may not specify a desired outcome.]",
        "common_errors": [
          "Mixing formal and informal register within the same letter",
          "Stating the complaint without explaining what resolution is expected"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Writes letters in both personal and formal registers with confident control of conventions, tone and purpose, adapting all aspects of the writing to the audience.",
        "example_task": "Write a formal letter to a company CEO requesting sponsorship for a school event, and a personal letter to a friend describing the same event. Notice how your language changes.",
        "example_response": "[Writes two contrasting letters about the same topic. The formal letter uses correct business format, formal register, a professional tone, specific evidence of the event's value, and a clear request with proposed benefits for the sponsor. The personal letter uses warm, informal language, humour, personal asides and a conversational tone. Both letters are effective for their audience, demonstrating that the student can control register consciously.]",
        "common_errors": [
          "Writing the formal letter well but making the personal letter too similar in tone",
          "Not adapting vocabulary, sentence structure and tone to the different audiences"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Writes letters with sophisticated control of voice, register and persuasive strategy, adapting the form to serve complex communicative purposes.",
        "example_task": "Write a letter to a newspaper editor responding to an article you disagree with. Your letter should be persuasive, reasoned and likely to be published.",
        "example_response": "[Writes a concise, compelling letter that opens by referencing the specific article, states a clear position, provides evidence and reasoning, uses the formal but accessible register appropriate for a newspaper's letters page, and closes with a memorable point. The letter demonstrates awareness that published letters are edited for space and impact, so every sentence is purposeful. The tone is firm but respectful, disagreeing with the article's argument rather than attacking the writer personally.]",
        "common_errors": [
          "Writing a response that is too long for the conventions of newspaper letters",
          "Attacking the writer rather than the argument"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C037",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "When asked to summarise, tends to either copy large sections of the original text or retell everything without distinguishing key points from details.",
        "example_task": "Read this article and summarise the main argument in three sentences.",
        "example_response": "The article is about plastic pollution. It says there is lots of plastic in the ocean. It says we should use less plastic.",
        "common_errors": [
          "Including too many details rather than identifying the central argument",
          "Copying phrases from the original rather than using own words"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifies key points and distinguishes them from supporting details, producing summaries that capture the main argument in own words.",
        "example_task": "Summarise this two-page article in one paragraph (50-75 words), capturing the main argument and key evidence.",
        "example_response": "The article argues that social media has a negative impact on teenage mental health. It cites research showing increased rates of anxiety and depression among heavy users, particularly girls aged 13-16. The writer acknowledges that social media also has benefits (community, information) but argues that the harms outweigh these for young people. The article calls for mandatory digital literacy education in schools.",
        "common_errors": [
          "Summarising the topic but missing the argument ('the article is about social media' rather than 'the article argues that...')",
          "Including too much detail to fit within the word limit"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Produces concise, accurate summaries that capture the structure of an argument as well as its content, distinguishing between claims, evidence and conclusions.",
        "example_task": "Summarise the key argument and counter-argument of this essay in 100 words.",
        "example_response": "[Writes a 100-word summary that identifies the essay's main claim, the most important evidence supporting it, the principal counter-argument, and the essay's response to that counter-argument. The summary is in the student's own words and captures the logical structure of the original rather than just its content. The summary demonstrates that the student can distinguish between the essay's position and the positions it argues against.]",
        "common_errors": [
          "Summarising the content accurately but missing the argumentative structure",
          "Not distinguishing between the writer's own views and the counter-arguments they discuss"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Produces summaries that not only capture content and structure but also evaluate the strength of the argument, identifying assumptions, gaps and rhetorical strategies.",
        "example_task": "Summarise and evaluate the argument of this article in 150 words.",
        "example_response": "[Writes a 150-word summary-evaluation that captures the argument's core claim and evidence, identifies an unstated assumption, evaluates the strength of the evidence, notes a rhetorical strategy the writer uses (e.g. emotive anecdote, appeal to authority), and reaches a brief evaluative conclusion about the argument's overall persuasiveness. The summary demonstrates that the student can simultaneously understand an argument and critically assess it.]",
        "common_errors": [
          "Summarising well but evaluating only superficially",
          "Allowing evaluation to replace summary rather than accompanying it"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C038",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Makes claims in writing without supporting them with evidence, or uses only personal experience as evidence.",
        "example_task": "Write a paragraph arguing that exercise is important. Include evidence to support your argument.",
        "example_response": "Exercise is important because it makes you feel good. I always feel better after I have been running. Everyone should exercise more because it is healthy.",
        "common_errors": [
          "Relying entirely on personal experience rather than external evidence",
          "Making general claims without specific supporting detail"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Supports arguments with some factual evidence, including statistics, examples or expert opinions, though evidence may be vague or not fully integrated into the argument.",
        "example_task": "Write a paragraph arguing that reading is essential for academic success. Include at least two pieces of evidence.",
        "example_response": "Reading is essential for academic success because it develops vocabulary and comprehension skills. Studies have shown that students who read for 20 minutes a day encounter significantly more words than those who do not, which improves their writing and exam performance. Additionally, reading develops critical thinking skills that are valuable across all subjects, not just English.",
        "common_errors": [
          "Citing evidence vaguely ('studies have shown') without specificity",
          "Including evidence without explaining how it supports the specific claim"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Constructs arguments supported by specific, relevant evidence, integrating factual detail into a logical chain of reasoning that connects claim, evidence and conclusion.",
        "example_task": "Write a paragraph arguing that the school curriculum should include financial literacy. Use specific evidence and clear reasoning.",
        "example_response": "[Writes a paragraph with a clear topic sentence (claim), specific evidence (e.g. a named study or statistic about young people's financial knowledge), reasoning that explains why the evidence supports the claim, and a concluding sentence that connects the point to the wider argument. Evidence is integrated naturally rather than dropped in as a separate element.]",
        "common_errors": [
          "Providing evidence without the reasoning that connects it to the claim",
          "Using evidence that is tangentially relevant rather than directly supporting the argument"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Builds sustained, evidenced arguments that evaluate the quality of evidence, address counter-evidence, and construct a persuasive case from multiple types of support (data, expert opinion, case studies, logical reasoning).",
        "example_task": "Write two paragraphs of an argument using different types of evidence (statistical, anecdotal, expert testimony) and explain why each type of evidence strengthens the overall case.",
        "example_response": "[Writes two paragraphs that use different evidence types strategically: one paragraph deploys a statistic to establish the scale of the issue, while another uses a specific case study to give the issue human dimensions. The student explains (either implicitly through structure or explicitly through metacommentary) why both types of evidence are needed -- statistics without stories are abstract, stories without statistics are anecdotal. The argument demonstrates awareness that different types of evidence serve different purposes and that the strongest arguments combine them.]",
        "common_errors": [
          "Using multiple types of evidence without explaining how they complement each other",
          "Not evaluating the limitations of any individual piece of evidence"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C039",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Writes in a default essay or story form regardless of what the task requires, without considering which form best suits the purpose.",
        "example_task": "You want to persuade people to visit a local attraction. Which form would be most effective: a letter, an article, a leaflet, or a speech?",
        "example_response": "I would write an essay about why people should visit.",
        "common_errors": [
          "Defaulting to 'essay' format for every writing task",
          "Not recognising that different forms have different conventions and effects"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Recognises that different forms serve different purposes and can select an appropriate form when given options, though may not apply its conventions consistently.",
        "example_task": "Choose the best form for each task: (a) persuading the council to build a skatepark, (b) sharing your holiday experience with friends, (c) reporting on a school event for the newsletter.",
        "example_response": "(a) A formal letter because I need to address a specific person in authority. (b) A personal letter or blog post because it is informal and for friends. (c) A newspaper-style report because it needs to inform readers about what happened.",
        "common_errors": [
          "Choosing an appropriate form but not applying its specific conventions",
          "Confusing the conventions of similar forms (e.g. article vs report)"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Selects form confidently based on purpose, audience and context, and applies the conventions of the chosen form accurately to enhance the writing's effectiveness.",
        "example_task": "Write the opening of a piece about plastic pollution in two different forms -- a newspaper article and a speech -- and explain how the form changes your approach.",
        "example_response": "[Writes two distinct openings. The article uses a headline, subheading and journalist's voice, opening with a striking fact and maintaining informative register. The speech uses direct address ('Ladies and gentlemen'), a rhetorical question and more emotive language. The student explains that the article assumes a reader who can re-read and check facts, while the speech assumes a listener who must be engaged immediately and cannot go back.]",
        "common_errors": [
          "Changing content between forms rather than changing technique and convention",
          "Not sustaining the chosen form's conventions throughout the piece"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Makes sophisticated choices about form, understanding that form itself carries meaning and that unconventional form choices can enhance a text's impact.",
        "example_task": "Write about a serious social issue using an unexpected form (e.g. a recipe, a weather report, a classified ad). Explain how the form choice enhances the message.",
        "example_response": "[Writes about homelessness in the form of an estate agent's listing ('Doorway. Central location. Open-plan. All-weather exposure. Suitable for single occupancy. No mod cons. No security deposit required.') The student explains that the form creates irony by applying the language of property and consumer choice to a situation where choice does not exist, forcing the reader to confront the dehumanising gap between housing as a commodity and housing as a human need. The unexpected form is more memorable and more unsettling than a conventional essay because it makes the reader complicit in the language of the market.]",
        "common_errors": [
          "Choosing an unusual form for novelty rather than because it enhances meaning",
          "Not explaining how the form choice serves the message"
        ]
      }
    ]
  }
]
