[
  {
    "concept_id": "EN-Y6-C049",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Writing legibly in a consistent joined style at a pace that allows the writer to keep up with classroom tasks, though handwriting may still require conscious effort.",
        "example_task": "Copy this paragraph in your neatest joined handwriting. Then write a second paragraph from dictation at normal speed. Compare the two and describe what changes when you write faster.",
        "example_response": "The pupil produces legible joined handwriting in both tasks. The copied paragraph is neater with more consistent letter sizes. The dictated paragraph is slightly less tidy but still legible. The pupil notes: 'When I write faster, my letters get a bit bigger and some of my joins are less neat, but you can still read it.'",
        "common_errors": [
          "Handwriting that is legible when copying slowly but becomes very difficult to read at normal writing speed",
          "Reverting to unjoined print under time pressure rather than maintaining a joined style"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writing fluently in a personal joined style that is largely automatic, freeing attention for content, and beginning to adapt presentation for different purposes.",
        "example_task": "Complete a timed writing task: you have 15 minutes to write the opening of a story. Afterwards, assess your own handwriting: is it legible throughout? Did you have to think about your handwriting or could you focus on what you were writing?",
        "example_response": "The pupil produces a sustained piece of writing in 15 minutes that is legible throughout, with a consistent personal style. Their self-assessment: 'I did not have to think about my handwriting. I was thinking about my characters and my word choices. My writing is a bit messier at the end because I was trying to finish my paragraph, but it is still readable.'",
        "common_errors": [
          "Handwriting that deteriorates significantly after the first few minutes, suggesting automaticity has not yet been achieved",
          "Being unable to assess own handwriting honestly, either claiming it is perfect or being overly critical without identifying specific issues"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Writing with a fluent, legible personal style that is fully automatic, allowing complete focus on content and composition. Making deliberate choices about presentation, layout and writing implement based on the task, audience and purpose.",
        "example_task": "You have three tasks today: rough planning notes for your essay, a neat final draft for your English book, and a poster for parents' evening. For each, describe how your handwriting and presentation approach will differ and why.",
        "example_response": "For rough notes, I will write quickly in my normal joined style because speed matters most and only I need to read them. I might use abbreviations and arrows. For the final draft, I will write in my best joined handwriting at a steady pace, making sure ascenders and descenders are clear and spacing is even, because my teacher will assess it and it represents my best work. For the poster, I will use larger, unjoined letters or a different style because it needs to be readable from a distance by parents. I might use a felt tip pen rather than a pencil. The key difference is that I am choosing the right handwriting for each purpose rather than writing the same way every time.",
        "common_errors": [
          "Using the same handwriting approach for all tasks without adapting speed, size or style to purpose and audience",
          "Not recognising that rough notes and polished final pieces require different presentation standards"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Demonstrating complete automaticity and self-awareness about handwriting as a communication tool, evaluating when handwriting, typing or other presentation methods best serve the purpose, and maintaining consistent quality across extended writing sessions.",
        "example_task": "You are preparing three versions of your persuasive essay: handwritten notes for yourself, a handwritten final copy for display, and a typed version for the school website. Explain the advantages and limitations of each format and when handwriting is more appropriate than typing.",
        "example_response": "Handwritten notes work best for planning because I can draw arrows, circle ideas, and arrange thoughts spatially on the page in a way that is harder on a screen. The handwritten display copy is better for the classroom wall because it shows my personal effort and is more engaging to read alongside illustrations. The typed version is better for the website because it is accessible to everyone, can be edited easily, and looks professional. Handwriting is more appropriate than typing when personal touch matters, when I need to sketch or annotate flexibly, or when no technology is available. Typing is better when the audience is large, the text needs to be edited, or the piece will be published digitally. A good writer chooses the format that best serves the reader and the purpose.",
        "common_errors": [
          "Assuming typing is always superior to handwriting without recognising contexts where handwriting is more appropriate",
          "Not considering the audience's needs when choosing between handwritten and typed presentation"
        ]
      }
    ]
  }
]
