[
  {
    "concept_id": "EN-KS1-C073",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Listening to a short instruction and carrying it out correctly.",
        "example_task": "Listen carefully. Put the red pencil in the pot and sit down.",
        "example_response": "Child puts the red pencil in the pot and sits down.",
        "common_errors": [
          "Completing only the first part of a two-step instruction",
          "Starting the action before the instruction is finished"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Listening to a speaker and responding to what was said, showing understanding.",
        "example_task": "Listen to your partner describe their weekend. Now tell me one thing they did.",
        "example_response": "'My partner said they went swimming with their dad on Saturday.'",
        "common_errors": [
          "Talking about their own weekend instead of listening to their partner's",
          "Hearing the last thing said but not the main point"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Listening attentively to longer contributions and responding with relevant comments or questions.",
        "example_task": "Listen to the visitor talk about their job. Afterwards, ask one question about something they said.",
        "example_response": "Child asks a relevant question that shows they were listening: 'You said you work with animals — which animal is the hardest to look after?'",
        "common_errors": [
          "Asking a question unrelated to what was said",
          "Being unable to recall any detail from the talk"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Listening actively, noting key points, and building on what others say in extended discussions.",
        "example_task": "In your group discussion, listen to everyone's ideas. Summarise what the group has said so far.",
        "example_response": "'So far, Sam said the best part of the trip was the museum, and Priya thinks it was the picnic. They both agreed that the bus journey was too long. I think we need to talk about whether we'd go again.'",
        "common_errors": [
          "Summarising only their own contribution, not others'",
          "Listening to respond rather than listening to understand"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C074",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Waiting for a turn to speak when using a talking stick or token.",
        "example_task": "When you have the talking stick, tell us your favourite animal. When someone else has it, listen quietly.",
        "example_response": "Child waits for the stick, speaks, then passes it on without interrupting others.",
        "common_errors": [
          "Speaking without the talking stick",
          "Not paying attention when others are speaking"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Taking turns in pair and group discussions, listening before responding.",
        "example_task": "Discuss with your partner: which is better, summer or winter? Take turns to give your reasons.",
        "example_response": "Child listens to partner's view, then gives their own response that shows they heard what was said.",
        "common_errors": [
          "Interrupting the partner before they have finished",
          "Waiting for a turn but not actually listening to what the partner said"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Taking turns appropriately in group discussions, building on others' ideas using sentence stems.",
        "example_task": "In your group, discuss the best book we've read this term. Use phrases like 'I agree with ___ because...' or 'I think differently because...'",
        "example_response": "Child takes turns, references others' contributions, and builds on ideas: 'I agree with Tom that it was exciting, but I think the ending was too sudden.'",
        "common_errors": [
          "Speaking in turn but not responding to what others said",
          "Dominating the discussion without letting others contribute"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Facilitating group discussion by inviting quieter members to contribute and summarising the group's views.",
        "example_task": "Lead a group discussion about the story. Make sure everyone gets a chance to speak and try to find areas of agreement.",
        "example_response": "Child invites contributions: 'What do you think, Sara?' Summarises: 'So most of us think the character was brave, but we disagree about whether the ending was fair.' Manages turns fairly.",
        "common_errors": [
          "Leading by talking the most rather than facilitating others",
          "Inviting contributions but not responding to them"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C075",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Asking a simple question about something they want to know, using a question word.",
        "example_task": "Ask me a question about this picture using the word 'what' or 'where'.",
        "example_response": "'What is the man carrying?'",
        "common_errors": [
          "Making a statement instead of asking a question ('The man is carrying a bag')",
          "Asking a question they already know the answer to"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Asking questions using a range of question words to find out information.",
        "example_task": "We have a visitor coming to talk about being a vet. Think of three questions you could ask. Use different question words.",
        "example_response": "'What animals do you help? Why did you want to be a vet? How long did you study?'",
        "common_errors": [
          "Using the same question word for every question",
          "Asking closed questions that only need yes/no answers"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Asking relevant questions that extend understanding during discussions and after listening to explanations.",
        "example_task": "After listening to the talk about space, ask a question that helps you understand something better — not just a fact you could look up.",
        "example_response": "'You said astronauts float in space. Why doesn't everything just float away? How do they eat and drink?'",
        "common_errors": [
          "Asking factual recall questions rather than questions that extend understanding",
          "Asking questions unrelated to the topic"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Formulating probing questions that challenge ideas, seek evidence or explore alternatives.",
        "example_task": "Your partner says the wolf is the villain in the story. Ask a question that challenges them to think more deeply.",
        "example_response": "'But what if the wolf was just hungry and didn't know any better? Does that still make him a villain? What evidence in the story tells us he meant to be bad?'",
        "common_errors": [
          "Accepting the first answer without probing further",
          "Asking challenging questions in a confrontational rather than collaborative way"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C076",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Giving a simple reason for a preference when asked directly.",
        "example_task": "Which story do you like best? Why?",
        "example_response": "'I like \"The Gruffalo\" because the mouse is clever and tricks everyone.'",
        "common_errors": [
          "Stating a preference without any reason ('I just like it')",
          "Giving a circular reason ('I like it because it's good')"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Supporting an opinion with a reason and a simple piece of evidence from a text or experience.",
        "example_task": "Do you think the character made a good decision? Give a reason using 'because' and point to something in the story.",
        "example_response": "'I think she made a good decision because she was kind to the old woman and the story shows that kindness was rewarded at the end.'",
        "common_errors": [
          "Giving a reason but not connecting it to evidence",
          "Stating evidence without connecting it to an opinion"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Justifying opinions with clear reasoning and evidence, using the frame 'I think... because... for example...'",
        "example_task": "Is this a good opening for a story: 'It was dark. Something moved in the shadows.'? Justify your answer.",
        "example_response": "'I think it's a good opening because it creates a mysterious mood. The short sentences build tension and make the reader want to know what is in the shadows. It doesn't give too much away, which makes you want to read on.'",
        "common_errors": [
          "Saying it's good but only giving one vague reason",
          "Not referring to specific features of the writing"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Considering different viewpoints before forming an opinion, and changing or strengthening opinions in response to others' reasoning.",
        "example_task": "Listen to two different opinions about the ending of the story. Which do you agree with more? Can you find strengths in both arguments?",
        "example_response": "'Sam thinks the ending was too happy and unrealistic. Priya thinks it was satisfying because the character deserved a happy ending. I can see both points — it was a bit easy, but I think the character earned it through their bravery earlier in the story. So I mostly agree with Priya but Sam makes a fair point.'",
        "common_errors": [
          "Simply agreeing with one view without considering the other",
          "Acknowledging both views but not forming their own reasoned position"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C077",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Participating in simple role-play activities linked to stories or experiences, with adult modelling.",
        "example_task": "Pretend to be the shopkeeper. I'll be the customer. What would you say?",
        "example_response": "'Hello, what would you like to buy today?'",
        "common_errors": [
          "Breaking out of role immediately",
          "Not speaking in character, only performing actions"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Taking on a role in a structured drama activity, speaking and acting as the character.",
        "example_task": "In hot-seating, you are the Big Bad Wolf. Answer questions from the class as if you ARE the wolf.",
        "example_response": "'I wasn't trying to be mean! I was just hungry and those pigs had lovely houses. I only knocked because I wanted to ask for some food.'",
        "common_errors": [
          "Answering as themselves rather than in character",
          "Giving one-word answers without developing the character's voice"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using drama to explore characters and situations, sustaining a role and responding to others in character.",
        "example_task": "In pairs, act out the scene where the character discovers the secret garden. Stay in character and respond to what your partner says.",
        "example_response": "Child sustains the role, speaking with appropriate emotion, responding to their partner's improvised contributions, and staying in the scene.",
        "common_errors": [
          "Breaking character to discuss what to do next rather than improvising in role",
          "Speaking as themselves rather than as the character"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using drama to deepen understanding of characters and texts, reflecting on how performing a role changed their understanding.",
        "example_task": "After the hot-seating activity, explain: did being in the wolf's role change how you think about the character?",
        "example_response": "'When I had to answer questions as the wolf, I had to think about why he did what he did. I realised he might not be completely evil — he was hungry and the pigs wouldn't help him. Being in role made me think about his side of the story, which I hadn't considered before.'",
        "common_errors": [
          "Saying the drama was fun without reflecting on what it taught them",
          "Not connecting the drama experience to deeper understanding of the text"
        ]
      }
    ]
  }
]