[
  {
    "concept_id": "EN-KS1-C052",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that a sentence is a group of words that makes sense on its own, not just a single word.",
        "example_task": "Which is a sentence: 'The cat sat on the mat' or 'cat mat sat'?",
        "example_response": "'The cat sat on the mat' is a sentence because it makes sense. 'Cat mat sat' doesn't make sense.",
        "common_errors": [
          "Thinking any group of words is a sentence",
          "Not understanding what 'makes sense' means in this context"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying where sentences begin and end when reading, and beginning to use capitals and full stops in own writing.",
        "example_task": "This passage has no capital letters or full stops. Read it and add them in: 'the sun was shining the children played outside they had fun'",
        "example_response": "'The sun was shining. The children played outside. They had fun.'",
        "common_errors": [
          "Putting a full stop after every line rather than at the end of each sentence",
          "Correctly identifying one boundary but not others"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Consistently demarcating sentences with capital letters and appropriate end punctuation in own writing.",
        "example_task": "Write four sentences about the weather today. Make sure every sentence starts with a capital and ends with the right punctuation mark.",
        "example_response": "Child writes four sentences, each starting with a capital letter and ending with a full stop, question mark or exclamation mark as appropriate.",
        "common_errors": [
          "Demarcating the first sentence but losing consistency in later sentences",
          "Using 'and' to join everything into one long sentence without boundaries"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining how sentence boundaries affect meaning and reading, and varying sentence length for effect.",
        "example_task": "Read these two versions aloud. Which is easier to understand and why? Version A: 'The dog ran it was fast the boy chased it.' Version B: 'The dog ran. It was fast. The boy chased it.'",
        "example_response": "'Version B is easier because the full stops tell you where to pause. In Version A you can't tell where one idea ends and the next begins. The full stops help the reader understand the meaning.'",
        "common_errors": [
          "Preferring Version B but not being able to explain why",
          "Not connecting sentence boundaries to reader comprehension"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C053",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that the first word of a sentence needs a capital letter when shown examples.",
        "example_task": "Look at this sentence: 'the dog barked.' What's wrong? How do we fix it?",
        "example_response": "'It needs a capital T at the beginning. It should be \"The dog barked.\"'",
        "common_errors": [
          "Not noticing that the capital is missing",
          "Knowing the rule but not being able to identify the error"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using capital letters at the start of most sentences in own writing.",
        "example_task": "Write three sentences about your favourite food. Start each one with a capital letter.",
        "example_response": "Child writes three sentences, each beginning with a capital letter.",
        "common_errors": [
          "Capitalising the first sentence but forgetting for the second and third",
          "Using a lower-case letter after a full stop because the focus is on the new content"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Consistently using capital letters at the start of every sentence in independent writing.",
        "example_task": "Write a paragraph about your weekend. Every sentence must start with a capital letter.",
        "example_response": "Child writes a paragraph with capital letters consistently at every sentence start.",
        "common_errors": [
          "Maintaining capitals for most sentences but missing one or two, especially mid-paragraph",
          "Using capitals at sentence starts but also capitalising random words mid-sentence"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using capital letters accurately in all contexts — sentence starts, proper nouns and 'I' — with no errors in extended writing.",
        "example_task": "Write a recount of your school trip. Use capitals correctly everywhere they are needed — and only where they are needed.",
        "example_response": "Child uses capitals correctly for sentence starts, names, places, days and 'I', with no unnecessary capitalisation.",
        "common_errors": [
          "Capitalising common nouns that feel important (e.g., 'we saw the Lions')",
          "Forgetting to capitalise 'I' when it appears mid-sentence"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C054",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Placing a full stop at the end of a sentence when reminded by the teacher.",
        "example_task": "You've written your sentence. What do we need at the end? Add it.",
        "example_response": "Child adds a full stop at the end of the sentence.",
        "common_errors": [
          "Needing a reminder every time rather than remembering independently",
          "Placing the full stop after every line of writing rather than at the end of each sentence"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using full stops at the end of most sentences in own writing without reminders.",
        "example_task": "Write three sentences about animals. Remember to use a full stop after each one.",
        "example_response": "Child writes three sentences, each ending with a full stop.",
        "common_errors": [
          "Placing a full stop after the first sentence but forgetting for later ones",
          "Using a full stop after a phrase or fragment rather than a complete sentence"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using full stops consistently to end statements in independent writing.",
        "example_task": "Write a paragraph about your hobby. Use full stops to end every statement.",
        "example_response": "Child uses full stops correctly after every statement, distinguishing from questions or exclamations.",
        "common_errors": [
          "Using full stops for all sentence types, including questions",
          "Omitting full stops when concentrating on the content of writing"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Choosing accurately between full stops, question marks and exclamation marks for sentence endings.",
        "example_task": "Write four sentences about a surprise party: one statement, one question, one exclamation, and one command. Use the right punctuation for each.",
        "example_response": "'Everyone hid behind the sofa. Would he notice the decorations? What a wonderful surprise it was! Be quiet and don't move.'",
        "common_errors": [
          "Using the correct punctuation for three types but confusing exclamations and statements",
          "Adding a full stop after the exclamation mark"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C055",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that a question asks something and ends with a special mark, different from a full stop.",
        "example_task": "Is this a question or a telling sentence: 'Where is the cat?' Point to the special mark at the end.",
        "example_response": "'It's a question because it asks something. That curly mark at the end is a question mark.'",
        "common_errors": [
          "Not distinguishing between questions and statements",
          "Pointing to the question mark but calling it a full stop"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using question marks when writing questions using question words (who, what, where, when, why, how).",
        "example_task": "Write two questions you would like to ask a zookeeper. Use question marks.",
        "example_response": "'What do the lions eat? How often do you clean the enclosures?'",
        "common_errors": [
          "Writing a question but ending it with a full stop",
          "Writing a statement disguised as a question ('I want to know what they eat.')"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using question marks accurately and consistently in independent writing whenever a question is written.",
        "example_task": "Write a passage that includes at least two questions and two statements. Punctuate each correctly.",
        "example_response": "'We went to the park. Have you ever been there? The slide was enormous. Did you know it was the tallest in the town?'",
        "common_errors": [
          "Using question marks for sentences that are not questions ('I wondered what it was?')",
          "Consistently forgetting question marks even when the sentence clearly asks something"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Distinguishing between direct questions requiring question marks and indirect questions that do not.",
        "example_task": "Which of these needs a question mark: 'She asked where the book was' or 'Where is the book'? Explain why.",
        "example_response": "'\"Where is the book?\" needs a question mark because it directly asks a question. \"She asked where the book was.\" doesn't need one because it's telling you about a question — it's a statement about what she asked.'",
        "common_errors": [
          "Putting question marks on both because both contain the word 'where'",
          "Not understanding the difference between direct and reported questions"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C056",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that exclamation marks show strong feeling, and reading exclamatory sentences with expression.",
        "example_task": "Read these two sentences: 'It is hot.' and 'It is so hot!' What is different about how they sound?",
        "example_response": "'The second one sounds more excited or surprised. The mark at the end means you say it with more feeling.'",
        "common_errors": [
          "Reading both sentences in the same tone",
          "Not connecting the exclamation mark to a change in expression"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using exclamation marks in own writing for sentences showing strong feelings.",
        "example_task": "Write a sentence showing surprise: something that made you say 'Wow!'",
        "example_response": "'What an amazing trick that was!'",
        "common_errors": [
          "Putting an exclamation mark after a statement that doesn't show strong feeling",
          "Using multiple exclamation marks (!!!) for extra emphasis"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using exclamation marks appropriately for exclamations and commands, not overusing them.",
        "example_task": "Write one exclamation starting with 'What' or 'How', and one command. Use exclamation marks correctly.",
        "example_response": "'What a beautiful sunset! Stop running in the corridor!'",
        "common_errors": [
          "Using exclamation marks after ordinary statements",
          "Not knowing that exclamation sentences begin with 'What' or 'How'"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining the grammatical form of an exclamation sentence and choosing deliberately between full stops, question marks and exclamation marks for effect.",
        "example_task": "What makes 'What a great day!' an exclamation sentence? Why not just write 'It was a great day.'?",
        "example_response": "'\"What a great day!\" is an exclamation because it starts with \"What\", contains a verb (even though it's hidden: \"it was\") and expresses strong feeling. \"It was a great day.\" is just a statement — it tells you the information but doesn't sound excited.'",
        "common_errors": [
          "Thinking any sentence ending in '!' is an exclamation sentence",
          "Not understanding the specific grammatical structure required"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C057",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Writing own name with a capital letter and understanding that names start with capitals.",
        "example_task": "Write your name. What kind of letter does it start with?",
        "example_response": "Child writes 'Emily' with a capital E. 'It starts with a capital letter because it's my name.'",
        "common_errors": [
          "Writing name in all lower case",
          "Not understanding why names need capital letters"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using capitals for people's names, days of the week and the pronoun 'I' in own writing.",
        "example_task": "Write a sentence about what you did with a friend on a particular day. Use capital letters for the name and the day.",
        "example_response": "'On Monday I played with Sarah at lunchtime.'",
        "common_errors": [
          "Capitalising the friend's name but not the day of the week",
          "Writing 'i' in lower case"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Consistently using capitals for proper nouns (names, places, days) and 'I' in independent writing.",
        "example_task": "Write about a character who visits London on Saturday with their friend. Use capitals wherever they are needed.",
        "example_response": "'On Saturday, Tom and I went to London. We visited Buckingham Palace and the Tower of London.'",
        "common_errors": [
          "Capitalising character names but not place names",
          "Forgetting capitals for 'I' mid-sentence"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Distinguishing between proper and common nouns and explaining why capitals are used for one but not the other.",
        "example_task": "Why does 'London' have a capital letter but 'city' does not? Explain the rule.",
        "example_response": "'London is a proper noun — it's the name of one specific place. City is a common noun — it could be any city. Proper nouns name a specific person, place or thing and always have a capital letter.'",
        "common_errors": [
          "Knowing the rule but not being able to explain it clearly",
          "Capitalising common nouns that feel important (e.g., 'Dog', 'School')"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C058",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Using 'and' to join two words in a list.",
        "example_task": "What did you have for lunch? Put 'and' between the things you ate.",
        "example_response": "'I had a sandwich and an apple.'",
        "common_errors": [
          "Listing items without 'and' ('sandwich, apple')",
          "Using 'and' at the start of the sentence instead of within it"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using 'and' to join two clauses within a sentence.",
        "example_task": "Join these two sentences using 'and': 'The dog barked.' 'The cat ran away.'",
        "example_response": "'The dog barked and the cat ran away.'",
        "common_errors": [
          "Writing both sentences separately with 'and' starting the second: 'The dog barked. And the cat ran away.'",
          "Using 'and' but not creating a grammatically complete combined sentence"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using 'and' appropriately in writing, alongside other conjunctions (but, or, so), without overusing it.",
        "example_task": "Write three sentences about a day at the beach. Use 'and' in one, 'but' in another, and 'so' in the third.",
        "example_response": "'We built a sandcastle and dug a moat. The water was cold but we still went swimming. It started to rain so we packed up and went home.'",
        "common_errors": [
          "Using 'and' in all three sentences despite the instruction",
          "Using the conjunction incorrectly (e.g., 'The water was cold so we went swimming')"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Recognising when a sentence is overloaded with 'and' and splitting it into shorter sentences for clarity.",
        "example_task": "Improve this sentence by splitting it up: 'We went to the shop and bought milk and bread and cheese and then we went home and mum made sandwiches and we ate them in the garden.'",
        "example_response": "'We went to the shop and bought milk, bread and cheese. Then we went home. Mum made sandwiches so we ate them in the garden.'",
        "common_errors": [
          "Splitting into too many very short sentences that lose flow",
          "Not replacing some 'ands' with other conjunctions or punctuation"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C059",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Distinguishing between a question and a statement (asking vs telling).",
        "example_task": "Which sentence is asking and which is telling? 'The cat is black.' 'Is the cat black?'",
        "example_response": "'\"The cat is black\" is telling. \"Is the cat black?\" is asking.'",
        "common_errors": [
          "Not hearing the difference in intonation between a question and a statement",
          "Thinking any sentence with a question word is a question"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying all four sentence types (statement, question, exclamation, command) in texts.",
        "example_task": "Sort these sentences: 'Close the door.' 'What a cold day!' 'Is it snowing?' 'It is winter.'",
        "example_response": "Command: 'Close the door.' Exclamation: 'What a cold day!' Question: 'Is it snowing?' Statement: 'It is winter.'",
        "common_errors": [
          "Confusing commands with statements",
          "Identifying exclamations as statements because they contain factual information"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Writing all four sentence types with correct punctuation, understanding their different purposes.",
        "example_task": "Write one of each sentence type about school: a statement, a question, an exclamation and a command.",
        "example_response": "'School starts at nine o'clock. When is the school play? What an amazing assembly that was! Listen carefully to the teacher.'",
        "common_errors": [
          "Writing a statement with an exclamation mark and calling it an exclamation",
          "Writing a question without question word order ('You like school?')"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Choosing sentence types for effect in writing and explaining why different types suit different purposes.",
        "example_task": "You are writing about a fire drill. Which sentence types would you use and why?",
        "example_response": "'Commands: \"Line up quickly. Walk to the assembly point.\" These tell people what to do in an emergency. A statement for information: \"The alarm will ring at 10 o'clock.\" An exclamation to show urgency: \"What a loud alarm that was!\"'",
        "common_errors": [
          "Choosing appropriate types but not explaining the reasoning",
          "Defaulting to statements for everything"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C060",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Adding a single adjective before a noun to describe it.",
        "example_task": "Describe the dog. Add a word before 'dog' to tell me more about it: 'The ___ dog.'",
        "example_response": "'The big dog.'",
        "common_errors": [
          "Adding a verb instead of an adjective ('The running dog')",
          "Choosing a vague adjective ('The nice dog')"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using two adjectives before a noun, separated by a comma, to create an expanded noun phrase.",
        "example_task": "Expand the noun phrase: 'the castle' — add two adjectives to describe it.",
        "example_response": "'The tall, dark castle.'",
        "common_errors": [
          "Using two similar adjectives ('the big, large castle')",
          "Forgetting the comma between adjectives"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using expanded noun phrases in own writing to add detail and interest, choosing adjectives for precision.",
        "example_task": "Write a description of a forest. Use at least three expanded noun phrases.",
        "example_response": "'Tall, ancient trees stretched up to the sky. A narrow, winding path led deep into the forest. Bright, colourful birds sang in the branches.'",
        "common_errors": [
          "Using generic adjectives ('nice', 'good', 'big') rather than precise ones",
          "Expanding every noun phrase, making the writing feel overloaded"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Choosing expanded noun phrases deliberately to create a specific mood or impression, explaining the effect of adjective choices.",
        "example_task": "Write two descriptions of the same house — one to make it sound welcoming and one to make it sound frightening. Use expanded noun phrases to create the mood.",
        "example_response": "Welcoming: 'A cosy, red-brick cottage with a bright, cheerful garden.' Frightening: 'A crumbling, grey ruin with a dark, overgrown garden.'",
        "common_errors": [
          "Using the same adjectives for both moods",
          "Creating different moods but not being able to explain which adjectives contribute to the effect"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C061",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Using the present tense to describe what is happening now, with oral practice.",
        "example_task": "Tell me what is happening in this picture. Use 'is' or 'are': 'The boy ___ running.'",
        "example_response": "'The boy is running.'",
        "common_errors": [
          "Using past tense ('The boy was running') when the picture shows current action",
          "Omitting the auxiliary verb ('The boy running')"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using regular past tense -ed forms in recounts and narratives.",
        "example_task": "Write about what you did yesterday. Use the past tense for each sentence.",
        "example_response": "'Yesterday I walked to school. I played with my friend. We painted pictures in art.'",
        "common_errors": [
          "Switching between past and present tense in the same piece",
          "Over-generalising -ed to irregular verbs: 'I goed', 'I runned'"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using present and past tense consistently and correctly, including common irregular past tense forms.",
        "example_task": "Rewrite these sentences in the past tense: 'I go to the park. I see a dog. It runs to me. I am happy.'",
        "example_response": "'I went to the park. I saw a dog. It ran to me. I was happy.'",
        "common_errors": [
          "Using 'goed' instead of 'went' or 'seed' instead of 'saw'",
          "Correctly converting some verbs but not others"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Maintaining consistent tense throughout an extended piece and explaining why tense shifts should be deliberate.",
        "example_task": "Read this passage and find where the tense changes by mistake. Fix it. Why is it important to keep the tense the same?",
        "example_response": "Identifies the accidental tense shift, corrects it, and explains: 'If you change tense in the middle, the reader gets confused about when things are happening. A recount should stay in the past tense.'",
        "common_errors": [
          "Identifying obvious tense shifts but missing subtle ones",
          "Fixing the shift but not explaining why consistency matters"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C062",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising the -ing form in sentences describing actions happening right now.",
        "example_task": "Which sentence tells you something is happening right now? 'She ran.' or 'She is running.'",
        "example_response": "'She is running' — because it says \"is running\", that means it's happening now.",
        "common_errors": [
          "Not hearing the difference between 'ran' (past) and 'is running' (present progressive)",
          "Choosing 'She ran' because running happened"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using the present progressive (is/are + -ing) to describe ongoing actions.",
        "example_task": "Describe what the children in this picture are doing right now. Use 'is' or 'are' with an -ing word.",
        "example_response": "'The girl is painting. Two boys are playing football. The teacher is reading a book.'",
        "common_errors": [
          "Omitting the auxiliary verb: 'The girl painting' instead of 'The girl is painting'",
          "Using simple present instead: 'The girl paints'"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using both present and past progressive forms correctly, understanding the difference from simple tenses.",
        "example_task": "Write two sentences: one using the past progressive (was/were + -ing) and one using the present progressive (is/are + -ing).",
        "example_response": "'The children were singing a song when the bell rang.' 'Right now, the children are eating their lunch.'",
        "common_errors": [
          "Confusing 'was' and 'were' in past progressive (e.g., 'they was running')",
          "Not understanding that progressive describes an ongoing action, not a completed one"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining the difference in meaning between simple and progressive forms and choosing deliberately between them in writing.",
        "example_task": "What is the difference between 'I eat breakfast' and 'I am eating breakfast'? When would you use each one?",
        "example_response": "'\"I eat breakfast\" means I do it regularly, every day — it's a habit. \"I am eating breakfast\" means I'm doing it right now, at this moment. You'd use the first in a routine description and the second to describe what's happening now.'",
        "common_errors": [
          "Seeing both as meaning the same thing",
          "Understanding the difference in context but unable to articulate the rule"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C063",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Joining two ideas using 'because' to give a reason, with oral practice.",
        "example_task": "Finish this sentence: 'I wore my coat because ___.'",
        "example_response": "'I wore my coat because it was cold.'",
        "common_errors": [
          "Giving a reason that doesn't logically follow ('I wore my coat because I like cats')",
          "Repeating the first part instead of adding a reason"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using 'when', 'if', 'that' and 'because' to join a main clause and subordinate clause in writing.",
        "example_task": "Write a sentence using 'when': 'When ___, I ___.'",
        "example_response": "'When it rains, I wear my wellies.'",
        "common_errors": [
          "Writing the subordinate clause as a complete sentence: 'Because it was raining.' (fragment)",
          "Using the conjunction but not completing the sentence"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using subordination with 'when', 'if', 'that' and 'because' accurately in writing, varying the position of the subordinate clause.",
        "example_task": "Write two sentences about bedtime, one starting with 'if' and one ending with 'when'.",
        "example_response": "'If I finish my book, I can stay up late.' 'I brush my teeth when it is time for bed.'",
        "common_errors": [
          "Always putting the subordinate clause in the same position",
          "Confusing subordination with coordination (using 'because' as if it means 'and')"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Choosing between conjunctions for precise meaning and explaining why one is better than another in context.",
        "example_task": "Which is better for this context — 'if' or 'when'? 'I will take my umbrella ___ it rains.' Explain your choice.",
        "example_response": "'\"If it rains\" means it might or might not rain — you're not sure. \"When it rains\" means you expect it will definitely rain. \"If\" is better here because you don't know yet whether it will rain.'",
        "common_errors": [
          "Treating 'if' and 'when' as interchangeable",
          "Choosing correctly but not being able to explain the difference in meaning"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C064",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Using 'and' to join two equally important ideas in a sentence.",
        "example_task": "Join these ideas: 'I like dogs.' 'I like cats.'",
        "example_response": "'I like dogs and cats.'",
        "common_errors": [
          "Writing both as separate sentences without joining",
          "Using 'and' at the start: 'And I like cats'"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using 'and', 'but' and 'or' to join clauses, understanding the different meaning each adds.",
        "example_task": "Choose the right conjunction: 'I wanted to play outside ___ it was raining.' (and/but/or)",
        "example_response": "'But' — because the rain stops you playing outside. 'But' shows a contrast.",
        "common_errors": [
          "Choosing 'and' for every sentence regardless of meaning",
          "Not understanding that 'but' signals contrast"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using all four coordinating conjunctions (and, but, or, so) correctly in own writing.",
        "example_task": "Write four sentences, each using a different coordinating conjunction: and, but, or, so.",
        "example_response": "'I packed my bag and walked to school. I wanted pizza but they had pasta. Do you want milk or juice? It was late so we went home.'",
        "common_errors": [
          "Using 'so' and 'because' interchangeably without understanding the difference",
          "Starting sentences with 'but' or 'so' instead of using them to join clauses"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining the difference between coordination and subordination and choosing between them for effect.",
        "example_task": "What is the difference between 'I stayed inside because it rained' and 'It rained so I stayed inside'? Which puts more emphasis on the reason?",
        "example_response": "'\"Because it rained\" explains why I stayed inside — it emphasises the reason. \"It rained so I stayed inside\" describes the events in order — first it rained, then I stayed inside. \"Because\" gives more emphasis to the reason.'",
        "common_errors": [
          "Seeing both sentences as identical in meaning and emphasis",
          "Not understanding that word order and conjunction choice affect emphasis"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C065",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Understanding that commas separate items when listing more than two things.",
        "example_task": "Read this sentence: 'I bought apples, bananas, grapes and oranges.' Point to the commas. What do they do?",
        "example_response": "Points to commas. 'They separate the different fruits in the list.'",
        "common_errors": [
          "Not noticing the commas at all",
          "Thinking commas are the same as full stops"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using commas to separate items in a list of three or more, with 'and' before the final item.",
        "example_task": "Write a sentence listing four things you would pack for a holiday. Use commas.",
        "example_response": "'I would pack sunglasses, sun cream, a towel and my swimming costume.'",
        "common_errors": [
          "Using 'and' between every item instead of commas",
          "Placing commas after every item including before 'and'"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using commas in lists consistently and correctly in independent writing, including lists of adjectives, nouns and verbs.",
        "example_task": "Write a sentence with a list of nouns, one with a list of adjectives, and one with a list of verbs.",
        "example_response": "'We saw elephants, giraffes, zebras and monkeys.' 'The house was old, dark, dusty and cold.' 'The children ran, jumped, skipped and hopped around the playground.'",
        "common_errors": [
          "Using commas in noun lists but forgetting them in adjective or verb lists",
          "Placing commas randomly rather than between each item"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Understanding that commas in lists prevent ambiguity and can change meaning.",
        "example_task": "What is funny about this sentence if you don't use commas correctly: 'I love cooking my family and my pets'?",
        "example_response": "'Without commas, it sounds like you love cooking your family and pets — like you're going to eat them! It should be: \"I love cooking, my family and my pets.\" The comma shows that cooking, family and pets are three separate things I love.'",
        "common_errors": [
          "Not seeing the ambiguity in the uncomma'd version",
          "Understanding the joke but not connecting it to the function of commas"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C066",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying naming words (nouns) in simple sentences with picture support.",
        "example_task": "Look at this picture. Point to three things you can see. Those words are called nouns.",
        "example_response": "Points to dog, tree, ball. 'Dog, tree and ball are nouns.'",
        "common_errors": [
          "Pointing to actions (running, jumping) rather than things",
          "Not understanding that a noun is a naming word"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying nouns in sentences and distinguishing them from other word types.",
        "example_task": "Underline the nouns in this sentence: 'The tall boy kicked the red ball.'",
        "example_response": "Underlines 'boy' and 'ball'.",
        "common_errors": [
          "Underlining adjectives ('tall', 'red') as well as nouns",
          "Underlining the verb ('kicked') as a noun"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Identifying nouns including abstract and collective nouns, and distinguishing common from proper nouns.",
        "example_task": "Sort these words into common nouns and proper nouns: 'London', 'city', 'dog', 'Rover', 'Tuesday', 'day'.",
        "example_response": "Common nouns: city, dog, day. Proper nouns: London, Rover, Tuesday.",
        "common_errors": [
          "Putting 'day' as a proper noun because days of the week are capitalised",
          "Not understanding the distinction between the general category and the specific name"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining what a noun is with examples of different types and identifying nouns that can also function as other word classes.",
        "example_task": "Is the word 'play' a noun or a verb? Can it be both? Give examples.",
        "example_response": "'\"Play\" can be both. In \"I play football\" it's a verb — it's an action. In \"We watched a play\" it's a noun — it's a thing (a performance). Some words can be different word classes depending on how they are used in the sentence.'",
        "common_errors": [
          "Insisting a word can only be one word class",
          "Giving examples but not explaining how the context determines the word class"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C067",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying action words (verbs) in simple sentences by performing the actions.",
        "example_task": "Listen: 'The boy jumps.' Which word is the doing word? Can you do it?",
        "example_response": "'Jumps!' (Child jumps.)",
        "common_errors": [
          "Identifying the noun ('boy') instead of the verb",
          "Not understanding what a 'doing word' is"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying verbs in sentences including action verbs and simple state verbs.",
        "example_task": "Circle the verbs: 'The cat slept on the warm mat. It was happy.'",
        "example_response": "Circles 'slept' and 'was'.",
        "common_errors": [
          "Circling only action verbs and missing 'was'",
          "Circling adjectives like 'warm' or 'happy'"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Identifying verbs in various forms (past, present, progressive) and understanding that every sentence needs a verb.",
        "example_task": "Find the verb in each sentence and say whether it is past or present tense: 'The birds are singing.' 'The wind blew hard.' 'She writes a letter.'",
        "example_response": "'Are singing' — present. 'Blew' — past. 'Writes' — present.",
        "common_errors": [
          "Identifying only one word of a two-word verb ('singing' not 'are singing')",
          "Confusing tense labels — calling 'blew' present because it's a familiar word"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Choosing precise verbs in own writing and explaining how verb choice affects meaning.",
        "example_task": "Replace the verb 'went' in this sentence with a more precise verb: 'She went down the road.' Give three different options and explain how each changes the meaning.",
        "example_response": "'She strolled down the road' — relaxed, not in a hurry. 'She sprinted down the road' — fast, maybe in a hurry or scared. 'She crept down the road' — quietly, maybe hiding from someone.",
        "common_errors": [
          "Giving synonyms that are equally vague (e.g., 'walked', 'moved')",
          "Providing alternatives but not explaining the difference in meaning"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C068",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Using simple adjectives to describe what they can see, touch or feel.",
        "example_task": "Feel this teddy bear. Tell me two words to describe it.",
        "example_response": "'Soft and fluffy.'",
        "common_errors": [
          "Giving a noun ('teddy') instead of an adjective",
          "Using only one adjective"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying adjectives in sentences and adding adjectives to improve descriptions.",
        "example_task": "Make this sentence more interesting by adding adjectives: 'The house had a garden.'",
        "example_response": "'The old, spooky house had a beautiful, colourful garden.'",
        "common_errors": [
          "Adding adverbs instead of adjectives",
          "Adding adjectives that don't create a clear picture ('the nice, good house')"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using varied and specific adjectives in own writing to create vivid descriptions.",
        "example_task": "Write a description of a dragon using at least four different adjectives. Make each one add new information.",
        "example_response": "'The enormous, scaly dragon had fierce, glowing eyes and sharp, curved claws.'",
        "common_errors": [
          "Repeating similar adjectives ('big, large, huge')",
          "Using adjectives that tell rather than show ('scary' instead of specific details that create the feeling)"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Choosing adjectives deliberately for effect and explaining how they contribute to mood or character.",
        "example_task": "Describe the same room twice — once to make it sound cosy and once to make it sound creepy. Explain which adjectives create each mood.",
        "example_response": "Cosy: 'warm, soft, glowing, snug'. Creepy: 'cold, dark, shadowy, bare'. 'I used warm colours and comfortable textures for cosy, and cold colours and emptiness for creepy.'",
        "common_errors": [
          "Using obvious adjectives without subtlety",
          "Creating the mood but not being able to explain which adjectives contribute"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C069",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Understanding that adverbs tell us how something is done, using physical demonstration.",
        "example_task": "Walk slowly across the room. Now walk quickly. What words did I use to tell you HOW to walk?",
        "example_response": "'Slowly and quickly — they tell you how to walk.'",
        "common_errors": [
          "Confusing 'slowly' with 'slow' — not distinguishing adverb from adjective",
          "Not connecting the word to the action it describes"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Adding -ly adverbs to sentences to describe how an action is performed.",
        "example_task": "Add an adverb to this sentence: 'The girl sang ___.'",
        "example_response": "'The girl sang beautifully.'",
        "common_errors": [
          "Adding an adjective instead: 'The girl sang beautiful'",
          "Using only common adverbs like 'quickly' or 'slowly' every time"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using adverbs in own writing to add detail about how, when or where actions happen.",
        "example_task": "Write three sentences about a race. Use a different adverb in each one.",
        "example_response": "'The runners waited nervously at the start line. Suddenly, the whistle blew. They sprinted desperately towards the finish.'",
        "common_errors": [
          "Using the same adverb repeatedly",
          "Placing the adverb in an awkward position in the sentence"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Recognising that not all adverbs end in -ly and choosing adverbs deliberately for effect in writing.",
        "example_task": "Name three adverbs that do not end in -ly. Use one in a sentence.",
        "example_response": "'Fast', 'well', 'soon'. 'She runs fast' — 'fast' is an adverb because it describes how she runs, even though it doesn't end in -ly.",
        "common_errors": [
          "Insisting all adverbs must end in -ly",
          "Confusing 'fast' the adjective ('a fast car') with 'fast' the adverb ('she runs fast')"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C070",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that some words are made from two words joined together.",
        "example_task": "The word 'football' is made from two words. What are they?",
        "example_response": "'Foot' and 'ball'.",
        "common_errors": [
          "Breaking the word at the wrong point (e.g., 'foo' and 'tball')",
          "Not understanding that both parts are real words"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Splitting compound words into their two parts and creating compound words by combining two words.",
        "example_task": "Split these compound words: 'bedroom', 'sunflower', 'playground'. Now make a compound word from 'rain' and 'coat'.",
        "example_response": "'Bed-room, sun-flower, play-ground. Rain + coat = raincoat.'",
        "common_errors": [
          "Splitting at the wrong point in less obvious compounds",
          "Combining words that don't form a real compound (e.g., 'rain + hat = rainhat')"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using knowledge of compound words to read and understand unfamiliar words, and using compound words in own writing.",
        "example_task": "You see the word 'thunderstorm' in a book. How does knowing it is a compound word help you read and understand it?",
        "example_response": "'I can split it into \"thunder\" and \"storm\" — two words I already know. A thunderstorm is a storm with thunder. Breaking it into parts helps me read it and understand what it means.'",
        "common_errors": [
          "Not applying compound word knowledge as a decoding strategy",
          "Understanding the parts but not combining their meanings"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining how compound words are formed and distinguishing genuine compounds from words that simply contain other words.",
        "example_task": "Is 'carpet' a compound word? Why or why not? What about 'cupboard'?",
        "example_response": "'Carpet' is not a compound word — 'car' and 'pet' are real words but 'carpet' doesn't mean a car-pet. 'Cupboard' is a compound word — it was originally a board for keeping cups on, so both parts contribute to the meaning.",
        "common_errors": [
          "Thinking any word that contains two smaller words is a compound",
          "Not applying the meaning test — do both parts contribute to the whole meaning?"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C071",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Using basic terms — letter, word, sentence — correctly when talking about reading and writing.",
        "example_task": "Point to a letter. Point to a word. Point to a sentence.",
        "example_response": "Child correctly points to a single letter, a single word, and a complete sentence.",
        "common_errors": [
          "Confusing 'letter' with 'word' or 'word' with 'sentence'",
          "Pointing to a word when asked for a letter"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using Year 1 terminology (singular, plural, full stop, question mark, exclamation mark) when discussing texts.",
        "example_task": "What is the name of this punctuation mark: ? And this one: ! What does each one do?",
        "example_response": "'That's a question mark — it goes at the end of a question. That's an exclamation mark — it shows strong feeling.'",
        "common_errors": [
          "Confusing the names of punctuation marks",
          "Knowing the name but not the function"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using Year 1 and Year 2 grammatical terminology accurately (noun, verb, adjective, adverb, tense, apostrophe, comma, sentence type names).",
        "example_task": "Find a noun, a verb, an adjective and an adverb in this sentence: 'The brave knight fought fiercely.'",
        "example_response": "'Knight' is a noun, 'fought' is a verb, 'brave' is an adjective, 'fiercely' is an adverb.",
        "common_errors": [
          "Confusing adjective and adverb",
          "Identifying the correct word but assigning the wrong term"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using grammatical terminology fluently and precisely when discussing own and others' writing, and when explaining grammar rules.",
        "example_task": "Explain to your partner how to write a compound sentence. Use the correct grammatical terms.",
        "example_response": "'A compound sentence has two main clauses joined by a coordinating conjunction — that means \"and\", \"but\", \"or\" or \"so\". Each clause must have a subject and a verb. For example: \"The dog barked\" is one clause and \"the cat ran away\" is another. You join them with \"and\": \"The dog barked and the cat ran away.\"'",
        "common_errors": [
          "Using approximate language instead of precise terminology",
          "Defining terms correctly in isolation but not applying them in context"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C072",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to hear the difference between standard and non-standard forms in common phrases.",
        "example_task": "Which sounds right for a story: 'We was playing' or 'We were playing'?",
        "example_response": "'We were playing.'",
        "common_errors": [
          "Choosing the non-standard form because it matches their spoken dialect",
          "Not hearing any difference between the two forms"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using standard verb forms in writing for common non-standard patterns (was/were, did/done, went/gone).",
        "example_task": "Write the correct form: 'I ___ my homework.' (did/done)",
        "example_response": "'I did my homework.'",
        "common_errors": [
          "Writing 'I done my homework' because this is the spoken form",
          "Correctly choosing in a test but reverting to non-standard in free writing"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using Standard English consistently in writing, including subject-verb agreement and standard verb forms.",
        "example_task": "Write a short paragraph about a school trip using Standard English. Check that your verbs are correct.",
        "example_response": "Child writes with consistent standard forms: 'we were', 'they went', 'she saw', 'I did'.",
        "common_errors": [
          "Mixing standard and non-standard forms in the same piece",
          "Using standard forms for common verbs but non-standard for less frequent ones"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining the difference between Standard English and dialect, understanding when each is appropriate.",
        "example_task": "Your character in a story speaks in dialect: 'I ain't going nowhere.' Rewrite in Standard English. When would a character speak in dialect and when in Standard English?",
        "example_response": "Standard English: 'I'm not going anywhere.' 'A character might speak in dialect when talking informally to friends — it shows their personality and where they come from. They would use Standard English in a formal letter or speaking to someone important.'",
        "common_errors": [
          "Thinking dialect is always 'wrong' rather than appropriate in certain contexts",
          "Converting the dialect but not being able to explain when each register is appropriate"
        ]
      }
    ]
  }
]