[
  {
    "concept_id": "EN-KS1-C043",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Saying a simple sentence aloud when prompted before attempting to write it.",
        "example_task": "Tell me what you want to write about the picture. Say your whole sentence first.",
        "example_response": "'The cat is sitting on the mat.' (Child says the complete sentence before writing.)",
        "common_errors": [
          "Starting to write immediately without rehearsing the sentence orally",
          "Saying one or two words rather than a complete sentence"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Rehearsing sentences orally with a partner before writing, holding the sentence in memory while writing.",
        "example_task": "Tell your partner the sentence you want to write. Say it twice. Now write it down.",
        "example_response": "Child tells partner 'The scary dragon lived in a dark cave', repeats it, then writes the same sentence.",
        "common_errors": [
          "Changing the sentence between rehearsing and writing (e.g., simplifying it)",
          "Forgetting the end of the sentence and stopping partway through"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Independently rehearsing sentences orally before writing, including multi-clause sentences.",
        "example_task": "Before you write your next sentence, say it quietly to yourself. Make sure it has at least two parts joined by a conjunction.",
        "example_response": "Child quietly rehearses 'The children were excited because it was snowing' then writes it accurately.",
        "common_errors": [
          "Rehearsing a simple sentence but writing a more complex one (or vice versa)",
          "Skipping oral rehearsal entirely because they consider it unnecessary"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using oral rehearsal to experiment with different sentence structures before choosing the most effective one.",
        "example_task": "Try saying your sentence in two different ways. Which sounds better? Why?",
        "example_response": "'I could say \"The boy ran fast because the dog chased him\" or \"Because the dog chased him, the boy ran fast.\" The second one is more exciting because you want to know what happened.'",
        "common_errors": [
          "Producing two versions that are essentially the same",
          "Choosing between versions but not being able to explain why one is more effective"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C044",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Writing a simple sentence with a subject and verb that communicates one idea, with scaffold support.",
        "example_task": "Write a sentence about the picture. Use the sentence starter: 'The dog ___.'",
        "example_response": "'The dog is running.'",
        "common_errors": [
          "Writing a phrase rather than a complete sentence (e.g., 'big dog')",
          "Not including a verb ('The dog brown.')"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writing simple sentences independently with a capital letter and full stop, adding some detail.",
        "example_task": "Write a sentence about what you did at playtime. Remember your capital letter and full stop.",
        "example_response": "'I played on the climbing frame with my friend.'",
        "common_errors": [
          "Forgetting the capital letter or full stop",
          "Writing a sentence that is very short and lacks detail"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Writing varied sentences including compound sentences using 'and', 'but', 'or', 'so' and beginning to use subordination.",
        "example_task": "Write two sentences about this picture. Make one a compound sentence using 'but' and one using 'because'.",
        "example_response": "'The boy wanted to play outside but it was raining.' 'He read a book instead because he couldn't go to the park.'",
        "common_errors": [
          "Using 'and' for every compound sentence instead of varying conjunctions",
          "Writing a fragment after the conjunction ('Because it was raining.')"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Writing varied sentence types with deliberate choices about length, structure and word order for effect.",
        "example_task": "Write a short paragraph (3-4 sentences) about a storm. Vary your sentence lengths and try starting some sentences in different ways.",
        "example_response": "'Dark clouds gathered. Suddenly, the sky flashed with lightning and thunder crashed overhead. The rain poured down so hard that puddles formed everywhere. It was terrifying.'",
        "common_errors": [
          "Writing all sentences with the same structure and length",
          "Varying structure but losing grammatical accuracy"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C045",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Writing two or three sentences about the same topic in order, with picture support.",
        "example_task": "Write three sentences about what happens in the pictures: (picture 1: boy wakes up, picture 2: boy eats breakfast, picture 3: boy goes to school).",
        "example_response": "'The boy woke up. He had cereal for breakfast. Then he walked to school.'",
        "common_errors": [
          "Writing sentences about different, unrelated topics",
          "Describing only one picture and not sequencing"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writing a short narrative in order using time connectives (first, then, next, finally).",
        "example_task": "Write a four-sentence story about a trip to the zoo. Use the words first, then, next, finally.",
        "example_response": "'First, we got on the bus. Then, we arrived at the zoo. Next, we saw the lions and monkeys. Finally, we had ice cream and went home.'",
        "common_errors": [
          "Using the same connective ('then') for every sentence",
          "Putting events in an illogical order"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Writing a short narrative with a clear beginning, middle and end, maintaining a coherent sequence of events.",
        "example_task": "Write a short story about a character who finds something unexpected. Make sure it has a beginning, middle and end.",
        "example_response": "'One sunny morning, Lily found a golden key in her garden. She tried it in every lock she could find, but none of them opened. Finally, she tried the old shed door — it opened to reveal a beautiful secret garden inside.'",
        "common_errors": [
          "Writing a detailed beginning but rushing or omitting the ending",
          "Events that don't connect logically to each other"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Writing narratives with a developed plot including a problem and resolution, using varied connectives and building tension.",
        "example_task": "Write a story about a character facing a problem. Build up to the most exciting part before showing how the problem is solved.",
        "example_response": "Child writes a narrative with character introduction, rising tension, a climax and a satisfying resolution, using varied time and causal connectives, and with dialogue or description adding interest.",
        "common_errors": [
          "Including a problem but resolving it too quickly without building tension",
          "Losing the narrative thread partway through and introducing unrelated events"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C046",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Reading back a single sentence to an adult, pointing to each word, to check it makes sense.",
        "example_task": "Read your sentence back to me. Point to each word as you read.",
        "example_response": "Child reads back and notices 'I missed a word — it should say \"the dog ran away\" but I only wrote \"the dog ran\".'",
        "common_errors": [
          "Reading what they intended to write rather than what is actually on the page",
          "Pointing to words but reading too quickly to notice errors"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Rereading own writing independently to check it sounds right, identifying missing words or muddled sentences.",
        "example_task": "Read your writing back quietly. Does every sentence make sense? Fix anything that doesn't sound right.",
        "example_response": "Child rereads, finds a sentence missing a word, and adds it in.",
        "common_errors": [
          "Declaring 'it's fine' after a quick glance without actually rereading",
          "Noticing a problem but not knowing how to fix it"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Rereading as an ongoing part of the writing process, checking each sentence after writing it.",
        "example_task": "As you write your story, read each sentence back after you finish it. Fix any problems before moving on.",
        "example_response": "Child writes a sentence, rereads it, makes a small correction, then moves on to the next sentence.",
        "common_errors": [
          "Only rereading at the end rather than after each sentence",
          "Rereading for spelling but not for meaning"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Rereading to check for sense, flow and effect, making improvements to vocabulary and sentence structure as well as correcting errors.",
        "example_task": "Reread your whole piece. Does it make sense? Is there a sentence you could make even better?",
        "example_response": "Child rereads, fixes a missing full stop, and also changes 'the man was nice' to 'the kind man helped everyone', improving vocabulary and detail.",
        "common_errors": [
          "Checking only for errors without considering improvements",
          "Making changes that introduce new errors"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C047",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Writing for a single familiar purpose (e.g., a story or a label) with adult support.",
        "example_task": "Write a sentence to go with this picture of a farm. You are writing a label to tell people about it.",
        "example_response": "'This is a farm with cows and sheep.'",
        "common_errors": [
          "Writing without awareness of the purpose (e.g., writing a story when a label was requested)",
          "Not distinguishing between different types of writing"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writing for two or three different purposes (narrative, recount, list) with some awareness that each requires different features.",
        "example_task": "Write instructions for making a sandwich. Remember to use bossy verbs and number the steps.",
        "example_response": "'1. Get two slices of bread. 2. Spread butter on both slices. 3. Add cheese. 4. Put the slices together.'",
        "common_errors": [
          "Writing in narrative form ('First I got the bread and then I put butter on it') instead of instruction form",
          "Including imperative verbs but forgetting to number or sequence the steps"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Writing for a range of purposes — narrative, recount, instruction, information, letter, poetry — using features appropriate to each text type.",
        "example_task": "Write a letter to a friend telling them about a trip you went on. Use the correct letter layout.",
        "example_response": "Child writes with a greeting, recounts the trip in past tense with personal detail, and ends with a sign-off.",
        "common_errors": [
          "Writing a recount without the letter format (no greeting or sign-off)",
          "Mixing up the features of different text types"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Adapting writing style and language for different purposes and audiences, explaining why different text types need different features.",
        "example_task": "Write about the school trip twice: once as a recount for your diary and once as a report for the school newsletter. How are they different?",
        "example_response": "Diary: 'Today was the best day ever! We went to the museum and I saw a real dinosaur skeleton.' Newsletter: 'Year 2 visited the Natural History Museum on Tuesday. The children particularly enjoyed the dinosaur exhibition.' 'The diary is personal and uses I/we. The newsletter is formal and written for parents.'",
        "common_errors": [
          "Writing both pieces in the same style",
          "Explaining that they are different but not articulating how or why"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C048",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Telling an adult what they are going to write about before beginning.",
        "example_task": "Before you write, tell me what your story will be about.",
        "example_response": "'My story is about a dog that gets lost and finds its way home.'",
        "common_errors": [
          "Saying 'I don't know' and wanting to start writing immediately",
          "Giving only a single word topic rather than an idea for the content"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using a simple plan (picture, list or story map) before writing, with teacher guidance.",
        "example_task": "Draw three pictures to plan your story: beginning, middle, end. Write one word under each picture.",
        "example_response": "Child draws three pictures with key words and uses them as a guide when writing.",
        "common_errors": [
          "Creating a detailed drawing rather than a quick planning aid",
          "Planning but then ignoring the plan when writing"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Planning independently using an appropriate method (list, boxing up, mind map) before writing, and following the plan.",
        "example_task": "Plan your information text about minibeasts before you start writing. Decide what your sections will be about.",
        "example_response": "Child creates a boxing-up plan with sections: 'What are minibeasts?', 'Where do they live?', 'What do they eat?', 'Interesting facts.' Then writes following this structure.",
        "common_errors": [
          "Spending too long on the plan so it becomes a first draft",
          "Planning the beginning in detail but not planning the middle or end"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Planning with awareness of audience and purpose, including key vocabulary and structural choices.",
        "example_task": "Plan a persuasive leaflet about why people should recycle. Include your reasons, your best vocabulary and how you'll organise the information.",
        "example_response": "Child plans with a heading, three persuasive reasons with supporting vocabulary ('environment', 'waste', 'future'), a call to action, and notes on using rhetorical questions.",
        "common_errors": [
          "Planning content but not considering the persuasive structure",
          "Not including vocabulary or language feature notes in the plan"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C049",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying something they like about their own writing when asked by the teacher.",
        "example_task": "Read your writing. Tell me one thing you did well.",
        "example_response": "'I remembered my capital letter and full stop.'",
        "common_errors": [
          "Saying 'I don't know' or 'nothing'",
          "Commenting only on neatness rather than content"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying a strength and suggesting one improvement to their own writing using a simple checklist.",
        "example_task": "Look at the success criteria. Tick what you did. What could you improve?",
        "example_response": "'I used interesting words and my story has a beginning and end. But I could add more description in the middle.'",
        "common_errors": [
          "Ticking everything on the checklist without careful checking",
          "Identifying that something is missing but not knowing how to improve it"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Evaluating own and peers' writing against success criteria, giving specific feedback including suggestions for improvement.",
        "example_task": "Read your partner's story. Give them two specific things they did well and one specific suggestion for improvement.",
        "example_response": "'I liked how you described the forest using \"dark and mysterious\". Your ending was exciting. You could add speech to make the characters feel more real.'",
        "common_errors": [
          "Giving vague praise ('It was good') rather than specific feedback",
          "Being unable to suggest a specific improvement"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating writing for its effect on the reader, suggesting how to strengthen weak sections, and applying feedback to improve own work.",
        "example_task": "Reread your story. Which part would make a reader most excited? Which part is weakest? How could you improve the weak part?",
        "example_response": "'The chase scene is exciting because I used short sentences. The opening is weakest — it just says \"One day a boy went out.\" I could improve it by describing the setting and the character's feelings first.'",
        "common_errors": [
          "Identifying the strongest part but not the weakest",
          "Suggesting an improvement but not being able to carry it out"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C050",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Checking that a sentence has a capital letter at the start and a full stop at the end, with teacher prompting.",
        "example_task": "Check your sentence. Does it start with a capital letter? Does it end with a full stop?",
        "example_response": "Child checks and adds a missing full stop.",
        "common_errors": [
          "Saying 'yes' without actually looking at the writing",
          "Checking the first sentence but not subsequent ones"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Reading through own writing to find and correct spelling and punctuation errors using a checklist.",
        "example_task": "Use the proof-reading checklist to check your writing: capital letters, full stops, finger spaces, spelling of common words.",
        "example_response": "Child finds and corrects two missing capital letters and one misspelled common word.",
        "common_errors": [
          "Checking one type of error but missing others",
          "Reading too quickly and not catching errors"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Proof-reading independently for spelling, punctuation and grammatical errors, making corrections neatly.",
        "example_task": "Read through your writing carefully. Find and correct any mistakes in spelling, punctuation or grammar.",
        "example_response": "Child rereads slowly, corrects a homophone error ('their' to 'there'), adds a missing comma in a list, and fixes a spelling mistake.",
        "common_errors": [
          "Finding surface errors but missing grammatical inconsistencies (e.g., tense shifts)",
          "'Correcting' a word that was actually right"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Proof-reading with a systematic approach, checking for different error types on separate reads, and explaining corrections made.",
        "example_task": "Proof-read your writing three times: once for spelling, once for punctuation, once for grammar. Mark each correction with a different colour.",
        "example_response": "Child marks spelling corrections in green, punctuation in blue, grammar in red, identifying multiple errors across all three categories.",
        "common_errors": [
          "Using the same approach for all three reads rather than focusing on one error type at a time",
          "Missing errors on the third read due to fatigue"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C051",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Reading own writing aloud to an adult, pointing to each word.",
        "example_task": "Read your sentence to me. Point to each word as you read.",
        "example_response": "Child reads back their sentence clearly, pointing to each word.",
        "common_errors": [
          "Reading what they think they wrote rather than what is on the page",
          "Speaking too quietly to be heard"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Reading own writing aloud to a partner clearly and audibly.",
        "example_task": "Read your story to your partner. Make sure they can hear every word.",
        "example_response": "Child reads clearly and at an appropriate volume for the partner to hear.",
        "common_errors": [
          "Reading too fast for the partner to follow",
          "Mumbling or reading in a monotone"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Reading own writing with appropriate intonation, pausing at punctuation and varying voice for effect.",
        "example_task": "Read your story to the group. Use expression — change your voice for the different characters and the exciting parts.",
        "example_response": "Child reads with varied intonation, pauses at full stops, uses different voices for dialogue, and adjusts pace for exciting sections.",
        "common_errors": [
          "Reading in a flat voice without expression",
          "Adding expression for dialogue but reading narrative sections in monotone"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Performing own writing to the class with deliberate expression, engaging the audience and responding to their reactions.",
        "example_task": "Perform your story to the class. Think about how you will use your voice and body to make it engaging.",
        "example_response": "Child performs with eye contact, deliberate pauses for dramatic effect, varied volume and tone, and adjusts delivery based on audience response.",
        "common_errors": [
          "Reading with good expression but not looking up at the audience",
          "Over-performing so that the expression overwhelms the content"
        ]
      }
    ]
  }
]