[
  {
    "concept_id": "EN-Y3-C044",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying basic structural features in a model text, such as the beginning, middle and end.",
        "example_task": "Read this short story. Point to where the beginning ends and the middle starts. What happens in each part?",
        "example_response": "'The beginning is the first paragraph where it introduces the character and the forest. The middle is where the character gets lost. The end is where they find the way home.'",
        "common_errors": [
          "Saying the beginning is just the first sentence rather than the opening section",
          "Not being able to identify where one section ends and another begins"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Discussing features of a model text and borrowing structural ideas for own planning, with teacher support.",
        "example_task": "We've read this model letter of complaint. What features does it have? Create a plan for your own complaint letter using the same structure.",
        "example_response": "(Plan shows: 1. Opening — say what the problem is. 2. Middle — give details and explain why it's a problem. 3. End — say what I want to happen. Modelled on the structure of the example.)",
        "common_errors": [
          "Copying the content of the model rather than borrowing the structure",
          "Planning without referring back to the model text at all"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Analysing a model text's structure, vocabulary and grammar, and using these observations to plan and write a similar text independently.",
        "example_task": "Read this model persuasive leaflet. Identify three features of the writing (structure, vocabulary, grammar). Then plan your own persuasive leaflet about a different topic using the same features.",
        "example_response": "'Features: rhetorical questions in the opening, facts and statistics in the middle, and an imperative sentence at the end to tell the reader what to do. My plan: Opening — ask the reader if they care about local parks. Middle — give facts about how many parks have closed. End — tell the reader to sign the petition.'",
        "common_errors": [
          "Identifying surface features (e.g., it has pictures) rather than structural and language features",
          "Planning a text that doesn't actually use the features identified in the model"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating why specific structural and language choices work in a model text, and adapting (not just copying) these techniques for a different purpose or audience.",
        "example_task": "Read these two model texts — a newspaper report and a diary entry about the same event. How does the structure and language differ? Write your own diary entry about a school event, adapting techniques from the diary model.",
        "example_response": "(Identifies that the report uses formal language and third person while the diary uses informal language, first person and shows feelings. Own diary entry adapts the model's technique of starting with a strong emotion and uses short sentences for dramatic moments, but applies this to a completely different event.)",
        "common_errors": [
          "Describing the differences between the models without understanding why each text type uses those features",
          "Copying techniques without adapting them for a different purpose or audience"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C045",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Offering ideas verbally for a piece of writing when prompted by the teacher.",
        "example_task": "We're going to write a story about a magical garden. Tell me three things that could be in the garden.",
        "example_response": "'A talking flower, a pond with golden fish, and a tree that grows sweets.'",
        "common_errors": [
          "Saying 'I don't know' rather than generating ideas",
          "Offering only one idea rather than several to choose from"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Recording ideas for writing using a simple method such as a list or mind map, with some ideas relevant to the task.",
        "example_task": "You are going to write a non-fiction report about an animal. Use a mind map to record your ideas. What will you include?",
        "example_response": "(Mind map with central topic and 3-4 branches: what it looks like, where it lives, what it eats, interesting facts.)",
        "common_errors": [
          "Recording ideas that are too vague to be useful when writing (e.g., 'stuff about the animal')",
          "Creating a plan that is too detailed — essentially writing the whole text in the plan"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Generating and recording ideas independently using an appropriate planning method, drawing on reading, experience and imagination.",
        "example_task": "Plan an adventure story. Use a planning format of your choice to record your ideas for characters, setting, problem and resolution.",
        "example_response": "(Story plan with: Character — a girl who loves maps. Setting — an abandoned lighthouse. Problem — she discovers a hidden room with a coded message but someone else is trying to find it too. Resolution — she cracks the code first and finds it leads to a time capsule left by the lighthouse keeper's daughter.)",
        "common_errors": [
          "Plans that are too sketchy to guide the actual writing",
          "Generating lots of ideas but not selecting and organising the best ones"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Generating rich, detailed ideas that draw on wide reading and creative thinking, selecting and refining ideas critically before writing.",
        "example_task": "Plan a story inspired by the myths we've been reading. Generate several ideas, then choose the strongest one and explain why you selected it.",
        "example_response": "'Idea 1: A modern child finds a door to Olympus. Idea 2: A child discovers their teacher is a disguised god. Idea 3: A child has to complete three impossible tasks to save their village. I'm choosing idea 3 because it has a clear quest structure like the myths we read, with built-in tension from the tasks getting harder. I can include a mythical creature and a twist where the final task requires cleverness not strength.'",
        "common_errors": [
          "Choosing the first idea without considering alternatives",
          "Generating creative ideas but not being able to evaluate which will make the strongest piece of writing"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C046",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Saying a simple sentence aloud before writing it, to check it makes sense.",
        "example_task": "Before you write, say your sentence to your partner. Does it make sense? Then write it down.",
        "example_response": "(Says: 'The dog ran across the field.' Then writes the sentence accurately.)",
        "common_errors": [
          "Writing without saying the sentence aloud first",
          "Saying one sentence but writing a different one because of memory difficulties"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Rehearsing sentences orally that include expanded noun phrases or interesting vocabulary before writing them.",
        "example_task": "You're writing a description of a castle. Say your sentence aloud first, then improve it by adding more detail, then write the improved version.",
        "example_response": "(First attempt: 'The castle was big and old.' Improved: 'The enormous, crumbling castle stood on top of the hill.' Writes the improved version.)",
        "common_errors": [
          "Rehearsing the sentence but not actually improving it before writing",
          "Improving the sentence orally but then writing the simpler original version"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Composing and rehearsing multi-clause sentences orally, including dialogue, before writing them with varied vocabulary and sentence structures.",
        "example_task": "You're writing a scene where a character discovers something surprising. Rehearse your next two sentences aloud, including at least one sentence with a subordinate clause and one piece of dialogue.",
        "example_response": "(Rehearses: 'When she lifted the floorboard, a cold draught rushed up from below. \"What on earth is down there?\" she whispered, peering into the darkness.' Then writes both sentences.)",
        "common_errors": [
          "Rehearsing simple sentences rather than the multi-clause structures being practised",
          "Including dialogue in oral rehearsal but not punctuating it correctly in writing"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using oral rehearsal to experiment with sentence structure, word choice and rhythm, selecting the most effective version before writing.",
        "example_task": "Rehearse the opening sentence of your story in three different ways. Choose the most effective and explain why.",
        "example_response": "'Version 1: It was a dark and stormy night. Version 2: Lightning split the sky as Maya pressed her face against the window. Version 3: Maya watched the storm, counting the seconds between each flash and crash. I'll use version 2 because it starts with action, names the character immediately, and the word split is more powerful than just saying it was stormy.'",
        "common_errors": [
          "Generating variations that are too similar to each other",
          "Choosing the longest or most complicated version rather than the most effective"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C047",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that a text is divided into paragraphs by identifying the visual gap or indentation between sections.",
        "example_task": "Look at this page. How many paragraphs are there? How do you know where each paragraph starts?",
        "example_response": "'There are four paragraphs. I can see gaps between them and each one starts on a new line.'",
        "common_errors": [
          "Counting sentences instead of paragraphs",
          "Not noticing paragraph breaks at all"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Grouping related sentences together into a paragraph in their own writing, with support from a planning frame.",
        "example_task": "Write a non-fiction paragraph about what hedgehogs eat. Keep all the sentences about food in one paragraph.",
        "example_response": "'Hedgehogs eat a variety of food. Their favourite food is slugs and beetles. They also eat caterpillars, earthworms and sometimes frogs. In gardens, people sometimes put out cat food for hedgehogs.'",
        "common_errors": [
          "Including a sentence about a different topic in the middle of the paragraph (e.g., suddenly mentioning where hedgehogs live)",
          "Writing all information as one continuous block without any paragraphing"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Organising own writing into paragraphs around a theme, starting a new paragraph for each new topic, time, place or speaker.",
        "example_task": "Write a story of at least three paragraphs. Start a new paragraph each time there is a change of time, place or topic.",
        "example_response": "(Three or more paragraphs with clear, logical reasons for each break. For example: paragraph 1 introduces the character and setting, paragraph 2 describes the journey, paragraph 3 describes arriving at the destination.)",
        "common_errors": [
          "Starting new paragraphs at arbitrary points rather than at genuine shifts",
          "Writing the entire text as one paragraph or breaking after every sentence"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using paragraphs deliberately for effect, including varying paragraph length and using single-sentence paragraphs for impact.",
        "example_task": "Write a suspenseful scene using at least four paragraphs. Vary your paragraph lengths — use a short paragraph for dramatic effect.",
        "example_response": "(Varied paragraph lengths: a longer descriptive paragraph setting the scene, a medium paragraph building tension, a very short paragraph — perhaps just one sentence — at the moment of highest tension, and a final paragraph resolving the scene.)",
        "common_errors": [
          "Making all paragraphs the same length rather than varying for effect",
          "Using short paragraphs randomly rather than deliberately for impact"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C048",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Writing a simple story with a clear beginning (who, where) and a sequence of events.",
        "example_task": "Write the beginning of a story. Tell the reader who the story is about and where it is set.",
        "example_response": "'There was a boy called Sam who lived near a big forest. One day he decided to explore the forest.'",
        "common_errors": [
          "Starting with events before introducing the character or setting",
          "Writing 'Once upon a time' without establishing any specific character or place"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writing a story with distinct beginning, middle and end, including a basic problem or challenge for the character.",
        "example_task": "Write a short story that includes a character, a setting, a problem, and how the problem is solved.",
        "example_response": "(Story with clear sections: beginning introduces Leila and the school; middle — she loses her cat; end — she finds the cat hiding in the garden shed. Problem and resolution are present.)",
        "common_errors": [
          "Creating a problem but resolving it too quickly or easily",
          "Writing a 'bed to bed' story (I woke up... then... then... then I went to bed) without a real plot"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Writing a story with developed setting, characters with distinct traits, and a structured plot with building tension and satisfying resolution.",
        "example_task": "Write a story where the main character faces a challenge. Describe the setting using sensory detail, show the character's personality through their actions and dialogue, and build tension before the resolution.",
        "example_response": "(Story includes: setting with sensory detail — 'The cave was cold and the only sound was dripping water'; character shown through action — she checked her map carefully and whispered encouragement to herself; plot builds tension — the torch flickered, then died; resolution is earned — she remembered her grandmother's advice and felt her way using the cave wall.)",
        "common_errors": [
          "Describing characters only by appearance rather than showing personality through actions and dialogue",
          "Resolving the story with an external rescue ('and then Mum came') rather than the character solving the problem"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Crafting stories with well-developed characters who change or learn, deliberately chosen settings that contribute to mood, and plots with complications or subplots.",
        "example_task": "Write a story where the main character learns something important. Make the setting contribute to the mood, and include at least one complication before the resolution.",
        "example_response": "(Story where setting mirrors character mood — a grey, rainy day reflects the character's sadness after an argument. A complication occurs — the character's attempt to apologise goes wrong. Character growth — they learn that sometimes you have to be brave enough to try again. Language choices support mood and theme throughout.)",
        "common_errors": [
          "Telling the reader what the character learned rather than showing it through events",
          "Including complications that don't connect to the main story"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C049",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising basic organisational features in a non-fiction text, such as a heading or a title.",
        "example_task": "Look at this information page about spiders. Point to the heading. Why is it there?",
        "example_response": "'The heading says Types of Spider. It tells you what the page is about.'",
        "common_errors": [
          "Confusing the heading with the first sentence of the text",
          "Not understanding that headings serve a purpose beyond decoration"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using a heading and simple sub-headings in own non-fiction writing, with teacher guidance.",
        "example_task": "Write an information text about your favourite animal. Use a main heading and at least two sub-headings to organise your information.",
        "example_response": "(Text with heading 'All About Dolphins' and sub-headings 'What Dolphins Look Like' and 'Where Dolphins Live'. Information under each sub-heading matches the heading.)",
        "common_errors": [
          "Writing sub-headings that don't clearly signal what follows",
          "Placing all information under one heading rather than splitting it logically"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Structuring non-fiction writing using headings, sub-headings and other organisational devices such as bullet points or numbered lists, matched to purpose.",
        "example_task": "Write an information leaflet about staying safe online. Use headings, sub-headings and at least one list to organise your information clearly.",
        "example_response": "(Leaflet with: main heading 'Staying Safe Online'; sub-headings such as 'What Are the Risks?' and 'How to Stay Safe'; a bulleted list of safety rules; information organised logically under each sub-heading.)",
        "common_errors": [
          "Using bullet points where continuous prose would be more appropriate",
          "Headings that are too vague to guide the reader (e.g., 'More Information')"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Choosing and combining organisational devices effectively, considering how they help the reader navigate and understand the information.",
        "example_task": "Write a guide to your school for new pupils. Choose the best way to organise the information — consider headings, sub-headings, lists, numbered steps and text boxes. Explain why you chose each feature.",
        "example_response": "(Guide uses headings for major sections, sub-headings for detail, a numbered list for 'Your First Day Step by Step', and a boxed tip — 'Top tip: Your form tutor is always the best person to ask.' Child explains: 'I used numbered steps for the first day because the order matters, and a text box for the tip because it's important advice I want to stand out.')",
        "common_errors": [
          "Using organisational features inconsistently or decoratively rather than purposefully",
          "Not being able to justify why particular features were chosen"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C050",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying one thing they like about a piece of writing when prompted.",
        "example_task": "Listen to your partner read their story. Tell them one thing you liked about it.",
        "example_response": "'I liked the part where the dragon sneezed because it was funny.'",
        "common_errors": [
          "Saying 'It was good' without identifying anything specific",
          "Commenting on handwriting or length rather than the content or language"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying a strength and suggesting one specific improvement in a peer's writing, using a success criteria checklist.",
        "example_task": "Read your partner's writing. Using the checklist, find one thing they did well and one thing they could improve.",
        "example_response": "'You used really good describing words — I like shimmering. One thing to improve is that your story doesn't have a proper ending — it just stops. Maybe you could add a paragraph about what happened afterwards.'",
        "common_errors": [
          "Giving vague improvement suggestions (e.g., 'make it better') rather than specific advice",
          "Only identifying spelling errors rather than commenting on content and structure"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Evaluating writing against clear criteria, identifying strengths and suggesting specific improvements to content, structure and language.",
        "example_task": "Read your partner's persuasive letter. Evaluate it against the success criteria: Does it have a clear argument? Does it use persuasive language? Does it address the reader directly? Give specific feedback.",
        "example_response": "'Your argument is clear — you want more play time at lunch. You use persuasive language like surely and unfair, which is effective. But you could address the reader more directly. Instead of saying children need more play, you could say imagine how you would feel — that makes the reader put themselves in your position.'",
        "common_errors": [
          "Evaluating each criterion as simply 'yes/no' rather than explaining how well it was achieved",
          "Being reluctant to suggest improvements to avoid hurting the peer's feelings"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Providing detailed, constructive feedback that identifies how specific changes would improve the overall effect of the writing, and applying the same critical eye to their own work.",
        "example_task": "Re-read your own story. Identify one paragraph that is the weakest and explain specifically what you would change and why.",
        "example_response": "'My second paragraph is the weakest because I rush through the journey without describing anything — it just says they walked for ages. I should slow down and describe what they see and hear, which would also build tension before they arrive at the cave. I could add a sensory description and a fronted adverbial to set the scene.'",
        "common_errors": [
          "Being unable to identify weaknesses in own writing while being able to see them in others'",
          "Identifying a weakness but not knowing what specific changes would improve it"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C051",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Replacing a repeated word with a simple alternative when the repetition is pointed out by the teacher.",
        "example_task": "In your writing, you've written 'said' three times. Can you replace one of them with a different word?",
        "example_response": "(Changes one 'said' to 'whispered'.)",
        "common_errors": [
          "Replacing with an inappropriate synonym that doesn't fit the context",
          "Not seeing why repetition needs to be changed"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying and correcting a simple grammar or vocabulary issue in their own writing when guided to a specific section.",
        "example_task": "Read your second paragraph again. You've changed from past tense to present tense halfway through. Can you fix it so it's all in the same tense?",
        "example_response": "(Identifies where the tense changes and corrects 'she runs' to 'she ran' and 'he says' to 'he said'.)",
        "common_errors": [
          "Correcting some tense errors but missing others in the same section",
          "Not understanding the difference between past and present tense"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Independently re-reading writing to propose changes to grammar and vocabulary that improve consistency and quality, including using pronouns to avoid repetition.",
        "example_task": "Re-read your writing and make at least three improvements to grammar or vocabulary. Check that your tenses are consistent and that you haven't repeated names too often.",
        "example_response": "(Makes changes such as: replacing 'Tom' with 'he' in the third mention to avoid repetition; changing 'nice' to 'generous' for more precise vocabulary; correcting an inconsistent tense shift from past to present.)",
        "common_errors": [
          "Making vocabulary changes that are unnecessarily complicated rather than genuinely improving the text",
          "Replacing a noun with a pronoun where it creates ambiguity"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Editing writing with a strong sense of how changes affect the reader's experience, improving sentence structure, vocabulary precision and overall cohesion.",
        "example_task": "Edit your story to improve it. Focus on making the language more precise, varying sentence length, and ensuring the whole piece reads smoothly.",
        "example_response": "(Makes edits such as: changing 'He walked slowly through the quiet streets' to 'He crept through the silent streets' for more precise vocabulary; breaking a long sentence into two for clarity; adding a connective between paragraphs to improve flow.)",
        "common_errors": [
          "Over-editing to the point where the writing loses its original voice",
          "Focusing on individual sentences without considering how they connect"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C052",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Checking that each sentence starts with a capital letter and ends with a full stop when prompted to look.",
        "example_task": "Read through your writing and check that every sentence starts with a capital letter and ends with a full stop. Circle any you need to fix.",
        "example_response": "(Finds two missing capital letters and one missing full stop, circles them and corrects them.)",
        "common_errors": [
          "Reading for meaning rather than looking specifically at punctuation",
          "Missing errors at the start or end of lines where they are less visually obvious"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Checking and correcting basic spelling and punctuation errors in own writing using a simple checklist.",
        "example_task": "Use the proof-reading checklist to check your writing: capital letters, full stops, question marks, spelling of common words. Fix any errors you find.",
        "example_response": "(Uses checklist systematically. Finds and corrects: a missing question mark, 'becuse' corrected to 'because', a missing capital letter for a proper noun.)",
        "common_errors": [
          "Checking only the first type of error on the list and not completing the full checklist",
          "Reading what they intended to write rather than what they actually wrote"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Proof-reading independently for spelling and punctuation errors, using strategies such as reading aloud slowly or reading backwards for spelling.",
        "example_task": "Proof-read your completed piece of writing. Find and correct at least three errors in spelling or punctuation.",
        "example_response": "(Reads aloud slowly, pointing to each word. Identifies and corrects: 'diffrent' to 'different', a missing apostrophe in 'children's', and a comma splice corrected by adding a full stop and capital letter.)",
        "common_errors": [
          "Declaring the writing error-free after a superficial skim",
          "Correcting obvious errors but missing less visible ones like missing commas or apostrophes"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Proof-reading thoroughly and accurately, catching subtle errors including homophone mistakes, inconsistent tense and missing or misplaced punctuation.",
        "example_task": "Proof-read this passage that contains five errors (including a homophone, a tense inconsistency and a punctuation error). Find and correct all five.",
        "example_response": "(Finds all five: 'there' corrected to 'their', 'the childrens' corrected to 'the children's', 'she was walking and then she stops' corrected to 'stopped', a missing comma after a fronted adverbial, and 'seperate' corrected to 'separate'.)",
        "common_errors": [
          "Finding the most obvious errors but missing the subtle ones (e.g., tense inconsistency)",
          "Not recognising homophones as errors because the word is correctly spelled in isolation"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C053",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Reading a short piece of own writing aloud to a partner, audibly and without rushing.",
        "example_task": "Read your sentence to your partner. Make sure they can hear every word.",
        "example_response": "(Reads the sentence at an appropriate volume and pace so the partner can hear and understand.)",
        "common_errors": [
          "Reading too quietly for the partner to hear",
          "Rushing through the reading without pausing at punctuation"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Reading a paragraph of own writing aloud to a small group, using punctuation to guide pauses and intonation.",
        "example_task": "Read your paragraph to your group. Pause at full stops and commas. Use your voice to show where the question marks and exclamation marks are.",
        "example_response": "(Reads with appropriate pauses at full stops and commas. Voice rises for question marks and shows emphasis at exclamation marks.)",
        "common_errors": [
          "Ignoring punctuation and reading in a continuous stream",
          "Reading in a monotone without varying intonation for different sentence types"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Reading own writing aloud to the class with appropriate intonation, tone and volume that convey meaning and engage the audience.",
        "example_task": "Read your story to the class. Use your voice to show the mood and meaning — vary your tone, pace and volume.",
        "example_response": "(Reads with expression: slower pace and quieter voice for tense moments, louder and faster for exciting parts. Makes eye contact with the audience between sections. Pauses for effect at dramatic moments.)",
        "common_errors": [
          "Reading with expression at the start but reverting to a monotone as concentration on reading takes over",
          "Performing so dramatically that the meaning becomes unclear"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Presenting writing to an audience with confident, expressive delivery, using the reading aloud as an opportunity to evaluate the writing's effectiveness.",
        "example_task": "Read your best piece of writing to the class. Afterwards, explain one part where the audience reaction told you the writing was working well and one part you would revise.",
        "example_response": "(Reads confidently with varied intonation and pace. Afterwards: 'I noticed people laughed at the part where the cat fell in the pudding, so the humour worked. But when I read the ending, nobody reacted — I think it's too rushed and I need to add more description to make the ending feel satisfying.')",
        "common_errors": [
          "Not paying attention to audience reaction as feedback on the writing",
          "Being unable to connect the experience of reading aloud to revision decisions"
        ]
      }
    ]
  }
]