[
  {
    "concept_id": "EN-Y3-C013",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying a root word within a word that has a common suffix (-ing, -ed, -er).",
        "example_task": "What is the root word in 'playing', 'jumped', 'taller'?",
        "example_response": "Play, jump, tall.",
        "common_errors": [
          "Removing too many letters (e.g., saying the root of 'taller' is 'tal')",
          "Not recognising that the root word's spelling may change when a suffix is added"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using root word knowledge to read and understand unfamiliar words with prefixes and suffixes.",
        "example_task": "You encounter the word 'disagreement' in your reading. Break it down using your knowledge of root words.",
        "example_response": "'The root word is \"agree\". \"Dis-\" is a prefix meaning not or the opposite. \"-ment\" is a suffix that makes it a noun. So \"disagreement\" means when people don't agree.'",
        "common_errors": [
          "Identifying the root but not connecting it to the meaning of the whole word",
          "Breaking the word at the wrong point"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Applying root word knowledge systematically to decode and understand unfamiliar multisyllabic words in reading.",
        "example_task": "Read this passage. Circle three unfamiliar words. For each, identify the root word and use it to work out the meaning.",
        "example_response": "Child identifies words like 'uncomfortable' (root: comfort), 'disappearance' (root: appear), 'unbreakable' (root: break) and explains each meaning by analysing the root word and affixes.",
        "common_errors": [
          "Identifying the root word but not using the prefix/suffix meanings to build the full definition",
          "Misidentifying roots in words that look like they contain a familiar word but don't (e.g., 'carpet' doesn't contain 'car' as a meaningful root)"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Tracing word families from a shared root and explaining how meaning shifts across the family, using this to learn new vocabulary efficiently.",
        "example_task": "Starting with the root word 'port' (meaning to carry), generate a word family and explain how each word relates to carrying.",
        "example_response": "'Transport — carry across. Export — carry out. Import — carry in. Portable — able to be carried. Porter — a person who carries things. Deport — carry away (send someone out of a country). They all connect back to the idea of carrying.'",
        "common_errors": [
          "Generating words that contain 'port' but aren't related to the root meaning (e.g., 'sport')",
          "Listing word family members but not explaining the semantic connection"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C014",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising common prefixes (un-, re-, dis-) and knowing they change the meaning of the root word.",
        "example_task": "What does 'un-' do to the meaning of a word? What does 'unhappy' mean?",
        "example_response": "'Un- makes it the opposite. Unhappy means not happy.'",
        "common_errors": [
          "Knowing 'unhappy' means not happy but not being able to state the general rule about 'un-'",
          "Not recognising that 'un-' is a prefix rather than just the first two letters"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using knowledge of Year 3 prefixes (dis-, mis-, re-, pre-, anti-, auto-, super-, sub-) to work out word meanings.",
        "example_task": "Work out the meaning of these words using prefix knowledge: 'misbehave', 'rewrite', 'submarine'.",
        "example_response": "'Mis- means wrongly, so misbehave means behave badly. Re- means again, so rewrite means write again. Sub- means under, so submarine means under the sea.'",
        "common_errors": [
          "Knowing the prefix meaning but applying it incorrectly to the whole word",
          "Confusing prefix meanings (e.g., thinking 'dis-' means 'again')"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using prefix and suffix knowledge to read and understand new words encountered independently, including understanding how suffixes change word class.",
        "example_task": "The text says: 'The inexplicable disappearance puzzled everyone.' Use your knowledge of prefixes and suffixes to work out 'inexplicable' and 'disappearance'.",
        "example_response": "'In- means not. Explain is the root (spelling changes). -able means able to be. So inexplicable means cannot be explained. Dis- means the opposite. Appear is the root. -ance makes it a noun. So disappearance is when something stops appearing — it goes away.'",
        "common_errors": [
          "Identifying one affix but not all of them in a multi-affix word",
          "Not recognising when the root word's spelling has changed"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining how prefixes and suffixes from Latin and Greek roots contribute to English word formation, and using this to learn new vocabulary rapidly.",
        "example_task": "The prefix 'auto-' comes from Greek meaning 'self'. How does this help you understand: autobiography, autograph, automatic, automobile?",
        "example_response": "'Autobiography — writing about yourself (auto = self, bio = life, graph = writing). Autograph — your own writing/signature (auto = self, graph = writing). Automatic — acting by itself, without someone controlling it. Automobile — self-moving (auto = self, mobile = moving). Knowing the Greek root helps me figure out new words with \"auto-\" even if I haven't seen them before.'",
        "common_errors": [
          "Knowing the prefix meaning but not connecting it to the Greek/Latin origin",
          "Understanding individual words but not recognising the systematic pattern"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C015",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Reading common Year 3-4 exception words accurately using whole-word recognition.",
        "example_task": "Read these words: 'different', 'favourite', 'describe', 'believe', 'imagine'.",
        "example_response": "Child reads all five words correctly without needing to decode.",
        "common_errors": [
          "Mispronouncing 'different' as 'dif-er-ent' (three syllables instead of two common in speech)",
          "Reading 'favourite' as 'fav-or-ite' with emphasis on the wrong syllable"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Reading and spelling a growing number of Year 3-4 exception words, noting the unusual spelling patterns.",
        "example_task": "Spell these words: 'surprise', 'separate', 'calendar', 'February'.",
        "example_response": "Child spells all four words correctly.",
        "common_errors": [
          "Writing 'suprise' — missing the first 'r' in surprise",
          "Writing 'Febuary' — missing the first 'r' in February"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Reading and spelling Year 3-4 exception words accurately in context, including in dictated sentences.",
        "example_task": "Write from dictation: 'It was early in February when a peculiar accident occurred on the busy centre of town.'",
        "example_response": "Child writes the sentence with 'February', 'peculiar', 'accident', 'occurred', 'busy', 'centre' spelled correctly.",
        "common_errors": [
          "Spelling 'occured' instead of 'occurred' — missing the double 'r'",
          "Writing 'center' (American spelling) instead of 'centre'"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Identifying patterns within exception words and using etymology or mnemonics to explain and remember unusual spellings.",
        "example_task": "The words 'island', 'knowledge' and 'knight' all have silent letters. Can you explain why these letters are there? Create a mnemonic for one.",
        "example_response": "'These silent letters are historical — they used to be pronounced in Old English or Middle English. \"Knight\" was once pronounced with the \"k\" sound: \"k-nicht\". \"Island\" has a silent \"s\" because it was influenced by the Latin word \"insula\" even though the English word comes from a different origin. Mnemonic for \"island\": An island IS LAND surrounded by water.'",
        "common_errors": [
          "Creating a mnemonic but not understanding the etymological reason",
          "Assuming silent letters are random rather than historical"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C016",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Attempting to decode a longer unfamiliar word by breaking it into syllables.",
        "example_task": "Read this word: 'caterpillar'. Break it into smaller parts to help you.",
        "example_response": "Child segments: 'cat-er-pill-ar' and blends to say 'caterpillar'.",
        "common_errors": [
          "Guessing the word based on the first few letters (e.g., 'category')",
          "Giving up without attempting to break the word down"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using multiple strategies (syllable splitting, root word identification, trying different pronunciations) to decode unfamiliar words.",
        "example_task": "Read the word 'enthusiastically'. Try different strategies until it sounds like a word you recognise.",
        "example_response": "Child tries: 'en-thoo-see-ast-ick-al-ee'... adjusts to 'en-thew-zee-AST-ick-lee' and recognises 'enthusiastically'.",
        "common_errors": [
          "Trying one pronunciation and giving up if it doesn't sound right",
          "Decoding each syllable correctly but being unable to blend them into the whole word"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Decoding unfamiliar polysyllabic words in context, flexibly trying different pronunciations and using meaning to confirm.",
        "example_task": "Read this passage aloud. When you meet an unfamiliar word, use your strategies to work it out. I'll note which strategies you use.",
        "example_response": "Child reads fluently, pausing at unfamiliar words, segmenting by syllable, trying alternative vowel sounds where needed, and checking that the decoded word makes sense in context.",
        "common_errors": [
          "Decoding the word correctly in isolation but not checking it makes sense in the sentence",
          "Relying on only one strategy (usually sounding out) rather than flexibly choosing strategies"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining decoding strategies to others and identifying when a word has been incorrectly decoded by checking meaning.",
        "example_task": "Your partner decoded the word 'misled' as 'MY-zuld' (rhyming with 'drizzled'). Help them work out the correct pronunciation and explain why their first attempt was wrong.",
        "example_response": "'You've read it as one word, but it's actually two parts: \"mis-led\", like the past tense of \"mislead\". If you think about the meaning — to mislead means to lead someone the wrong way — then \"mis\" + \"led\" makes sense. Your pronunciation didn't match any word you know, which is a clue to try again.'",
        "common_errors": [
          "Identifying the correct pronunciation but not being able to explain the decoding error",
          "Not using meaning as a check on whether a decoded word is correct"
        ]
      }
    ]
  }
]