[
  {
    "concept_id": "EN-Y6-C044",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying common prefixes and suffixes in unfamiliar words and using them to make a reasonable guess at meaning, with teacher prompting.",
        "example_task": "You come across the word 'irreversible' in a science text. Break it into its parts and explain what you think it means.",
        "example_response": "The prefix 'ir-' means not. The root word is 'reverse', which means to go back. The suffix '-ible' means able to be. So 'irreversible' means not able to be reversed, or something that cannot be undone.",
        "common_errors": [
          "Splitting the word into syllables rather than meaningful morphemes, producing 'ir-re-ver-si-ble' without identifying root, prefix and suffix",
          "Identifying 'reverse' as the root but not connecting the prefix 'ir-' to its meaning of 'not'"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Independently breaking unfamiliar words into morphemes and using knowledge of common roots, prefixes and suffixes to determine meaning, with growing accuracy across subjects.",
        "example_task": "In your geography text you encounter 'biodegradable'. Break it into its morphemes, explain each part, and predict the meaning. Then check your prediction against the context of the sentence.",
        "example_response": "'Bio' means life or living things, like in biology. 'De' means down or away, like in decrease. 'Grade' relates to a step or stage. 'Able' means can be. So biodegradable means something that can be broken down by living things. The sentence says 'Paper bags are biodegradable, unlike plastic,' which confirms my prediction because it is talking about materials that break down naturally.",
        "common_errors": [
          "Correctly identifying morphemes but not cross-checking the predicted meaning against the sentence context",
          "Confusing 'bio-' with 'bi-' and guessing the word relates to two things rather than living things"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Actively and automatically using morphological analysis and etymological knowledge to determine the meanings of unfamiliar words across all subjects, connecting words within families and using this knowledge to support accurate spelling.",
        "example_task": "Read this passage from a history text: 'The monarch ruled as an autocrat, with no democratic accountability to the people.' Identify two words with Greek or Latin roots, explain how the roots reveal the meaning, and connect each to at least two other words from the same root family.",
        "example_response": "Autocrat: 'auto' is Greek for self (as in autobiography, automatic) and 'crat' is from 'kratos' meaning power or rule (as in democrat, bureaucrat). So an autocrat is someone who rules by themselves, with all the power. Democratic: 'demo' is Greek for people (as in demographic, epidemic) and 'cratic' is again from 'kratos'. So democratic means power held by the people. Knowing 'kratos' means power helps me understand the whole 'cracy' word family and reminds me that the spelling is '-crat' not '-krat' because it comes through Latin.",
        "common_errors": [
          "Defining the word correctly from context but failing to identify the specific roots and connect them to other words in the family",
          "Knowing individual root meanings but not synthesising them fluently to decode a compound word in real time"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Drawing on morphological and etymological knowledge flexibly to decode highly complex or technical vocabulary, explaining why English spelling reflects meaning rather than sound, and teaching vocabulary strategies to others.",
        "example_task": "A Year 4 pupil asks why 'sign' is spelt with a 'g' when you cannot hear it. Using your knowledge of morphology and etymology, write an explanation they could understand. Include at least three words from the same family where the 'g' reappears.",
        "example_response": "The 'g' in 'sign' is not a mistake. It is there because it comes from the Latin word 'signum', which means a mark or symbol. You cannot hear the 'g' in 'sign', but if you think about words from the same family, the 'g' comes back: signal (a sign that tells you something), signature (the sign you write as your name), significant (important enough to be a sign of something), and designate (to mark or point out). English spelling keeps the 'g' because it connects 'sign' to all these related words. The spelling shows meaning, not just sound, and once you know the family, the silent 'g' actually helps you remember how to spell all of them.",
        "common_errors": [
          "Explaining the silent letter pattern correctly for this example but not generalising the principle that English spelling prioritises morphological transparency over phonetic accuracy",
          "Pitching the explanation at too advanced a level for a Year 4 audience, using technical terms like 'morphological transparency' without simplifying"
        ]
      }
    ]
  }
]
