[
  {
    "concept_id": "EN-KS1-C035",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Holding a pencil with a functional grip and making controlled marks on paper.",
        "example_task": "Hold your pencil like this (adult models tripod grip). Draw a line from the star to the circle without going off the path.",
        "example_response": "Child holds pencil with a near-tripod grip and traces the path with reasonable control.",
        "common_errors": [
          "Gripping the pencil in a fist rather than a tripod grip",
          "Pressing too hard or too lightly on the paper"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using a consistent tripod grip and sitting with appropriate posture for writing.",
        "example_task": "Write your name. Check: are you holding your pencil correctly? Is your back straight? Are your feet flat on the floor?",
        "example_response": "Child writes name with tripod grip, sits upright, non-writing hand steadies paper.",
        "common_errors": [
          "Slumping forward with head very close to the paper",
          "Gripping the pencil too close to the point, covering the letters"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Maintaining correct pencil grip and posture consistently during extended writing tasks.",
        "example_task": "Write for 10 minutes about your favourite place. Keep checking your pencil grip and posture.",
        "example_response": "Child maintains good grip and posture throughout, writing fluently without fatigue.",
        "common_errors": [
          "Starting with correct grip but reverting to a tighter or different grip when tired",
          "Posture deteriorating during longer writing sessions"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Writing with speed and stamina while maintaining correct grip, posture, and legibility.",
        "example_task": "Copy this passage as neatly and quickly as you can in 5 minutes.",
        "example_response": "Child writes fluently with consistent grip, good posture, and legible handwriting throughout the timed task.",
        "common_errors": [
          "Sacrificing grip or posture for speed",
          "Legibility declining significantly as writing speed increases"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C036",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Forming some lower-case letters recognisably, starting from the correct position with adult support.",
        "example_task": "Watch me write the letter 'a'. Now you try. Start at the top of the round part.",
        "example_response": "Child forms a recognisable 'a' starting from the correct position.",
        "common_errors": [
          "Starting the letter from the bottom instead of the top",
          "Forming the letter as a recognisable shape but using incorrect stroke direction"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Forming most lower-case letters correctly using the appropriate start point and stroke direction.",
        "example_task": "Write these letters: a, d, g, m, s, t. Start each one from the correct place.",
        "example_response": "Child forms all six letters with correct start points and recognisable formation.",
        "common_errors": [
          "Reversing 'b' and 'd' or 's' and 'z'",
          "Forming round letters (a, d, g) clockwise instead of anticlockwise"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Forming all 26 lower-case letters correctly, consistently, and at an appropriate size.",
        "example_task": "Write the whole alphabet in lower-case on the line. Make sure every letter starts from the right place.",
        "example_response": "Child writes all 26 letters with correct formation, consistent size, and sitting on the baseline.",
        "common_errors": [
          "One or two persistent formation errors (commonly b/d reversal or incorrect 'k' formation)",
          "Letters correctly formed in isolation but inconsistent in connected writing"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Forming all letters fluently with correct formation maintained at speed in independent writing.",
        "example_task": "Write three sentences about your favourite animal. I will check that every letter is formed correctly even when you are writing quickly.",
        "example_response": "Child writes fluently with consistent, correct letter formation throughout, even when concentrating on content.",
        "common_errors": [
          "Correct formation in handwriting practice but reverting to shortcuts in independent writing",
          "Most letters well-formed but one or two consistently incorrect under pressure"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C037",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Practising the shared movement pattern for one letter family (e.g., the 'c' family: c, a, d, o).",
        "example_task": "All these letters start with the same shape — a 'c' curl. Practise: c, a, d, o.",
        "example_response": "Child forms each letter starting with the anticlockwise curve.",
        "common_errors": [
          "Not seeing the connection between the letters in the family",
          "Starting 'a' from a different position than 'c' and 'd'"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Forming letters from two or more letter families with the correct shared movement patterns.",
        "example_task": "Write these letters from the down-stroke family: l, i, t, u. Then write these from the round family: c, a, d, o.",
        "example_response": "Child forms all letters using the correct family movement pattern for each group.",
        "common_errors": [
          "Mixing up the movement pattern from one family when writing another",
          "Forming letters correctly but not recognising which family they belong to"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Sorting all letters into their formation families and using family knowledge to form letters consistently.",
        "example_task": "Sort these letters into their families: n, c, l, a, h, o, t, b. How are the letters in each family similar?",
        "example_response": "Round family: c, a, o. Down-stroke family: l, t. Retrace family: n, h, b. 'They start with the same movement.'",
        "common_errors": [
          "Sorting most letters correctly but misplacing one or two",
          "Sorting correctly but not being able to describe the shared movement"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using letter family knowledge to self-correct formation errors and to help peers improve their handwriting.",
        "example_task": "Your partner is forming the letter 'a' by starting at the bottom. Which letter family does 'a' belong to? How would you help them fix it?",
        "example_response": "'The letter \"a\" is in the round family with c, d, g, o. They all start with the same anticlockwise curve at the top. I would tell them to start like a \"c\" and then add the down stroke.'",
        "common_errors": [
          "Knowing the correct formation but not being able to explain it to a peer",
          "Identifying the family but not connecting it to a fix for the error"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C038",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Forming some capital letters recognisably, beginning with the letters in the child's own name.",
        "example_task": "Write the capital letter that starts your name.",
        "example_response": "Child forms the capital letter recognisably (e.g., 'S' for Sam).",
        "common_errors": [
          "Forming the capital letter the same as the lower-case version but larger",
          "Starting the letter from the bottom instead of the top"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Forming common capital letters correctly (those used for names, days of the week).",
        "example_task": "Write the capital letters for the days of the week: M, T, W, T, F, S, S.",
        "example_response": "Child forms M, T, W, F, S correctly from the top.",
        "common_errors": [
          "Forming 'S' or 'W' using lower-case movement patterns",
          "Making capitals the same size as lower-case letters"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Forming all 26 capital letters correctly, at the appropriate size, distinct from their lower-case forms.",
        "example_task": "Write the alphabet in capital letters. Make sure each one looks different from the lower-case version.",
        "example_response": "Child writes all 26 capitals correctly, clearly larger than lower-case and with correct formation.",
        "common_errors": [
          "Confusing capital and lower-case forms of similar letters (S/s, K/k, C/c)",
          "Making some capitals too small or the same size as lower-case"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using capital letters fluently and correctly in all writing contexts, never mixing cases inappropriately.",
        "example_task": "Write a short paragraph about your school. Use capital letters only where they are needed.",
        "example_response": "Child uses capitals correctly for sentence starts, proper nouns and 'I', never mixing cases within words.",
        "common_errors": [
          "Using capitals for emphasis or decoration rather than grammatical purpose",
          "Occasionally mixing a capital into the middle of a word"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C039",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Forming the digits 0-9 recognisably with some adult guidance on starting position.",
        "example_task": "Write the numbers 1 to 9. Start each number from the top.",
        "example_response": "Child forms all nine digits recognisably.",
        "common_errors": [
          "Reversing digits, particularly 3, 5 and 7",
          "Starting digits from the bottom rather than the top"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Forming all digits 0-9 with correct start points and consistent size.",
        "example_task": "Write these numbers clearly: 2, 3, 5, 7, 8. Make sure none are reversed.",
        "example_response": "Child forms all digits correctly with no reversals.",
        "common_errors": [
          "Persistent reversal of 3 or 5",
          "Inconsistent sizing — some digits much larger or smaller than others"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Writing digits 0-9 fluently, correctly and consistently in maths and other contexts.",
        "example_task": "Write the answer to these sums neatly: 14 + 23 = ___, 35 + 17 = ___.",
        "example_response": "Child writes '37' and '52' with correctly formed, consistently sized digits.",
        "common_errors": [
          "Digits correctly formed in handwriting practice but rushed and unclear in maths work",
          "Confusing 6 and 9 when writing quickly"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Forming digits with fluency and consistency in all contexts, including two- and three-digit numbers with correct place value spacing.",
        "example_task": "Write these numbers clearly with correct spacing: 108, 246, 350.",
        "example_response": "Child writes all numbers with correctly formed, evenly spaced digits and consistent sizing.",
        "common_errors": [
          "Digits too close together or too far apart, making place value unclear",
          "Correct individual digit formation but poor alignment"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C040",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Writing letters on a baseline with some attempt at consistent size, using wide-lined paper.",
        "example_task": "Write your name on the line. Try to make all the small letters the same height.",
        "example_response": "Child writes name on the baseline with letters of approximately similar size.",
        "common_errors": [
          "Letters floating above the baseline or sinking below it",
          "All letters the same size regardless of ascenders and descenders"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writing letters with correct relative sizing — x-height letters smaller than ascenders, descenders below baseline.",
        "example_task": "Write the word 'happy'. Make sure the 'h' is taller than the other letters and the 'y' goes below the line.",
        "example_response": "Child writes 'happy' with 'h' as an ascender (tall), 'a', 'p', 'p' at x-height, and 'y' descending below the baseline.",
        "common_errors": [
          "Making 'h' the same height as 'a' and 'p'",
          "Not dropping the 'y' below the baseline"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Writing with consistent letter sizing and proportion, clearly distinguishing ascenders, descenders and x-height letters on lined paper.",
        "example_task": "Write this sentence on lined paper: 'The big dog jumped high.' Check that tall letters touch the top line and tails go below the bottom line.",
        "example_response": "Child writes with consistent proportion: b, d, j, h as ascenders, g, j, p as descenders, all other letters at x-height.",
        "common_errors": [
          "Inconsistent sizing — some ascenders tall, others the same as x-height letters",
          "Descenders not dropping enough below the baseline"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Maintaining correct letter sizing and proportion consistently in extended independent writing across all subjects.",
        "example_task": "Write a half-page description of your classroom. I will check that your letter sizes stay consistent throughout.",
        "example_response": "Child maintains consistent letter sizing, proportion and spacing throughout the extended piece of writing.",
        "common_errors": [
          "Starting with good proportion but letters becoming uneven towards the end of the piece",
          "Correct proportion on lined paper but losing it when lines are narrower"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C041",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Practising the basic diagonal join from one letter to another in simple letter pairs.",
        "example_task": "Practise joining these letter pairs: 'in', 'an', 'it'.",
        "example_response": "Child makes a diagonal joining stroke from the first letter to the second, keeping both letters recognisable.",
        "common_errors": [
          "Lifting the pen between letters instead of maintaining the join",
          "Distorting the second letter because of the joining stroke"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using diagonal and horizontal joins in common words, maintaining legibility.",
        "example_task": "Write these words in joined handwriting: 'the', 'and', 'was', 'will'.",
        "example_response": "Child joins the letters within each word with appropriate diagonal and horizontal strokes.",
        "common_errors": [
          "Joining some letters but printing others within the same word",
          "Joins that distort letter shapes, making the word difficult to read"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using joined handwriting consistently in independent writing, knowing which letters are best left unjoined.",
        "example_task": "Write three sentences about your holiday using joined handwriting throughout.",
        "example_response": "Child writes in consistent joined handwriting, with appropriate joins and correct breaks for letters that don't join well.",
        "common_errors": [
          "Attempting to join every letter, including combinations that don't work well",
          "Reverting to print in independent writing despite joining in practice sessions"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Writing fluently in a consistent joined style that is both legible and efficient, maintaining quality at speed.",
        "example_task": "Copy this passage in your best joined handwriting, then write it again as fast as you can while keeping it neat.",
        "example_response": "Child produces legible joined writing at both normal and increased speed, with consistent joining patterns.",
        "common_errors": [
          "Legible at normal pace but illegible when speed increases",
          "Correct joins but letter formation deteriorating at speed"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS1-C042",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Using a finger space between words with a physical spacer or finger placed on the page.",
        "example_task": "Write 'I like cats.' Put your finger between each word to make a space.",
        "example_response": "Child writes 'I like cats.' with visible spaces between words, using finger as a guide.",
        "common_errors": [
          "Running all words together: 'Ilikecats'",
          "Using finger spaces inconsistently — some gaps large, some nonexistent"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Leaving consistent word spaces without needing a physical spacer.",
        "example_task": "Write this sentence without using a finger spacer: 'The big dog ran fast.'",
        "example_response": "Child writes with clear, consistent spaces between all words.",
        "common_errors": [
          "Spaces between some words but not others",
          "Very large spaces that disrupt the flow of the sentence"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Maintaining consistent, appropriate word spacing in all independent writing.",
        "example_task": "Write five sentences about your best friend. I will check your spacing throughout.",
        "example_response": "Child writes with consistent, appropriate word spacing across all five sentences.",
        "common_errors": [
          "Spacing becoming inconsistent when writing quickly or concentrating on content",
          "Spaces within words (e.g., 'be cause' instead of 'because')"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Maintaining correct spacing consistently in extended writing, with spacing proportional to letter size and appropriate for joined handwriting.",
        "example_task": "Write a full page in joined handwriting. Check that your word spaces are clear but not too wide.",
        "example_response": "Child maintains consistent, proportionate spacing throughout a full page of joined writing.",
        "common_errors": [
          "Spacing that is correct in print but too wide or too narrow in joined writing",
          "Word spaces that vary in width across the page"
        ]
      }
    ]
  }
]