[
  {
    "concept_id": "EN-Y4-C042",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Discussing features of a model text before attempting to write something similar.",
        "example_task": "Read this model newspaper report. List three features you notice about how it is organised.",
        "example_response": "1. It has a headline that grabs attention. 2. The first paragraph answers who, what, where and when. 3. It includes quotes from witnesses.",
        "common_errors": [
          "Listing content rather than structural features",
          "Noticing only one or two features"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using a model text to create a structured plan that identifies sections, key vocabulary and sentence types to use.",
        "example_task": "Use this model letter of complaint as a basis for planning your own. Identify the structure, useful vocabulary and sentence types.",
        "example_response": "Structure: 1) Formal greeting, 2) State the problem, 3) Explain what happened, 4) Say what you want done, 5) Formal sign-off. Vocabulary: disappointed, unacceptable, request, replacement, promptly. Sentence types: formal statements, polite requests ('I would be grateful if...').",
        "common_errors": [
          "Planning content only without noting structural or language features from the model",
          "Copying the model's content rather than its pattern"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Analysing how structure, vocabulary and grammar serve purpose and audience in a model text, then applying these features to own writing plan.",
        "example_task": "Study this persuasive speech. Identify how the writer uses structure, vocabulary and grammar to persuade. Then plan your own persuasive speech on a different topic using the same techniques.",
        "example_response": "The model uses: a rhetorical question opening to engage the audience, three main arguments each in their own paragraph, emotive vocabulary ('devastating', 'innocent'), and modal verbs to urge action ('we must', 'we should'). My plan: Open with 'How would you feel if...?', three paragraphs on my reasons, emotive vocabulary relevant to my topic, closing with 'we must act now'.",
        "common_errors": [
          "Noting features superficially without understanding how they serve the purpose",
          "Planning content without incorporating the techniques identified"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating multiple model texts for the same purpose, identifying which techniques are most effective, and combining the best features into a plan.",
        "example_task": "Read two different persuasive letters on the same topic. Which is more effective and why? Create a plan that combines the strongest features of both.",
        "example_response": "Letter A has a stronger opening — it uses a statistic that shocks the reader. Letter B has better structure — each paragraph builds on the last. Letter A repeats the same point too much, while Letter B introduces new arguments each time. My plan combines Letter A's shocking opening statistic with Letter B's progressive argument structure, and I'll add my own concluding call to action.",
        "common_errors": [
          "Choosing one model as 'better' without analysing specific features",
          "Not combining features — just copying one model's approach"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C043",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Generating a simple list of ideas through brainstorming before writing.",
        "example_task": "You are going to write a story set in a jungle. Brainstorm five ideas for things that could happen.",
        "example_response": "1. Find a hidden temple. 2. Meet a talking parrot. 3. Get lost in the trees. 4. Discover a river with a waterfall. 5. Hear strange sounds at night.",
        "common_errors": [
          "Only generating one or two ideas",
          "Writing full sentences instead of quick idea notes"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using discussion, research or drama to generate and explore ideas before selecting the best ones for writing.",
        "example_task": "Before writing your non-fiction report about volcanoes, use a mind map to collect ideas from the class discussion and your research book. Then star the three most important ideas.",
        "example_response": "[Mind map with branches: Types of volcano, How they erupt, Famous eruptions, Where they are found, Effects on people, Effects on landscape. Stars next to: How they erupt, Famous eruptions, Effects on people — these are the most interesting for the reader.]",
        "common_errors": [
          "Including everything without selecting the most important ideas",
          "Not using the discussion or research to generate ideas — relying on prior knowledge only"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Generating ideas through multiple strategies, selecting and organising them for a specific purpose and audience.",
        "example_task": "You are writing a balanced discussion about whether school should start later. Generate ideas by listing arguments for AND against, then organise them into a plan.",
        "example_response": "For: children are tired in the morning (research shows teenagers need more sleep), better concentration later in the day, less rushing means less stress. Against: parents need to get to work, after-school clubs would finish later, less daylight after school in winter. Plan: Introduction (the debate), paragraph for, paragraph against, my conclusion (weigh the strongest arguments).",
        "common_errors": [
          "Generating arguments for only one side",
          "Listing ideas without organising them into a coherent structure"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Independently selecting the most appropriate idea-generation strategy for different writing tasks and explaining why.",
        "example_task": "You have three writing tasks: a story, a persuasive letter, and an information report. Which idea-generation strategy would work best for each?",
        "example_response": "Story — I'd use drama/hot-seating to explore my character's personality, because understanding the character helps me write better dialogue and actions. Persuasive letter — I'd research the facts first, because strong persuasion needs evidence, not just opinions. Information report — I'd use a mind map to organise what I already know and identify gaps I need to research. Each strategy matches the purpose of the writing.",
        "common_errors": [
          "Suggesting the same strategy for all three tasks",
          "Not connecting the strategy to the specific demands of each writing type"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C044",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Saying a sentence aloud before writing it to check it sounds right.",
        "example_task": "Before you write each sentence in your story, say it aloud to your partner. Does it sound like a complete sentence?",
        "example_response": "[Says aloud] 'The dragon swooped down from the mountain and breathed fire over the village.' [Partner confirms] Yes, that's a full sentence and it sounds good.",
        "common_errors": [
          "Writing without rehearsing first",
          "Saying a fragment rather than a complete sentence"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Orally rehearsing sentences that include dialogue, paying attention to how speech sounds natural.",
        "example_task": "Rehearse this dialogue aloud before writing it: a character warns their friend about danger. Say both the speech and the reporting clause.",
        "example_response": "[Says aloud] '\"Run!\" screamed Maya, grabbing her friend's arm. \"There's no time to explain — just run!\"' The speech sounds urgent and natural — she wouldn't use long sentences when she's panicking.",
        "common_errors": [
          "Rehearsing dialogue that sounds like written text rather than natural speech",
          "Forgetting to include the reporting clause when rehearsing"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Composing and rehearsing varied sentence structures orally, building a rich vocabulary and range of structures before drafting.",
        "example_task": "You are going to write a description of a stormy sea. Rehearse three different opening sentences aloud, each with a different structure. Choose the most effective one.",
        "example_response": "Option 1: 'The waves crashed against the harbour wall.' (simple sentence — direct and punchy). Option 2: 'As the wind howled and the sky darkened, the waves rose higher and higher.' (complex sentence — builds tension). Option 3: 'Crash. The sea hurled itself at the rocks.' (short sentence then longer — dramatic impact). I'll use option 3 because the one-word sentence grabs attention.",
        "common_errors": [
          "Rehearsing only one sentence rather than exploring options",
          "Always choosing the longest sentence as the 'best' one"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Rehearsing sequences of sentences to control pace and rhythm, understanding how writing differs from speech in its structure.",
        "example_task": "Rehearse a short paragraph of dialogue between two characters arguing. Make it sound natural but different from how real people actually argue. Explain the difference.",
        "example_response": "'\"You promised,\" said Lena, her voice barely above a whisper. \"I trusted you.\" Marcus turned away. \"I know,\" he said. \"But it wasn't that simple.\"' Real arguments are messier — people talk over each other, repeat themselves, and use lots of 'um' and 'like'. In writing, I cut all that out. Each line reveals something about the character. The pauses and actions between speech do work that facial expressions do in real life.",
        "common_errors": [
          "Writing dialogue that sounds exactly like real speech (too messy for written narrative)",
          "Not understanding that written dialogue is a crafted version of speech, not a transcript"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C045",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Understanding that a new paragraph signals a change and grouping related sentences together.",
        "example_task": "This piece of writing has no paragraphs. Mark where you think each new paragraph should start and explain why.",
        "example_response": "New paragraph at: 'The next morning...' (change of time), 'Meanwhile, in the castle...' (change of place), '\"Stop!\" shouted the guard.' (new speaker). Each new paragraph shows something has changed.",
        "common_errors": [
          "Starting a new paragraph after every sentence",
          "Not recognising time, place or topic changes as paragraph triggers"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Planning writing in paragraphs before drafting, with each paragraph focused on one main idea or event.",
        "example_task": "Plan a four-paragraph story about a character who finds a mysterious object. Write a one-sentence plan for each paragraph.",
        "example_response": "Paragraph 1: Setting the scene — Anya walks home through the park after school. Paragraph 2: The discovery — She finds a strange glowing stone under a bench. Paragraph 3: The problem — The stone starts making a humming sound and she can't put it down. Paragraph 4: The resolution — She takes it to the museum and learns it is an ancient artefact.",
        "common_errors": [
          "Planning one long paragraph rather than four focused ones",
          "Paragraphs that overlap in content"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Organising extended writing into well-structured paragraphs in both narrative and non-narrative texts, using paragraph breaks appropriately for changes in time, place, topic or speaker.",
        "example_task": "Write a four-paragraph newspaper report about a school event. Each paragraph should have a clear focus.",
        "example_response": "Paragraph 1: 'St Mary's Primary held its annual Science Fair on Friday, with over 200 visitors...' (overview). Paragraph 2: 'The highlight was Year 4's volcano demonstration...' (main event). Paragraph 3: 'Head teacher Mrs Khan said, \"I am incredibly proud of our pupils...\"' (quotes/reactions). Paragraph 4: 'The school plans to make the Science Fair an annual tradition...' (future plans).",
        "common_errors": [
          "Uneven paragraphs — one very long, others very short",
          "Breaking paragraphs in the middle of an idea"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using paragraph length deliberately for effect, and linking paragraphs with cohesive devices.",
        "example_task": "Write a short passage where you use a one-sentence paragraph for dramatic effect. Explain your choice.",
        "example_response": "'The old house had been empty for forty years. Cobwebs draped every surface and dust hung in the air like fog. The floorboards groaned under their weight as they crept through the hallway, past the boarded-up windows and the peeling wallpaper.\n\nThen the lights came on.\n\nFor a moment, nobody moved. The chandelier blazed above them as if it had never stopped working, casting sharp shadows across the walls.' I used a one-sentence paragraph for 'Then the lights came on' to create a moment of shock — the white space around it makes the reader pause, just as the characters would.",
        "common_errors": [
          "Using one-sentence paragraphs so often they lose their impact",
          "Not connecting the paragraph-length choice to the intended effect"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C046",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Including basic setting, character and plot elements in a story.",
        "example_task": "Write the opening of a story that tells the reader WHERE the story happens, WHO the main character is, and WHAT they want.",
        "example_response": "In a small village by the sea, there lived a girl called Nia. She had dark curly hair and loved to explore. More than anything, Nia wanted to find the hidden cave her grandmother had told her about.",
        "common_errors": [
          "Missing one of the three elements (usually setting)",
          "Describing the character's appearance but not their goal or personality"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Developing character through action and dialogue, and creating a setting using sensory detail.",
        "example_task": "Rewrite this flat sentence as a paragraph: 'The boy went into the scary forest.' Show the setting and show that the boy is scared — don't tell the reader.",
        "example_response": "Tom pushed through the tangled branches, flinching as twigs scratched his arms. Above him, the trees blocked out the sky and the air turned cold. Something rustled in the undergrowth. He stopped. His heart hammered. 'Keep going,' he whispered to himself. 'Don't look back.'",
        "common_errors": [
          "Telling emotions ('he was scared') instead of showing them",
          "Describing the setting without connecting it to the character's experience"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Creating settings, characters and plots that work together to form a coherent narrative with a problem, complication and resolution.",
        "example_task": "Write a complete short story (about one page) with a clear problem, a complication that makes it worse, and a resolution.",
        "example_response": "[Story with: Opening that establishes character and setting. Problem: character discovers something is missing. Complication: the obvious solution fails, making things worse. Climax: the character has to take a risk or make a difficult choice. Resolution: the problem is solved in a way that shows the character has learned something.]",
        "common_errors": [
          "Rushing to the resolution without developing the complication",
          "Including a complication that is resolved too easily"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Making deliberate authorial choices about how to develop setting, character and plot, and explaining the effects of those choices.",
        "example_task": "Write the climax of your story in two different ways: one where the character succeeds, and one where the character fails. Which is more effective for your story?",
        "example_response": "Version A (success): 'Nia reached into the gap and her fingers closed around the key. It fit. The door swung open, and golden light poured out.' Version B (failure): 'Nia reached into the gap, but her fingers found only dust. The key was gone. She sank to her knees as the truth settled over her — she was too late.' Version B is more effective because my story is about loss and growing up. A happy ending would feel too easy. The character learning to cope with failure is more powerful than finding the treasure.",
        "common_errors": [
          "Always choosing the happy ending without considering alternatives",
          "Not connecting the plot choice to the story's theme"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C047",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Using headings and subheadings to organise a simple non-fiction text.",
        "example_task": "Write an information page about your favourite animal. Use a main heading and at least two subheadings.",
        "example_response": "Heading: All About Dolphins. Subheading 1: What do dolphins look like? Subheading 2: Where do dolphins live? Subheading 3: What do dolphins eat?",
        "common_errors": [
          "Forgetting to include subheadings",
          "Subheadings that do not match the content beneath them"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Choosing appropriate organisational devices for different non-fiction text types.",
        "example_task": "You are writing instructions for making a bird feeder. What organisational devices would help the reader?",
        "example_response": "A 'You will need' list at the top with bullet points for materials. Numbered steps for the method, in order. A labelled diagram showing the finished bird feeder. A 'Top tip' box at the end with extra advice.",
        "common_errors": [
          "Using the same devices for all text types",
          "Adding devices after writing rather than using them to organise from the start"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using a range of organisational devices purposefully to aid the reader's navigation and understanding.",
        "example_task": "Write a non-chronological report about Ancient Egypt. Use at least four different organisational devices and explain why you chose each one.",
        "example_response": "Title: 'Life in Ancient Egypt'. Subheadings for each section ('Daily Life', 'Religion', 'Farming', 'Building the Pyramids') — so the reader can find the topic they want. A fact box with key dates — to highlight the most important information. A labelled diagram of a pyramid — because the structure is easier to understand visually. A glossary of Egyptian words — because specialist vocabulary needs explaining.",
        "common_errors": [
          "Using devices decoratively rather than functionally",
          "Not explaining why each device serves the reader"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating which organisational devices best serve a specific purpose and audience, adapting choices accordingly.",
        "example_task": "You have written a report about space. Now you need to adapt it for two audiences: a class display for Year 2 children, and a page for the school website for parents. What would you change about the organisational devices?",
        "example_response": "For Year 2: larger subheadings with simpler words, more pictures and diagrams with labels, a glossary of key words with child-friendly definitions, fact boxes with WOW facts to engage younger readers. For parents on the website: hyperlinked contents so they can jump to sections, embedded video links, longer paragraphs with more detail, a 'Further reading' section. The content stays similar but the organisational devices change because the audiences navigate text differently.",
        "common_errors": [
          "Changing content but not organisational devices",
          "Not recognising that different audiences need different navigational support"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C048",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying one strength and one area for improvement in a piece of writing.",
        "example_task": "Read your partner's story opening. Tell them one thing they did well and one thing they could improve.",
        "example_response": "You did well with your description of the setting — I could picture the forest really clearly. You could improve by adding some dialogue so the reader gets to know the character better.",
        "common_errors": [
          "Giving only positive feedback ('it's really good')",
          "Identifying a weakness but not suggesting how to improve it"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Assessing writing against specific success criteria, identifying strengths and suggesting improvements.",
        "example_task": "Use the success criteria to assess this persuasive letter: Does it have a clear opening? At least three arguments? Evidence for each? A polite but firm closing?",
        "example_response": "Opening: Yes — clearly states the purpose. Arguments: Only two — needs a third. Evidence: Argument 1 has a statistic which is strong, but Argument 2 has no evidence — just an opinion. Closing: Yes — polite request for action. Improvement: Add a third argument with evidence, and support Argument 2 with a fact.",
        "common_errors": [
          "Ticking off criteria without genuinely evaluating quality",
          "Focusing only on surface features (spelling, handwriting) rather than content and structure"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Evaluating own and others' writing for effectiveness, identifying strengths in content, structure and language, and proposing specific improvements.",
        "example_task": "Evaluate your own story against these criteria: Does the opening hook the reader? Is the character well-developed? Is the climax exciting? Is the ending satisfying? Write specific notes on what to improve.",
        "example_response": "Opening: The first sentence is a bit boring ('One day, a boy went for a walk'). I'll change it to something that creates mystery ('Nobody told Marcus about the path through the woods. Nobody needed to.'). Character: I've described what he looks like but not how he thinks or feels — I need to add his inner thoughts. Climax: Good — the chase scene is tense. Ending: Too rushed — I need to slow down the resolution.",
        "common_errors": [
          "Evaluating own work as 'good' without critical analysis",
          "Identifying problems without proposing specific solutions"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating how effectively writing achieves its purpose for its intended audience, considering the reader's experience.",
        "example_task": "You wrote a persuasive letter to the council about road safety. Read it as if you were a council member receiving it. Is it persuasive? What would make it more convincing?",
        "example_response": "Reading as a council member: The letter makes good points about speeding cars, but it relies on emotions ('children could get hurt') without data. A council member would want to see evidence — accident statistics, survey results from parents. The tone is a bit too emotional for a formal context. I should add: 'According to local police data, there have been 12 near-misses on this road in the last year.' That would be more convincing for this audience.",
        "common_errors": [
          "Evaluating from the writer's perspective rather than the reader's",
          "Not considering how the audience would receive the writing"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C049",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Replacing a repeated word with a more precise or varied alternative.",
        "example_task": "This sentence uses 'nice' three times: 'The nice girl had a nice day at the nice park.' Replace each 'nice' with a better word.",
        "example_response": "The friendly girl had a wonderful day at the beautiful park.",
        "common_errors": [
          "Replacing with another vague word ('good' instead of 'nice')",
          "Using the same replacement word for all three"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Editing sentences to improve grammar and vocabulary, including replacing weak verbs and adding precise details.",
        "example_task": "Improve this sentence: 'The man went down the road and got to the shop and got some bread.'",
        "example_response": "The old man hurried along the cobbled street until he reached the baker's, where he bought a warm loaf of bread.",
        "common_errors": [
          "Only changing one word rather than improving the whole sentence",
          "Adding detail that doesn't serve the sentence's purpose"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Editing own writing to improve consistency of tense, clarity of pronoun reference, and precision of vocabulary.",
        "example_task": "Edit this paragraph, correcting the tense inconsistencies and unclear pronoun references: 'Maya picks up the stone. She looked at it carefully. Her friend comes over. She said it was glowing.'",
        "example_response": "Maya picked up the stone. She looked at it carefully. Her friend Layla came over. 'It's glowing,' Layla said. [Changed present to past tense throughout. Clarified 'She said' — was it Maya or the friend? Named the friend to avoid ambiguity.]",
        "common_errors": [
          "Fixing one type of error but missing others",
          "Changing tense inconsistently"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Making substantive revisions to improve the overall quality, flow and impact of a piece of writing, not just correcting surface errors.",
        "example_task": "Read your first draft. Find one paragraph where the writing could have more impact. Rewrite it, making at least three specific improvements, and explain what you changed.",
        "example_response": "Original: 'The room was dark. There were spiders. It was scary. I didn't want to go in.' Revised: 'Darkness swallowed the room beyond the doorway. Cobwebs hung like grey curtains, and something scuttled in the corner. Every instinct screamed at me to turn back.' Changes: 1) Replaced 'was dark' with a metaphor ('darkness swallowed'). 2) Added specific sensory detail ('cobwebs hung', 'something scuttled'). 3) Replaced telling ('It was scary') with showing ('every instinct screamed at me').",
        "common_errors": [
          "Making surface changes (swapping adjectives) rather than substantive revisions",
          "Explaining changes in vague terms rather than naming specific techniques"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C050",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Re-reading a piece of writing to spot and correct obvious spelling mistakes.",
        "example_task": "Read through your writing and circle any words that don't look right. Try to correct them.",
        "example_response": "[Circles 'becuase' → because, 'thier' → their, 'diffrent' → different]",
        "common_errors": [
          "Skim-reading too quickly and missing errors",
          "Circling words but not knowing the correct spelling"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Proof-reading for both spelling and punctuation errors, checking sentence boundaries.",
        "example_task": "Proof-read this passage and correct all errors: 'the children went too the park they played on the swings. then they went home for there tea'",
        "example_response": "The children went to the park. They played on the swings. Then they went home for their tea. [Corrections: capital T for 'the', 'too' → 'to', added full stop after 'park', capital T for 'then', 'there' → 'their'.]",
        "common_errors": [
          "Fixing spelling but missing punctuation, or vice versa",
          "Not recognising that 'too/to' and 'there/their' are different words"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Systematically proof-reading own writing using a multi-pass approach: one pass for spelling, one for punctuation, one for grammar.",
        "example_task": "Proof-read your report using three passes. Pass 1: touch each word and check the spelling. Pass 2: check every sentence starts with a capital and ends with correct punctuation. Pass 3: read aloud to check grammar makes sense.",
        "example_response": "[Pass 1 catches: 'goverment' → government, 'enviroment' → environment. Pass 2 catches: missing full stop at end of paragraph 2, comma splice in paragraph 3 (needs full stop or conjunction). Pass 3 catches: 'The group was going there things' → 'The group were taking their things' — wrong verb form and homophone.]",
        "common_errors": [
          "Doing one quick read rather than three focused passes",
          "Finding errors in the first paragraph but becoming less careful towards the end"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Proof-reading with a year-group-specific checklist and explaining the rules behind corrections made.",
        "example_task": "Proof-read this passage for Year 4 specific errors: apostrophes, fronted adverbials with commas, speech punctuation, and homophones. Explain each correction.",
        "example_response": "'Carefully the fox crept forward. \"whose been eating my food\" it asked. The foxs eyes narrowed.' Corrections: 1) 'Carefully,' — add comma after fronted adverbial. 2) '\"Whose' → '\"Who's' — contraction of 'who has', not possessive. 3) Add capital W for start of speech, question mark before closing speech marks. 4) 'The foxs' → 'The fox's' — possessive apostrophe (the eyes belong to the fox).",
        "common_errors": [
          "Correcting errors but not being able to explain the rule",
          "Missing the less obvious errors while catching the simple ones"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C051",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Reading own writing aloud clearly enough for others to hear and understand.",
        "example_task": "Stand up and read your story to your group. Make sure everyone can hear you.",
        "example_response": "[Reads at appropriate volume, looking up occasionally, pausing at full stops]",
        "common_errors": [
          "Reading too quietly for the group to hear",
          "Rushing through without pausing at sentence boundaries"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Reading own writing aloud with expression, varying pace and tone to match the mood.",
        "example_task": "Read your story aloud to the class. Use your voice to show the exciting parts and the quiet parts.",
        "example_response": "[Reads description slowly and calmly, speeds up for the chase scene, pauses dramatically before the reveal, reads dialogue in different voices]",
        "common_errors": [
          "Reading in a monotone throughout",
          "Using a 'performance voice' that sounds unnatural"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Presenting writing to a group or class with appropriate intonation that conveys meaning, controlling tone and volume effectively.",
        "example_task": "Present your persuasive speech to the class. Use your voice to emphasise key points and engage your audience.",
        "example_response": "[Varies volume — louder for key statistics, quieter for emotional appeal. Pauses after rhetorical questions. Makes eye contact. Emphasises repeated phrases for persuasive effect. Slows down for the conclusion.]",
        "common_errors": [
          "Reading the speech rather than presenting it",
          "Not varying delivery to match the persuasive purpose"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using the experience of reading aloud to identify areas for improvement in own writing, recognising how writing sounds when spoken.",
        "example_task": "Read your writing aloud, then identify two places where the writing didn't sound as good as you expected. Explain what you would change and why.",
        "example_response": "When I read paragraph 2 aloud, I noticed three sentences all started with 'The...' which sounded repetitive. I'll vary the openings — change one to a fronted adverbial. Also, my dialogue on page 2 sounded unnatural when spoken — nobody says 'I am going to proceed to the park.' I'll change it to 'I'm going to the park' because characters should sound like real people.",
        "common_errors": [
          "Reading aloud but not using the experience to improve the writing",
          "Only noticing surface errors (stumbling on words) rather than compositional weaknesses"
        ]
      }
    ]
  }
]