[
  {
    "concept_id": "EN-Y3-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Listening to a short teacher instruction and responding appropriately, demonstrating basic attention skills.",
        "example_task": "Listen to these two instructions: 'Pick up your whiteboard and write the date.' Now do them.",
        "example_response": "Child follows both instructions in order without needing them repeated.",
        "common_errors": [
          "Completing only the first instruction and forgetting the second",
          "Starting to act before the full instruction has been given"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Listening to a peer's contribution in discussion and responding with a relevant comment or question.",
        "example_task": "Listen to your partner's idea about the story character. Respond by saying whether you agree or disagree, and why.",
        "example_response": "'I agree with you that the character was brave because she went into the cave even though she was scared. But I think she was also a bit foolish because she didn't tell anyone where she was going.'",
        "common_errors": [
          "Responding with an unrelated personal anecdote instead of addressing what was said",
          "Saying 'I agree' without elaborating or giving a reason"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Listening attentively to longer spoken contributions, identifying key points and responding with relevant, considered comments.",
        "example_task": "Listen to the teacher read a two-paragraph explanation about volcanoes. Afterwards, tell your partner the two main points.",
        "example_response": "'The first point was that volcanoes form where tectonic plates meet. The second was that the lava comes from melted rock deep underground.'",
        "common_errors": [
          "Remembering only the last thing said rather than the main points",
          "Confusing supporting details with main ideas"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Listening critically to extended contributions, identifying strengths and weaknesses in arguments, and asking probing follow-up questions.",
        "example_task": "Listen to a classmate's persuasive speech about banning homework. Identify their strongest argument and ask a question that challenges their weakest point.",
        "example_response": "'Your strongest point was that children need time to play and relax. But you said homework is never useful — what about practising spellings or times tables? Isn't that useful?'",
        "common_errors": [
          "Commenting on presentation style rather than content",
          "Asking a question already answered in the speech because they weren't listening carefully"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Asking a factual question about a topic or text using a question word (who, what, where, when).",
        "example_task": "We've read about Ancient Egypt. Ask one question using 'who', 'what', 'where' or 'when'.",
        "example_response": "'Where were the pyramids built?'",
        "common_errors": [
          "Making a statement instead of asking a question",
          "Asking a question they already know the answer to"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Asking open-ended questions using 'why' and 'how' that promote deeper thinking about a text or topic.",
        "example_task": "Ask a 'why' or 'how' question about the character's actions in the story we just read.",
        "example_response": "'Why did the character choose to help the stranger even though it put her in danger?'",
        "common_errors": [
          "Asking closed questions that only need yes/no answers",
          "Asking 'why' but about a trivial detail rather than something that extends understanding"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Formulating questions that genuinely extend understanding, distinguishing between literal and inferential questions.",
        "example_task": "Write two questions about this text: one that can be answered from the text and one that requires thinking beyond the text.",
        "example_response": "Literal: 'What was the character's name?' Inferential: 'Why do you think the author chose to set the story in winter — what effect does it create?'",
        "common_errors": [
          "Writing two literal questions rather than distinguishing the types",
          "Writing an inferential question that is actually answerable directly from the text"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Generating higher-order questions that evaluate, analyse or synthesise ideas across texts or topics.",
        "example_task": "We've read two stories about friendship. Generate a question that makes the class think about both stories together.",
        "example_response": "'Both stories show a friendship being tested. Which friendship do you think is stronger, and what evidence from both texts supports your answer?'",
        "common_errors": [
          "Asking a question about only one text rather than connecting both",
          "Generating a complex-sounding question that is actually superficial"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Using picture context to work out the meaning of an unfamiliar word encountered in reading.",
        "example_task": "The text says the explorer was 'exhausted'. Look at the picture — what does 'exhausted' mean?",
        "example_response": "'Really, really tired — the picture shows him lying down and his eyes are closed.'",
        "common_errors": [
          "Saying 'I don't know' without using available clues",
          "Giving a vague synonym ('tired') without indicating degree"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using sentence context and word parts (root words, prefixes, suffixes) to infer the meaning of unfamiliar words.",
        "example_task": "The text says: 'The path was impassable because of the fallen trees.' What does 'impassable' mean? How can you work it out?",
        "example_response": "'I can see \"pass\" in the middle, and \"im-\" means \"not\". So impassable means you can't pass through or get past it.'",
        "common_errors": [
          "Skipping the word entirely rather than attempting to work it out",
          "Using context but not word parts, or vice versa"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using multiple strategies (context, morphology, dictionary) to work out unfamiliar words and using new vocabulary in speech and writing.",
        "example_task": "Find three unfamiliar words in this text. For each one, explain what it means and what strategy you used to work it out. Then use one in your own sentence.",
        "example_response": "'\"Desolate\" — I used the context: the description of empty, ruined buildings told me it means deserted and bleak. \"Subterranean\" — I used the prefix \"sub\" meaning under, so it means underground. \"Cascade\" — I used the dictionary: it means a waterfall or flowing rush of water. My sentence: The subterranean cave was dark and cold.'",
        "common_errors": [
          "Relying on only one strategy rather than choosing the most effective one for each word",
          "Working out meanings but not being able to use the words in their own sentences"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Exploring shades of meaning between synonyms, understanding connotation, and selecting precise vocabulary in own writing.",
        "example_task": "What is the difference between 'said', 'whispered', 'declared' and 'muttered'? When might you choose each one in a story?",
        "example_response": "'Said is neutral. Whispered means speaking very quietly, maybe secretly. Declared means saying something loudly and confidently, like making an announcement. Muttered means speaking quietly and unclearly, often when annoyed. In a story, I'd use \"whispered\" for a secret, \"declared\" for a king making a law, and \"muttered\" for a grumpy character.'",
        "common_errors": [
          "Defining all four as 'ways of talking' without distinguishing connotation",
          "Understanding differences but defaulting to 'said' in own writing"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Stating an opinion and giving a simple reason using 'because'.",
        "example_task": "Did you enjoy this book? Give your opinion using 'I think... because...'",
        "example_response": "'I think this book was exciting because the character went on a dangerous journey and I wanted to know what would happen.'",
        "common_errors": [
          "Giving an opinion without a reason ('I liked it')",
          "Giving a circular reason ('It was good because it was nice')"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Supporting an opinion with a reason and evidence, using the structure: opinion, reason, evidence.",
        "example_task": "Do you think the main character was a good friend? Support your answer with evidence from the story.",
        "example_response": "'I think the character was a good friend because she stayed to help even when it was dangerous. The evidence is on page 23 where she says \"I won't leave you\" even though the flood was coming.'",
        "common_errors": [
          "Giving a reason but not pointing to specific evidence from the text",
          "Giving evidence without connecting it to the opinion"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Justifying opinions with multiple pieces of evidence, anticipating counterarguments, and defending a position in discussion.",
        "example_task": "Argue whether the wolf in this story is a villain. Give at least two pieces of evidence and consider what someone who disagrees might say.",
        "example_response": "'I think the wolf is a villain because he deliberately tricked the grandmother and he tried to eat Little Red Riding Hood. Someone might say he was just hungry, but the story shows he chose to trick people rather than asking for food. That makes him a villain, not just an animal following instinct.'",
        "common_errors": [
          "Giving evidence for their position but not considering the counterargument",
          "Acknowledging the other side but not explaining why their own position is stronger"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Constructing a balanced argument, weighing evidence from multiple sources, and reaching a reasoned conclusion that acknowledges complexity.",
        "example_task": "Should children have more say in what they learn at school? Present both sides and explain your conclusion.",
        "example_response": "'On one hand, children know what they're interested in, and you learn better when you're motivated. On the other hand, teachers know what skills children need for the future, and some important topics aren't immediately exciting. I think children should have some choice — perhaps choosing between topics — but teachers should still decide the core skills.'",
        "common_errors": [
          "Presenting both sides but not reaching a conclusion",
          "Reaching a conclusion without genuinely weighing both sides"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Describing an object or picture using simple sentences with some detail.",
        "example_task": "Describe this picture to your partner so they could draw it without seeing it.",
        "example_response": "'There is a big tree in the middle. A red bird is sitting on a branch. Under the tree there is a pond with a duck.'",
        "common_errors": [
          "Giving only one detail rather than a full description",
          "Describing in random order rather than systematically"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Giving spoken descriptions and explanations with a clear structure using sequence words.",
        "example_task": "Explain to the class how you made your model. Use the words 'first', 'then', 'next', 'after that', 'finally'.",
        "example_response": "'First, I cut out the shapes from cardboard. Then, I folded them along the lines. Next, I stuck the tabs together with glue. After that, I painted it blue. Finally, I added the wheels.'",
        "common_errors": [
          "Missing out key steps in the sequence",
          "Describing what happened without using the sequencing language"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Organising spoken contributions clearly, using appropriate structure for the purpose (description, explanation, recount, argument).",
        "example_task": "Explain to the class why rivers are important. Organise your explanation into three clear points.",
        "example_response": "'Rivers are important for three reasons. Firstly, they provide drinking water for people and animals. Secondly, they are used for transport — boats can carry goods along rivers. Thirdly, rivers create habitats for wildlife like fish, otters and kingfishers.'",
        "common_errors": [
          "Jumping between points without clear organisation",
          "Repeating the same point in different words rather than making three distinct points"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Delivering well-structured spoken explanations adapted for the audience, anticipating questions and including relevant examples.",
        "example_task": "Explain the water cycle to a Year 1 child. Think about what language and examples they would understand.",
        "example_response": "'You know when you boil a kettle and steam comes out? The sun does the same thing to puddles and rivers — it turns water into invisible water vapour that goes up into the sky. Then it gets cold up there, so the water vapour turns back into tiny droplets and makes clouds. When there are too many droplets, they fall as rain.'",
        "common_errors": [
          "Using technical vocabulary without adapting for the younger audience",
          "Simplifying so much that the explanation becomes inaccurate"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C006",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Participating in a paired discussion, taking turns to speak and listen.",
        "example_task": "Discuss with your partner: what was the best part of the story? Take turns — one speaks while the other listens.",
        "example_response": "Child takes turns, listens to partner, and responds relevantly.",
        "common_errors": [
          "Both children speaking at the same time",
          "One child dominating while the other stays silent"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Staying on topic during a group discussion and building on others' contributions.",
        "example_task": "In your group, discuss what makes a good friend. Build on each other's ideas using 'I agree with... and also...' or 'Adding to what... said...'",
        "example_response": "'Adding to what Sam said about being kind, I think a good friend also stands up for you if someone is being mean.'",
        "common_errors": [
          "Making a new unrelated point instead of building on what was said",
          "Going off topic after two or three exchanges"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Engaging in extended discussions, initiating new points, challenging ideas respectfully, and maintaining focus on the topic.",
        "example_task": "Hold a group discussion about whether the school should have a new rule. Everyone must contribute at least twice, and you must respond to each other's points.",
        "example_response": "Child initiates a point, responds to others, challenges an idea politely ('I see what you mean, but...'), and helps keep the group on topic.",
        "common_errors": [
          "Contributing once and then staying silent",
          "Challenging ideas in a way that feels personal rather than respectful"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Facilitating collaborative discussion, synthesising different viewpoints, and reaching a group consensus or acknowledging where agreement is not possible.",
        "example_task": "Lead a discussion about the most important character in the story. Help the group reach a shared view or explain why you couldn't agree.",
        "example_response": "'We discussed three characters. Half the group thinks the grandmother is most important because without her advice the quest would have failed. The others think the youngest brother is most important because he did the actual work. We couldn't fully agree, but we decided the story needs both characters — the guidance and the action.'",
        "common_errors": [
          "Summarising only the dominant view rather than all perspectives",
          "Forcing agreement rather than genuinely synthesising"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C007",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Offering a tentative idea in discussion using speculative language ('maybe', 'I think', 'perhaps').",
        "example_task": "Why do you think the character hid the letter? Start with 'Maybe...' or 'I think...'",
        "example_response": "'Maybe she hid it because she didn't want her parents to find out what she had done.'",
        "common_errors": [
          "Refusing to speculate because they're 'not sure'",
          "Stating ideas as certain facts rather than tentative thoughts"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using talk to think aloud and explore ideas, building on initial speculations with further reasoning.",
        "example_task": "Think aloud about what might happen next in the story. Use phrases like 'What if...', 'I wonder whether...', 'It could be that...'",
        "example_response": "'What if the dragon isn't actually dangerous? It could be that the villagers are scared because they don't understand it. I wonder whether the boy will try to talk to the dragon instead of fighting it. That would be more interesting because...'",
        "common_errors": [
          "Giving a single speculation without developing it further",
          "Dismissing tentative ideas from peers as 'wrong'"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using exploratory talk to develop understanding, trying out different interpretations and refining thinking through discussion.",
        "example_task": "With your partner, explore different reasons why the author chose to end the story this way. Think out loud — it's okay to change your mind.",
        "example_response": "'At first I thought the sad ending was because the author wanted us to feel sorry for the character. But actually, maybe it's a warning — the character ignored everyone's advice and it went wrong. Or perhaps the author is saying that life doesn't always have happy endings. I think it's probably a mix of the warning and the realistic ending.'",
        "common_errors": [
          "Settling on the first interpretation without exploring alternatives",
          "Exploring ideas but not arriving at any refined understanding"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using exploratory talk to develop original ideas, hypothesising and testing ideas against evidence, and recognising when thinking has changed.",
        "example_task": "Discuss: if you were the author, would you have ended the story differently? Explore possibilities and explain how your thinking develops.",
        "example_response": "'Initially I thought a happy ending would be better. But then I thought — if everything worked out perfectly, there would be no lesson. The bittersweet ending makes the reader think more. Actually, I changed my mind during this discussion. The more we talked about it, the more I realised the sad ending is what makes this story memorable.'",
        "common_errors": [
          "Not tracking or acknowledging how their thinking has changed",
          "Hypothesising without testing ideas against the text"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C008",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Speaking clearly enough to be understood by a partner in a quiet setting.",
        "example_task": "Tell your partner about your favourite game. Speak clearly so they can understand every word.",
        "example_response": "Child speaks at an appropriate volume with clear pronunciation for partner conversation.",
        "common_errors": [
          "Speaking too quietly for the partner to hear",
          "Speaking too fast, running words together"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Speaking audibly and clearly in small group and whole class settings, adjusting volume for the context.",
        "example_task": "Share your book recommendation with the whole class. Project your voice so everyone can hear.",
        "example_response": "Child speaks with clear pronunciation and volume appropriate for the whole class.",
        "common_errors": [
          "Speaking at partner volume, too quiet for the class to hear",
          "Shouting rather than projecting"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Speaking fluently and audibly in different contexts, beginning to use Standard English forms in formal situations.",
        "example_task": "Present your research project findings to the class. Speak clearly, at an appropriate pace, and use Standard English.",
        "example_response": "Child presents fluently, varying pace for emphasis, maintaining eye contact, and using Standard English forms.",
        "common_errors": [
          "Speaking fluently in informal chat but becoming halting in formal presentations",
          "Using non-standard English forms despite the formal context"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Adapting speech style, volume, pace and register for different audiences and purposes, using Standard English forms consistently.",
        "example_task": "Present the same information about your topic to two audiences: first to a Year 1 class, then to a visiting parent. How does your language change?",
        "example_response": "To Year 1: uses simple vocabulary, short sentences, asks questions to engage. To parent: uses more formal register, technical vocabulary, structured argument. Child explains: 'I used simpler words for the younger children and spoke more slowly.'",
        "common_errors": [
          "Using the same register for both audiences",
          "Adapting vocabulary but not pace, tone or sentence structure"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C009",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Participating in a simple role-play activity related to a story or topic, speaking in character with prompting.",
        "example_task": "Pretend to be the story character arriving at the magical island. What would you say?",
        "example_response": "'Wow! Look at all the sparkly trees! I've never seen anything like this before!'",
        "common_errors": [
          "Breaking out of character after one or two sentences",
          "Describing what the character would do rather than speaking as the character"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sustaining a role in drama activities such as hot-seating and freeze-frame, responding to questions in character.",
        "example_task": "You are the giant from the story. The class will ask you questions. Answer as the giant would.",
        "example_response": "'I live at the top of the beanstalk. I've been up there for hundreds of years, all alone. When that boy Jack came, I was actually excited to have a visitor — but then he stole from me!'",
        "common_errors": [
          "Answering as themselves rather than staying in character",
          "Giving brief, one-word answers without developing the character's perspective"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Engaging in a range of drama activities (debate, improvisation, performance) with sustained character and purpose.",
        "example_task": "In pairs, improvise a scene where two characters from the story meet for the first time. Stay in character and respond to what your partner says.",
        "example_response": "Child sustains character throughout, responds spontaneously to partner's improvised dialogue, and develops the scene with appropriate emotion and purpose.",
        "common_errors": [
          "Planning the whole scene beforehand rather than improvising in the moment",
          "Breaking character to negotiate what happens next"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using drama to explore complex situations and emotions, reflecting on how performance deepens understanding of characters and themes.",
        "example_task": "After performing the conscience alley for the character's dilemma, reflect: how did hearing both sides affect your understanding of the character's choice?",
        "example_response": "'Before the activity, I thought the character should obviously have stayed. But hearing the arguments for leaving made me realise how torn she must have felt. Both choices had consequences. The drama helped me understand that there wasn't a simple right answer.'",
        "common_errors": [
          "Reflecting on whether they enjoyed the drama rather than what it revealed about the text",
          "Not connecting the drama experience to deeper character understanding"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C010",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Looking at the audience when speaking and using an appropriate volume.",
        "example_task": "Tell the class about your weekend. Remember to look at people, not at the floor.",
        "example_response": "Child looks up from any notes and makes eye contact with different parts of the audience.",
        "common_errors": [
          "Staring at the floor or at one person throughout",
          "Reading from notes without looking up"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using basic presentation skills — eye contact, clear voice, and simple organisation of content.",
        "example_task": "Give a 1-minute recommendation for a book. Include: what it's about, why you liked it, and who should read it.",
        "example_response": "Child presents with clear structure, makes eye contact, and speaks at an appropriate pace and volume.",
        "common_errors": [
          "Rushing through the recommendation without pausing between points",
          "Forgetting one of the three required elements"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Engaging an audience through varied tone, pace, eye contact and appropriate gestures, with content logically organised.",
        "example_task": "Present your research project to the class. Use your voice and body language to keep the audience interested.",
        "example_response": "Child varies tone for emphasis, pauses for effect, uses gestures naturally, makes eye contact across the room, and organises content with a clear introduction, body and conclusion.",
        "common_errors": [
          "Presenting content well but in a monotone that loses the audience",
          "Using gestures that distract rather than support meaning"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Adjusting presentation style in response to audience reactions, using rhetorical techniques to engage and persuade.",
        "example_task": "Give a persuasive speech about why your topic is the most interesting we've studied. Watch the audience — if they look bored, change something!",
        "example_response": "Child uses rhetorical questions, surprising facts, and humour to engage. Notices some listeners losing focus and asks a direct question or changes pace to re-engage them.",
        "common_errors": [
          "Delivering a pre-planned speech without adapting to audience response",
          "Noticing disengagement but not knowing how to adjust"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C011",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Listening to a different viewpoint and acknowledging it, even if they disagree.",
        "example_task": "Your partner thinks the story ending was unfair. You thought it was fair. Listen to their reason and tell them you understand their point.",
        "example_response": "'I understand why you think it was unfair — the character had tried really hard. But I still think it was fair because she broke the rules.'",
        "common_errors": [
          "Dismissing the other viewpoint immediately without listening",
          "Agreeing just to avoid disagreement"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Considering an alternative perspective on a text or issue and explaining why someone might hold that view.",
        "example_task": "Some people think the wolf was the villain. Others think he was just misunderstood. Explain why someone might think each way.",
        "example_response": "'People who think he's a villain would point to the fact that he tricked people and tried to eat them. People who think he's misunderstood might say he was just hungry and acting on instinct, like any animal would.'",
        "common_errors": [
          "Only being able to explain one viewpoint — the one they agree with",
          "Explaining both but clearly dismissing the one they disagree with"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Evaluating different viewpoints by considering the strength of evidence for each, and forming a balanced judgement.",
        "example_task": "Was the character right to lie to protect her friend? Consider different perspectives and form your own view.",
        "example_response": "'From the friend's perspective, the lie was kind — it protected her from getting into trouble. From the teacher's perspective, lying is always wrong because it damages trust. I think the character was trying to be a good friend, but she could have found a better way to help that didn't involve lying.'",
        "common_errors": [
          "Taking a strong position without genuinely considering the other view",
          "Sitting on the fence without forming any clear judgement"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Recognising that some questions have no clear right answer, evaluating the reasoning behind different positions, and changing their mind when presented with stronger evidence.",
        "example_task": "After our class debate, has your opinion changed? Explain what argument or evidence made you think differently.",
        "example_response": "'I started thinking zoos were always wrong, but when Aisha explained that some species would be extinct without breeding programmes, it made me reconsider. Now I think it depends — zoos that focus on conservation are justifiable, but zoos that just keep animals for entertainment aren't. Aisha's point about specific examples of saved species was the strongest evidence.'",
        "common_errors": [
          "Claiming their mind changed without being able to identify what caused the shift",
          "Refusing to reconsider despite strong counter-evidence"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C012",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that people speak differently in different situations (e.g., playground vs classroom).",
        "example_task": "Would you say 'Give us it!' to a friend in the playground? Would you say the same thing to the head teacher? What might you say instead?",
        "example_response": "'To my friend I'd say \"Give us it!\" but to the head teacher I'd say \"Please could I have it?\"'",
        "common_errors": [
          "Not recognising any difference between the two situations",
          "Knowing they should be different but not being able to produce the formal version"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Beginning to adjust language choices for familiar formal and informal situations.",
        "example_task": "Write what you would say in two situations: asking a friend to play, and asking the head teacher if you can visit the library.",
        "example_response": "Friend: 'Wanna come play football?' Head teacher: 'Excuse me, please could I go to the library?'",
        "common_errors": [
          "Making both versions sound the same",
          "Making the formal version overly stiff rather than naturally polite"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Adjusting vocabulary, tone and sentence structure for different audiences and purposes, understanding the difference between spoken and written register.",
        "example_task": "Write a text message to your friend about a school trip AND a thank-you letter to the trip organiser. How are they different?",
        "example_response": "Text: 'That trip was amazing!! The castle was SO cool 😊' Letter: 'Dear Mrs Thompson, Thank you very much for organising our trip to Warwick Castle. We particularly enjoyed the guided tour of the battlements.' Child explains: 'The text is informal with slang and short forms. The letter uses formal language, full sentences and polite phrases.'",
        "common_errors": [
          "Writing the letter in an appropriately formal way but not being able to explain why",
          "Using formal vocabulary in the letter but keeping an informal sentence structure"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining why register matters, identifying register in texts they read, and deliberately manipulating register for effect in own writing.",
        "example_task": "In your story, a character speaks both formally and informally. Write a scene showing both registers and explain why the character switches.",
        "example_response": "Character speaks formally to the king: 'Your Majesty, I humbly request permission to cross the bridge.' Then informally to a friend: 'That was terrifying! Did you see his face?' The child explains: 'She switches because you have to show respect to a king but she can be herself with her friend. The formal language shows the power difference.'",
        "common_errors": [
          "Including both registers but not explaining the reason for the switch",
          "Making the formal register sound unnatural or parodic"
        ]
      }
    ]
  }
]