[
  {
    "concept_id": "EN-Y5-C014",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Reading from a limited range of text types, typically fiction only, and showing some willingness to try new books when guided.",
        "example_task": "Choose a book from the class library that is a different type from the one you read last. If you last read a story, try a poetry book or a non-fiction book.",
        "example_response": "Last time I read a story about a dog. This time I picked a book about volcanoes because I want to learn how they erupt.",
        "common_errors": [
          "Always choosing the same type of book (usually fiction) without branching out",
          "Picking a text type but not engaging meaningfully with it"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Reading across at least three different text types (fiction, non-fiction and one other) and beginning to discuss what makes each type different.",
        "example_task": "This term you have read a novel, a non-fiction book and a collection of poems. For each one, explain one thing that was different about how you read it.",
        "example_response": "With the novel I read from start to finish to follow the story. With the non-fiction book I used the contents page and index to find the parts I needed. With the poetry I read each poem more than once to think about what it meant.",
        "common_errors": [
          "Describing what the book was about rather than how they read it differently",
          "Not recognising that different text types require different reading approaches"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Reading genuinely widely across fiction, poetry, plays, non-fiction and reference materials, selecting texts for both pleasure and information, and articulating why breadth of reading matters.",
        "example_task": "Create a reading log showing at least six different types of text you have read this term. For each, note the genre, why you chose it, and what you gained from reading it.",
        "example_response": "1. Novel (The Borrowers): chosen for class reading, I learnt how an author builds a fantasy world from an ordinary setting. 2. Non-fiction (DK Eyewitness Space): chosen for my science project, I learnt about the planets. 3. Poetry (Michael Rosen collection): chosen because I liked his poems in Year 4, I enjoyed the humour and rhythm. 4. Play script (A Midsummer Night's Dream adapted): class drama, I learnt how stage directions work. 5. Newspaper article: current events display, I practised identifying fact and opinion. 6. Reference book (children's encyclopedia): to answer a question about Ancient Egypt, I practised using index and cross-references.",
        "common_errors": [
          "Logging the books but not reflecting on what each type offered as a reading experience",
          "Counting re-reads of the same genre as 'breadth'"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C015",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Engaging with a myth, legend or traditional story when it is shared by the teacher, and identifying basic features such as heroes, quests or magical elements.",
        "example_task": "After hearing the Greek myth of Theseus and the Minotaur, name the hero and describe the quest.",
        "example_response": "The hero is Theseus. His quest is to go into the labyrinth and kill the Minotaur to stop Athens having to send young people to be eaten.",
        "common_errors": [
          "Retelling the story without identifying the quest or hero conventions",
          "Confusing the characters because the names are unfamiliar"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Recognising conventions shared across myths and legends from different cultures (hero, quest, transformation, supernatural elements) and beginning to compare stories from different traditions.",
        "example_task": "Compare the Greek myth of Theseus with the story of Anansi the Spider from West African tradition. What do the two stories have in common and what is different?",
        "example_response": "Both have a main character who faces a challenge. Theseus uses strength and bravery to defeat a monster, while Anansi uses cleverness and trickery to solve problems. Theseus is a warrior hero, but Anansi is a trickster hero. Both stories were told to teach lessons, but they come from very different cultures.",
        "common_errors": [
          "Listing features of each story separately rather than comparing them directly",
          "Assuming one tradition's stories are 'better' or 'more important' than the other"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Engaging with texts from both British literary heritage and other cultural traditions, discussing characteristics and conventions, and understanding that literature reflects cultural context.",
        "example_task": "You have read an extract from Charles Dickens' Oliver Twist and a chapter from Benjamin Zephaniah's Refugee Boy. Both feature children in difficult circumstances. How does each author's cultural context influence the story?",
        "example_response": "Dickens wrote in Victorian times when many children lived in poverty in workhouses. His writing shows what life was like for poor children in 19th century England. Zephaniah writes about a modern boy who is a refugee from Ethiopia and Eritrea. His cultural context includes the experience of being Black and British and understanding what it means to leave your homeland. Both authors write about children facing hardship, but the types of hardship reflect different times and cultures.",
        "common_errors": [
          "Comparing the stories without linking them to their cultural contexts",
          "Treating 'literary heritage' as meaning only very old, difficult books"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C016",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to identify what a story is 'about' beyond the plot, with teacher modelling of how to name a theme.",
        "example_task": "We have just read Charlotte's Web. The plot is about a spider who saves a pig. But what is the story really about? What bigger idea does it explore?",
        "example_response": "The story is really about friendship and loyalty. Charlotte is loyal to Wilbur even though she is very different from him.",
        "common_errors": [
          "Retelling the plot instead of identifying the theme ('It is about a spider who writes words in her web')",
          "Confusing the subject with the theme ('It is about animals')"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying themes in texts with supporting evidence and recognising common genre conventions.",
        "example_task": "Name one theme in the class novel and find two pieces of evidence from the text that support your choice.",
        "example_response": "A theme in Goodnight Mister Tom is the power of kindness to overcome harm. Evidence: Mr Tom is gruff at first but slowly shows William care, which helps William become confident. Also, when William draws pictures for the first time, it shows that a safe, kind environment has allowed him to express himself.",
        "common_errors": [
          "Naming a theme but providing evidence that relates to a different theme",
          "Choosing a theme that is too vague ('good versus evil') without making it specific to the text"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Identifying and discussing themes and conventions across a range of texts, providing textual evidence, and comparing how the same theme is treated differently by different authors.",
        "example_task": "The theme of 'belonging' appears in both The Arrival by Shaun Tan and Kensuke's Kingdom by Michael Morpurgo. How does each text explore this theme? What conventions does each use?",
        "example_response": "In The Arrival, belonging is shown through a man arriving in a strange country where he does not understand the language or customs. Tan uses the convention of a wordless picture book so the reader feels the same confusion as the character. In Kensuke's Kingdom, Michael is shipwrecked on an island and has to learn to belong in a completely unfamiliar place. Morpurgo uses the adventure genre convention of a survival story. Both explore belonging through displacement, but Tan focuses on cultural displacement while Morpurgo focuses on physical isolation.",
        "common_errors": [
          "Discussing each text separately rather than comparing their treatment of the theme",
          "Confusing a convention of the genre with a feature unique to the text"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Analysing how themes develop across a text and evaluating how authors use literary conventions to reinforce thematic ideas, using appropriate metalanguage.",
        "example_task": "Choose a novel you have read this year. Explain how the author develops a theme across the whole book, not just in one scene. How do they use character, setting or structure to build the theme?",
        "example_response": "In Street Child by Berlie Doherty, the theme of resilience develops across the book. At the start, Jim is helpless when his mother dies and he is sent to the workhouse. The dark, enclosed settings of the workhouse mirror his lack of freedom. As Jim escapes and meets new people, the settings become more open. By the end, Jim's resilience leads to the founding of a school for poor children. Doherty uses the convention of a historical novel to show that one person's resilience can change things for many. The structural pattern of repeated escapes and setbacks reinforces the idea that resilience means trying again after failure, not just being brave once.",
        "common_errors": [
          "Analysing a single scene rather than tracing the theme across the whole text",
          "Naming conventions without explaining how they serve the theme"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C017",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying a simple similarity or difference between two texts when guided by the teacher.",
        "example_task": "We have read two poems about the sea, one by a modern poet and one by a Victorian poet. What is one thing that is the same and one thing that is different?",
        "example_response": "Both poems are about the sea and how powerful it is. The modern poem uses short lines and everyday words, but the Victorian poem uses long sentences and old-fashioned words like 'thou'.",
        "common_errors": [
          "Describing each poem separately without making a direct comparison",
          "Comparing only surface features like length rather than content or style"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Making comparisons between two texts on the same topic or theme, noting similarities and differences in how the authors present ideas.",
        "example_task": "Compare how the Tudors are presented in your history textbook and in a historical novel set in Tudor times. What is different about how each text presents the same period?",
        "example_response": "The textbook presents facts about Tudor life in an organised way with headings and dates. It uses formal language and includes evidence from sources. The novel brings the period to life through a character's experiences. It uses descriptive language and dialogue to make you feel what it was like. The textbook tells you what happened; the novel makes you experience it.",
        "common_errors": [
          "Summarising each text rather than comparing their approaches",
          "Not recognising that different text types serve different purposes for presenting information"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Making substantiated comparisons across texts, considering viewpoint, theme, technique and authorial purpose, and structuring comparative discussion using appropriate language.",
        "example_task": "Compare how the character of a bully is presented in two different novels you have read. Consider what techniques each author uses and what viewpoint the reader is given.",
        "example_response": "In Wonder by R.J. Palacio, the bully Julian is mostly seen through Auggie's viewpoint, so the reader experiences his cruelty from the victim's perspective. Palacio uses dialogue to show Julian's nastiness directly. In There's a Boy in the Girls' Bathroom by Louis Sachar, Bradley starts as the class troublemaker but the reader sees things from his point of view, so we understand why he behaves badly. Sachar uses Bradley's internal thoughts to build sympathy. Both books feature bullying, but Palacio wants us to see its impact on the victim while Sachar wants us to understand what drives the bully.",
        "common_errors": [
          "Comparing at a surface level ('both books have bullies') without analysing technique or viewpoint",
          "Failing to use comparative language ('whereas', 'in contrast', 'similarly')"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating how different authors, genres or text types present the same subject matter, and explaining why the differences matter for the reader's understanding.",
        "example_task": "You have read a newspaper report about climate change, a speech by Greta Thunberg, and a poem about a melting glacier. How does each text try to make the reader care about climate change? Which is most effective and why?",
        "example_response": "The newspaper report uses facts and statistics to inform the reader logically. The speech by Thunberg uses direct address ('How dare you') and emotional language to make the audience feel guilt and urgency. The poem uses imagery of ice cracking and water rising to make the reader picture the destruction. I think the speech is most effective because Thunberg combines facts with emotion and speaks directly to the people who can make changes. However, the poem might stay in your memory longer because the images are vivid. Each text has a different strength depending on its purpose and audience.",
        "common_errors": [
          "Stating a preference without evaluating the effectiveness of each text's approach",
          "Not recognising that different texts achieve different things and a single 'most effective' answer oversimplifies"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C018",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Making a simple inference about a character's feelings based on what happens in the story, with teacher prompting.",
        "example_task": "Read this extract: 'Mia stared at the empty chair where her grandmother always sat. She picked up the old knitting needles and held them tightly.' How do you think Mia feels?",
        "example_response": "I think Mia feels sad because her grandmother is not there any more and she is holding the knitting needles tightly, like she misses her.",
        "common_errors": [
          "Stating an emotion without any reference to the text ('She is sad')",
          "Confusing literal information with inference"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Making inferences about characters' feelings, thoughts and motives, supported by specific evidence from the text.",
        "example_task": "Read this extract: 'Tom glanced at the clock for the third time. He rearranged the cutlery on the table and straightened the napkins again.' What can you infer about Tom? Use evidence from the text.",
        "example_response": "I think Tom is nervous or anxious because he keeps looking at the clock, which suggests he is waiting for someone and worried they might not come. He is rearranging things that are already neat, which shows he is fidgeting because he cannot settle.",
        "common_errors": [
          "Providing evidence but not explaining how it supports the inference",
          "Making an inference that contradicts the textual evidence"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Inferring characters' feelings, thoughts and motives from their actions, justifying inferences with specific evidence, and considering multiple possible interpretations using tentative language.",
        "example_task": "Read this extract: 'When the teacher announced the test results, Priya smiled and slid her paper into her bag without showing anyone. Later, she found Aisha crying in the cloakroom and sat next to her without saying a word.' What can you infer about Priya's character? Consider more than one possible interpretation.",
        "example_response": "Priya hiding her results suggests she did well but did not want to show off, which implies she is sensitive to others' feelings. Finding Aisha and sitting with her without speaking could suggest Priya understands that sometimes being present is more comforting than words, or it could suggest she did not know what to say but still wanted to help. Either way, her actions imply she is empathetic. The text implies rather than states her kindness, which makes the reader infer it from her behaviour.",
        "common_errors": [
          "Settling on one interpretation without considering alternatives",
          "Over-reading the text and making inferences not supported by the evidence"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Making sophisticated inferences that consider authorial intent, explaining why the author chose to imply rather than state, and evaluating the reliability of inferences.",
        "example_task": "In a novel, the author never directly tells the reader that the main character is lonely. How might an author show loneliness without using the word? Find an example from a book you have read and explain how the author achieves this.",
        "example_response": "In Skellig by David Almond, Michael's loneliness is shown through the setting and his actions rather than being stated. He spends time alone in the crumbling garage, away from his worried parents and his sick baby sister. The author describes him talking to Skellig, a mysterious creature, which suggests Michael needs companionship he cannot find at home. Almond chose to show rather than tell because it makes the reader experience the loneliness alongside Michael. If the author simply wrote 'Michael was lonely', it would tell us a fact but would not make us feel it.",
        "common_errors": [
          "Explaining the concept of 'show not tell' but not demonstrating it with a specific textual example",
          "Not evaluating why the author's choice to imply is more effective than stating directly"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C019",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Making a simple prediction about what will happen next based on what has been stated directly in the text.",
        "example_task": "The story says: 'Dark clouds gathered and the wind began to howl.' What do you think will happen next?",
        "example_response": "I think there is going to be a storm because the clouds are dark and the wind is howling.",
        "common_errors": [
          "Predicting based on personal experience rather than textual evidence",
          "Making a prediction unrelated to any clue in the text"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Making predictions using both stated and implied information, distinguishing between the two types of clue.",
        "example_task": "Read: 'Raj packed his bag slowly, checking each item twice. He kept looking at the photograph on his bedside table. His mother called from downstairs, \"The taxi will be here in ten minutes!\"' What do you predict and what clues are you using?",
        "example_response": "I predict Raj is going away from home and he is not sure he wants to go. The stated clue is that a taxi is coming, so he is definitely going somewhere. The implied clue is that he keeps looking at the photograph, which suggests he will miss someone. He is packing slowly, which implies reluctance.",
        "common_errors": [
          "Using only the stated information without picking up on implied clues",
          "Not distinguishing between what the text says and what it implies"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Making reasoned predictions about plot, character development and outcomes using both stated and implied information, articulating the evidence and using tentative language.",
        "example_task": "You are halfway through a class novel. The main character has just discovered that her best friend has been keeping a secret from her. Predict what will happen next, using evidence from what you have read so far. Explain which clues are stated and which are implied.",
        "example_response": "I predict the main character will confront her friend but then forgive her, because earlier in the book the author established that she values honesty above everything (she said 'I hate liars' in Chapter 3, which is stated). However, the author has also implied that the friend kept the secret to protect her, because the friend looked worried whenever the topic came up (implied through body language). The author might be building towards the idea that honesty is complicated and sometimes people keep secrets for good reasons. I think this because the theme of the book seems to be about trust.",
        "common_errors": [
          "Predicting based on what the pupil wants to happen rather than what the evidence suggests",
          "Not returning to predictions after reading further to evaluate which clues were reliable"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Making predictions that consider genre conventions, authorial patterns and narrative structure, and evaluating the reliability of predictions by distinguishing between foreshadowing and red herrings.",
        "example_task": "In a mystery novel, the author has introduced three suspects, each with a motive. One suspect has been mentioned much more than the others. Predict who did it and explain how the genre conventions of mystery stories influence your prediction.",
        "example_response": "In a mystery novel, the most obvious suspect is usually not the guilty one because the genre convention is to mislead the reader. The author has mentioned one suspect frequently, which could be a red herring designed to distract us. I predict the quietest suspect, the one the author has barely mentioned, is the real culprit because mystery writers often hide the guilty character in plain sight. However, sometimes authors deliberately subvert this convention to surprise experienced readers. My prediction could be wrong if the author is playing a double bluff.",
        "common_errors": [
          "Ignoring genre conventions and predicting only from character evidence",
          "Applying genre conventions too rigidly without considering that authors sometimes subvert them"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C020",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying the main idea of a single paragraph when prompted, distinguishing it from supporting details.",
        "example_task": "Read this paragraph about penguins. Underline the sentence that tells you the main idea. Circle two details that support it.",
        "example_response": "Main idea: 'Penguins have many features that help them survive in freezing conditions.' Supporting details: 'Their feathers are tightly packed to keep out wind and water.' 'They huddle together in groups to share warmth.'",
        "common_errors": [
          "Choosing the most interesting detail rather than the main idea",
          "Underlining the first sentence automatically, assuming main ideas always come first"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying the main idea of each paragraph in a multi-paragraph text and beginning to see how paragraphs connect to build an overall argument or explanation.",
        "example_task": "Read this three-paragraph text about deforestation. Write one sentence summarising the main idea of each paragraph.",
        "example_response": "Paragraph 1: Deforestation is happening at an alarming rate around the world. Paragraph 2: Cutting down forests destroys habitats for thousands of species. Paragraph 3: There are things governments and individuals can do to reduce deforestation.",
        "common_errors": [
          "Writing summaries that are too long and include unnecessary details",
          "Copying sentences directly from the text rather than summarising in own words"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Synthesising main ideas across multiple paragraphs into a concise, accurate summary that preserves the overall meaning without distortion, in own words.",
        "example_task": "Read this five-paragraph article about the water cycle. Write a summary of no more than four sentences that covers the key ideas from the whole text.",
        "example_response": "Water moves continuously between the Earth's surface and the atmosphere in a process called the water cycle. Heat from the sun causes water to evaporate from oceans and lakes, forming clouds through condensation. When clouds become heavy with moisture, precipitation falls as rain or snow. The water then flows back into rivers and oceans, and the cycle begins again.",
        "common_errors": [
          "Retelling paragraphs in order rather than synthesising the overall meaning",
          "Including interesting but non-essential details while omitting crucial information"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Producing summaries of complex texts that distinguish between essential and peripheral information, preserve the author's argument structure, and demonstrate critical judgement about what to include.",
        "example_task": "Read this long article about whether homework helps primary school children learn. Summarise the arguments on both sides in no more than five sentences. Then explain what you chose to leave out and why.",
        "example_response": "Some researchers argue that homework reinforces classroom learning and builds independent study habits needed for secondary school. Others argue that homework increases stress, reduces time for play and family, and has little measurable impact on primary-age achievement. Most experts agree that short, focused tasks are more effective than lengthy assignments. The evidence is mixed, and the impact depends on the type of homework set. I left out the specific statistics and the names of individual studies because they supported the arguments but were not the arguments themselves.",
        "common_errors": [
          "Summarising only one side of the argument",
          "Not being able to articulate why certain information was excluded"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C021",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying a language feature in a text (such as a simile or descriptive word) when prompted by the teacher.",
        "example_task": "Read this sentence: 'The moon hung in the sky like a silver coin.' What language technique has the author used?",
        "example_response": "The author has used a simile. They compare the moon to a silver coin using the word 'like'.",
        "common_errors": [
          "Identifying the simile but not naming the technique",
          "Confusing simile with metaphor"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying language features and beginning to describe their effect on the reader, using some technical vocabulary.",
        "example_task": "Read this extract: 'The forest swallowed them whole. Branches clawed at their faces and roots grabbed at their ankles.' Name two techniques and describe what effect they have.",
        "example_response": "The author uses personification by saying the forest 'swallowed them' and the branches 'clawed'. This makes the forest seem alive and threatening, as if it is a creature trying to trap them. It makes the reader feel scared for the characters.",
        "common_errors": [
          "Identifying the technique but describing the effect vaguely ('it makes it more interesting')",
          "Listing techniques without explaining how they work"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Analysing how authors use language including figurative language, explaining the impact on the reader using appropriate metalanguage, and evaluating whether the technique is effective.",
        "example_task": "Read this extract from a novel: 'Hope is a bird that perches in the soul, singing a tune without words that never stops at all.' Identify the technique, explain its effect, and evaluate whether it works.",
        "example_response": "The author uses an extended metaphor, comparing hope to a bird. The metaphor works because a bird perching suggests something small and light that could fly away at any time, which captures how fragile hope can feel. The idea of it singing 'without words' suggests hope is felt rather than explained logically. The phrase 'never stops at all' implies hope is persistent even in difficult times. I think the metaphor is effective because it gives the abstract concept of hope a physical, living image that the reader can picture.",
        "common_errors": [
          "Identifying the metaphor but not explaining how each part of it contributes to meaning",
          "Evaluating with vague praise ('it is a good metaphor') rather than specific analysis"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Analysing authorial language choices with precision, comparing how different authors achieve similar effects through different techniques, and evaluating effectiveness with reference to purpose and audience.",
        "example_task": "Compare how two authors create a sense of danger. Author A writes: 'The ice cracked beneath her feet like breaking glass.' Author B writes: 'Each step was a question. The ice had no answer.' Which is more effective and why?",
        "example_response": "Author A uses a simile comparing cracking ice to breaking glass. This is direct and visual, and most readers know the sound of breaking glass so it creates an instant sensory image. Author B uses a metaphor that personifies the ice and turns walking into a conversation. This is more subtle and creates tension through uncertainty rather than sound. Author A is more effective for a younger audience because the comparison is concrete and immediate. Author B is more effective for an older reader because it builds psychological tension and makes the reader think. Both achieve danger, but through different means: A through sensory impact, B through suspense.",
        "common_errors": [
          "Stating a preference without analysing the specific techniques each author uses",
          "Not considering how the intended audience affects which technique is more effective"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C022",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Distinguishing between an obvious fact and an obvious opinion when the two are presented separately.",
        "example_task": "Which is a fact and which is an opinion? A: 'London is the capital of England.' B: 'London is the best city in the world.'",
        "example_response": "A is a fact because it can be checked and proved true. B is an opinion because 'best' is a personal judgement that different people would disagree about.",
        "common_errors": [
          "Classifying surprising facts as opinions because they seem hard to believe",
          "Thinking that all opinions are wrong"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying fact and opinion when they are mixed together in the same text, recognising signal words for opinion.",
        "example_task": "Read this paragraph and highlight the facts in one colour and the opinions in another: 'The Amazon rainforest covers 5.5 million square kilometres. It is arguably the most important ecosystem on Earth. Over 10 million species live there. Sadly, thousands of hectares are destroyed every year.'",
        "example_response": "Facts: The Amazon covers 5.5 million square kilometres. Over 10 million species live there. Thousands of hectares are destroyed every year. Opinions: 'arguably the most important ecosystem' (the word 'arguably' signals this is a view, not a proven fact). 'Sadly' is also an opinion word because it shows the writer's feelings.",
        "common_errors": [
          "Missing opinion signal words like 'arguably', 'sadly', 'probably'",
          "Classifying the statistics as opinions because exact numbers seem uncertain"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Identifying fact and opinion reliably in non-fiction texts including cases where opinion is presented without explicit markers, and explaining how this relates to bias and reliability.",
        "example_task": "Read this product review: 'This tablet has a 10-inch screen and 64GB of storage. It is perfect for children and the screen quality is outstanding. Battery life lasts up to 8 hours.' Identify the facts and opinions. Is this review reliable? Why or why not?",
        "example_response": "Facts: 10-inch screen, 64GB storage, battery life up to 8 hours (these can be measured and verified). Opinions: 'perfect for children' (different children have different needs), 'outstanding screen quality' (this is a judgement). The review mixes facts and opinions, which could mislead a reader into thinking the opinions are also facts. It is only partly reliable because it does not mention any drawbacks, which suggests bias.",
        "common_errors": [
          "Accepting all claims in a review as facts because the text sounds authoritative",
          "Not recognising that presenting only positive opinions without negatives indicates bias"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating how writers deliberately blur the boundary between fact and opinion to persuade, and explaining the strategies they use to make opinion appear factual.",
        "example_task": "Read this extract from an advertisement: 'Studies show that 9 out of 10 dentists recommend BrightSmile toothpaste.' Is this a fact or an opinion? What strategies does the writer use to make it seem factual?",
        "example_response": "This looks like a fact because it uses a statistic and refers to 'studies', which suggests scientific evidence. However, it could be misleading: it does not say which studies, how many dentists were asked, or what question they were asked. '9 out of 10' sounds precise but might come from a very small or biased sample. The writer uses the language of fact (numbers, 'studies show') to present what may be a carefully constructed opinion. This is a common persuasion technique: dressing opinion in the language of evidence to make it seem objective.",
        "common_errors": [
          "Accepting the statistic at face value because it sounds scientific",
          "Not questioning the source, sample size or methodology behind presented 'facts'"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C023",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Locating a specific piece of information in a non-fiction text using a contents page or index.",
        "example_task": "Use the index in this reference book to find out what temperature water boils at. Write down the answer and the page number where you found it.",
        "example_response": "Water boils at 100 degrees Celsius. I found it on page 47 by looking up 'boiling point' in the index.",
        "common_errors": [
          "Reading from the beginning of the book rather than using the index",
          "Looking up the wrong key word in the index"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Planning a simple research question, locating relevant information using navigation features, and recording it in note form rather than copying verbatim.",
        "example_task": "Your research question is: 'How do volcanoes form?' Use the non-fiction book to find the answer. Write notes in your own words, not copied sentences.",
        "example_response": "Notes: Volcanoes form where hot melted rock (magma) pushes up through cracks in the Earth's surface. The magma comes from deep underground where it is very hot. When it reaches the surface it is called lava. Over time, layers of cooled lava build up to form the volcano shape.",
        "common_errors": [
          "Copying whole sentences from the text rather than making notes in own words",
          "Recording information that does not answer the research question"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Planning research questions before beginning, locating information efficiently across multiple sources, taking selective notes, and presenting findings in an appropriate format.",
        "example_task": "You are researching 'What were the main causes of the Great Fire of London?' Use at least two sources. Plan your research questions, take notes, and present your findings as a short report.",
        "example_response": "Research questions: 1. How did the fire start? 2. Why did it spread so quickly? 3. Could it have been prevented? From the textbook: fire started in a bakery on Pudding Lane, September 1666. From the website: houses were timber-framed and close together, wind was strong. Report: The Great Fire of London began on 2 September 1666 in Thomas Farriner's bakery on Pudding Lane. It spread rapidly because the houses were made of wood and built very close together, and a strong east wind fanned the flames. The fire could have been stopped sooner if the Lord Mayor had ordered firebreaks earlier.",
        "common_errors": [
          "Jumping straight into reading without identifying research questions first",
          "Using only one source when multiple sources would give a more complete picture"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Conducting independent research across multiple sources, evaluating the reliability of sources, synthesising information, and presenting findings in a format chosen to suit the audience and purpose.",
        "example_task": "Research whether school uniform should be compulsory. Use at least three different types of source. Present your findings as a balanced report that includes your evaluation of which sources were most reliable.",
        "example_response": "I used a newspaper article, a school's website, and the results of a parent survey. The newspaper article argued against uniform using emotional language but few facts, so it was the least reliable. The school website gave practical reasons for uniform but was biased because the school had already decided to require it. The parent survey gave a range of views with percentages, which was most reliable because it showed real opinions rather than one person's argument. My report: Evidence is divided on school uniform. Supporters argue it reduces bullying and creates equality. Critics argue it is expensive and limits self-expression. The most reliable evidence suggests parents are split roughly evenly on the issue.",
        "common_errors": [
          "Presenting only one viewpoint rather than a balanced overview",
          "Not evaluating the reliability of sources and treating all sources as equally trustworthy"
        ]
      }
    ]
  }
]