[
  {
    "concept_id": "EN-KS3-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Reads mostly within a single genre or form (e.g. only fantasy novels) and rarely ventures beyond familiar authors or types of text.",
        "example_task": "Look at this list of 10 books you have read this year. How many different genres, forms, or time periods are represented?",
        "example_response": "I have read 8 fantasy novels, 1 horror novel and 1 graphic novel. They are all from the 21st century.",
        "common_errors": [
          "Believing wide reading means reading lots of books, regardless of variety",
          "Not recognising poetry, drama or non-fiction as valid reading choices"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Reads across two or three genres or forms with some awareness that breadth matters, but needs prompting to try unfamiliar types of text.",
        "example_task": "Choose a text from a genre you have not read before this term. After reading it, explain what was different about the experience.",
        "example_response": "I normally read fiction but I chose a travel writing extract by Bill Bryson. It was different because it was funny but also informative. The writer described real places but used exaggeration to make them entertaining. I found it easier to read than I expected.",
        "common_errors": [
          "Choosing a text from a superficially different genre that is actually very similar (e.g. switching from fantasy to sci-fi)",
          "Struggling to articulate what makes one form different from another"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Reads confidently across fiction, non-fiction, poetry and drama from different periods and traditions, and can explain how different forms offer different reading experiences.",
        "example_task": "Recommend a reading list of five texts for someone your age that covers at least three different genres, two different time periods, and one non-fiction text. Justify each choice.",
        "example_response": "1. 'A Midsummer Night's Dream' by Shakespeare (pre-1914 drama) -- introduces comedy and magic in language that rewards close reading. 2. 'Refugee Boy' by Benjamin Zephaniah (contemporary fiction) -- a powerful novel about asylum that connects to current issues. 3. A selection from the Romantic poets (pre-1914 poetry) -- Wordsworth and Blake show how poetry captures nature and protest. 4. 'I Am Malala' by Malala Yousafzai (contemporary non-fiction) -- a real-life story that reads like a novel. 5. 'The War of the Worlds' by H.G. Wells (pre-1914 fiction) -- early science fiction that is surprisingly exciting. This list covers drama, fiction, poetry, non-fiction, and autobiography across the 19th century, early 20th century and 21st century.",
        "common_errors": [
          "Listing texts from only one period or tradition",
          "Omitting poetry or drama in favour of prose fiction"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Independently seeks out challenging and unfamiliar texts across genres, periods and cultures, and reflects critically on how reading breadth shapes their understanding of literature and the world.",
        "example_task": "Write a reflective piece explaining how reading across different genres and time periods has changed the way you think about literature or the world.",
        "example_response": "Reading Victorian novels alongside contemporary fiction showed me that the same issues -- class inequality, gender expectations, fear of the unknown -- appear across centuries, just expressed differently. Dickens used satirical caricature to expose poverty; Angie Thomas uses first-person voice to expose racial injustice. Poetry taught me that meaning does not always need narrative -- a single image can carry an entire argument. Reading world literature in translation, like Chinua Achebe's 'Things Fall Apart', challenged the assumption that English literary tradition is the only important one. Each genre I read gives me a new lens: drama makes me think about performance and audience; non-fiction makes me question evidence and bias. Wide reading has not just given me more books -- it has given me more ways of seeing.",
        "common_errors": [
          "Making superficial connections between texts without explaining how the different forms shape understanding",
          "Reflecting only on personal enjoyment rather than on how breadth develops critical insight"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Finds pre-1914 texts difficult to access and tends to disengage when encountering unfamiliar vocabulary or sentence structures.",
        "example_task": "Read this short extract from 'Oliver Twist' by Dickens. What is happening in the scene?",
        "example_response": "Oliver is asking for more food. The people in charge are shocked and angry because he is not supposed to ask for more.",
        "common_errors": [
          "Giving up when encountering unfamiliar vocabulary instead of using context clues",
          "Treating all pre-1914 writing as equally old and difficult"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Can follow the plot and meaning of pre-1914 texts with some teacher support, and begins to notice how older language differs from modern English.",
        "example_task": "Read this extract from 'Jane Eyre'. Identify two words or phrases that a modern writer probably would not use and explain what they mean.",
        "example_response": "Bronte writes 'I was glad of it' where we would say 'I was happy about it'. She also writes 'ere long' which means 'before long' or 'soon'. The language is more formal and the sentences are longer than modern writing, which makes it feel more distant and serious.",
        "common_errors": [
          "Assuming every unfamiliar word is archaic when some are simply advanced vocabulary still in use",
          "Identifying differences in language without commenting on their effect"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Reads pre-1914 literature with confidence, understanding the relationship between the text and its historical period, and comparing older and modern literary conventions.",
        "example_task": "Compare the opening of a Dickens novel with the opening of a contemporary novel. How do the writers' techniques reflect their different historical contexts?",
        "example_response": "Dickens opens 'Great Expectations' with a long, retrospective first-person narration where the adult Pip explains his childhood name and family circumstances. The sentences are complex and formal, reflecting the Victorian convention of detailed, authorial scene-setting. A contemporary novel like 'The Hate U Give' by Angie Thomas opens with immediate dialogue and colloquial first-person voice, reflecting modern expectations of pace and authentic voice. Dickens assumes a patient reader; Thomas assumes a reader who needs to be hooked instantly. Both use first person to build sympathy, but the Victorian version establishes social context first while the modern version establishes character and voice first.",
        "common_errors": [
          "Describing differences in language without connecting them to historical context",
          "Assuming pre-1914 writing is automatically inferior to modern writing or vice versa"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Engages independently with a range of pre-1914 texts from different periods and genres, evaluating how literary movements and historical conditions shaped writers' choices.",
        "example_task": "Explain how the Gothic tradition in 19th-century literature reflects the anxieties of the Victorian period, using examples from at least two texts.",
        "example_response": "Gothic literature uses the supernatural and the uncanny to externalise anxieties that Victorian society could not openly discuss. Stevenson's 'Strange Case of Dr Jekyll and Mr Hyde' (1886) reflects fears about the duality of respectable Victorian masculinity -- the idea that behind the civilised gentleman lurks a primitive, violent self. This connects to Darwinian anxieties about evolution and the fear that humanity might not be as far from animals as the Victorians wished. Shelley's 'Frankenstein' (1818), written earlier but foundational to the Gothic tradition, reflects Romantic-era fears about the unchecked power of science and the danger of humans playing God. Both texts use isolation, darkness, and physical monstrosity as metaphors for social transgression. The Gothic tradition survives because its core technique -- using the horrifying to explore the unspeakable -- remains relevant, but the specific anxieties it addresses are deeply rooted in the concerns of their own period.",
        "common_errors": [
          "Treating Gothic conventions as simply 'scary' rather than analysing their ideological function",
          "Conflating the early Gothic (Shelley, 1818) with the late-Victorian Gothic (Stevenson, 1886) without noting differences"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Reads contemporary texts for entertainment but does not reflect on how modern writers use literary techniques or engage with current themes.",
        "example_task": "What is the main theme of the contemporary novel you have just read? How does the writer explore it?",
        "example_response": "The book is about friendship. The main character makes a new friend and they go on adventures together.",
        "common_errors": [
          "Summarising plot rather than identifying themes",
          "Not recognising that contemporary writers make deliberate craft choices"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Begins to identify themes and techniques in contemporary literature, recognising that modern writers make deliberate choices about voice, structure and subject matter.",
        "example_task": "How does the contemporary novel you have read use narrative voice to engage the reader?",
        "example_response": "The novel uses first-person present tense which makes it feel immediate, like things are happening right now. The narrator speaks in a way that sounds like a real teenager which makes them relatable. Sometimes the narrator does not tell us everything which creates mystery.",
        "common_errors": [
          "Identifying technique without explaining its effect on the reader",
          "Assuming first-person narration is always autobiographical"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses contemporary literature with the same critical rigour as canonical texts, understanding how modern writers use form, voice and theme to engage with current issues and literary traditions.",
        "example_task": "How does a contemporary novelist you have studied use narrative technique to explore a social issue?",
        "example_response": "In 'Noughts and Crosses' by Malorie Blackman, the dual narrative technique alternates between Callum (a nought/white character who is oppressed) and Sephy (a cross/Black character who is privileged). By inverting real-world racial hierarchies and then giving both perspectives, Blackman forces readers to confront prejudice from inside both the victim's and the beneficiary's experience. The alternating chapters create dramatic irony -- we know things each character does not know about the other's situation. This structural choice is more effective than a single narrator because it prevents the reader from simply sympathising with one side.",
        "common_errors": [
          "Discussing the social issue without connecting it to the writer's narrative choices",
          "Treating the characters as real people rather than constructions designed to achieve an effect"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Independently evaluates how contemporary writers extend, challenge or subvert literary traditions, and makes sophisticated connections between modern texts and their literary and social contexts.",
        "example_task": "Choose a contemporary text and argue how it either continues or breaks with an established literary tradition.",
        "example_response": "Kazuo Ishiguro's 'Never Let Me Go' operates within the science fiction tradition but deliberately subverts its conventions. Traditional sci-fi like Wells or Asimov foregrounds the science -- the technology is the plot. Ishiguro buries the science fiction premise (human cloning for organ harvesting) beneath a quiet, nostalgic first-person narration that reads more like a boarding school memoir. The narrator Kathy H. accepts her fate with calm resignation, denying the reader the rebellion or escape that the genre conventionally demands. This technique forces the reader to confront their own complicity -- we want a dystopian hero, but Ishiguro refuses to provide one. The novel extends the literary tradition of the unreliable narrator (Kathy withholds and avoids) while challenging the science fiction tradition by making the science ordinary rather than spectacular. The effect is more unsettling than any conventional dystopia because it suggests that oppressive systems succeed precisely when their victims accept them as normal.",
        "common_errors": [
          "Describing plot rather than analysing how the writer engages with literary tradition",
          "Making superficial connections to literary traditions without detailed analysis of technique"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Understands the basic plot of a Shakespeare play when supported but struggles to decode the language independently.",
        "example_task": "In your own words, explain what is happening in this scene from 'A Midsummer Night's Dream' where Puck puts the love potion on Lysander's eyes.",
        "example_response": "Puck puts magic juice on the wrong person's eyes. When Lysander wakes up he falls in love with Helena instead of Hermia.",
        "common_errors": [
          "Confusing characters because of unfamiliar names",
          "Believing Shakespeare is written in Old English rather than Early Modern English"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Follows Shakespeare's plots and identifies key characters, themes and some language features with teacher support, beginning to recognise that Shakespeare's language carries layers of meaning.",
        "example_task": "In Macbeth's soliloquy 'Is this a dagger which I see before me', what does the dagger represent? Why does Shakespeare give this speech to Macbeth alone on stage?",
        "example_response": "The dagger represents Macbeth's temptation to murder King Duncan. He is imagining it because he is conflicted about whether to go through with the plan. Shakespeare makes this a soliloquy -- spoken alone on stage -- so the audience can hear Macbeth's private thoughts. This shows that in public Macbeth appears loyal, but privately he is being pulled towards violence.",
        "common_errors": [
          "Taking the dagger literally rather than recognising its symbolic function",
          "Not explaining why the soliloquy form is significant"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses Shakespeare's language, dramatic conventions and themes with confidence, understanding how his techniques create specific effects on an audience.",
        "example_task": "How does Shakespeare use the contrast between verse and prose in 'Much Ado About Nothing' to reveal character and social status?",
        "example_response": "Shakespeare uses blank verse (unrhymed iambic pentameter) for the noble characters Claudio and Hero in their romantic scenes, which gives their language a formal, elevated quality appropriate to aristocratic courtship. By contrast, Benedick and Beatrice often speak in witty prose, which signals their more grounded, sharp-tongued personalities and their rejection of romantic convention. The Watch, who are lower-class characters, speak in bumbling prose full of malapropisms ('Marry, sir, they have committed false report'), which creates comedy through language itself. The shift from prose to verse can also signal a shift in emotional register: when Beatrice says 'Kill Claudio' in prose, the directness is shocking precisely because it breaks the verse pattern the audience expects in a serious moment. Shakespeare uses the verse/prose distinction as a dramatic tool, not just a stylistic habit.",
        "common_errors": [
          "Stating that verse is for important characters and prose for unimportant ones without exploring exceptions and shifts",
          "Not connecting the verse/prose distinction to specific dramatic effects"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Independently analyses Shakespeare's plays as complex works of dramatic art, evaluating how language, form, structure and theatrical context create layered meaning.",
        "example_task": "How does Shakespeare use dramatic irony across 'Macbeth' to shape the audience's moral response to the protagonist?",
        "example_response": "Shakespeare creates dramatic irony from the very first scene: the witches' prophecy tells the audience what Macbeth will become before Macbeth himself knows, so every subsequent scene of his loyalty is shadowed by our knowledge of his future betrayal. When Duncan arrives at Macbeth's castle and praises its pleasant air, the audience knows he is entering a death trap -- this creates a painful tension between the dramatic world and our knowledge. As the play progresses, the dramatic irony shifts: initially we know more than the characters, but after the murder, other characters (Macduff, Malcolm) begin to suspect what we already know, and the irony becomes about how long the pretence can hold. By Act 5, the dramatic irony reverses entirely -- Macbeth believes the witches' second prophecy protects him ('none of woman born'), but the audience suspects it will be fulfilled unexpectedly. This structural arc of irony shapes our moral response: we feel complicit in Act 2 (we knew and could not prevent it), anxious in Act 3 (we watch the cover-up), and grimly satisfied in Act 5 (the irony turns against Macbeth). Shakespeare uses dramatic irony not just as a plot device but as a moral architecture.",
        "common_errors": [
          "Discussing dramatic irony in individual scenes without tracing its development across the whole play",
          "Not connecting dramatic irony to its effect on the audience's moral judgement"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Has limited experience of literature from beyond the British tradition and may assume that stories from other cultures are fundamentally different from their own.",
        "example_task": "Read this extract from a Nigerian folk tale. What is the moral of the story?",
        "example_response": "The story is about a tortoise who is greedy and gets punished. The moral is that being greedy leads to bad things happening to you.",
        "common_errors": [
          "Treating world literature as exotic curiosities rather than as literature with universal themes",
          "Assuming that translated texts are automatically less literary than English-language originals"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Engages with texts from different cultures with curiosity and begins to notice how cultural context shapes storytelling conventions.",
        "example_task": "Compare the way a character is introduced in a European fairy tale and in a West African Anansi story. What do you notice?",
        "example_response": "In European fairy tales, characters are often described by their appearance and social role -- 'a beautiful princess' or 'a poor woodcutter'. In the Anansi story, the character is introduced through what they do and how clever they are. Anansi is a trickster who outsmarts others. The European story focuses on what characters look like; the African story focuses on what they are like. This might reflect different cultural values about what matters in a person.",
        "common_errors": [
          "Making sweeping generalisations about entire cultures based on one text",
          "Comparing only surface-level differences without considering deeper literary techniques"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Reads world literature with critical engagement, understanding how different literary traditions use narrative, form and theme, and recognising universal human concerns across cultures.",
        "example_task": "How does a text from a non-British literary tradition explore a theme that also appears in British literature? Compare the approaches.",
        "example_response": "Both Harper Lee's 'To Kill a Mockingbird' (American) and Charles Dickens's 'Oliver Twist' (British) explore the theme of social injustice through the perspective of a child narrator. Lee uses Scout's naive first-person voice to expose racial injustice in the American South -- Scout does not fully understand what she witnesses, which forces the reader to interpret events that the narrator cannot. Dickens uses a more omniscient narrator who describes Oliver's suffering in the workhouse with a satirical tone directed at the reader. The American tradition emphasises individual moral courage (Atticus standing alone), while Dickens emphasises systemic critique (the institutions themselves are corrupt). Both traditions use the innocent child to make injustice visible, but the narrative techniques reflect different literary cultures.",
        "common_errors": [
          "Comparing only thematic content without analysing how technique differs across traditions",
          "Assuming one literary tradition is superior to another"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Independently seeks out and evaluates world literature, understanding how translation, cultural context and literary tradition shape meaning, and critiquing the idea of a single literary canon.",
        "example_task": "Should the English curriculum include more world literature? Argue your case with specific examples.",
        "example_response": "The English curriculum should include substantially more world literature because the canon currently privileges a narrow slice of human literary achievement. Reading Chinua Achebe's 'Things Fall Apart' alongside Conrad's 'Heart of Darkness' does not just add diversity -- it fundamentally challenges the reader to question whose perspective literature privileges. Achebe's realist depiction of Igbo society directly counters Conrad's symbolic reduction of Africa to a backdrop for European moral crisis. Similarly, reading magical realism from Latin America (Gabriel Garcia Marquez) shows that Western realism is not the only sophisticated way to represent reality -- it is a convention, not a default. The strongest argument for world literature is pedagogical: students who encounter only one tradition develop a narrower analytical toolkit. A student who has read Japanese haiku, West African oral narrative, and Caribbean poetry alongside British canonical texts will have a more flexible and critically aware understanding of what literature can do.",
        "common_errors": [
          "Arguing for inclusion based only on representation rather than also on literary quality and critical value",
          "Treating world literature as a homogeneous category rather than recognising its internal diversity"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C006",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Chooses books based on cover, series loyalty or peer recommendation without considering challenge level, breadth or personal reading goals.",
        "example_task": "How did you choose the book you are reading now?",
        "example_response": "My friend said it was good so I picked it up.",
        "common_errors": [
          "Selecting books well below reading level because they feel safe and easy",
          "Never abandoning an unsuitable book, or abandoning every book after a few pages"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Uses some strategies for book selection including reading blurbs, sampling opening pages and considering genre, but tends to stay within a comfort zone.",
        "example_task": "You have finished your current book. Describe your process for choosing the next one.",
        "example_response": "I read the blurb to see what the book is about and check if it sounds interesting. I read the first page to see if I like the writing style. I also look at the genre because I know I enjoy mystery stories. This time I might try historical fiction because my teacher suggested I try something different.",
        "common_errors": [
          "Relying on a single criterion (e.g. genre) without considering difficulty or variety",
          "Not being able to explain why a book is or is not a good choice for them"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Selects books purposefully, balancing personal interest with challenge, breadth and reading goals, and can articulate why a particular text is a good choice at this point in their reading journey.",
        "example_task": "You have been reading mainly contemporary fiction this term. Choose your next book and explain why it is a good choice.",
        "example_response": "I am going to read 'The Strange Case of Dr Jekyll and Mr Hyde' by Stevenson because I have read very little pre-1914 fiction this year and it will stretch me. It is a novella so it is manageable in length, but the language will be more challenging than what I usually read. I know it is a Gothic text which connects to my interest in mystery and horror but from a different era. It will also prepare me for GCSE because 19th-century fiction is a requirement. I read the first page in the library and found I could follow it with effort, which is the right level of challenge.",
        "common_errors": [
          "Always choosing books of the same difficulty rather than stretching",
          "Not connecting book choices to broader reading goals"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Curates their own reading with independence and critical awareness, seeking out texts that challenge assumptions, fill gaps in their experience, and develop them as both a reader and a thinker.",
        "example_task": "Design a personal reading plan for the next term that addresses a gap in your reading experience and explain your reasoning.",
        "example_response": "I have noticed that almost all my reading has been prose fiction and I have avoided poetry. My plan is to read one poetry collection per month alongside my usual novel. I will start with 'The World's Wife' by Carol Ann Duffy because the dramatic monologue form gives me a narrative entry point. Then I will try 'Staying Alive' edited by Neil Astley, which is an anthology of accessible modern poetry organised by theme. Finally I will attempt some Romantic poetry -- Keats or Shelley -- because I need to build confidence with pre-1914 verse before KS4. I will keep a reading journal noting which poems I respond to strongly and why, so I can identify my preferences within the genre. This plan addresses my weakest area while building on my strength (close reading of character and voice) in a new form.",
        "common_errors": [
          "Planning ambitiously without realistic strategies for sustaining the plan",
          "Choosing texts that address gaps but not considering engagement and sustainability"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C007",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Views re-reading as unnecessary repetition and believes that reading a text once is sufficient for full understanding.",
        "example_task": "We are going to re-read the opening of the novel we studied last term. What might you notice on a second reading?",
        "example_response": "I do not know. I already read it once so I know what happens.",
        "common_errors": [
          "Equating re-reading with inability to understand on the first attempt",
          "Confusing re-reading with skimming to remember plot"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Recognises that re-reading can reveal things missed on a first reading, and notices new details with teacher guidance.",
        "example_task": "Re-read the opening chapter of the novel now that you know how it ends. What do you notice that you missed before?",
        "example_response": "Now I know that the character dies at the end, I can see that the opening has hints. The writer describes the sky as 'bruised' and the character 'shivered despite the warmth'. These details felt like ordinary description the first time but now I can see they are foreshadowing.",
        "common_errors": [
          "Only noticing plot foreshadowing rather than also attending to language, structure and theme",
          "Re-reading passively without a specific focus or question"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Re-reads independently and purposefully, using second readings to deepen analysis of language, structure and theme, and to make comparisons with other texts.",
        "example_task": "Choose a passage you have studied before and re-read it alongside a passage from a different text on a similar theme. What does the comparison reveal?",
        "example_response": "Re-reading the description of Scrooge's counting house in 'A Christmas Carol' alongside the description of Miss Havisham's room in 'Great Expectations', I notice both Dickens and later writers use physical setting to externalise a character's emotional state. Scrooge's cold, dim, spare office reflects his emotional coldness; Miss Havisham's decaying wedding feast reflects her refusal to move on from the past. On second reading I noticed Dickens uses sensory detail differently: Scrooge's scene is about absence (no warmth, no light, no comfort) while Miss Havisham's is about presence (dust, cobwebs, rotting cake). Both techniques are effective but the second is more unsettling.",
        "common_errors": [
          "Comparing only surface-level similarities without analysing technique",
          "Not explaining how re-reading specifically enabled the comparison"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Uses re-reading as a critical practice to develop evolving interpretations, recognising that great literature rewards multiple readings and that a reader's understanding changes over time.",
        "example_task": "Write a reflective piece about how your interpretation of a text has changed between first reading and subsequent re-readings.",
        "example_response": "When I first read 'Lord of the Flies' in Year 7, I understood it as a story about boys who become savage on an island -- exciting, frightening, and straightforward. Re-reading it in Year 9 after studying the context of post-war anxieties, I now see it as Golding's argument about human nature: the island is not a special case but a controlled experiment that strips away the thin layer of civilisation. On my first reading, I sympathised entirely with Ralph and saw Jack as a villain. On re-reading, I noticed that Ralph participates in Simon's murder -- Golding deliberately implicates even the 'good' character, which undermines any simple moral reading. My understanding of the novel has moved from plot-level engagement to thematic analysis, and I suspect another reading in a few years would reveal further layers.",
        "common_errors": [
          "Claiming interpretation has changed without giving specific textual evidence",
          "Not acknowledging that the reader's own development contributes to changed interpretation"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C009",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Tends to skip over unfamiliar words or stop reading rather than using strategies to determine meaning from context.",
        "example_task": "Read this passage. Circle any words you do not know and try to work out their meaning from the surrounding sentences.",
        "example_response": "I circled 'melancholy' but I am not sure what it means. The sentence says the character sat in melancholy silence, so maybe it means something like sad?",
        "common_errors": [
          "Skipping unknown words entirely without attempting to decode them",
          "Looking up every unknown word in a dictionary without first trying context"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Uses basic context clues to infer the meaning of unfamiliar words and checks understanding using a dictionary when context is insufficient.",
        "example_task": "The writer describes the room as 'austere'. Using the context of the whole paragraph, what does 'austere' mean? Check your inference with a dictionary.",
        "example_response": "The paragraph describes bare walls, no ornaments, hard wooden chairs and cold light. So 'austere' probably means plain, strict and without comfort. The dictionary says 'severe in manner or appearance; undecorated and simple'. My inference was close. The writer uses 'austere' to show the character does not value comfort or warmth.",
        "common_errors": [
          "Using context clues to get the general sense but not the precise meaning",
          "Not connecting the vocabulary choice to the writer's purpose"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Confidently infers meaning from context, uses morphological knowledge (prefixes, roots, suffixes) to decode unfamiliar words, and understands how vocabulary choices contribute to tone and meaning.",
        "example_task": "In this passage, the writer describes the crowd as 'incredulous'. Using your knowledge of word roots and the context, explain what this means and why the writer chose this word rather than 'surprised'.",
        "example_response": "The Latin root 'cred' means 'believe' (as in 'credible' and 'credit'), and the prefix 'in-' means 'not'. So 'incredulous' literally means 'not believing'. The crowd cannot believe what they are seeing. The writer chose 'incredulous' rather than 'surprised' because surprise is a brief reaction, but incredulity suggests a deeper refusal to accept what is happening. It implies the event contradicts everything the crowd thought was possible. The word also has a more formal, serious register than 'surprised', which fits the gravity of the scene.",
        "common_errors": [
          "Identifying the root correctly but not explaining the connotative difference between synonyms",
          "Not connecting vocabulary analysis to the wider tone of the passage"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Analyses vocabulary choices in challenging texts with precision, understanding etymology, connotation and register, and evaluates how individual word choices shape the reader's experience.",
        "example_task": "In this 19th-century passage, the writer uses the word 'rapacious' to describe a landlord. Analyse this word choice in detail, including its etymology, connotations and effect.",
        "example_response": "Rapacious derives from the Latin 'rapere' meaning 'to seize or snatch' -- the same root as 'raptor' (a bird of prey that snatches its food) and 'rape' (to seize by force). Describing a landlord as 'rapacious' therefore carries connotations of predatory violence: the landlord does not merely charge rent but seizes wealth from tenants who cannot resist. The word positions the landlord as a predator and the tenants as prey, creating a power dynamic that goes beyond financial exploitation to something animalistic and threatening. In the Victorian context, this word choice serves a satirical purpose: a gentleman landlord is described in terms that associate him with beasts of prey, undermining his claims to civilisation and respectability. A simpler word like 'greedy' would describe the same behaviour but without the predatory connotations, the Latin register, or the implicit critique of the class system.",
        "common_errors": [
          "Providing etymology without connecting it to the specific effect in this context",
          "Analysing the word in isolation rather than within the sentence and passage"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C010",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Understands what a text explicitly states but struggles to read between the lines or identify implied meaning.",
        "example_task": "Read this passage where a character says 'Fine' when asked how they are feeling, but the writer describes them clenching their fists. What is the character really feeling?",
        "example_response": "The character says they are fine so they are probably okay. Maybe they are a bit annoyed because of the fists.",
        "common_errors": [
          "Taking characters' words at face value without considering contradictory evidence",
          "Guessing at meaning without anchoring the inference in textual evidence"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Makes reasonable inferences about character feelings and motivations, supported by some textual evidence, but may miss more subtle or complex layers of implied meaning.",
        "example_task": "In this extract, the narrator describes watching rain 'slide down the windowpane like tears'. What might this suggest about the narrator's emotional state?",
        "example_response": "The comparison of rain to tears suggests the narrator is feeling sad. The image of watching rain slide down the window also suggests they are trapped inside and perhaps feeling isolated. The word 'slide' is slow and quiet, which creates a melancholy mood.",
        "common_errors": [
          "Making only one inference when the image supports multiple layers of meaning",
          "Identifying the technique (simile) without fully exploring what it implies"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Makes sophisticated, multi-layered inferences about character, theme and authorial intent, consistently supporting interpretations with precise textual evidence.",
        "example_task": "In 'Animal Farm', the pigs begin walking on two legs. What does Orwell imply about revolution and power through this detail?",
        "example_response": "The pigs' adoption of two-legged walking is Orwell's most devastating image of revolutionary betrayal. The original commandment 'Four legs good, two legs bad' was the animals' founding principle -- the single idea that united them against human oppression. When the pigs walk on two legs, they have not just broken a rule; they have become the thing they overthrew. Orwell implies that power corrupts absolutely: the revolution did not fail because of external enemies but because the revolutionaries themselves became indistinguishable from their oppressors. The detail also implies that the other animals' inability to challenge this transformation shows how propaganda and gradual change can make the unthinkable seem inevitable. The reader infers what the animals cannot articulate: that the revolution was always about replacing one ruling class with another.",
        "common_errors": [
          "Explaining the allegory without analysing the specific textual detail",
          "Making inferences about authorial intent without supporting them with evidence from the text"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Draws complex inferences that consider multiple possible interpretations, evaluates the strength of different readings, and understands how authorial choices create deliberate ambiguity.",
        "example_task": "In 'The Tempest', Prospero says 'This thing of darkness I acknowledge mine' about Caliban. What are the possible interpretations of this line, and which do you find most convincing?",
        "example_response": "This line operates on at least three interpretive levels. On the surface, Prospero is claiming ownership of Caliban as his servant -- 'mine' means 'my property'. This reading fits the colonial interpretation: Prospero reasserts control over the colonised subject. However, 'this thing of darkness' can also be read psychologically: Prospero acknowledges the dark, controlling, vengeful aspects of his own nature that Caliban represents. In this reading, Caliban is Prospero's shadow self, and 'acknowledge mine' means 'admit is part of me'. A third interpretation combines both: Prospero recognises that his colonialism -- his subjugation of Caliban -- is itself the 'darkness' he must own. The ambiguity is deliberate. Shakespeare does not resolve it because the line's power lies in its multiple layers. I find the psychological reading most convincing because it is consistent with Prospero's broader arc of relinquishing power and his final plea for forgiveness in the epilogue -- he is acknowledging his own capacity for tyranny, not just reclaiming a servant.",
        "common_errors": [
          "Committing to one interpretation without acknowledging alternatives",
          "Listing interpretations without evaluating which is most convincing and why"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C011",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Makes claims about a text without supporting them with evidence, or retells events rather than using quotations to support a point.",
        "example_task": "What is the character of Scrooge like at the beginning of 'A Christmas Carol'? Use evidence from the text.",
        "example_response": "Scrooge is mean and he does not like Christmas. He is horrible to everyone.",
        "common_errors": [
          "Making unsupported assertions without any textual evidence",
          "Retelling the plot instead of selecting evidence to support a point"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Selects relevant quotations to support points but may not embed them smoothly or analyse them in detail.",
        "example_task": "How does Dickens present Scrooge as cold and isolated at the beginning of 'A Christmas Carol'? Support your answer with quotations.",
        "example_response": "Dickens says Scrooge is 'a squeezing, wrenching, grasping, scraping, clutching, covetous old sinner'. This shows he is greedy and unpleasant. He also says 'The cold within him froze his old features' which shows he is cold on the inside as well as the outside.",
        "common_errors": [
          "Selecting long quotations without identifying which words are most important",
          "Using quotations as decoration rather than as the basis for analysis"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Selects short, precise quotations, embeds them fluently within analytical sentences, and uses them as the basis for detailed comment on language and effect.",
        "example_task": "How does Dickens use language to present Scrooge's isolation? Select two short quotations and analyse them closely.",
        "example_response": "Dickens describes Scrooge as 'solitary as an oyster', a simile that works on multiple levels: an oyster is encased in a hard shell that protects it from the world, just as Scrooge has built emotional barriers around himself. The word 'solitary' suggests his isolation is total, and the comparison to an oyster -- a cold, grey, closed creature -- implies that Scrooge has chosen to shut out human warmth. Later, Dickens writes that 'no warmth could warm' him, using repetition of 'warm' to emphasise the completeness of his emotional coldness. The internal rhyme creates a sense of finality -- nothing and no one can reach him. Both quotations establish Scrooge's isolation as self-imposed and total, setting up the transformation that Christmas will demand.",
        "common_errors": [
          "Analysing quotations in isolation without connecting them to a broader argument",
          "Explaining what the quotation means without analysing how the language creates its effect"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Deploys textual evidence with the precision and fluency of an accomplished literary critic, using quotations to build sustained, multi-layered arguments and tracking language patterns across a whole text.",
        "example_task": "Trace Dickens's use of temperature imagery across 'A Christmas Carol' and explain how it supports the novel's moral argument.",
        "example_response": "Dickens constructs a systematic temperature motif that maps directly onto Scrooge's moral journey. In Stave 1, cold dominates: Scrooge's 'cold within him froze his old features', his office has a 'very small fire' while Bob Cratchit shivers, and even the weather seems to reflect his character -- 'biting' fog and 'piercing' cold. This is not pathetic fallacy but moral geography: Dickens places Scrooge at the centre of a frozen world of his own making. The word 'froze' is significant because it implies his emotional state has solidified -- it is not temporary unhappiness but permanent, structural coldness. In Stave 3, warmth enters through the Cratchits' Christmas dinner: 'a blaze of ruddy light', the family 'warm' with togetherness despite poverty. Heat here represents generosity, love and community -- everything Scrooge lacks. The turning point comes in Stave 4 when Scrooge's future corpse lies in a cold, dark room 'plundered and bereft' while the Cratchits grieve Tim in a room still lit with remembered warmth. The final stave completes the pattern: Scrooge sends a turkey, lights a fire, and becomes 'as good a friend, as good a master, and as good a man, as the good old city knew'. Warmth has replaced cold, but Dickens's argument is subtle: the warmth was always available -- Scrooge chose cold. The temperature imagery is the novel's moral argument in miniature.",
        "common_errors": [
          "Tracking the motif without explaining its moral significance",
          "Quoting extensively without close analysis of specific word choices"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C012",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Reads texts without considering who they were written for or why, treating all texts as straightforward communication.",
        "example_task": "Who is this newspaper article written for? What is it trying to do?",
        "example_response": "It is written for people who read newspapers. It is telling them about something that happened.",
        "common_errors": [
          "Identifying audience in vague terms ('everyone', 'newspaper readers') without specificity",
          "Not distinguishing between informing, persuading, entertaining and arguing"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifies the likely audience and purpose of texts with some accuracy and begins to notice how these shape the writer's choices.",
        "example_task": "This charity advert uses a photograph of a child and the phrase 'Just 2 pounds a month'. Who is the target audience and what is the purpose? How do you know?",
        "example_response": "The audience is adults who have some money to spare, probably parents because the photo of a child appeals to parental instinct. The purpose is to persuade people to donate. The phrase 'Just 2 pounds' makes it sound affordable and easy. The photograph creates an emotional response.",
        "common_errors": [
          "Identifying audience and purpose correctly but not explaining how specific features serve them",
          "Assuming that all persuasive texts work in the same way"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses how audience and purpose shape every aspect of a text's language, structure and presentation, and explains the relationship between these elements with precision.",
        "example_task": "Compare how a tabloid and a broadsheet newspaper report the same event. How do their different audiences affect their language choices?",
        "example_response": "The tabloid uses short sentences, colloquial vocabulary ('slammed', 'fury'), a dramatic headline, and emotive language that positions the reader to share the writer's outrage. Its audience expects entertainment alongside information, so the report reads like a story with a clear villain. The broadsheet uses longer, more complex sentences, formal vocabulary ('criticism', 'controversy'), qualifying language ('some analysts suggest'), and a more balanced presentation of multiple viewpoints. Its audience expects nuanced analysis, so the writer maintains a more measured tone. Both report the same facts but the tabloid's purpose is to provoke an emotional reaction while the broadsheet's is to inform and enable the reader's own judgement. The tabloid assumes a reader with strong existing opinions; the broadsheet assumes a reader who wants evidence before forming one.",
        "common_errors": [
          "Describing differences without explaining how audience drives them",
          "Treating one approach as objectively better rather than suited to different purposes"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluates how texts construct and manipulate their implied audience, recognising that audience and purpose are not fixed but are created by the text itself, and critiques the assumptions texts make about their readers.",
        "example_task": "How does a political speech construct its audience? Analyse how the speaker creates a sense of shared identity and purpose.",
        "example_response": "Political speeches do not merely address an existing audience -- they construct one. Martin Luther King's 'I Have a Dream' speech uses the first-person plural ('we') to create a unified collective from a diverse crowd: 'We cannot walk alone.' This pronominal choice transforms individuals into a movement. The repeated refrain 'I have a dream' shifts from collective present ('we') to individual future vision ('I'), positioning King as the voice of the community's aspirations. The speech also constructs its audience through exclusion: the 'we' implicitly defines a 'they' (those who oppose civil rights), which gives the audience a shared adversary and therefore a shared identity. The biblical register ('Let freedom ring') constructs an audience that recognises scriptural allusion, connecting the civil rights movement to a moral tradition. The speech's audience is not just the 250,000 people on the Mall; through its rhetoric, it constructs an imagined community of all who share these values. This is what the best persuasive writing does: it does not find its audience but creates it.",
        "common_errors": [
          "Analysing the speech's content without examining how its rhetoric constructs an audience",
          "Treating the audience as a pre-existing group rather than one created by the text"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C013",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Reads texts without considering the historical or cultural conditions in which they were written, treating all texts as if they were written today.",
        "example_task": "This text was written in 1847. Does that matter for how we read it?",
        "example_response": "Not really. A good story is a good story no matter when it was written.",
        "common_errors": [
          "Assuming that historical context is irrelevant to understanding a text",
          "Judging characters' behaviour by modern standards without historical awareness"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Recognises that historical and cultural context affects a text's meaning and can identify basic contextual information when prompted.",
        "example_task": "How does knowing that 'A Christmas Carol' was written in 1843, during a time of extreme poverty and child labour, affect your understanding of the story?",
        "example_response": "Knowing about Victorian poverty helps explain why Dickens wrote about the Cratchits and Tiny Tim. He was trying to make rich people feel guilty about ignoring poor families. The story was meant to change people's attitudes, not just entertain them.",
        "common_errors": [
          "Mentioning context in general terms without connecting it to specific textual details",
          "Treating context as background information rather than as something that shapes meaning"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Integrates contextual knowledge into textual analysis, explaining how historical, social and cultural conditions shape a writer's choices and a reader's interpretation.",
        "example_task": "How does the historical context of colonialism affect the meaning of 'The Tempest'?",
        "example_response": "Shakespeare wrote 'The Tempest' in 1611, a period when England was actively colonising the New World. Prospero's arrival on the island, his subjugation of Caliban (the island's native inhabitant), and his use of magic to control and dominate mirror the colonial pattern of European conquest. Caliban's speech -- 'This island's mine, by Sycorax my mother, which thou takest from me' -- articulates the colonial subject's experience of dispossession. When Prospero teaches Caliban language and Caliban responds 'You taught me language; and my profit on't is, I know how to curse', Shakespeare dramatises the double-edged nature of colonial education: the coloniser's language becomes the tool of resistance. Reading this in 1611, an audience might have sympathised with Prospero; reading it now, with awareness of colonialism's legacy, we are more likely to hear Caliban's grievance. Context does not change the words but it changes what we hear in them.",
        "common_errors": [
          "Adding context as a separate paragraph rather than weaving it into textual analysis",
          "Applying only one contextual lens when multiple contexts are relevant"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluates how multiple contexts (historical, cultural, biographical, literary) interact to create meaning, and understands that context is itself an interpretive choice -- different contexts produce different readings.",
        "example_task": "Choose a text you have studied and show how applying different contextual lenses produces different interpretations.",
        "example_response": "Applying different contexts to 'Frankenstein' produces radically different readings. A biographical context focuses on Mary Shelley's personal losses -- the death of her mother in childbirth, the death of her own baby -- and reads the Creature's abandonment by his creator as Shelley's exploration of parental responsibility and grief. A scientific context reads the novel as a response to contemporary galvanism experiments and Enlightenment hubris -- the danger of science without ethics. A feminist context reads it as a critique of male creative ambition: Victor's attempt to create life without a woman results in monstrosity, suggesting that bypassing female reproductive power is inherently dangerous. A postcolonial context reads the Creature as a racial Other -- described in terms of physical difference, rejected by society for his appearance, articulate but unheard. Each context illuminates different aspects of the same text, and none is definitively 'correct'. The novel's enduring power lies in its capacity to sustain multiple readings simultaneously. The choice of context is itself an interpretive act -- what we bring to a text shapes what we find in it.",
        "common_errors": [
          "Presenting one contextual reading as the definitive interpretation",
          "Listing contexts without showing how each produces a distinct reading of specific textual details"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C014",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Reads without checking understanding and may not realise when comprehension has broken down.",
        "example_task": "After reading this passage, rate your understanding on a scale of 1-5 and explain what, if anything, confused you.",
        "example_response": "I think I understood it. Maybe 3. I am not sure about some of the words.",
        "common_errors": [
          "Not recognising when understanding has been lost",
          "Continuing to read without stopping to resolve confusion"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Recognises when comprehension breaks down and can identify what is causing confusion, using basic strategies such as re-reading or asking for help.",
        "example_task": "Read this challenging paragraph. When you get confused, stop and write down what confused you and what strategy you will use.",
        "example_response": "I got confused in the third sentence because the writer uses a very long sentence with lots of clauses. I re-read it twice and broke it into smaller parts. The main point is that the character feels torn between two choices. I also looked up 'equivocate' which means to avoid giving a clear answer.",
        "common_errors": [
          "Identifying confusion but not using a specific strategy to resolve it",
          "Re-reading the same passage without trying a different approach"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Actively monitors understanding while reading, using a repertoire of strategies (re-reading, questioning, summarising, contextual inference) to resolve confusion independently.",
        "example_task": "Read this unfamiliar extract and annotate it to show where you monitored your understanding and what strategies you used.",
        "example_response": "Paragraph 1: I summarised the main idea in the margin ('character arrives in a new city and feels overwhelmed'). Paragraph 2: The word 'inscrutable' was unfamiliar -- I inferred from the context ('faces that gave nothing away') that it means impossible to understand. Paragraph 3: I was confused by a shift in tense from past to present -- I re-read and realised the writer is using present tense for the character's thoughts (interior monologue) and past tense for narration. Paragraph 4: I asked myself 'why does the writer end with this image?' and noted that the closing image of a locked door connects symbolically to the character's feeling of exclusion.",
        "common_errors": [
          "Using only one strategy (e.g. always re-reading) rather than selecting the most appropriate one",
          "Monitoring vocabulary but not monitoring structural or thematic comprehension"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Monitors comprehension at multiple levels simultaneously (literal, inferential, structural, thematic) and uses metacognitive awareness to reflect on how their reading process works and how to improve it.",
        "example_task": "Read this challenging unseen extract and write a brief commentary on your own reading process: what was easy, what was difficult, and what strategies served you best.",
        "example_response": "The extract was from a 19th-century essay with complex syntax and unfamiliar vocabulary. My first reading gave me the general argument (the writer opposes capital punishment) but I missed the subtlety of how the argument was constructed. On second reading, I focused on the rhetorical structure: the writer begins by conceding that crime must be punished (which I initially mistook for support of execution), then systematically dismantles the arguments for capital punishment using logical reasoning and emotional appeal. My best strategy was questioning -- asking 'what is this paragraph doing in the argument?' at each stage. My weakest area was vocabulary: I had to infer several words ('ameliorate', 'repugnant') and I should build my vocabulary of formal argument terms. I also noticed that reading slowly and tolerating initial confusion (rather than panicking or giving up) allowed meaning to build across paragraphs.",
        "common_errors": [
          "Describing what they did without evaluating which strategies were most effective",
          "Not identifying specific areas for improvement in their reading process"
        ]
      }
    ]
  }
]
