[
  {
    "concept_id": "EN-Y5-C028",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Understanding that a relative clause gives extra information about a noun and is introduced by a relative pronoun (who, which, that, where, when).",
        "example_task": "Join these two sentences using 'who': 'The girl won the race. She trains every morning.'",
        "example_response": "The girl who trains every morning won the race.",
        "common_errors": [
          "Placing the relative clause in the wrong position ('The girl won the race who trains every morning')",
          "Not understanding that 'who' replaces the repeated noun"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Constructing relative clauses using the correct relative pronoun for the type of noun (who for people, which for things, where for places).",
        "example_task": "Add a relative clause to each sentence using the correct relative pronoun: 'The castle ___ was built in 1200 is now a museum.' 'The scientist ___ discovered penicillin was Alexander Fleming.' 'The park ___ we play football is being renovated.'",
        "example_response": "The castle which was built in 1200 is now a museum. (which for a thing) The scientist who discovered penicillin was Alexander Fleming. (who for a person) The park where we play football is being renovated. (where for a place)",
        "common_errors": [
          "Using 'which' for people instead of 'who'",
          "Using 'who' for things instead of 'which'"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Constructing relative clauses accurately in independent writing, punctuating non-defining relative clauses with commas, and understanding when relative pronouns can be omitted.",
        "example_task": "Write three sentences with relative clauses: one defining (no commas), one non-defining (with commas), and one with an omitted relative pronoun.",
        "example_response": "Defining: The book that I borrowed from the library was about Ancient Egypt. (No commas because the clause tells us which book.) Non-defining: My dog, who is called Rex, loves swimming in the river. (Commas because we already know which dog; the clause adds extra information.) Omitted pronoun: The film we watched last night was brilliant. (The word 'that' has been omitted but the sentence still makes sense.)",
        "common_errors": [
          "Omitting commas around non-defining relative clauses",
          "Adding commas around defining relative clauses where they are not needed"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using relative clauses with variety and precision in extended writing, choosing between defining and non-defining forms for effect, and using whose and complex constructions confidently.",
        "example_task": "Write a paragraph about a historical figure using at least three different relative clauses, including one with 'whose'. Explain why you chose defining or non-defining form in each case.",
        "example_response": "Florence Nightingale, who was born in 1820, transformed nursing from a low-status job into a respected profession. (Non-defining with commas: we already know who she is, so the birth date is extra information.) The hospital where she worked in Crimea was dirty and overcrowded. (Defining without commas: the clause tells us which hospital.) The soldiers whose wounds she treated had a much better chance of survival. (Defining with 'whose': it specifies which soldiers.) Nightingale, whose statistical work proved that hygiene saved lives, changed medical practice forever. (Non-defining with 'whose': adds information about an achievement.)",
        "common_errors": [
          "Avoiding 'whose' because it feels difficult and substituting a clumsy alternative",
          "Writing very long relative clauses that make the sentence difficult to follow"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C029",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising common modal verbs (can, will, might, must) and understanding that they express possibility or certainty.",
        "example_task": "Put these sentences in order from most certain to least certain: 'It will rain tomorrow.' 'It might rain tomorrow.' 'It must rain tomorrow.' 'It could rain tomorrow.'",
        "example_response": "Most certain: It must rain tomorrow. Then: It will rain tomorrow. Then: It could rain tomorrow. Least certain: It might rain tomorrow.",
        "common_errors": [
          "Treating all modal verbs as meaning the same thing",
          "Not understanding that 'must' expresses strong obligation or certainty, not just emphasis"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using modal verbs to express different degrees of possibility in writing and explaining how changing the modal changes the meaning.",
        "example_task": "Rewrite this sentence four times, each time using a different modal verb. Explain how the meaning changes: 'You ___ finish your homework before dinner.'",
        "example_response": "You must finish your homework before dinner. (No choice, it is compulsory.) You should finish your homework before dinner. (Strong advice, but not compulsory.) You could finish your homework before dinner. (It is one option among several.) You might finish your homework before dinner. (It is possible but uncertain.)",
        "common_errors": [
          "Using 'can' and 'could' interchangeably without recognising the difference in certainty",
          "Writing 'should of' instead of 'should have'"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using modal verbs purposefully in writing to indicate degrees of possibility, necessity or certainty, and understanding how modal choice affects register and meaning.",
        "example_task": "Write a paragraph about climate change using at least three different modal verbs. Explain why you chose each one.",
        "example_response": "Scientists say that global temperatures will continue to rise if emissions are not reduced. (Will: this is presented as a certainty based on evidence.) Governments should invest more in renewable energy. (Should: this is a strong recommendation, not an obligation.) Sea levels could rise by over a metre by 2100. (Could: this is a possibility, not a certainty.) Each modal verb signals how confident the writer is: 'will' for near-certainty, 'should' for recommendation, 'could' for possibility.",
        "common_errors": [
          "Using only 'will' and 'can' without exploring the full range of modals",
          "Not recognising that modal verbs are essential in science and non-fiction writing for hedging claims"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Selecting modal verbs with precision to control tone and register, combining modals with adverbs to fine-tune degrees of possibility, and identifying how modal choice affects persuasion.",
        "example_task": "A headteacher writes to parents: 'Your child must attend the school trip.' A parent replies: 'My child may not be able to attend.' Analyse how the modal verbs create different power dynamics. Then rewrite the headteacher's sentence to be less authoritative.",
        "example_response": "The headteacher uses 'must', which expresses compulsion and leaves no room for choice. This creates an authority dynamic where the school is giving orders. The parent uses 'may not be able to', which is polite and tentative, using 'may' to soften the refusal. The power difference is encoded in the modal choice. A less authoritative version: 'We would encourage all children to attend the school trip.' 'Would encourage' suggests preference rather than command, and respects the parent's right to decide.",
        "common_errors": [
          "Analysing the meaning of the modals but not discussing the power dynamics they create",
          "Not recognising that modal choice is a key tool for controlling register in formal writing"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C030",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Understanding that a sentence can be written in two ways: active (the subject does the action) and passive (the subject receives the action), with teacher modelling.",
        "example_task": "The teacher writes two sentences: 'The cat chased the mouse.' 'The mouse was chased by the cat.' What is different about these two sentences?",
        "example_response": "In the first sentence, the cat is doing the chasing. In the second sentence, the mouse comes first and the cat is mentioned at the end. Both sentences describe the same event but from a different point of view.",
        "common_errors": [
          "Thinking the two sentences have different meanings rather than different emphasis",
          "Not noticing the structural change (subject and object have swapped position)"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Converting simple active sentences into passive and identifying the passive construction ('be' + past participle), noting that the agent ('by...') is optional.",
        "example_task": "Rewrite each active sentence as passive: 'The goalkeeper saved the penalty.' 'The Vikings invaded Britain.' 'Someone broke the window.'",
        "example_response": "The penalty was saved by the goalkeeper. Britain was invaded by the Vikings. The window was broken. (I left out 'by someone' because we do not know who did it, which is a reason to use passive.)",
        "common_errors": [
          "Forgetting to use the correct form of 'be' (was/were) before the past participle",
          "Including the agent when it would be better omitted"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using passive voice purposefully in writing, understanding when and why writers choose passive over active (to change focus, omit the agent, or create a formal tone), and identifying passive constructions in texts.",
        "example_task": "Read this science report: 'The solution was heated to 60 degrees. The results were recorded in a table. No errors were observed.' Why does science writing use the passive voice? Rewrite it in active voice and explain what is lost.",
        "example_response": "Science writing uses passive because it focuses on what happened rather than who did it. It sounds objective and formal. Active version: 'I heated the solution to 60 degrees. I recorded the results in a table. I did not observe any errors.' The active version sounds personal and informal because it draws attention to the scientist rather than the experiment. Science writing deliberately removes the person to focus on the method and results.",
        "common_errors": [
          "Confusing past tense with passive voice (thinking 'I heated' is passive because it is past tense)",
          "Using passive in all writing once learned, without selecting it purposefully"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Analysing how published writers and public figures use passive voice strategically, including to avoid responsibility or create deliberate ambiguity.",
        "example_task": "A politician says: 'Mistakes were made.' A journalist writes: 'The government made serious mistakes.' Compare these two sentences. Why might the politician choose the passive?",
        "example_response": "The politician uses passive voice ('Mistakes were made') to avoid saying who made the mistakes. There is no agent in the sentence, so nobody is blamed directly. The journalist uses active voice ('The government made serious mistakes') to assign responsibility clearly. The politician's passive construction is a deliberate rhetorical choice: it acknowledges that something went wrong while avoiding personal accountability. This shows that passive voice is not just a grammar choice but a tool for controlling how information is presented and who takes responsibility.",
        "common_errors": [
          "Recognising the grammatical difference but not analysing the rhetorical purpose",
          "Assuming passive voice is always bad writing rather than understanding it as a strategic choice"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C031",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising the present perfect form ('have/has + past participle') and understanding that it describes a past action connected to the present.",
        "example_task": "What is the difference between 'I ate my lunch' and 'I have eaten my lunch'?",
        "example_response": "'I ate my lunch' just tells you it happened in the past. 'I have eaten my lunch' means I ate it in the past but it matters now, maybe because I am full or because someone is asking me if I want food.",
        "common_errors": [
          "Treating both sentences as meaning exactly the same thing",
          "Not understanding why the present perfect connects the past to the present"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Forming present perfect sentences correctly using 'have/has + past participle' and distinguishing them from simple past in writing.",
        "example_task": "Complete each sentence with the correct form: 'Yesterday, I (go/went/have gone) to the park.' 'I (visit/visited/have visited) three countries in my life.'",
        "example_response": "Yesterday, I went to the park. (Simple past because it happened at a specific time in the past.) I have visited three countries in my life. (Present perfect because the time period 'in my life' is still continuing.)",
        "common_errors": [
          "Using present perfect with a specific past time ('I have gone yesterday' is incorrect)",
          "Using simple past when present perfect is needed ('I visited three countries in my life' is less natural)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using both present perfect and past perfect forms correctly in writing, understanding that the past perfect ('had + past participle') places one past action before another.",
        "example_task": "Write a short narrative passage that uses simple past, present perfect and past perfect. Explain why each tense form is used.",
        "example_response": "Last summer, we visited Grandma in Scotland. (Simple past: a completed action at a specific time.) She had already prepared our rooms before we arrived. (Past perfect: 'had prepared' happened before 'arrived', so the earlier action uses past perfect.) We have been back twice since then. (Present perfect: connects the past visits to the present moment, suggesting we may visit again.)",
        "common_errors": [
          "Confusing present perfect with past perfect (using 'had' when 'have' is needed or vice versa)",
          "Avoiding the past perfect entirely and using simple past for both actions in a sequence"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Selecting between simple past, present perfect and past perfect with precision to control temporal relationships and narrative perspective in extended writing.",
        "example_task": "Write the opening of a story that begins in the present but flashes back to an earlier event. Use at least two different perfect forms to manage the time shifts. Explain your choices.",
        "example_response": "I have always known this day would come. (Present perfect: connects a long-held knowledge to the present moment.) Even as a child, I had sensed something was different about the old house on Miller Street. (Past perfect: places the childhood feeling before the present-day narration.) The first time I walked past it, the curtains moved. (Simple past: the specific event on a specific occasion.) I had never told anyone what I saw that day. (Past perfect: the silence lasted from that event until now.) By using present perfect for the narrator's current state and past perfect for events before the story's main timeline, I create a layered sense of time.",
        "common_errors": [
          "Switching between tenses inconsistently without purposeful control",
          "Not understanding that the past perfect creates a 'past within the past' for flashback sequences"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C032",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Understanding that brackets, dashes and commas can be used to add extra information to a sentence, and identifying parenthesis in example sentences.",
        "example_task": "Find the extra information in each sentence: 'My teacher (Mrs Williams) is very kind.' 'The dog, a small terrier, barked loudly.' 'The castle — built over 500 years ago — still stands today.'",
        "example_response": "The extra information is: Mrs Williams, a small terrier, built over 500 years ago. If you took these parts out, the sentences would still make sense.",
        "common_errors": [
          "Not realising that the extra information could be removed without breaking the sentence",
          "Confusing parenthesis with other uses of commas"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Adding parenthetical information to sentences using brackets, dashes or commas, and beginning to recognise that each punctuation mark creates a different effect.",
        "example_task": "Add a piece of extra information to this sentence using brackets, then dashes, then commas: 'The River Thames flows through London.'",
        "example_response": "The River Thames (the longest river in England) flows through London. The River Thames — the longest river in England — flows through London. The River Thames, the longest river in England, flows through London.",
        "common_errors": [
          "Opening the parenthesis but forgetting to close it (one bracket or one dash instead of a pair)",
          "Using a single dash where a pair is needed"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using all three forms of parenthesis correctly in independent writing and making deliberate choices between them based on the degree of emphasis and formality required.",
        "example_task": "Write three sentences about the same topic, each using a different form of parenthesis. Explain why you chose each form.",
        "example_response": "The volcano (which last erupted in 1783) is still considered active. (Brackets: the date is useful but not dramatic; brackets quietly add information without interrupting the flow.) The volcano — which could erupt at any moment — towers over the village. (Dashes: the possibility of eruption is dramatic and surprising; dashes create emphasis and draw the reader's attention.) The volcano, one of the most dangerous in Europe, has been closely monitored for decades. (Commas: the extra information fits smoothly into the sentence; commas create the least disruption.)",
        "common_errors": [
          "Always using commas without considering whether brackets or dashes would be more effective",
          "Confusing commas used for parenthesis with commas used for lists or before conjunctions"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using parenthesis as a deliberate stylistic tool in extended writing, varying the form for effect and explaining how published authors use parenthesis to control pace and emphasis.",
        "example_task": "Find an example of parenthesis in a book you have read. Explain why the author chose that particular form (brackets, dashes or commas) and what effect it creates.",
        "example_response": "In War Horse by Michael Morpurgo, the narrator writes: 'Albert — my Albert — was standing at the gate.' The author uses dashes rather than brackets or commas because the repetition of 'my Albert' is emotional and dramatic. The dashes create a pause on either side, forcing the reader to slow down and feel the horse's recognition and attachment. Brackets would have made it feel like a minor detail, and commas would not have created enough dramatic pause. The dash choice matches the emotional intensity of the moment.",
        "common_errors": [
          "Analysing the content of the parenthesis without discussing why the specific punctuation form was chosen",
          "Not recognising that punctuation choice is an authorial decision with stylistic consequences"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C033",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Understanding that semi-colons, colons and dashes can be used between sentences that are closely related, as an alternative to a full stop.",
        "example_task": "Look at these two sentences: 'It was raining. I was fed up.' Now look at this version: 'It was raining; I was fed up.' What does the semi-colon do?",
        "example_response": "The semi-colon joins the two sentences together to show they are connected. The rain is the reason the person is fed up, and the semi-colon shows that link without using a joining word.",
        "common_errors": [
          "Thinking the semi-colon is the same as a comma",
          "Not understanding that both parts must be complete sentences"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using semi-colons between closely related independent clauses and colons to introduce an explanation or elaboration.",
        "example_task": "Join each pair of sentences using either a semi-colon or a colon. Explain your choice. 'The test was cancelled. The hall was flooded.' 'I knew what had happened. Someone had left the tap running.'",
        "example_response": "The test was cancelled; the hall was flooded. (Semi-colon: the two clauses are balanced and closely related.) I knew what had happened: someone had left the tap running. (Colon: the second clause explains or reveals what 'what had happened' means.)",
        "common_errors": [
          "Using a semi-colon where a colon is needed (when the second clause explains the first)",
          "Putting a capital letter after a semi-colon or colon mid-sentence"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using semi-colons, colons and dashes correctly and purposefully to mark clause boundaries in independent writing, understanding the different effect each creates.",
        "example_task": "Write three versions of the same idea, using a semi-colon in one, a colon in another, and a dash in the third. Explain the different effect.",
        "example_response": "The house was empty; nobody had lived there for years. (Semi-colon: balanced, factual, formal. The two clauses have equal weight.) The house was empty: nobody had lived there for years. (Colon: the second clause explains why. It announces the reason.) The house was empty — nobody had lived there for years. (Dash: informal, dramatic, as if the narrator is adding the information as an afterthought or revelation.)",
        "common_errors": [
          "Using a colon between a clause and a single word rather than between two independent clauses",
          "Overusing dashes as a substitute for all other punctuation"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Selecting between semi-colons, colons and dashes with precision for rhetorical effect in extended writing, and analysing how published writers use these marks to control pace and emphasis.",
        "example_task": "Read this extract from a speech: 'We have a choice: we can act now, or we can wait until it is too late.' Why did the speaker use a colon here? What would change if they used a semi-colon or a dash instead?",
        "example_response": "The speaker uses a colon because it announces what comes next. It creates a dramatic pause before revealing the choice, which is a persuasive technique: the audience is made to wait for the key information. A semi-colon would make the two parts feel equal and balanced, removing the sense that the second part is the important reveal. A dash would feel more informal and urgent, like an interruption. The colon is the best choice here because speeches need controlled pacing for maximum impact.",
        "common_errors": [
          "Analysing the content but not discussing the specific effect of the punctuation choice",
          "Not recognising that punctuation is a rhetorical tool in persuasive and spoken contexts"
        ]
      }
    ]
  }
]