[
  {
    "concept_id": "EN-Y6-C013",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognises that writers make choices about sentence structure and can identify different structures (simple, compound, complex) in a given text.",
        "example_task": "Read this short paragraph. Underline one simple sentence, one compound sentence and one complex sentence. Explain how you know which is which.",
        "example_response": "Simple: 'The door slammed shut.' (one clause, one verb). Compound: 'The wind howled and the lights flickered.' (two clauses joined by 'and'). Complex: 'Although she had been warned, Maya pushed the door open.' (main clause with a subordinate clause starting with 'although').",
        "common_errors": [
          "Identifies sentence length rather than structure — assumes long sentences are complex and short ones are simple",
          "Cannot name or distinguish clause types, calling everything 'a sentence'"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writes using a deliberate range of sentence structures and, with prompting, can explain why a particular structure suits the moment in the writing.",
        "example_task": "Write three sentences describing a character arriving at an abandoned building. Use a short simple sentence for impact, a complex sentence to build atmosphere, and a compound sentence to move the action forward. Annotate each one.",
        "example_response": "Short: 'She stopped.' (Creates a sudden pause — the reader stops too.) Complex: 'As the evening mist crept across the overgrown garden, the house seemed to lean towards her like something waiting.' (The subordinate clause builds atmosphere before the main image.) Compound: 'She pushed the gate open and stepped onto the cracked path.' (Two actions linked — moves the character forward without pausing.)",
        "common_errors": [
          "Writes sentences of varied length but does not vary the grammatical structure itself",
          "Annotates with vague comments like 'it sounds good' rather than explaining the structural effect"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Consciously controls sentence structure throughout a sustained piece of writing, varying it for effect and able to articulate why specific constructions serve the writer's purpose at each point.",
        "example_task": "Redraft this flat paragraph to improve sentence variety. For each change you make, write a brief annotation explaining your grammatical choice: 'The soldiers marched forward. The soldiers were tired. The soldiers had been walking for days. The soldiers reached the river. The soldiers stopped.'",
        "example_response": "Redraft: 'The soldiers marched forward. They were exhausted — they had been walking for three days without rest. When they finally reached the river, they stopped.' Annotations: Kept the first sentence short and direct to establish the action. Combined the next two into a compound sentence with a dash to show cause and effect without slowing the pace. Used a complex sentence ('When they finally reached...') so the subordinate clause creates a sense of arrival before the main clause delivers the stop. The final 'they stopped' echoes the opening's simplicity — bookending the paragraph.",
        "common_errors": [
          "Makes structural changes but cannot explain the intended effect on the reader",
          "Varies structure mechanically (short-long-short-long) without connecting choices to meaning or pace"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Analyses how published authors control sentence structure for specific effects, then transfers those principles to own writing with metacognitive awareness of technique.",
        "example_task": "Read this extract from a novel you have studied in class. Identify three places where the author's sentence structure creates a specific effect. Then write your own paragraph on a different topic, using the same three structural techniques. Annotate your choices.",
        "example_response": "Author's techniques: (1) A sentence fragment — 'Nothing.' — after a long description to create a void. (2) A periodic sentence where the main clause is delayed until the end to build suspense: 'Through the smoke, past the broken walls, beyond the place where the road used to be, she saw it.' (3) A list of short clauses without conjunctions to create breathless pace: 'She ran. She climbed. She fell. She got up.' My paragraph (about a space launch): 'Through the static, past the crackling countdown, beyond the point where fear should have stopped her, Commander Osei pressed the button.' (periodic — delays the action). 'The engines fired. The ground shook. The tower fell away.' (short clauses — pace and power). 'Then — silence.' (fragment — contrast). I used the periodic sentence to build anticipation, the short clauses to convey overwhelming force, and the fragment to mark the sudden transition to weightlessness.",
        "common_errors": [
          "Copies the author's surface features (e.g. short sentences) without understanding the structural principle behind the effect",
          "Analyses the published text well but cannot transfer the techniques to a different context"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y6-C014",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifies whether a text is written in formal or informal register based on obvious signals such as contractions, slang, and greeting conventions.",
        "example_task": "Read these two texts about the same school trip. One is from a pupil's diary and one is from the school newsletter. List three differences that tell you which is formal and which is informal.",
        "example_response": "Diary (informal): uses 'we had the best time ever' (casual phrase), 'couldn't believe it' (contraction), 'Miss let us' (first name/title shorthand). Newsletter (formal): uses 'pupils thoroughly enjoyed' (formal vocabulary), 'were unable to' (no contraction), 'Mrs Thompson permitted' (full title and formal verb).",
        "common_errors": [
          "Identifies only one type of signal (usually vocabulary) and misses structural or tonal differences",
          "Confuses 'friendly' with 'informal' — thinks a warm formal text must be informal"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Rewrites a text shifting register between formal and informal, adjusting vocabulary, sentence structure and tone, though may not yet control all three consistently.",
        "example_task": "Rewrite this informal message as a formal letter to the local council: 'Hey, the park near our school is a total mess. The swings are broken, there's rubbish everywhere and nobody seems to care. Can someone sort it out?'",
        "example_response": "Dear Sir or Madam, I am writing to draw your attention to the poor condition of Riverside Park, which is adjacent to our school. The play equipment requires repair, litter has accumulated throughout the area, and it appears that regular maintenance has not been carried out. I would be grateful if the council could arrange for these issues to be addressed. Yours faithfully, [Name].",
        "common_errors": [
          "Changes vocabulary to formal but keeps informal sentence structure (e.g. questions instead of statements)",
          "Over-formalises to the point of being stilted or unnatural"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Selects and maintains the appropriate register for purpose and audience throughout a sustained piece, controlling vocabulary, sentence structure, degree of formality and tone consistently.",
        "example_task": "Write two openings about your school's new library: (a) a formal report for the school governors, and (b) a blog post for Year 3 and 4 pupils. Each should be about 50 words. Explain three specific register choices you made differently in each.",
        "example_response": "(a) 'This report evaluates the impact of the new library facility on reading engagement across the school. Data collected during the autumn term indicates a 15% increase in voluntary reading, with the most significant gains observed among pupils previously identified as reluctant readers.' (b) 'Have you been to the new library yet? It is amazing! There are beanbags, a reading den, and over 500 new books. The best part? You can borrow graphic novels now. Loads of people who never used to read at break are now in there every day.' Register differences: (1) Vocabulary — 'facility' and 'engagement' vs 'amazing' and 'best part'. (2) Sentence type — declarative statements in the report vs questions and exclamations in the blog. (3) Tone — impersonal and evidence-based vs direct address and enthusiasm.",
        "common_errors": [
          "Writes both in a similar middle register rather than committing fully to each",
          "Identifies register differences when analysing but does not consistently apply them in own writing"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluates how authors manipulate register deliberately for effect — including intentional register shifts within a text — and deploys register control with nuance and sophistication in own writing.",
        "example_task": "In a charity appeal letter, the writer begins formally: 'The Foundation has worked tirelessly for fifteen years to provide clean water to communities in need.' Then shifts: 'But here is what the numbers do not tell you. Last Tuesday, a seven-year-old girl called Amara drank clean water for the first time.' Analyse why the writer shifts register. Then write your own short text that uses a deliberate register shift for effect.",
        "example_response": "The formal opening establishes the charity's credibility and authority — the reader trusts the organisation. The shift to informal, personal language ('But here is what...') breaks through the formality to create an emotional, human connection. 'Last Tuesday' and 'a seven-year-old girl called Amara' move from statistics to a real person, making the appeal feel urgent and personal. The shift works because the contrast makes the informal section feel more authentic. My text (school fundraiser): 'The PTA has raised over three thousand pounds this academic year to support enrichment activities for all pupils. Fundraising events have included a sponsored walk, a cake sale and a quiz night.' [Shift] 'But none of that matters as much as what happened last Friday. A Year 2 boy opened his violin case for the first time — paid for by your donations — and his face lit up like it was Christmas morning.' I shifted from impersonal report to personal anecdote so the reader feels the real impact behind the numbers.",
        "common_errors": [
          "Identifies the register shift but describes it as accidental or an error rather than a deliberate rhetorical technique",
          "Attempts a register shift in own writing but the transition is abrupt rather than purposeful"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y6-C015",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Reads an age-appropriate non-fiction text and answers comprehension questions independently, demonstrating functional reading fluency.",
        "example_task": "Read this two-page information text about space exploration. Answer these five questions in full sentences without looking back at the text for the first attempt.",
        "example_response": "1. The first person to walk on the Moon was Neil Armstrong in 1969. 2. Astronauts train for years before going to space. 3. The International Space Station orbits the Earth every 90 minutes. 4. Scientists are now planning missions to Mars. 5. Space exploration has led to inventions we use every day, such as memory foam.",
        "common_errors": [
          "Needs to re-read the text multiple times to recall basic information, indicating fluency is not yet automatic",
          "Answers in single words or fragments rather than full sentences"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Reads texts from different subject areas with sufficient fluency to extract key information and complete tasks, though may need support with unfamiliar subject-specific vocabulary.",
        "example_task": "Read this geography text about river erosion and this science text about states of matter. For each, identify the three most important facts and write them in your own words.",
        "example_response": "Geography: (1) Rivers wear away rock through erosion, especially on the outside of bends. (2) Eroded material is carried downstream as sediment. (3) Over thousands of years, erosion changes the shape of the landscape. Science: (1) Matter exists in three states — solid, liquid and gas. (2) Heating a substance gives its particles more energy, causing them to move faster. (3) Changing state does not create a new substance.",
        "common_errors": [
          "Copies phrases from the text rather than paraphrasing in own words",
          "Struggles with subject-specific vocabulary and skips over key terms"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Reads and writes fluently across curriculum subjects at a level sufficient for secondary school demands: reads unfamiliar texts independently, infers meaning of unknown vocabulary from context, writes extended responses under time pressure, and adapts register for different subjects.",
        "example_task": "You have 25 minutes. Read this unseen history source about the Industrial Revolution (about 250 words). Write a response of at least 150 words explaining what the source tells us and how reliable you think it is. Use evidence from the source to support your answer.",
        "example_response": "This source, written by a factory inspector in 1833, describes the working conditions of children in a cotton mill. It tells us that children as young as eight worked twelve-hour shifts and that injuries from machinery were common. The inspector notes that 'several children bore visible scars from entanglement with the spinning frames.' The source is useful because it was written by an official inspector whose job required accurate reporting, which suggests the observations are likely to be truthful. However, factory inspectors at this time were often sympathetic to reform, so the language may emphasise the worst conditions to strengthen the case for new laws. The phrase 'I have never witnessed such deplorable neglect' suggests a degree of personal outrage that could influence the objectivity of the account. Overall, the source is valuable primary evidence but should be read alongside other perspectives.",
        "common_errors": [
          "Writes a response that summarises the source but does not evaluate its reliability",
          "Runs out of time because reading fluency is not yet fast enough for timed conditions"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Reads and responds to complex, multi-source tasks with independence and critical awareness, synthesising information from different text types, evaluating arguments, and writing with the sophistication and stamina expected of a confident secondary school learner.",
        "example_task": "Read Source A (a newspaper editorial arguing for school uniform) and Source B (a blog post arguing against it). Write a balanced discussion of at least 200 words that uses evidence from both sources, evaluates the strength of each argument, and reaches a reasoned conclusion. You have 30 minutes.",
        "example_response": "The question of whether schools should require uniform divides opinion. Source A, from The Times, argues that uniform promotes equality and school identity. The editorial cites a 2019 study showing that 'schools with uniform policies report fewer incidents of bullying related to clothing.' This is a strong argument because it uses research evidence rather than opinion. However, Source A does not acknowledge that the study was commissioned by a uniform supplier, which may introduce bias. Source B, a parent's blog, argues that uniform restricts self-expression and is an unnecessary expense. The writer states that she spent over two hundred pounds on branded items in a single year. This is a persuasive personal example, but it represents one family's experience and cannot be generalised. Source B is weaker in its use of evidence — it relies on anecdote rather than data. Both sources raise valid points. On balance, I believe uniform is beneficial for the sense of belonging it creates, but schools should ensure costs are reasonable and second-hand options are available. The strongest argument is Source A's evidence on bullying, provided the study is independently verified.",
        "common_errors": [
          "Summarises both sources without evaluating the strength of their arguments",
          "Reaches a conclusion that is not supported by the evidence discussed"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y6-C025",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifies different non-narrative text types (explanation, report, persuasion, discussion) and names their basic features when shown clear examples.",
        "example_task": "Match each text extract to its type: explanation, report, persuasion or discussion. Explain one feature that helped you decide for each.",
        "example_response": "Extract 1 = explanation — it uses 'This happens because...' to show a cause-and-effect chain. Extract 2 = report — it uses subheadings and presents factual information in a neutral tone. Extract 3 = persuasion — it uses 'You should...' and emotional language to convince the reader. Extract 4 = discussion — it presents arguments 'for' and 'against' before reaching a conclusion.",
        "common_errors": [
          "Confuses explanation with report because both contain factual information",
          "Identifies text type correctly but cannot name the feature that signals it"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Plans and writes a non-narrative text in one form using a model, including the key structural features and appropriate language, though may not yet sustain register or structure throughout.",
        "example_task": "Using the model explanation text as a guide, write an explanation of how a volcano erupts. Include a title, an introduction, a step-by-step causal chain, and a concluding statement.",
        "example_response": "Title: How Does a Volcano Erupt? Introduction: Volcanoes are openings in the Earth's surface where molten rock escapes. But what causes an eruption? Causal chain: Deep beneath the surface, extreme heat melts rock into magma. This magma is less dense than the surrounding rock, so it rises slowly through cracks. As it rises, the pressure above it decreases, allowing dissolved gases to expand. Eventually, the pressure becomes too great and the magma bursts through the surface as lava, ash and gas. Conclusion: Volcanic eruptions are caused by a chain of events driven by heat and pressure deep underground.",
        "common_errors": [
          "Writes an information report about volcanoes rather than an explanation of the process",
          "Includes causal steps but not in a clear logical sequence"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Plans and produces effective non-narrative texts in multiple forms, selecting structure, language and organisational devices appropriate to the form, purpose and audience, sustaining register and coherence throughout.",
        "example_task": "Your class has been studying the question: 'Should plastic bags be banned?' Write a balanced discussion text of about 300 words. Include an introduction that frames the debate, at least two arguments on each side with evidence, and a conclusion that weighs the arguments.",
        "example_response": "The debate over whether plastic bags should be banned has intensified in recent years as concerns about environmental damage have grown. This discussion examines arguments on both sides before reaching a conclusion. Those in favour of a ban argue that plastic bags cause severe harm to wildlife and ecosystems. According to the Marine Conservation Society, over 8 million tonnes of plastic enter the oceans each year, and bags are among the most commonly found items on beaches. A ban would immediately reduce this pollution. Furthermore, alternatives such as reusable bags are widely available and affordable. Opponents argue that a complete ban could disadvantage poorer families who rely on free carrier bags for multiple uses, including bin liners and packed lunches. They also point out that manufacturing cotton tote bags uses significantly more energy than producing plastic ones, meaning the environmental benefit is not straightforward. Some suggest that a charge, rather than a ban, strikes a better balance. In conclusion, while both sides raise valid points, the evidence of environmental damage is compelling. A phased ban, combined with affordable alternatives and clear public information, would reduce harm without placing an unfair burden on those who can least afford it.",
        "common_errors": [
          "Presents arguments for one side more convincingly than the other, creating a biased discussion",
          "Writes a conclusion that introduces new arguments rather than weighing those already presented"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Writes non-narrative texts that demonstrate authorial control — selecting the most effective form for a given purpose, adapting structure for impact, and deploying rhetorical and organisational techniques with precision and confidence.",
        "example_task": "You want to convince your head teacher to create a school garden. Choose the most effective form (letter, report, speech or article) and write it. In a separate paragraph, explain why you chose that form over the others and identify three specific techniques you used to make your writing persuasive.",
        "example_response": "[Formal letter to the head teacher, approximately 250 words, including: a clear statement of purpose, three organised arguments with supporting evidence (health benefits, curriculum links, community engagement), acknowledgement and rebuttal of a potential objection (cost), and a polite but assertive closing request.] Explanation: I chose a formal letter because it is a direct, personal appeal to one decision-maker, which is more appropriate than a general article or public speech. A report would present information neutrally, but I needed to persuade, not just inform. Three techniques: (1) I used the tricolon 'healthier, happier and more engaged' for rhetorical impact. (2) I anticipated the objection about cost and countered it with evidence that local businesses have offered donations, which shows I have considered practicalities. (3) I closed with 'I would welcome the opportunity to discuss this further,' which is firm but respectful — it assumes the conversation will continue rather than asking 'please can we?'",
        "common_errors": [
          "Chooses a form without being able to explain why it is more effective than the alternatives",
          "Identifies techniques after writing but the techniques are not clearly present in the actual text"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y6-C026",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Writes a narrative with a clear beginning, middle and end, including a character, a setting and a sequence of events with some descriptive detail.",
        "example_task": "Write the opening two paragraphs of a story about a character who discovers something unexpected in a familiar place. Include description of the setting and introduce your character.",
        "example_response": "Every morning, Kai took the same route through Highfield Woods to school. He knew every tree, every bend in the path, every patch of mud to avoid. It was boring. Nothing ever changed. But that Thursday, something did. Where the old oak had always stood, there was a door. Not a door in a wall or a building — just a door, standing on its own in the middle of the clearing, with a brass handle that glinted in the early light. Kai stopped. He looked behind it. Nothing. Just more woods. He looked at the handle.",
        "common_errors": [
          "Rushes into the discovery without establishing the character or setting first",
          "Describes the setting as a list of details rather than filtering it through the character's experience"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writes narratives that show awareness of pace, using description to slow down key moments and shorter sentences to speed up action, with some deliberate choices about viewpoint.",
        "example_task": "Write a scene where a character must make a difficult decision. Slow down the moment of decision using description and internal thought, then speed up the action when they commit to their choice.",
        "example_response": "The boat was drifting further from the jetty. Inside it, her little brother clung to the seat, his knuckles white. The rope trailed in the water, just out of reach. Priya looked at the dark lake. She could not swim well — she had barely passed her ten-metre badge. The water looked cold and deep and nothing like a swimming pool. But Jaden was only five. He did not know what to do. She pulled off her shoes. She jumped. The cold hit her like a wall. She gasped, kicked, reached for the rope. Grabbed it. Held on.",
        "common_errors": [
          "Maintains the same pace throughout — either all slow description or all fast action",
          "Tells the reader about the character's feelings ('she was terrified') rather than showing them through action and thought"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Writes narratives demonstrating authorial control: deliberate choices about structure, viewpoint, pace, characterisation and setting, with awareness of the reader's experience.",
        "example_task": "Write a complete short story (approximately one page) in which the ending connects back to the opening in a meaningful way. Make deliberate choices about viewpoint and pace, and be prepared to explain them.",
        "example_response": "[A story with: First-person viewpoint establishing voice and personality. Opening image that establishes a motif (e.g. a locked music box). Rising action with a problem and complication. Pacing that slows at the emotional climax through description and internal thought. Resolution that returns to the opening image with new significance (the music box opens). Final line that echoes the opening sentence with a changed meaning.] Authorial choices: I used first person so the reader experiences the mystery directly. I slowed the pace at the climax — 'For a long time, I just sat there, turning the box over in my hands' — because the emotional moment matters more than the action. The ending mirrors the opening ('The music box had always been silent') but now the silence is a choice, not a mystery, which shows the character has changed.",
        "common_errors": [
          "Writes a competent story but without deliberate structural or stylistic choices that can be articulated",
          "Ends the story abruptly without connecting it back to the themes or images established at the beginning"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Makes sophisticated authorial choices — such as unreliable narration, non-linear structure, symbolic imagery or dual-timeline — and can explain how these techniques serve the story's meaning.",
        "example_task": "Write the opening of a story that uses a non-chronological structure (for example, starting at the end and then going back to explain how the character got there). Explain why this structure is more effective than starting at the beginning.",
        "example_response": "'I never meant to open the letter. That is what I told myself afterwards, standing in the headteacher's office with the torn envelope in my hand and the words still burning behind my eyes. But that is not entirely true. The truth started three weeks earlier, on the morning Grandad's desk arrived.' This opening works better than chronological order because it creates a mystery — the reader knows something went wrong with a letter but does not know what the letter said or why it matters. The flash-forward to the headteacher's office tells the reader there will be consequences, which creates tension throughout the chronological section. Starting at Grandad's desk arriving would be a slower opening with no hook. The phrase 'that is not entirely true' hints that the narrator might not be fully honest, which adds complexity — the reader has to judge for themselves what really happened.",
        "common_errors": [
          "Uses non-chronological structure as a gimmick without it serving the story's meaning",
          "Creates confusion rather than intrigue — the reader cannot follow what is happening"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y6-C027",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Writes a simple poem using a given form or structure (such as a haiku, acrostic or rhyming couplet), demonstrating understanding of the form's basic rules.",
        "example_task": "Write a haiku (5-7-5 syllables) about the sea. Count the syllables carefully.",
        "example_response": "Waves crash on the shore (5) / Salt wind stings my face and hands (7) / The tide pulls me back (5).",
        "common_errors": [
          "Miscounts syllables, producing lines that do not follow the 5-7-5 pattern",
          "Writes a sentence split over three lines rather than creating a poetic image"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writes poems that make some deliberate choices about poetic devices such as simile, metaphor, alliteration or personification, and can explain why they chose a particular device.",
        "example_task": "Write a poem of at least eight lines about a storm. Use at least three different poetic devices and underline each one, naming the device in the margin.",
        "example_response": "The sky cracked open like a broken egg [simile] / And poured its fury on the trembling town. / Thunder growled and prowled above the rooftops [personification + alliteration] / While lightning stitched the darkness with bright thread. [metaphor] / Trees bent double, whispering surrender, [personification] / And the river swallowed the bridge whole. [personification] / Then silence. / Just the drip, drip, drip of the world catching its breath. [onomatopoeia + personification]",
        "common_errors": [
          "Uses only one device repeatedly (usually simile) rather than varying techniques",
          "Inserts devices that do not fit the poem's mood or subject"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Composes poems in a chosen form, making deliberate and effective choices about imagery, line breaks, rhythm and structure, with craft that shows awareness of how the poem sounds and looks on the page.",
        "example_task": "Write a free verse poem about a memory. Make deliberate choices about line breaks — where you end each line should be intentional. Write a short commentary explaining three line-break decisions.",
        "example_response": "Poem: 'I remember the kitchen / in winter — / the way the window ran / with condensation / and my grandmother's hands / moved through flour / like something holy. / She never followed a recipe. / She said the dough would tell her / when it was ready, / and I believed her / the way you believe weather / or gravity / or the ground beneath your feet.' Commentary: (1) I broke 'the way the window ran' at 'ran' so the reader briefly imagines the window running before 'with condensation' corrects it — the double meaning creates a visual image. (2) 'like something holy' is on its own line to give it weight and stillness, matching the reverent tone. (3) The final three lines get shorter and shorter, slowing the reader down to emphasise that these are fundamental, unquestioned truths.",
        "common_errors": [
          "Breaks lines at the end of sentences rather than using line breaks as a poetic tool",
          "Writes prose with line breaks rather than a poem with deliberate shape and rhythm"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Writes poems that demonstrate genuine craft and artistic intention, experimenting with form, sound and meaning, drawing on techniques observed in published poets and able to evaluate the effect of their own choices.",
        "example_task": "Read this published poem. Write a response poem — a poem inspired by or in conversation with it — that uses a contrasting form or perspective. Write a reflective commentary explaining how your poem relates to the original and what poetic choices you made deliberately.",
        "example_response": "[Original poem: a formal sonnet about the beauty of nature.] Response poem: a free verse poem in the voice of the nature being described, pushing back against being romanticised. 'You write me in soft focus — / meadows, birdsong, golden hour — / but you were not here / when the frost killed the early blossom / or the fox screamed at three in the morning / loud enough to wake the dead. / Nature is not your postcard. / I am mud and rot and thorn / and the thing that grows / back.' Commentary: I chose free verse to contrast with the original's formal structure — my poem rejects the neat frame the sonnet imposes. The short final line 'back' sits alone to show resilience and defiance. I used concrete, unglamorous images ('mud and rot and thorn') to challenge the original's idealism. The poem is in second person ('You write me') to create a direct confrontation with the original poet.",
        "common_errors": [
          "Writes a poem on the same topic but without any genuine relationship to the original",
          "Cannot explain poetic choices beyond 'it sounded nice' or 'I liked it'"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y6-C028",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifies the purpose of a piece of writing (inform, persuade, entertain, instruct, explain, argue, discuss) when given clear examples.",
        "example_task": "Read these four short extracts. For each, decide: is the purpose to inform, persuade, entertain, or instruct? Explain one clue that helped you decide.",
        "example_response": "Extract 1: Instruct — it uses numbered steps and imperative verbs ('cut', 'fold', 'glue'). Extract 2: Persuade — it uses 'you should' and emotional language. Extract 3: Inform — it presents facts in a neutral tone with no opinion. Extract 4: Entertain — it tells a story with characters and description.",
        "common_errors": [
          "Confuses 'inform' with 'explain' because both contain factual content",
          "Cannot distinguish between 'persuade' and 'argue' at this stage"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Selects an appropriate form for a given purpose and audience before writing, and makes some language choices that match the form's conventions.",
        "example_task": "Your purpose is to persuade parents to attend Sports Day. Choose the best form: a formal letter, a poster, or a set of instructions. Explain your choice, then write the text.",
        "example_response": "I chose a formal letter because parents respond well to a personal, direct appeal and a letter can include details about times and arrangements as well as persuasive language. A poster would be too brief for the amount of information needed. Instructions would be wrong because I am not telling them how to do something. [Letter includes: polite greeting, reasons to attend, practical information, and a warm closing.]",
        "common_errors": [
          "Chooses a form without explaining why it matches the purpose and audience",
          "Writes in the chosen form but uses language that does not match its conventions"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Identifies purpose and audience independently, selects the most appropriate form, and sustains the form's conventions in vocabulary, structure and layout throughout a complete piece.",
        "example_task": "Write two texts about healthy eating: (a) a set of instructions for making a healthy packed lunch (purpose: instruct, audience: Year 4 pupils), and (b) a persuasive article for the school website (purpose: persuade, audience: parents). Each should be about 100 words.",
        "example_response": "(a) 'How to Make a Healthy Packed Lunch. You will need: a lunchbox, wholemeal bread, protein (chicken, cheese or hummus), salad, a piece of fruit, a bottle of water. Step 1: Choose your bread and spread. Step 2: Add your protein...' [numbered steps, imperative verbs, simple vocabulary, list format]. (b) 'As parents, we all want our children to eat well — but a recent survey of school packed lunches found that 60% contained no fruit or vegetables. Research shows that children who eat a balanced lunch concentrate better in afternoon lessons and are less likely to experience energy dips...' [third-person formal register, statistics, logical argument structure].",
        "common_errors": [
          "Uses similar language for both texts despite the different purposes and audiences",
          "Follows the form's structure but not its register — e.g. instructions written in a chatty tone"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Selects the most effective form from several options, adapts conventions flexibly when purpose requires it, and evaluates how form choices affect the reader's experience.",
        "example_task": "You want to raise awareness about plastic pollution in the ocean. You could write: a newspaper report, a persuasive speech, a poem, or a diary entry from a marine biologist. Choose the form you think would be most effective. Write it. Then write a paragraph explaining why your chosen form is stronger than at least one of the alternatives.",
        "example_response": "[Diary entry from a marine biologist, approximately 150 words, written in first person with a mix of scientific observation and personal emotion: factual details about plastic found during a dive, contrasted with the biologist's growing frustration and sadness.] Explanation: I chose the diary because it combines facts with personal emotion in a way that feels genuine rather than manipulative. A persuasive speech would be effective for a live audience but can feel formulaic on paper — 'I urge you to act' is easy to dismiss. The diary creates empathy because the reader experiences the biologist's journey: they start with professional observation and end with private despair, which is more powerful than being told to care. The diary form also allows me to include specific scientific evidence naturally ('Today we counted 47 pieces of microplastic in one square metre') without it feeling like a lecture.",
        "common_errors": [
          "Evaluates forms in general terms ('a speech is persuasive') without connecting the analysis to this specific topic and audience",
          "Chooses a form but does not fully commit to its conventions — the diary reads like an essay"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y6-C029",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifies who a piece of writing is for and makes basic observations about how the writing has been adapted for that audience.",
        "example_task": "This text about dinosaurs was written for five-year-olds. List three things the writer did differently from how a textbook for adults would be written.",
        "example_response": "1. The sentences are short and simple — 'T-Rex was very big.' 2. The vocabulary is simple — it says 'meat-eater' instead of 'carnivore'. 3. There are pictures on every page with labels.",
        "common_errors": [
          "Describes the content rather than the audience adaptations — 'it talks about dinosaurs'",
          "Only notices one type of adaptation (usually vocabulary)"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Makes deliberate vocabulary and tone choices for a specified audience, though may not yet sustain these choices consistently or adapt sentence structure and layout as well.",
        "example_task": "Write the opening paragraph of an information text about volcanoes for two audiences: (a) Year 2 pupils, and (b) the school governors. How did you change your vocabulary and tone?",
        "example_response": "(a) 'Have you ever seen a mountain that can explode? That is what a volcano is! Deep under the ground, rock gets so hot that it melts. When it pushes up through the mountain — BOOM! — hot melted rock shoots out of the top.' (b) 'This report summarises Year 6 pupils' cross-curricular study of volcanic activity, conducted as part of our geography and science programmes of study. The unit integrated fieldwork skills with scientific investigation.' Vocabulary changes: 'melted rock' vs 'volcanic activity'; 'BOOM!' vs formal description. Tone: exciting and direct for Year 2; professional and measured for governors.",
        "common_errors": [
          "Adapts vocabulary but keeps the same sentence structures for both audiences",
          "Makes the Year 2 version patronising rather than age-appropriate"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Makes specific, sustained adaptations at vocabulary, sentence structure, register, tone and layout levels for the intended audience, maintaining these choices consistently throughout a complete piece.",
        "example_task": "Write a letter about the same topic — requesting better cycling facilities near your school — to two different audiences: (a) the local council, and (b) a Year 6 school council meeting. Each should be about 100 words. Annotate three specific adaptations you made for each audience.",
        "example_response": "(a) Council: 'Dear Councillor Ahmed, I am writing on behalf of the pupils of Oakwood Primary to request improvements to cycling infrastructure on Green Lane...' Adaptations: (1) Formal greeting and sign-off conventions. (2) Impersonal sentence structures: 'It has been observed that...' (3) Evidence-based argument: 'According to the school travel survey, 34% of families would cycle if a safe route existed.' (b) School council: 'Right, so loads of us want to cycle to school but Green Lane is actually dangerous...' Adaptations: (1) Informal register with direct address. (2) First-person plural: 'we' and 'us' for shared ownership. (3) Practical, action-focused language: 'Here is what I think we should do...'",
        "common_errors": [
          "Writes two versions that are closer in register than they should be — a vaguely formal letter and a slightly less formal letter",
          "Adapts vocabulary effectively but forgets to adapt sentence structure, layout or tone"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Anticipates the audience's knowledge, attitudes and expectations, and makes subtle adaptations that go beyond register — such as addressing likely objections, choosing evidence the audience will find compelling, or adjusting the level of assumed knowledge.",
        "example_task": "Write the opening of a persuasive text aimed at convincing reluctant readers to try a book you love. Consider: what does this audience think about reading? What objections might they have? How can you hook someone who does not usually enjoy books?",
        "example_response": "'I know what you are thinking. Another book recommendation from someone who reads all the time. You have heard it before: \"You'll love it!\" \"You just haven't found the right book yet.\" And you have smiled and nodded and gone back to your phone. Fair enough. But this book is different — and I can prove it. It is 180 pages. You could finish it in a weekend. There are no long descriptions. The chapters are short. And the main character hates reading as much as you do.' I anticipated three audience characteristics: (1) They are sceptical of book recommendations, so I acknowledged that scepticism immediately rather than ignoring it. (2) They value their time, so I emphasised the book's brevity. (3) They feel alienated from 'reading culture,' so I chose a book with a relatable protagonist. Addressing their objections before they raise them builds trust.",
        "common_errors": [
          "Writes a standard recommendation without considering the specific audience's resistance",
          "Acknowledges the audience's reluctance but then ignores it and writes a conventional review"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y6-C030",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Reduces a short paragraph to fewer words while keeping the main point, with teacher modelling of the process.",
        "example_task": "This paragraph has 45 words. Rewrite it in 20 words or fewer, keeping the main idea: 'The ancient Greeks held the first Olympic Games nearly three thousand years ago. Athletes from different city-states would travel to Olympia to compete in running, wrestling, chariot racing and other sports. The games were held every four years.'",
        "example_response": "The ancient Greeks held the Olympic Games at Olympia every four years, with athletes competing in various sports.",
        "common_errors": [
          "Deletes sentences at random rather than identifying and preserving the essential meaning",
          "Keeps interesting details (chariot racing) while losing the main point (the games were ancient and regular)"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Condenses a longer passage by distinguishing essential information from supporting detail and rewriting in own words.",
        "example_task": "Read this 80-word passage about the water cycle. Rewrite it in approximately 30 words. You must use your own words, not copy phrases from the original.",
        "example_response": "Water evaporates from oceans and lakes, forming clouds. When clouds cool, water falls as rain or snow. This collects in rivers and flows back to the sea, and the cycle repeats.",
        "common_errors": [
          "Copies key phrases from the original rather than paraphrasing in own words",
          "Produces a shorter text that misses one stage of the process"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Produces a polished precis of a multi-paragraph text that retains all essential meaning in approximately one third of the original length, written as coherent continuous prose in the pupil's own words.",
        "example_task": "Read this 180-word article about the impact of deforestation. Write a precis of approximately 60 words that covers all the key points in your own words. It must read as a fluent paragraph, not a list.",
        "example_response": "Deforestation destroys habitats, threatening thousands of species with extinction. It also accelerates climate change because trees absorb carbon dioxide; when they are cut down, stored carbon is released. Additionally, deforestation causes soil erosion and flooding because tree roots no longer hold the ground together. Although some deforestation provides farmland, the long-term environmental costs outweigh the short-term economic benefits.",
        "common_errors": [
          "Shortens by removing whole sections rather than condensing each section proportionally",
          "Produces bullet points or a list rather than continuous, coherent prose"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Writes a precis that preserves not only the content but the argument structure, emphasis and tone of the original, demonstrating critical judgement about what constitutes essential versus peripheral information.",
        "example_task": "Read this 250-word opinion article arguing that homework should be abolished. Write a precis of about 80 words that preserves the argument structure (claim, evidence, counter-argument, conclusion). Then explain one decision you made about what to keep and what to cut.",
        "example_response": "Precis: The author argues that homework should be abolished because research shows it has little academic benefit for primary-age children and reduces time for play, family life and independent interests. A 2015 study found no correlation between homework quantity and achievement at primary level. The author acknowledges that secondary homework may have value for developing study habits, but maintains that primary homework causes unnecessary stress. The conclusion urges schools to replace homework with voluntary reading. Decision: I cut the personal anecdote about the author's daughter crying over maths homework. Although it was emotionally powerful, it was illustrative rather than essential — the research evidence makes the same point more reliably, and in a precis the argument matters more than the anecdote.",
        "common_errors": [
          "Condenses content but loses the argument's logical structure (claim, evidence, counter, conclusion)",
          "Keeps the most interesting or emotional details rather than the most logically important ones"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y6-C031",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Locates and copies a relevant quotation from a text to answer a question, using quotation marks correctly.",
        "example_task": "Read this passage about polar bears. Find a quotation that shows polar bears are well-adapted to cold environments. Write it out with quotation marks.",
        "example_response": "The text says 'their thick layer of blubber and dense fur keep them warm even in temperatures of minus forty degrees.'",
        "common_errors": [
          "Copies a long section of text rather than selecting a focused, relevant quotation",
          "Forgets to use quotation marks around the borrowed words"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Selects a relevant quotation and uses it to support a point, with a basic point-evidence structure, though the explanation of how the quotation supports the point may be underdeveloped.",
        "example_task": "The question is: How does the author show that the character is brave? Make a point and support it with a quotation from the text.",
        "example_response": "The author shows that Lena is brave because she acts even though she is frightened. The text says she 'stepped forward despite the trembling in her legs.' This shows bravery because she does not let her fear stop her.",
        "common_errors": [
          "Makes a point and includes a quotation but does not explain how the quotation supports the point",
          "Selects a quotation that does not actually support the point being made"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Selects precise, well-chosen evidence, embeds quotations fluently into sentences, and explains clearly how the evidence supports the argument, using a consistent point-evidence-explanation structure.",
        "example_task": "How does the author create a sense of danger in the opening chapter? Write a paragraph using at least two quotations, embedded into your sentences, to support your answer.",
        "example_response": "The author creates danger from the very first line through the setting and the character's reactions. The forest is described as a place where 'the trees pressed in so close that daylight barely reached the ground,' suggesting the character is enclosed and trapped. The danger intensifies when the narrator reveals that 'every sound seemed magnified — a snapping twig became a gunshot, a rustling leaf became a warning.' The similes 'became a gunshot' and 'became a warning' show how fear transforms ordinary sounds into threats, making the reader share the character's heightened anxiety.",
        "common_errors": [
          "Drops quotations into the paragraph without embedding them grammatically into sentences",
          "Explains what the quotation says (paraphrases it) rather than analysing what it means or how it creates the effect"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Selects evidence strategically, using short embedded quotations and longer block quotations appropriately, and analyses language at word level within quotations to build a sustained, convincing argument.",
        "example_task": "Compare how two characters are presented in the text. Use quotations from different parts of the text to build your argument, and zoom into specific word choices within your quotations.",
        "example_response": "Marcus and Priya are presented as opposites whose differences drive the story's central conflict. Marcus is associated with stillness and control: he 'folded the map with a sharp snap' and 'did not look up.' The verb 'folded' and the adjective 'sharp' suggest precision and decisiveness — he has already made his decision before the conversation begins. Priya, by contrast, is associated with uncertainty and movement: she is 'pulling her coat tighter' and later 'stared at the dark shapes of the trees.' The progressive verbs 'pulling' and 'stared' show her attention is scattered — she is reacting to her environment rather than controlling it. The contrast between Marcus folding (an act of closure) and Priya pulling (an act of self-protection) encapsulates their different responses to danger: he moves towards it, she shields herself from it.",
        "common_errors": [
          "Uses quotations to prove a point but does not analyse individual word choices within them",
          "Compares the characters in general terms without using the specific evidence to reveal the contrast"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y6-C032",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifies what each paragraph in a short text is mainly about, distinguishing the main idea from supporting details.",
        "example_task": "Read this three-paragraph text about the Amazon rainforest. Write one sentence for each paragraph saying what its main idea is.",
        "example_response": "Paragraph 1: The Amazon rainforest is the largest tropical rainforest in the world. Paragraph 2: The rainforest is home to more species of plants and animals than anywhere else on Earth. Paragraph 3: Deforestation is threatening the Amazon and the wildlife that depends on it.",
        "common_errors": [
          "Copies the first sentence of each paragraph as the main idea, even when the main idea is stated elsewhere",
          "Includes specific details rather than the overarching point of the paragraph"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifies main ideas across multiple paragraphs and distinguishes them from supporting details, beginning to see how paragraphs connect to form an argument or explanation.",
        "example_task": "Read this four-paragraph text about renewable energy. For each paragraph, write the main idea AND identify one supporting detail that is not the main idea. Then write one sentence explaining how the paragraphs connect.",
        "example_response": "Paragraph 1: Main idea — fossil fuels are running out. Supporting detail — oil could be exhausted within 50 years. Paragraph 2: Main idea — renewable energy is a viable alternative. Detail — solar panels have become 70% cheaper since 2010. Paragraph 3: Main idea — there are challenges with renewable energy. Detail — wind turbines cannot generate power on calm days. Paragraph 4: Main idea — investment in renewables is increasing worldwide. Detail — China installed more solar capacity than any other country last year. Connection: The paragraphs follow a problem-solution-challenge-progress structure.",
        "common_errors": [
          "Confuses a vivid supporting detail with the main idea because it is more memorable",
          "Identifies main ideas in each paragraph but cannot see how the paragraphs connect logically"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Produces a coherent summary of a multi-paragraph text, capturing the main idea of each paragraph in logical order, written as fluent continuous prose in own words.",
        "example_task": "Read this five-paragraph article about the impact of plastic pollution on marine life. Write a summary of approximately 60 words that captures the main idea from each paragraph. Your summary must be in your own words and read as a fluent paragraph.",
        "example_response": "Millions of tonnes of plastic enter the oceans every year, harming marine ecosystems. Sea creatures mistake plastic for food, leading to starvation and internal injuries. Microplastics are now found in the food chain, including fish consumed by humans. Some countries have introduced bans on single-use plastics. However, scientists warn that without global action, plastic in the ocean could outweigh fish by 2050.",
        "common_errors": [
          "Includes interesting supporting details at the expense of main ideas from other paragraphs",
          "Loses the logical sequence of the original text when summarising"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Summarises complex, multi-paragraph texts that use different organisational structures, adapting the summarisation strategy to the text type and evaluating which information is essential in context.",
        "example_task": "Summarise this persuasive article (about 400 words) AND this explanatory text (about 400 words), each in approximately 80 words. Then explain how your summarisation approach differed for each text type.",
        "example_response": "[Persuasive summary preserves the claim, key evidence, counter-argument and conclusion in logical order. Explanatory summary preserves the causal chain, with each stage connected to the next.] Explanation: For the persuasive text, I needed to keep the argument structure intact — the claim, the strongest piece of evidence for each side, and the conclusion — because a persuasive text only makes sense if the reader can follow the reasoning. I cut illustrative examples that supported points already made. For the explanation, I needed to preserve every stage of the causal process, because missing one stage breaks the chain. I cut descriptive detail but kept all the causal connectives ('because', 'this leads to', 'as a result'). The key difference is that persuasive summaries prioritise the logic of the argument, while explanatory summaries prioritise the completeness of the process.",
        "common_errors": [
          "Uses the same summarisation approach for both text types without adapting to the structure",
          "Cannot articulate why the approach needs to differ — treats all texts as 'information to shorten'"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y6-C033",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Understands that writing improves through editing and can identify one thing to change in a first draft when given a prompt or checklist.",
        "example_task": "Read your first draft. Use this checklist to find one thing to improve: Does every sentence make sense? Is there a word you could make more precise? Is there a place where you need more detail?",
        "example_response": "I found that my third sentence says 'The thing went to the place.' I can make this more precise: 'The fox crept towards the henhouse.' The original was too vague — the reader cannot picture anything.",
        "common_errors": [
          "Says 'it is fine' without genuinely evaluating the writing",
          "Only checks spelling rather than content or expression"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Drafts with the intention of improving, making multiple changes to vocabulary, sentence structure and clarity in response to feedback or self-review.",
        "example_task": "Read your draft story opening. Make at least three improvements: one to vocabulary, one to sentence structure, and one to add detail where the writing is thin. Mark each change with a different colour.",
        "example_response": "Vocabulary (green): Changed 'walked' to 'trudged' — this shows he is tired without me having to say it. Sentence structure (blue): Combined 'It was raining. The streets were empty.' into 'Rain hammered the empty streets.' — one sentence is more powerful than two flat ones. Added detail (red): After 'He reached the door,' I added 'A handwritten note was pinned to the wood, the ink already beginning to run in the rain.' — this adds atmosphere and raises a question.",
        "common_errors": [
          "Makes only surface changes (swapping adjectives) rather than substantive improvements",
          "Improves the opening but does not edit the rest of the piece"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Drafts, evaluates against criteria of effectiveness, coherence and correctness, and makes substantive revisions that genuinely improve the quality of the writing, including restructuring paragraphs, cutting unnecessary material and strengthening arguments or descriptions.",
        "example_task": "Evaluate your discussion text draft against these criteria: (1) Is the introduction clear and engaging? (2) Are arguments organised logically? (3) Is evidence used effectively? (4) Is the conclusion balanced? (5) Is the register consistent? Rewrite any sections that score below 'good.'",
        "example_response": "Evaluation: (1) Introduction — adequate but bland. Rewritten: 'Should children be allowed social media accounts? It is a question that divides families, schools and even the children themselves.' (3) Evidence — Paragraph 2 makes a claim ('social media harms mental health') without evidence. Added: 'A 2023 study by the Royal College of Psychiatrists found that children who used social media for more than three hours daily were twice as likely to report feelings of anxiety.' (4) Conclusion — originally just repeated the introduction. Rewritten to weigh the arguments: 'While both sides raise compelling points, the evidence suggests that age restrictions, rather than outright bans, offer the best balance between safety and digital literacy.' (5) Register — paragraph 3 slipped into informal ('loads of kids think...'). Changed to 'many pupils believe...'",
        "common_errors": [
          "Evaluates accurately but makes only minor tweaks rather than substantive revisions",
          "Rewrites sections but introduces new problems (e.g. the revised version breaks coherence with surrounding paragraphs)"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Approaches drafting as an iterative craft, making multiple passes with different focuses (content, structure, style, accuracy), and can articulate how each revision improves the writing's overall effectiveness for the intended reader.",
        "example_task": "Take a piece of writing you completed last week. Conduct three editing passes: Pass 1 — content and argument (Is everything relevant? Is anything missing?). Pass 2 — structure and cohesion (Does it flow logically?). Pass 3 — style and precision (Is every word earning its place?). For each pass, make at least two changes and explain the effect.",
        "example_response": "Pass 1 (content): (1) Cut paragraph 4 entirely — it repeated the point from paragraph 2 without adding new evidence. The text is now tighter. (2) Added a counter-argument to paragraph 3 — the original was one-sided, which weakened the discussion's credibility. Pass 2 (structure): (1) Moved paragraph 5 to before paragraph 3 — the chronological evidence needed to come before the thematic analysis so the reader has the facts before the interpretation. (2) Added 'Despite this evidence' at the start of paragraph 4 to signal the shift from arguments for to arguments against, improving cohesion. Pass 3 (style): (1) Changed 'The results were really very significant' to 'The results were striking' — removed hedging that weakened the claim. (2) Broke the final sentence into two: 'The debate continues.' was more powerful alone as a short, definitive closing than buried in a longer sentence.",
        "common_errors": [
          "Makes the same type of change in every pass rather than genuinely focusing on different aspects",
          "Explains changes in general terms ('I made it better') rather than identifying the specific effect on the reader"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y6-C034",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Creates a simple plan before writing, listing ideas or key points in a logical order.",
        "example_task": "You are going to write an information text about the Ancient Greeks. Create a plan with a title and at least four points you want to cover, in the order you would write them.",
        "example_response": "Title: Life in Ancient Greece. 1. Where and when the Ancient Greeks lived. 2. What daily life was like. 3. The Olympic Games. 4. Greek gods and myths. 5. Why the Ancient Greeks are still important today.",
        "common_errors": [
          "Lists ideas in a random order rather than a logical sequence",
          "Plans only two or three points, which is not enough for extended writing"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Plans writing that identifies audience, purpose and form, and organises content into sections or paragraphs with brief notes on what each section will contain.",
        "example_task": "Plan a persuasive letter to your local MP about an issue you care about. Your plan must show: audience, purpose, form, and paragraph-by-paragraph content.",
        "example_response": "Audience: Local MP (adult, decision-maker). Purpose: Persuade them to act on road safety near our school. Form: Formal letter. Paragraph 1: Introduce myself and state the issue clearly. Paragraph 2: Argument 1 — traffic speed data from the school's survey. Paragraph 3: Argument 2 — a near-miss incident reported by a parent. Paragraph 4: What I am asking the MP to do (speed camera, crossing patrol). Paragraph 5: Polite closing and request for a response.",
        "common_errors": [
          "Plans the content but not the audience, purpose or form",
          "Writes paragraph notes that are too vague — 'Paragraph 2: more reasons' rather than specifying the argument"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Produces effective, detailed written plans for extended writing that identify audience, purpose and form, structure content logically with clear paragraph purposes, and include notes on key vocabulary, techniques and structural features to deploy.",
        "example_task": "Plan an extended piece of writing: a balanced discussion about whether zoos should exist. Your plan must include: audience/purpose/form, paragraph structure, key arguments with evidence notes, vocabulary/techniques to use, and your planned conclusion.",
        "example_response": "Audience: Examiner (formal, demonstrate balanced thinking). Purpose: Discuss both sides and reach a reasoned conclusion. Form: Balanced discussion text. Structure: Introduction — frame the debate, define 'zoo'. Paragraph 2 — For: conservation (breeding programmes, note: example of Giant Panda). Paragraph 3 — For: education (school trips, public awareness). Paragraph 4 — Against: animal welfare (limited space, unnatural behaviour — vocab: 'stereotypic behaviour'). Paragraph 5 — Against: ethics (animals not ours to imprison — vocab: 'moral responsibility'). Paragraph 6 — Conclusion: weigh arguments — conservation is valuable but only if welfare standards are high. Technique: Use formal connectives to signal shifts ('Conversely', 'On the other hand'). Ensure both sides get equal treatment. Avoid emotional language — let the evidence speak.",
        "common_errors": [
          "Plans content thoroughly but does not include notes on language, techniques or structural features",
          "Plans arguments for one side more fully than the other, leading to imbalanced writing"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Plans extended writing strategically, making deliberate choices about structure, sequence and emphasis based on the intended effect on the reader, and can explain why the plan is organised the way it is.",
        "example_task": "Plan a narrative that uses a non-linear structure (flashback, dual timeline, or in medias res). Explain why this structure serves your story better than a straightforward chronological approach.",
        "example_response": "Story: A girl discovers her grandmother's wartime diary. Structure: Dual timeline — alternating chapters between the girl reading the diary (present) and the grandmother's experiences (past). Opening: In medias res — the girl finds the diary hidden in a wall cavity during a house renovation. She opens it and reads the first entry, which takes us back to 1940. Plan: Chapter 1 (present): Discovery of the diary. Hook: the grandmother never talked about the war. Chapter 2 (past): First diary entry — grandmother arrives as an evacuee. Chapter 3 (present): The girl finds a photograph tucked between pages — she recognises the house. Chapter 4 (past): The grandmother makes a difficult choice. Final chapter (present): The girl understands something about her grandmother she never knew. Why this structure works better than chronological: Starting with the discovery creates an immediate mystery — why was the diary hidden? The alternating timeline lets the reader piece together the story alongside the girl, which creates dramatic irony when the reader knows things from the past that the girl does not yet understand. A chronological structure would tell the grandmother's story directly, losing the emotional frame of a granddaughter learning who her grandmother really was.",
        "common_errors": [
          "Plans a complex structure that serves as a novelty rather than genuinely enhancing the story",
          "Cannot explain why the chosen structure is better than a simpler alternative"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y6-C035",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifies one strength and one area for improvement in own or a partner's writing when given specific success criteria.",
        "example_task": "Read your partner's story. Using the success criteria (clear character, interesting setting, a problem, descriptive language), tell them one thing they did well and one thing to improve.",
        "example_response": "Strength: Your setting description is really effective — 'the wind rattled the windows like chattering teeth' made me feel like I was there. Improvement: The character does not have a clear problem yet. You could add something that goes wrong at the end of paragraph 1 to give the story direction.",
        "common_errors": [
          "Gives only vague praise ('it was good') without linking to the success criteria",
          "Identifies a weakness but cannot suggest a specific way to improve it"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Assesses writing against success criteria systematically, identifying strengths and weaknesses in content, structure and language, and making specific suggestions for improvement.",
        "example_task": "Assess your own persuasive letter against these criteria: (1) Clear opening statement of purpose. (2) At least three arguments with evidence. (3) Counter-argument acknowledged. (4) Formal register throughout. (5) Strong closing. For each, rate yourself and explain.",
        "example_response": "(1) Opening — good: 'I am writing to express my concern about...' clearly states purpose. (2) Arguments — developing: I have three arguments but only one has evidence (the road safety statistics). Arguments 2 and 3 are opinions without support. Action: research a fact for each. (3) Counter-argument — weak: I did not include one. Action: add 'Some may argue that... however...' (4) Register — mostly good, but paragraph 3 slips into 'it is really unfair' which is too informal. Change to: 'this raises significant concerns about fairness.' (5) Closing — good: polite request for action with contact details.",
        "common_errors": [
          "Rates everything as 'good' without genuinely evaluating quality",
          "Focuses only on surface features (spelling, handwriting) rather than content, structure and effect"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Evaluates own and others' writing for effectiveness, coherence and effect on the reader, using stated criteria to identify specific strengths and propose targeted improvements that address compositional quality, not just surface accuracy.",
        "example_task": "Exchange stories with a partner. Evaluate their story against these criteria: (1) Does the opening engage the reader? (2) Is the character developed through action and dialogue, not just description? (3) Does the pace vary appropriately? (4) Does the ending feel earned? Write detailed feedback with specific examples from their text.",
        "example_response": "(1) Opening — strong: 'Nobody noticed when the clock stopped.' This creates immediate intrigue. Effective because it is short, mysterious, and implies something important has happened. (2) Character — developing: Amira is described well ('dark eyes, always watching') but we only learn about her through the narrator's descriptions. Suggestion: add a scene where Amira's actions or dialogue reveal her personality — e.g. how she reacts when she discovers the clock has stopped would show us who she is. (3) Pace — needs work: paragraphs 3, 4 and 5 are all the same length and pace. The chase scene in paragraph 4 should be faster — try shorter sentences and fewer adjectives. Paragraph 5 is the emotional climax but it rushes past in three sentences. Slow it down with internal thought or a sensory detail. (4) Ending — effective: the final line ('The clock started again. But nothing else did.') echoes the opening and carries thematic weight. The ambiguity works well.",
        "common_errors": [
          "Evaluates from a personal preference rather than against the stated criteria — 'I liked it because I like mysteries'",
          "Identifies problems accurately but gives generic advice ('make it better') rather than specific, actionable suggestions"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluates writing from the reader's perspective, considering how effectively the text achieves its purpose for its audience, and proposes revisions that demonstrate understanding of craft and composition at a sophisticated level.",
        "example_task": "Re-read your own discussion text as if you were an examiner marking it. Identify the strongest and weakest sections. For the weakest section, write two alternative versions and evaluate which is more effective.",
        "example_response": "Strongest section: Paragraph 2 — the argument for is well-evidenced with a statistic and a real-world example, and the final sentence explicitly connects the evidence to the claim. An examiner would see clear PEE structure used fluently, not mechanically. Weakest section: The conclusion. Original: 'In conclusion, there are arguments on both sides and it is hard to decide.' This is weak because it does not weigh the arguments — it avoids taking a position. Version A: 'In conclusion, while both sides present valid points, the weight of scientific evidence supports the argument for renewable energy investment. The economic concerns raised by opponents are legitimate but short-term, whereas the environmental benefits are long-term and irreversible.' Version B: 'Ultimately, this is not a question of economics versus environment — it is a question of what kind of future we are willing to accept. The evidence presented in this discussion suggests that inaction carries a far greater cost than investment.' Version A is more effective for a formal discussion text because it directly references the arguments presented and reaches a reasoned judgement. Version B is more rhetorical and would suit a speech better. For this text type, I would use Version A.",
        "common_errors": [
          "Evaluates from the writer's perspective ('I tried hard on this') rather than the reader's or examiner's",
          "Writes alternative versions but cannot evaluate which is more effective for the specific text type and purpose"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y6-C047",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifies different writing forms encountered across the curriculum and names their basic features.",
        "example_task": "List five different forms of writing you have done this year. For each, name one feature that makes it different from the others.",
        "example_response": "1. Story — has characters, setting and plot. 2. Letter — has a greeting, paragraphs and a sign-off. 3. Report — has subheadings and presents facts. 4. Diary — written in first person about personal experiences. 5. Instructions — numbered steps with imperative verbs.",
        "common_errors": [
          "Lists topics (writing about the Romans, writing about the rainforest) rather than forms",
          "Cannot identify distinguishing features — describes all forms as 'it has paragraphs'"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writes in several different forms over the year, applying the basic conventions of each form, though may need reminding of specific conventions before writing.",
        "example_task": "Write a short book review (about 80 words) for the school library display. Include: title and author, a brief summary without spoilers, your opinion with a reason, and a recommendation.",
        "example_response": "Title: 'The Boy at the Back of the Class' by Onjali Q. Rauf. Summary: When a new boy joins the class, a group of friends discover he is a refugee from Syria. They decide to do something extraordinary to help him. Opinion: This is one of the best books I have read this year. It is funny, moving and makes you think about how you would react if a refugee arrived at your school. Recommendation: I would recommend it for confident readers in Year 5 and above.",
        "common_errors": [
          "Includes a detailed plot summary rather than a brief, spoiler-free overview",
          "Writes an opinion without giving a reason — 'I liked it' is not a review"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Writes confidently in a broad range of forms across the curriculum and for authentic purposes, applying the conventions of each form consistently and adapting language, structure and layout to match the form's requirements.",
        "example_task": "Over the next two weeks, you will write in four different forms for real audiences: (1) a formal letter to a local business requesting a donation for the school fair, (2) a biography of a scientist for the class display, (3) a script for a short assembly presentation, and (4) a newspaper report about a school event. For each, demonstrate that you understand and can apply the form's conventions.",
        "example_response": "[Four complete pieces, each demonstrating form-specific conventions: (1) Formal letter — appropriate layout, register, persuasive but polite tone, specific request. (2) Biography — third person, chronological structure, factual but engaging, significance of the person's contribution. (3) Script — stage directions, speaker labels, written for speaking aloud (shorter sentences, cues for pausing). (4) Newspaper report — headline, byline, inverted pyramid structure (most important information first), reported speech, neutral tone.]",
        "common_errors": [
          "Writes all four pieces in a similar style, only changing the content — the letter reads like the report, the script reads like the biography",
          "Follows form conventions mechanically without engaging authentically with the real audience"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Writes in a wide range of forms with fluency and authenticity, selecting the most effective form for each situation, adapting conventions creatively when purpose demands it, and reflecting on how experience with different forms strengthens overall writing ability.",
        "example_task": "Choose a topic you have studied this year. Write about it in three completely different forms for three different audiences. Then write a reflective commentary explaining what each form allowed you to do that the others could not.",
        "example_response": "Topic: The Industrial Revolution. Form 1 — Diary entry of a child factory worker (audience: classmates for a display): 'Monday 14th March 1833. My hands are raw from the spinning frames again. Mr Arkwright says I am too slow but the thread cuts my fingers...' Form 2 — Information report for a class textbook (audience: Year 5 pupils): 'The Industrial Revolution began in Britain in the late 18th century. Factories replaced cottage industries, and millions of people moved from the countryside to rapidly growing towns...' Form 3 — Speech for a school debate: 'The Industrial Revolution is celebrated as the birth of modern Britain. But at what cost? Today I want to tell you about the children — some as young as five — who paid for our progress with their health, their childhood, and sometimes their lives.' Commentary: The diary let me explore the emotional, human experience — I could use first person and sensory detail to make the reader empathise. The information report let me present facts objectively — I could cover the broad picture without personal bias. The speech let me combine facts with persuasion — I could use rhetorical techniques to make the audience care about historical injustice. Each form reveals a different truth about the same topic. Writing in all three made me realise that form is not just packaging — it changes what the writing can say and how the reader receives it.",
        "common_errors": [
          "Writes three pieces that differ in format but not genuinely in voice, purpose or effect",
          "Reflects on the forms in general terms ('the diary was more personal') without identifying specific techniques that each form enabled"
        ]
      }
    ]
  }
]
