[
  {
    "concept_id": "ELT-KS4-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can identify basic dramatic features in Shakespeare (e.g. recognises a soliloquy or aside) but does not explain how these conventions create specific theatrical effects.",
        "example_task": "Read this extract from Act 1, Scene 7 of 'Macbeth'. What dramatic convention is Shakespeare using when Macbeth speaks alone on stage? Why might Shakespeare have chosen this moment for a soliloquy?",
        "example_response": "This is a soliloquy because Macbeth is speaking alone. Shakespeare uses it so the audience can hear what Macbeth is thinking. He is thinking about whether to kill Duncan.",
        "common_errors": [
          "Defining the convention ('a soliloquy is when a character speaks alone') without analysing its dramatic function in this specific moment",
          "Treating the soliloquy as simply 'the character's thoughts' rather than a deliberate dramatic device that creates tension between public and private selves"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explains the function of key dramatic conventions (soliloquy, aside, verse/prose shifts, dramatic irony) with reference to specific moments, and begins to consider the effect on an audience rather than just a reader.",
        "example_task": "In 'Macbeth', Shakespeare shifts between verse and prose. Find one example of each in the extract and explain why Shakespeare makes this shift.",
        "example_response": "Macbeth speaks in blank verse when addressing the court: 'If it were done when 'tis done, then 'twere well / It were done quickly.' The iambic pentameter creates a rhythmic, elevated register appropriate to his status as a nobleman and warrior. However, the Porter in Act 2 Scene 3 speaks in prose: 'Here's a knocking indeed!' This shift signals a change in social class -- the Porter is a commoner -- and also a change in dramatic mode from the tense, poetic atmosphere of the murder scene to vulgar comic relief. The prose allows the actor to improvise and the audience to breathe after the intensity of Duncan's killing.",
        "common_errors": [
          "Identifying the verse/prose distinction without explaining why Shakespeare shifts between them at specific moments",
          "Discussing Shakespeare's language as though it is being read silently rather than performed to a live audience"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses how Shakespeare uses dramatic conventions as interconnected tools to create meaning, control audience response and develop character, integrating analysis of convention with close reading of language.",
        "example_task": "Read Act 3, Scene 4 of 'Macbeth' (the banquet scene). Analyse how Shakespeare uses dramatic conventions to present Macbeth's deteriorating mental state.",
        "example_response": "Shakespeare uses the banquet scene to externalise Macbeth's psychological collapse through three converging dramatic conventions. First, dramatic irony: the audience knows Banquo has been murdered on Macbeth's orders, so when Macbeth says 'I drink to the general joy o' the whole table, and to our dear friend Banquo, whom we miss', the irony is excruciating -- the audience watches Macbeth perform hospitality while the ghost of his crime literally sits at the table. Second, the ghost itself functions as a theatrical convention that makes internal guilt visible: whether the audience sees the ghost (as in many productions) or sees only an empty chair (as the stage direction is ambiguous), the effect is a splitting of reality -- what Macbeth sees and what his guests see are different, dramatising his isolation from the world of the sane. Third, the disruption of verse signals the disruption of order: Macbeth's lines become increasingly fragmented -- 'Avaunt, and quit my sight! Let the earth hide thee!' -- the exclamatory syntax and caesurae breaking the iambic line, formally enacting the loss of composure that the action dramatises. Lady Macbeth's asides to the lords -- 'Sit, worthy friends. My lord is often thus' -- create a secondary dramatic register, a performance-within-a-performance, as she attempts to manage public perception while privately recognising that her husband is losing control. The banquet scene thus uses Shakespeare's full repertoire of dramatic convention to stage the moment when Macbeth's public and private selves can no longer be held apart.",
        "common_errors": [
          "Analysing dramatic conventions in isolation rather than showing how multiple conventions interact in a single scene",
          "Describing the effect on 'the reader' rather than 'the audience', missing the theatrical dimension of the text"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluates Shakespeare's use of dramatic conventions with critical sophistication, considering how different theatrical interpretations affect meaning, and connecting formal choices to the broader thematic and political concerns of the play.",
        "example_task": "Evaluate how Shakespeare uses the conventions of tragedy in 'Macbeth'. Consider whether Macbeth fits the classical model of the tragic hero and how Shakespeare adapts or subverts tragic convention.",
        "example_response": "Shakespeare both employs and complicates the classical tragic model in 'Macbeth', creating a protagonist who resists comfortable categorisation. The Aristotelian framework -- hamartia, peripeteia, anagnorisis, catharsis -- is present but deliberately distorted. Macbeth's hamartia is traditionally identified as ambition, but this reading is insufficient: ambition alone would produce a political drama, not a tragedy. What makes Macbeth tragic is his imagination -- the capacity to see, in horrifying detail, the moral consequences of what he is about to do ('his virtues will plead like angels, trumpet-tongued, against the deep damnation of his taking-off') and to do it anyway. This is not a flaw of ignorance but of will, which makes Macbeth closer to Milton's Satan than to Oedipus. The peripeteia (reversal) is also complicated. In classical tragedy, the reversal is external -- fate turns against the hero. In 'Macbeth', the reversal is internal: the murder of Duncan, which Macbeth commits to seize control, initiates a psychological disintegration that strips him of the very agency he sought. By Act 5, the man who killed to become king cannot feel anything: 'I have almost forgot the taste of fears.' Shakespeare uses the convention of the soliloquy to chart this trajectory -- from the agonised moral reasoning of 'Is this a dagger' to the nihilistic 'Tomorrow, and tomorrow, and tomorrow' -- making the soliloquy not just a window into thought but a measure of what has been lost. The anagnorisis (recognition) is the most contested element. Does Macbeth achieve self-knowledge? 'Tomorrow and tomorrow' might be read as existential insight -- the recognition that his choices have emptied life of meaning -- or as the final failure of understanding, a man who blames 'a tale told by an idiot' rather than acknowledging his own authorship of the catastrophe. This ambiguity is Shakespeare's most sophisticated subversion of tragic convention: he denies the audience the cathartic resolution that classical tragedy provides. We do not leave the play feeling that justice has been done and order restored. We leave it haunted by the possibility that Macbeth was right -- that all the sound and fury signified nothing.",
        "common_errors": [
          "Applying the classical tragic framework mechanically without evaluating whether Shakespeare adapts or subverts it",
          "Treating Shakespeare's dramatic conventions as static features rather than as dynamic tools that evolve across the play"
        ]
      }
    ]
  },
  {
    "concept_id": "ELT-KS4-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can identify figurative language in Shakespeare (e.g. spots a metaphor or simile) but struggles with the density of Shakespeare's imagery and tends to paraphrase rather than analyse.",
        "example_task": "Read Macbeth's soliloquy in Act 1, Scene 7 ('If it were done when 'tis done...'). Find one example of figurative language and explain what it means.",
        "example_response": "Shakespeare uses the metaphor 'vaulting ambition, which o'erleaps itself'. This means that Macbeth's ambition is like a horse that jumps too far and falls over the other side. It suggests that too much ambition can lead to failure.",
        "common_errors": [
          "Translating the metaphor into modern English without analysing the effect of Shakespeare's specific word choices",
          "Identifying the vehicle of the metaphor ('a horse jumping') but not connecting it to the play's themes"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Analyses Shakespeare's language choices with some precision, exploring connotations of specific words and connecting imagery to character or theme, though analysis may be limited to one or two features per extract.",
        "example_task": "Analyse how Shakespeare uses imagery in Lady Macbeth's 'unsex me here' speech (Act 1, Scene 5). Focus on two specific images.",
        "example_response": "Lady Macbeth commands: 'Come, you spirits / That tend on mortal thoughts, unsex me here, / And fill me from the crown to the toe top-full / Of direst cruelty'. The verb 'unsex' is remarkable because it asks the supernatural to remove her femininity entirely -- in the Elizabethan world view, this means removing the qualities of compassion and nurturing that define womanhood. The image of being filled 'from the crown to the toe' with cruelty imagines the body as a container that can be emptied of one quality and refilled with another, as though humanity is liquid and interchangeable. The word 'direst' -- meaning most extreme -- goes beyond ordinary cruelty to suggest something inhuman. Shakespeare uses this language to present Lady Macbeth as someone willing to sacrifice her own nature for power, which foreshadows the psychological cost she will pay later in the play.",
        "common_errors": [
          "Analysing individual words without connecting them to the overall image pattern of the speech",
          "Identifying what the imagery means but not how it functions as dramatic language -- how would this sound to an audience?"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses Shakespeare's language at multiple levels simultaneously -- lexical choice, imagery, syntax, sound -- and traces image patterns across the whole play, connecting specific moments to broader thematic development.",
        "example_task": "Analyse how Shakespeare uses the imagery of blood across 'Macbeth'. You should refer to at least three different moments in the play.",
        "example_response": "Blood is the play's central image cluster, and Shakespeare transforms its meaning across the five acts to track Macbeth's moral trajectory. Before the murder, blood signifies honour: the 'bloody man' of Act 1 Scene 2 is a wounded soldier whose blood is the visible evidence of courage. The Captain's report transforms blood into spectacle and trophy -- 'he unseam'd him from the nave to the chops' -- and the violence is celebrated because it serves the legitimate order. After Duncan's murder, the same substance becomes evidence of guilt. Macbeth's 'Will all great Neptune's ocean wash this blood / Clean from my hand?' transforms blood from external badge to indelible stain, and the hyperbole of the ocean image measures the scale of what cannot be undone. The image of the hand turning the 'multitudinous seas incarnadine, / Making the green one red' is Shakespeare's most extraordinary moment of linguistic enactment: the polysyllabic Latinate 'multitudinous seas incarnadine' is itself overwhelmed by the monosyllabic Anglo-Saxon 'making the green one red', as though the elaborate language of guilt collapses under its own weight into the simplest possible statement. By Act 5, Lady Macbeth's sleepwalking scene completes the image's transformation: 'Out, damned spot! Out, I say!' Here, the blood is hallucinatory -- there is no physical stain -- which means guilt has become a permanent psychological reality that cannot be washed, wished or willed away. The irony is complete: Lady Macbeth, who in Act 2 dismissed blood as something that 'a little water clears us of', is now destroyed by the very image she once minimised. Shakespeare thus uses a single substance to trace an entire moral arc: from honour, through guilt, to madness.",
        "common_errors": [
          "Tracing an image across the play without analysing the specific language of each instance",
          "Identifying the image cluster without explaining how Shakespeare transforms its meaning across different dramatic contexts"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Produces sophisticated close readings of Shakespeare's language that engage with the full complexity of his imagery, syntax, sound and dramatic register, considering how multiple layers of meaning operate simultaneously and how language functions in performance.",
        "example_task": "Choose a speech of 10-15 lines from your studied Shakespeare play and produce a detailed close reading that analyses how language creates meaning at multiple levels.",
        "example_response": "Macbeth, Act 5, Scene 5: 'Tomorrow, and tomorrow, and tomorrow, / Creeps in this petty pace from day to day / To the last syllable of recorded time, / And all our yesterdays have lighted fools / The way to dusty death. Out, out, brief candle! / Life's but a walking shadow, a poor player / That struts and frets his hour upon the stage / And then is heard no more. It is a tale / Told by an idiot, full of sound and fury, / Signifying nothing.' The speech operates through three interlocking strategies: temporal manipulation, theatrical self-reference and progressive abstraction. The opening line's triple repetition of 'tomorrow' creates a rhythmic monotony that enacts the tedium it describes -- the comma after each 'tomorrow' forces a pause that mimics the 'petty pace' of the second line. The iambic stress falls on 'creeps', a verb that transforms time from abstraction to sluggish, unwanted physical presence. 'The last syllable of recorded time' is a remarkable conceit: it reimagines all of history as a text being read aloud, with each moment a syllable, and the end of time as the end of the final word. This positions human experience as something already written -- a predestined script -- which connects directly to the theatrical metaphor that follows. The 'walking shadow' and 'poor player' images are self-consciously metatheatrical: Macbeth, a dramatic character, describes life as a performance. In the Globe Theatre, this would have been vertiginous -- the actor playing Macbeth is literally 'a poor player that struts and frets his hour upon the stage'. Shakespeare creates a hall-of-mirrors effect where the boundary between Macbeth's despair and the audience's reality dissolves. The final image -- 'a tale told by an idiot' -- completes the progressive abstraction: life has moved from 'tomorrow' (something you live) to 'a candle' (something that burns out) to 'a shadow' (something insubstantial) to 'a tale' (something narrated) told by 'an idiot' (someone whose speech lacks meaning). The speech is itself 'full of sound and fury' -- the hard consonants, the emphatic stresses, the exclamatory 'Out, out!' -- but this rhetorical energy is deployed in service of the claim that nothing signifies. The form contradicts the content: the most powerfully crafted speech in the play argues that all craft is meaningless. Whether this constitutes tragic insight or its final absence is the question Shakespeare leaves unanswered.",
        "common_errors": [
          "Producing a comprehensive catalogue of techniques without building a sustained interpretive argument about what the language achieves as a whole",
          "Analysing Shakespeare's language only as written text without considering its theatrical dimension -- how it sounds, how it would be performed, how it addresses an audience"
        ]
      }
    ]
  },
  {
    "concept_id": "ELT-KS4-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knows basic facts about the Elizabethan or Jacobean period but tends to include context as a separate paragraph rather than connecting it to specific textual choices.",
        "example_task": "How does knowledge of the Elizabethan period help us understand 'Macbeth'? Give one example.",
        "example_response": "In the Elizabethan period, people believed in witches and the supernatural. This helps us understand why the witches in Macbeth are important -- the audience would have believed they were real and dangerous.",
        "common_errors": [
          "Stating contextual facts without connecting them to specific moments in the text",
          "Beginning a paragraph with 'In the Elizabethan era...' and narrating historical information that is never linked back to the play"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Uses contextual knowledge to explain specific textual choices, connecting historical/social information to why a scene, character or speech has particular significance, though the connection may be surface-level.",
        "example_task": "How does understanding the concept of the Divine Right of Kings help us interpret the murder of Duncan in 'Macbeth'?",
        "example_response": "The Divine Right of Kings was the belief that the monarch was chosen by God and therefore killing a king was not just murder but a sin against God's natural order. This helps us understand why Duncan's murder is presented as so catastrophic -- it is not just a political assassination but a cosmic disruption. Shakespeare signals this through the unnatural events that follow the murder: the old man reports that 'a falcon, towering in her pride of place, / Was by a mousing owl hawk'd at and kill'd' -- the natural hierarchy of birds has been inverted, mirroring the inversion of the political hierarchy. James I, who was king when Macbeth was first performed, was a strong believer in the Divine Right of Kings, so Shakespeare is writing for an audience (and a patron) who would have found regicide genuinely horrifying.",
        "common_errors": [
          "Explaining the Divine Right of Kings accurately but not connecting it to a specific moment in the text",
          "Treating the context as background rather than as something that shapes the meaning of specific language choices"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Integrates contextual knowledge fluently into textual analysis, using context to illuminate why specific language, structural or dramatic choices resonate in their historical moment, without allowing context to substitute for close reading.",
        "example_task": "Analyse how Shakespeare presents Lady Macbeth in Act 1, Scene 5. Consider how the Jacobean context shapes the audience's response to her.",
        "example_response": "Lady Macbeth's 'unsex me here' speech would have been profoundly transgressive for a Jacobean audience. Her invocation of evil spirits -- 'Come, you spirits that tend on mortal thoughts' -- explicitly aligns her with witchcraft, which James I had written about in his treatise 'Daemonologie' (1597) and taken seriously enough to preside over witch trials. But Shakespeare's presentation is more complex than simple demonisation. Lady Macbeth's request to be 'unsexed' reveals that her culture defines femininity as an obstacle to action: she cannot pursue power and remain a woman because the Jacobean framework positions female nature as incompatible with political agency. Her language of bodily transformation -- 'Come to my woman's breasts, / And take my milk for gall' -- imagines motherhood itself as a weakness to be chemically altered, which speaks to the deep anxieties about powerful women that shaped Jacobean attitudes to female authority (intensified by the recent memory of Elizabeth I, whose power had required a rhetoric of 'honorary masculinity'). Shakespeare thus uses Lady Macbeth to dramatise a cultural contradiction: the patriarchal order insists that women are gentle and nurturing, but when a woman accepts this definition and violates it, the system that created the definition treats her as monstrous. The Jacobean audience would have been horrified by Lady Macbeth -- but Shakespeare's text is more interrogative than condemnatory, inviting the question of what kind of society makes power available only to those willing to destroy their own humanity to obtain it.",
        "common_errors": [
          "Using context to explain the audience's likely reaction without connecting it to the specific language Shakespeare chooses",
          "Presenting contextual knowledge as certain when historical attitudes were diverse and contested"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Uses contextual knowledge with critical sophistication, recognising that context is not a fixed background but a contested set of attitudes that Shakespeare both reflects and challenges, and evaluating how different historical or critical frameworks produce different interpretations of the same text.",
        "example_task": "Evaluate how different contextual readings change our interpretation of 'Macbeth'. Consider at least two different contextual frameworks.",
        "example_response": "The interpretation of 'Macbeth' shifts fundamentally depending on which contextual framework we prioritise, which reveals that context is not a neutral backdrop but an interpretive lens. A Jacobean political reading focuses on James I as the play's primary audience: the compliment to Banquo (ancestor of the Stuart line), the presentation of regicide as cosmic disorder, and the restoration of legitimate kingship through Malcolm can be read as a dramatised endorsement of Stuart legitimacy. In this reading, Macbeth is a cautionary tale about the consequences of violating the divinely sanctioned political order -- a 'king's play' that flatters its patron by dramatising the worst that can happen when his authority is challenged. But this reading struggles to account for the play's most powerful moments, which are not political but psychological. A psychoanalytic reading (drawing on Freud's 1916 essay 'Some Character-Types Met With In Psycho-Analytic Work') interprets Lady Macbeth's sleepwalking as the return of repressed guilt and Macbeth's hallucinations as the projections of a mind that knows what it has done but cannot consciously acknowledge it. In this framework, the play is not about politics but about the impossibility of committing an act that violates one's own moral knowledge and surviving psychologically intact. A feminist reading produces yet another interpretation: Lady Macbeth's 'unsex me here' becomes not an embrace of evil but a critique of a society that defines power as masculine and compassion as feminine, forcing anyone who wants to act in the political sphere to renounce the qualities their culture assigns to their gender. In this reading, Lady Macbeth is not a villain but a victim of a patriarchal system that offers women only two roles: obedient wife or monster. Each of these readings is defensible, and each is limited by what it excludes. The Jacobean political reading marginalises the play's psychological depth; the psychoanalytic reading dehistoricises the political stakes; the feminist reading risks anachronism. What makes 'Macbeth' a great play is not that one context explains it but that it resists reduction to any single contextual frame -- it is a text that continues to generate meaning precisely because it speaks to multiple concerns simultaneously.",
        "common_errors": [
          "Presenting a single contextual reading as definitive rather than recognising that different contexts produce different but equally valid interpretations",
          "Including multiple contexts but treating them as sequential paragraphs rather than showing how they interact, compete or illuminate different aspects of the same text"
        ]
      }
    ]
  },
  {
    "concept_id": "ELT-KS4-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can identify basic genre features of the studied 19th-century text (e.g. 'it is a Gothic novel' or 'it is about poverty') but does not explain how genre conventions shape the reader's experience.",
        "example_task": "What genre is 'A Christmas Carol' by Dickens? How can you tell?",
        "example_response": "It is a ghost story because there are ghosts in it. It is also a morality tale because Scrooge learns to be a better person. The supernatural elements and the moral lesson tell us what genre it is.",
        "common_errors": [
          "Naming the genre without explaining how its conventions shape the writing",
          "Treating genre as a label rather than a set of conventions that create specific reader expectations"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifies genre conventions in the studied text and explains how they shape characterisation, setting or narrative structure, making some connections between form and meaning.",
        "example_task": "How does Stevenson use the conventions of Gothic fiction in 'The Strange Case of Dr Jekyll and Mr Hyde'? Give two examples.",
        "example_response": "Stevenson uses Gothic conventions to create an atmosphere of concealment and dread. First, the setting of London is presented as a labyrinth of dark streets and hidden doors -- the description of Hyde's entrance as 'the door, which was equipped with neither bell nor knocker, was blistered and distained' uses adjectives that suggest neglect and decay, typical of Gothic architecture. The hidden door literally leads to Jekyll's respectable house, making the building itself a physical metaphor for the duality theme. Second, Stevenson uses the convention of the fragmented narrative -- the story is told through multiple accounts, letters and third-person observation rather than a single authoritative narrator. This fragmentation is a Gothic convention that creates uncertainty: the reader, like the characters, must piece together the truth from incomplete evidence, which mirrors the epistemological anxiety of a society that fears what lies beneath respectable surfaces.",
        "common_errors": [
          "Identifying Gothic features (dark settings, supernatural elements) without explaining how they function within the specific concerns of this text",
          "Listing conventions without connecting them to the text's thematic or ideological purpose"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses how the 19th-century writer works within, extends or subverts genre conventions, connecting formal choices to the social and ideological concerns of the period and demonstrating understanding of narrative technique.",
        "example_task": "Analyse how Dickens uses the conventions of the novella form and the ghost story genre in 'A Christmas Carol' to create a text that is both entertaining and politically purposeful.",
        "example_response": "Dickens exploits the compactness of the novella form and the supernatural machinery of the ghost story to deliver a polemic against Victorian economic individualism disguised as a Christmas entertainment. The novella's brevity is essential to the text's rhetorical strategy: Scrooge's transformation from miser to philanthropist takes place in a single night, compressing what would be a gradual psychological change into an urgent, theatrical one. This formal compression serves Dickens's purpose: he is not interested in realistic character development but in demonstrating that moral transformation is possible immediately -- a direct challenge to Malthusian economics, which argued that poverty was a natural and irremediable condition. The ghost story genre provides the mechanism for this compression. Each spirit operates as a different mode of persuasion: the Ghost of Christmas Past uses memory and empathy (pathos), the Ghost of Christmas Present uses evidence of suffering (logos -- Dickens shows Scrooge the Cratchit family as a living counter-argument to his philosophy), and the Ghost of Christmas Yet to Come uses fear (a silent, hooded figure whose method is pure Gothic terror). The genre convention of the supernatural visitation allows Dickens to bypass the realist novel's requirement for plausibility -- no one asks how ghosts can transport a man through time, because the genre has already established the contract. The result is a text that is simultaneously a ghost story (entertainment), a novella (literary form), a sermon (moral argument) and a political pamphlet (critique of the New Poor Law). Dickens's genius is in recognising that the Christmas genre -- festive, communal, emotionally generous -- is the perfect vehicle for an argument about social responsibility, because it allows him to present redistribution of wealth not as radical politics but as seasonal goodwill.",
        "common_errors": [
          "Analysing genre conventions without connecting them to the text's political or social purpose",
          "Treating narrative technique as decoration rather than as a tool that serves the writer's ideological aims"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluates how 19th-century genre conventions encode the ideological assumptions of the period, analyses how the writer both employs and interrogates those conventions, and considers how modern readers may respond differently to the text than its original audience.",
        "example_task": "Evaluate how the genre conventions of 'The Strange Case of Dr Jekyll and Mr Hyde' encode specifically Victorian anxieties. Consider how a modern reader might interpret these conventions differently from a Victorian audience.",
        "example_response": "Stevenson's novella works simultaneously as Gothic horror, detective fiction and psychological case study, and each generic layer encodes a distinct Victorian anxiety. The Gothic layer -- Hyde's deformity, his association with darkness and back streets, the locked laboratory -- externalises the fear of degeneration: the scientific theory, prevalent in the 1880s, that civilisation could regress, that the veneer of respectability concealed an atavistic violence that might erupt at any moment. Hyde is consistently described in terms that invoke evolutionary regression -- 'hardly human', 'ape-like fury', 'troglodytic' -- which places the novella within a post-Darwinian anxiety about what humanity might revert to when moral restraints are removed. The detective fiction layer -- Utterson's investigation, the fragmented narrative, the locked-room mystery -- encodes epistemological anxiety: the fear that the truth is not merely hidden but structurally unknowable. Victorian society was organised around public performance of respectability, and Stevenson's fragmented form mirrors a social order in which no single perspective has access to the whole truth. The revelation that Jekyll and Hyde are the same person is not just a plot twist but a structural argument: identity itself is multiple, and the detective's search for a single explanation is destined to fail. A modern reader encounters these conventions differently. The duality of Jekyll and Hyde, which for Victorian readers dramatised the repression required by respectability, is now more commonly read through a psychological lens: the text becomes an allegory of addiction, mental illness, or the fragmentation of modern identity. The Gothic deformity of Hyde, which Stevenson's original readers might have read as moral physiognomy (evil visible in the body), is now more likely to prompt discomfort about the text's equation of physical difference with moral corruption -- a reading that reveals the ableist and potentially racist assumptions embedded in Victorian Gothic convention. The genre conventions that made the text legible in 1886 have not changed, but the ideological frameworks through which we interpret them have, which is precisely why 19th-century texts remain valuable objects of study: they reveal not only the anxieties of their own period but the assumptions of ours.",
        "common_errors": [
          "Analysing Victorian genre conventions without acknowledging that they encode ideological assumptions the writer may not have been fully conscious of",
          "Comparing Victorian and modern readings without being precise about what has changed and why"
        ]
      }
    ]
  },
  {
    "concept_id": "ELT-KS4-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knows basic facts about the Victorian period (e.g. 'there was a lot of poverty', 'women had fewer rights') but includes them as general background rather than connecting them to specific textual moments.",
        "example_task": "How does knowledge of Victorian society help us understand Scrooge's character in 'A Christmas Carol'?",
        "example_response": "In Victorian times, there was a lot of poverty and rich people did not always help the poor. This helps us understand Scrooge because he is a rich man who does not care about poor people. Dickens wanted to show that this was wrong.",
        "common_errors": [
          "Making general statements about the Victorian period without connecting them to specific moments in the text",
          "Presenting context as 'in those days...' without explaining how that historical reality shapes a specific character, scene or language choice"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Connects specific Victorian social or historical conditions to specific moments in the text, explaining how context illuminates the writer's choices, though connections may be limited to the most obvious examples.",
        "example_task": "How does understanding Victorian attitudes to class help us interpret the presentation of Pip's ambitions in 'Great Expectations'?",
        "example_response": "Victorian society was rigidly structured by class, and social mobility was both desired and feared. Pip's desire to become a 'gentleman' reflects the aspirational culture of the period: the Industrial Revolution had created new wealth, and education could transform a blacksmith's apprentice into a man of property. However, Dickens complicates this aspiration. When Pip receives his 'great expectations', his first action is to feel ashamed of Joe -- 'I wished Joe had been rather more genteelly brought up'. The word 'genteelly' carries the weight of the class system that Pip is internalising: he is adopting the standards of the class he aspires to join and applying them to the person who raised him. Dickens uses Pip's shame to critique a class system that makes human loyalty incompatible with social advancement -- a specifically Victorian contradiction that his middle-class readership would have recognised in themselves.",
        "common_errors": [
          "Explaining Victorian class structure accurately but not connecting it to a specific quotation or moment in the text",
          "Treating the writer's attitude as identical to the characters' attitudes -- Dickens criticises what Pip admires"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Integrates Victorian social and historical context fluently into literary analysis, using context to explain why specific language, character and structural choices resonate within their historical moment, and distinguishing between the author's perspective and the characters' perspectives.",
        "example_task": "Analyse how Stevenson uses the setting of 'Dr Jekyll and Mr Hyde' to reflect Victorian social anxieties. You should refer to specific moments in the text.",
        "example_response": "Stevenson uses London's geography as a moral map of Victorian society. The respectable front door of Jekyll's house opens onto a 'square of ancient, handsome houses, now for the most part decayed from their high estate and let in flats and chambers to all sorts and conditions of men'. The phrase 'decayed from their high estate' applies to the houses but also to their inhabitants -- the vocabulary of decline ('decayed', 'high estate') conflates architectural deterioration with social degeneration, reflecting the Victorian anxiety that respectability is a facade that conceals corruption. The back entrance to the same building -- Hyde's door, 'blistered and distained', opening onto a 'dingy street' with 'a blind forehead of discoloured wall' -- is literally the same property viewed from a different angle. This architectural duality is Stevenson's most powerful structural metaphor: the same building presents a respectable face to one street and a degraded face to another, just as Jekyll presents a philanthropic public identity while concealing his 'undignified' pleasures. The fact that Hyde accesses the building from the back entrance -- the servants' and tradesmen's entrance in Victorian domestic architecture -- associates his activities with the lower classes and the hidden domestic spaces that respectable society preferred not to acknowledge. Stevenson is mapping the topography of Victorian hypocrisy: the same city, the same building, the same man can be respectable or degraded depending on which door you use. The fog that pervades the novella is not just atmospheric but epistemological -- it represents a society that has deliberately obscured its own contradictions.",
        "common_errors": [
          "Describing the setting without connecting it to the social anxieties of the period",
          "Using context to explain what the writer describes rather than why the writer describes it in this specific way"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Uses Victorian contextual knowledge with critical sophistication, recognising that 19th-century writers are both products of and commentators on their culture, and evaluating how the text both reflects and challenges the ideological assumptions of its period.",
        "example_task": "Evaluate the extent to which Dickens challenges or reinforces Victorian attitudes to poverty in 'A Christmas Carol'. Consider whether the text's resolution is genuinely radical or ultimately conservative.",
        "example_response": "The radicalism of 'A Christmas Carol' is more apparent than real, and evaluating this requires distinguishing between Dickens's emotional critique and his structural conservatism. The text's emotional power is undeniable: the Cratchit family, Ignorance and Want, and Tiny Tim's potential death are designed to produce visceral sympathy, and they succeed. Dickens's attack on Malthusian economics is explicit -- Scrooge's 'Are there no prisons? And the Union workhouses?' echoes the language of the 1834 New Poor Law, and the Ghosts systematically demolish the intellectual justifications for indifference to suffering. This is genuinely subversive of the dominant economic orthodoxy of the 1840s. However, the resolution is profoundly conservative. Scrooge's transformation is individual, not systemic: he buys the Cratchits a turkey, he gives Bob a pay rise, he becomes 'as good a friend, as good a master, and as good a man, as the good old city knew'. The vocabulary of 'goodness' and 'friendship' reframes economic exploitation as a failure of personal generosity rather than a structural injustice. The solution Dickens offers -- that rich men should choose to be kind -- leaves the economic system that creates poverty entirely intact. There is no mention of workers' rights, collective action, fair wages or legislative reform. The Cratchit family's salvation depends entirely on the goodwill of their employer, which is a deeply paternalistic model that flatters the middle-class reader: you can solve poverty by being nicer, without changing anything about the system that benefits you. Dickens, it must be said, may have been strategically conservative rather than naively so. Writing for a middle-class audience in 1843, a radical economic critique would have alienated his readership. The ghost story form allows him to make emotional and moral arguments that his audience can accept without feeling threatened. Whether this pragmatism constitutes compromise or realism depends on one's view of what literature can achieve. What is clear is that the text's enduring popularity rests precisely on this ambiguity: it allows the reader to feel morally improved without being materially inconvenienced.",
        "common_errors": [
          "Praising the writer's social critique without evaluating whether the text's resolution actually challenges or reinforces the structures it criticises",
          "Treating the Victorian period as monolithic rather than recognising that writers like Dickens were in dialogue with specific political and economic debates of their moment"
        ]
      }
    ]
  },
  {
    "concept_id": "ELT-KS4-C006",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can describe what characters do and say but treats them as real people rather than analysing how the writer constructs them through specific techniques.",
        "example_task": "How is the character of Scrooge presented at the beginning of 'A Christmas Carol'?",
        "example_response": "Scrooge is a mean, grumpy old man who does not like Christmas. He is horrible to his nephew and to the charity collectors. He does not care about poor people and only cares about money.",
        "common_errors": [
          "Describing the character's qualities without explaining how the writer creates those impressions",
          "Writing about characters as though they are real people making choices rather than constructions made by the author"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Analyses how the writer presents character through specific techniques (description, dialogue, action, others' reactions) and begins to distinguish between what a character says and what the writer implies.",
        "example_task": "Analyse how Dickens presents Scrooge in Stave 1 of 'A Christmas Carol'. Focus on the methods Dickens uses to create a specific impression.",
        "example_response": "Dickens presents Scrooge through a sustained accumulation of negative imagery. The opening description uses simile to define him: 'Hard and sharp as flint, from which no steel had ever struck out generous fire.' This compares Scrooge to a stone that cannot produce warmth, establishing his inability to feel or give. The word 'generous' is significant because it transforms a physical image (striking flint) into a moral judgement (generosity). Dickens also uses other characters as mirrors: Fred's warmth and goodwill are directly contrasted with Scrooge's coldness, and the charity collectors' hesitation before Scrooge's door suggests that his reputation precedes him. The pathetic fallacy of the weather -- 'The fog came pouring in at every chink and keyhole' -- extends Scrooge's coldness to the environment itself, as though his personality has infected the physical world around him.",
        "common_errors": [
          "Analysing one method of characterisation (e.g. description) without considering how multiple methods work together",
          "Identifying that other characters react to Scrooge but not explaining how these reactions shape the reader's understanding"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses characterisation as a deliberate authorial strategy, examining how the writer controls sympathy, uses narrative voice to position the reader, and develops character across the whole text to serve thematic purposes.",
        "example_task": "Analyse how Bronte presents the character of Jane Eyre in the opening chapters. Consider how Bronte uses narrative voice to control the reader's sympathy.",
        "example_response": "Bronte's first-person retrospective narration is the primary tool of characterisation in 'Jane Eyre', and it operates through a deliberate double perspective: the adult Jane narrating and the child Jane experiencing. When the child Jane confronts Mrs Reed -- 'I am not deceitful: if I were, I should say I loved you; but I declare I do not love you' -- the directness of the statement creates admiration for the child's courage. But the adult narrator frames this moment with reflection: 'A child cannot quarrel with its elders, as I had done, cannot give its furious feelings uncontrolled play, as I had given mine, without experiencing afterwards the pang of remorse and the chill of reaction.' The adult voice qualifies the child's defiance, adding moral complexity. Bronte thus controls sympathy through temporal distance: we admire the child's rebellion but are invited by the adult narrator to recognise its cost. This dual perspective prevents Jane from becoming simply a victim or simply a rebel -- she is both, and the reader is positioned to hold both responses simultaneously. Bronte extends this strategy across the novel: Jane's choices (leaving Thornfield, refusing St John, returning to Rochester) are always presented through the retrospective voice of someone who knows the outcome, which creates a narrative authority that asks the reader to trust the narrator's judgement even when the character's actions seem reckless.",
        "common_errors": [
          "Analysing characterisation without considering the role of narrative voice in shaping the reader's response",
          "Tracing character development without connecting it to the text's thematic concerns"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluates characterisation as an ideological strategy, analysing how the writer's construction of character encodes specific values and assumptions, how narrative voice positions the reader to accept or challenge those values, and how different critical perspectives produce different readings of the same character.",
        "example_task": "Evaluate how Stevenson constructs the character of Hyde in 'Dr Jekyll and Mr Hyde'. Consider how different readers might interpret the characterisation differently.",
        "example_response": "Stevenson's construction of Hyde is remarkable for its refusal of specificity: Hyde is consistently described as repulsive, but the nature of his repulsiveness is never precisely identified. Enfield says: 'He is not easy to describe. There is something wrong with his appearance; something displeasing, something downright detestable.' The triple construction escalates ('wrong', 'displeasing', 'detestable') but each term is vaguer than the last. This deliberate withholding is a characterisation strategy that forces the reader to project their own fears onto Hyde's blankness. A Victorian reader, steeped in physiognomic science, might have read Hyde's deformity as the physical expression of moral corruption -- the body betraying the soul. A post-Darwinian reader might recognise the 'ape-like' descriptions as encoding anxieties about evolutionary regression: Hyde is what humanity was before civilisation, and what it might become again. A modern reader might focus on the vocabulary of disgust and physical revulsion as revealing not Hyde's nature but Victorian society's reaction to difference -- the characterisation becomes a mirror of prejudice rather than a portrait of evil. A queer reading notes that Hyde's 'pleasures' are never named, that Jekyll's horror is as much about exposure as about immorality, and that the entire narrative is constructed by men who are terrified not of evil but of being seen: the characterisation of Hyde as unspeakable maps precisely onto the Victorian legal and social framework that classified certain identities and desires as crimes that could not be named in public. What makes Stevenson's characterisation so powerful is precisely its emptiness: Hyde is a vessel into which each generation pours its own anxieties, and the text's refusal to specify the nature of his evil guarantees its continued relevance. The character is less a person than a structural absence around which the other characters -- and the reader -- arrange their fears.",
        "common_errors": [
          "Offering a single interpretation of the characterisation without recognising that the text's deliberate ambiguity invites multiple readings",
          "Analysing characterisation only through what characters do and say, without considering what the text withholds and why"
        ]
      }
    ]
  },
  {
    "concept_id": "ELT-KS4-C007",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can identify basic dramatic elements in a modern play (e.g. stage directions, dialogue) but analyses the text as though it were prose rather than a script intended for performance.",
        "example_task": "Read this extract from 'An Inspector Calls'. What do the stage directions tell us about the character of Mr Birling?",
        "example_response": "The stage directions say that Mr Birling is 'heavy-looking, rather portentous'. This tells us he is big and important-looking. He is probably quite rich because the stage directions describe the dining room as having 'good solid furniture'.",
        "common_errors": [
          "Treating stage directions as factual description rather than as the playwright's instructions to actors and set designers",
          "Analysing dialogue without considering how it would be delivered on stage"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Analyses how the playwright uses specific dramatic techniques (stage directions, dramatic irony, entrances and exits, the relationship between dialogue and action) to create meaning for an audience.",
        "example_task": "Analyse how Priestley uses dramatic irony in Act 1 of 'An Inspector Calls'. Give two examples and explain their effect on the audience.",
        "example_response": "Priestley uses dramatic irony extensively in Act 1 to undermine Birling's authority before the Inspector even arrives. When Birling announces that 'the Germans don't want war' and that the Titanic is 'unsinkable -- absolutely unsinkable', the 1945 audience knows both predictions are catastrophically wrong: the First World War killed millions and the Titanic sank on its maiden voyage. This dramatic irony is devastating because it destroys Birling's credibility at the very moment he is asserting it. By the time the Inspector arrives, the audience already distrusts Birling's judgement -- so when he dismisses responsibility for Eva Smith, the audience is primed to side with the Inspector. Priestley also uses the timing of the Inspector's entrance as dramatic irony: he arrives immediately after Birling's speech about 'a man has to mind his own business', interrupting the philosophy of individualism with a literal embodiment of collective responsibility. The doorbell becomes a dramatic punctuation mark that answers Birling's speech before a word of rebuttal is spoken.",
        "common_errors": [
          "Identifying dramatic irony without explaining how it shapes the audience's relationship with the characters",
          "Describing the effect of stage directions without considering how different directorial choices might realise them"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses modern drama as a theatrical text, integrating understanding of stagecraft, dramatic structure, the playwright's use of space and time, and the relationship between text and performance to produce a sustained and coherent interpretation.",
        "example_task": "Analyse how Priestley uses the structure of 'An Inspector Calls' to develop his argument about collective responsibility. Consider the play as a whole.",
        "example_response": "Priestley structures 'An Inspector Calls' as a systematic demolition of bourgeois self-image, and the three-act structure serves this purpose with architectural precision. Act 1 establishes the family's self-congratulatory unity -- the engagement celebration, the comfortable dining room, Birling's expansive speeches -- and then introduces the Inspector, whose method is to address each family member in turn. This sequential interrogation is structurally important: each revelation makes the next harder to deny, because the cumulative effect of multiple connections to Eva Smith transforms coincidence into complicity. Priestley uses the well-made play structure (exposition, complication, crisis, resolution) but subverts its conventional resolution. In a traditional well-made play, the final act restores order: the guilty are punished, the innocent vindicated, the audience reassured. Priestley denies this resolution twice. First, the family discovers that there may be no Inspector and no death -- and the older generation (Birling, Mrs Birling) immediately revert to their original positions, treating the evening as 'nothing but a lot of moonshine'. This false resolution exposes the shallowness of their moral awakening: they are relieved, not reformed. The second subversion -- the telephone call announcing that a real inspector is on the way -- destroys the false resolution and reinstates the play's moral argument with even greater force. The circular structure (ending where it began) is a theatrical device that functions as a trap: the audience watches the Birlings repeat their failure, and the repetition implies that without genuine change, society will continue to produce Eva Smiths. Sheila's refusal to accept the false resolution -- 'You're pretending everything is just as it was' -- positions her as the play's moral centre, but Priestley makes clear that individual enlightenment is insufficient without collective transformation.",
        "common_errors": [
          "Analysing the play's themes without connecting them to its structural and dramatic choices",
          "Treating the Inspector as a realistic character rather than analysing his function as a dramatic and rhetorical device"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluates modern drama with critical sophistication, considering how the playwright's theatrical choices encode political and philosophical arguments, how different production choices affect interpretation, and how the text operates differently on stage and on the page.",
        "example_task": "Evaluate how effectively Priestley uses the form of the well-made play in 'An Inspector Calls' to deliver a political argument. Consider whether the theatrical form supports or limits the political message.",
        "example_response": "Priestley's choice of the well-made play form is both strategically brilliant and ideologically limited, and evaluating this tension is essential to understanding the play's lasting impact and its contradictions. The well-made play -- parlour setting, limited cast, unities of time and place, detective-plot structure -- is a bourgeois form: it was developed to entertain the very class Priestley critiques. By using this form to deliver a socialist argument, Priestley performs a kind of rhetorical Trojan horse: the audience expects entertainment and receives an indictment. The form's reliance on revelation and surprise -- each character's connection to Eva is uncovered in turn -- creates a propulsive momentum that makes the political argument feel like a thriller. The audience wants to know what happens next, and Priestley exploits this narrative desire to force them through a political education they did not sign up for. However, the form also contains the argument in ways that may limit it. The well-made play resolves in a single evening, in a single room, with a single family -- and this containment risks reducing systemic injustice to individual guilt. Eva Smith's death is presented as the consequence of specific decisions by specific people, which is dramatically satisfying but sociologically simplistic: exploitation is structural, not accidental, and the implication that it can be prevented by individual moral improvement is precisely the liberal position that Priestley's socialism should challenge. The 1992 Stephen Daldry production addressed this limitation by literalising what the text only implies: the house was placed on stilts above a crowd of working-class figures, and at the Inspector's exit, the house collapsed onto the stage, physically destroying the bourgeois space and suggesting that the Birlings' world is structurally unsustainable, not merely morally compromised. This production choice reveals what the text constrains: the political argument is present but can only fully emerge when the theatrical form is disrupted. The telephone call at the end -- the circular return -- is the text's most sophisticated formal device because it refuses both resolution and resignation. The play does not end in reform or in despair; it ends in repetition, which is Priestley's bleakest and most honest statement: history will repeat itself unless something changes, and the play itself is the argument for change.",
        "common_errors": [
          "Evaluating the political argument without evaluating whether the theatrical form supports or constrains it",
          "Discussing the play only as a text without considering how production choices can extend, limit or transform its meaning"
        ]
      }
    ]
  },
  {
    "concept_id": "ELT-KS4-C008",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can retell the plot of a modern novel and identify basic narrative features (e.g. 'it is told in the first person') but does not analyse how narrative technique shapes the reader's experience.",
        "example_task": "Who tells the story in your studied modern novel? How does this affect what the reader knows?",
        "example_response": "The story is told by George in 'Of Mice and Men'. Actually, it is told in the third person, but we mostly see things through George's perspective. The reader knows what George knows and sees.",
        "common_errors": [
          "Confusing the protagonist with the narrator",
          "Identifying the narrative perspective without explaining how it shapes what the reader sees and understands"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Analyses specific narrative techniques (point of view, non-linear structure, foreshadowing, use of dialogue) and explains how they shape the reader's understanding of character and theme.",
        "example_task": "Analyse how Steinbeck uses the narrative technique of foreshadowing in 'Of Mice and Men'. Give two examples and explain their effect.",
        "example_response": "Steinbeck foreshadows the tragic ending through two carefully placed earlier incidents. The first is Candy's dog: Carlson shoots the old, sick dog, arguing that 'he ain't no good to himself', and Candy later says 'I ought to of shot that dog myself. I shouldn't ought to of let no stranger shoot my dog.' This foreshadows the ending where George shoots Lennie rather than let strangers (the lynch mob) kill him, and Candy's regret about not acting himself directly parallels George's decision to act. The second is Lennie's killing of the mice and the puppy: the escalating pattern of accidental killing -- mice, then puppy, then Curley's wife -- makes the final death feel inevitable rather than random. Steinbeck uses this pattern to build a sense of tragic determinism: the reader understands before it happens that Lennie's uncontrollable strength will lead to a human death. Both examples of foreshadowing serve Steinbeck's naturalistic philosophy: in a harsh world, outcomes are determined by forces beyond individual control.",
        "common_errors": [
          "Identifying foreshadowing without explaining how it shapes the reader's emotional and interpretive experience",
          "Treating foreshadowing as a hidden clue rather than a deliberate narrative strategy that creates dramatic irony and tragic inevitability"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses how modern fiction uses narrative technique as a meaning-making tool, connecting choices about perspective, structure, time and voice to the text's thematic concerns and the reader's interpretive position.",
        "example_task": "Analyse how the narrative structure of your studied modern text reflects its thematic concerns. Consider how the writer's choices about time, perspective and revelation shape the reader's understanding.",
        "example_response": "Steinbeck's narrative technique in 'Of Mice and Men' is cinematic -- a term critics have used since its publication, and one that illuminates both the novel's form and its ideology. The third-person objective narration rarely enters characters' thoughts: we see what a camera would see, hear what a microphone would record. When Lennie speaks, we hear his words but must infer his mental state from action and dialogue, not from interior narration. This technique is not a limitation but a philosophical position: Steinbeck withholds interiority because the characters themselves have limited access to their own motivations. George repeats the dream speech mechanically, as a rehearsed narrative rather than a genuine plan; Curley's wife performs flirtation as the only social script available to her. The objective narration mirrors the characters' condition: they are observed from outside because they live from outside, performing roles that the economic and social structure has assigned them. The condensed timeframe -- three days, six scenes, each set in a single location -- creates a theatrical unity that reinforces the sense of inevitability. Nothing is digressive or accidental in the narrative structure: every scene advances the trajectory towards the ending, and the circular structure (beginning and ending at the pool) suggests that the dream of land and independence was always an illusion, a story characters tell themselves to survive. Steinbeck's most sophisticated narrative choice is the absence of moral commentary. The narrator does not judge Curley, does not pity Crooks, does not condemn George. This restraint is itself an ideological position: in a naturalistic worldview, moral judgement is irrelevant because characters are products of forces they cannot control. The reader must supply the moral response that the narrator withholds, which makes the act of reading itself an ethical exercise.",
        "common_errors": [
          "Describing narrative technique without connecting it to the text's philosophical or ideological commitments",
          "Analysing the narrative voice without considering how the withholding of information positions the reader"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluates how modern fiction's narrative techniques encode specific philosophical, political or aesthetic positions, considers how different critical approaches produce different readings of the same narrative strategy, and analyses the relationship between form and ideology with precision.",
        "example_task": "Evaluate how the narrative technique of your studied modern text shapes the reader's moral and political response. Consider whether the technique constrains or enables the reader's interpretive freedom.",
        "example_response": "The narrative technique of 'Of Mice and Men' creates a paradox of objectivity and manipulation that rewards critical scrutiny. Steinbeck's third-person objective narration appears to offer the reader freedom -- there is no authorial voice telling us what to think, no narrator guiding our sympathies. But this apparent neutrality is itself a carefully constructed position that shapes response as powerfully as any first-person confession. By withholding interiority, Steinbeck forces the reader to interpret behaviour rather than being told what to feel. When Crooks says to Lennie, 'A guy needs somebody -- to be near him. A guy goes nuts if he ain't got nobody', the reader must decide whether this is self-pity, wisdom, manipulation, or all three. The text provides no guidance, and this interpretive burden is what makes the reading experience morally demanding rather than morally comfortable. However, the objectivity is strategic rather than absolute. Steinbeck controls sympathy through selection: we see Lennie stroking the dead puppy with 'desperate softness', and the juxtaposition of 'desperate' and 'softness' positions the reader to feel simultaneously disturbed and sympathetic. We do not see Curley's wife's perspective until the scene in the barn, and the delayed revelation of her loneliness and thwarted ambitions ('I coulda been in the movies') is a structural choice that retrospectively complicates the reader's earlier judgements of her as a 'tart'. The timing of this revelation -- immediately before her death -- is manipulative in the most precise sense: Steinbeck ensures that the reader recognises her humanity at exactly the moment it is about to be destroyed, maximising the emotional impact. A Marxist reading might argue that Steinbeck's naturalistic objectivity serves a political purpose: by presenting the ranch workers' lives without sentimentality or intervention, Steinbeck implies that their suffering is produced by economic structures rather than individual failings, and that individual moral improvement (the liberal solution) is insufficient. A feminist reading might challenge the same technique, arguing that the objective narration's refusal to enter Curley's wife's consciousness until the final scene reflects and reinforces the marginalisation it appears merely to document -- she is an object of the male gaze not only within the story but within the narrative technique itself. Both readings are enabled by the form and both are legitimate: the narrative technique's power lies precisely in its capacity to support contradictory interpretations, which is why the text continues to generate critical debate nearly a century after its publication.",
        "common_errors": [
          "Treating narrative objectivity as genuine neutrality rather than recognising it as a carefully constructed rhetorical position",
          "Evaluating the narrative technique's effect on 'the reader' in the singular, without considering how different readers or critical frameworks produce different responses"
        ]
      }
    ]
  },
  {
    "concept_id": "ELT-KS4-C009",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can identify basic features of a poem's form (e.g. counts stanzas, spots rhyme) but does not explain how formal choices create meaning or affect the reader's experience.",
        "example_task": "Look at this poem. How many stanzas does it have? Does it rhyme? What do you notice about the line lengths?",
        "example_response": "The poem has four stanzas of four lines each. It rhymes ABAB. The lines are roughly the same length. It looks quite regular and organised.",
        "common_errors": [
          "Describing formal features ('the poem has four stanzas') without explaining why those features matter",
          "Treating form as a checklist to identify rather than a set of choices that create effects"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explains how specific formal features (rhyme scheme, stanza form, enjambment, caesura) create effects, though analysis tends to focus on one feature at a time rather than considering how multiple formal elements interact.",
        "example_task": "Analyse how the poet uses enjambment in this poem. Give two examples and explain the effect.",
        "example_response": "In stanza two, the poet uses enjambment across lines 5-6: 'She could not stop the slow / unravelling of everything she knew'. The line break after 'slow' forces the reader to pause, creating a moment of suspense before the next line reveals what is 'slow'. The enjambment also physically enacts the 'unravelling': the sentence spills across the line boundary just as the character's certainty spills beyond her control. In stanza four, the enjambment across 'and the sky / was the colour of nothing' delays the unexpected image, making 'the colour of nothing' land with greater impact because the reader expects a conventional colour after 'the sky was'.",
        "common_errors": [
          "Describing enjambment as simply 'flowing' or 'continuous' without explaining the specific effect of the specific line break",
          "Identifying enjambment without considering what alternative (end-stopping the line) would change about the reading experience"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses how form, structure, metre and rhyme work together to create meaning, explaining how the poet's formal choices reinforce, complicate or contradict the poem's content.",
        "example_task": "Analyse how the poet uses form and structure to reinforce the poem's themes. Consider how multiple formal elements work together.",
        "example_response": "The poem's formal structure enacts a tension between control and chaos that mirrors its thematic concern with grief. The regular stanza form -- four quatrains with a consistent ABAB rhyme scheme -- creates an appearance of order, as though the speaker is imposing structure on an experience that resists it. But the regularity is undermined from within: the iambic metre, established in stanza one ('The morning came with nothing left to say'), is disrupted in stanza three by a spondee in the opening foot -- 'Dark. Still.' -- two stressed syllables that break the rhythmic contract and force the reader to slow down at the poem's emotional centre. The rhyme scheme also participates in this tension: stanzas one and two maintain full rhymes ('say/day', 'ground/sound'), but by stanza three, the rhymes have become half-rhymes ('gone/rain', 'there/air'), as though the formal structure is deteriorating under the pressure of what the speaker is trying to contain. The final stanza returns to full rhyme, but the effect is not resolution -- it is performance, the speaker reassembling the appearance of composure that stanza three exposed as fragile. Form and content are thus in productive dialogue: the regular form represents the speaker's attempt to contain grief, and the disruptions within the form represent the moments when grief exceeds that containment. The poem is about what it means to keep going when the structure you have built your life around has failed -- and the form dramatises this by building a structure that almost, but not quite, holds.",
        "common_errors": [
          "Analysing formal features separately without showing how they interact to create a unified effect",
          "Describing how form 'reflects' content without explaining the specific mechanism by which formal choices create meaning"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Analyses poetic form with the precision of a practitioner, evaluating how the poet's choices of metre, rhyme, stanza form and lineation create meaning at every level, and demonstrating understanding of how form can contradict, complicate or extend the poem's stated content.",
        "example_task": "Choose a poem from your anthology and analyse how the poet's formal choices create meaning that could not be achieved through prose. Your analysis should demonstrate precise understanding of how form and content interact.",
        "example_response": "Wilfred Owen's 'Exposure' uses half-rhyme and rhythmic disruption to create a formal experience of the psychological condition it describes: the slow, grinding attrition of waiting in the trenches. The half-rhymes ('silent/salient', 'snow-dazed/sun-dozed', 'knive us/nervous') create an expectation of resolution that is never fulfilled -- the ear waits for a full rhyme that never arrives, producing a low-level acoustic frustration that mirrors the soldiers' experience of waiting for an attack that never comes. If Owen had used full rhyme, the poem would feel complete, resolved, contained -- qualities that are the opposite of the experience it describes. Half-rhyme is therefore not a decorative choice but a structural argument: the form insists that this experience resists the consolation of artistic wholeness. The metre is equally purposeful. The long lines -- predominantly hexameter rather than the expected pentameter -- create a dragging rhythm that slows the reading pace below the natural speed of English speech. The extra metrical foot per line forces the reader to spend longer in each line than feels comfortable, enacting the temporal distortion of the trenches where 'nothing happens' and time itself becomes a weapon. The refrain 'But nothing happens' is the poem's most formally significant line: it occupies the final position in each stanza, where a reader expects climax or resolution, and it delivers neither. Its repetition across five of the poem's eight stanzas transforms a statement of fact into a formal principle: the poem will not give the reader what they want, just as the war does not give the soldiers what they expect. The stanza that omits the refrain (stanza 6, ending 'Is it that we are dying?') is devastating precisely because the absence of the familiar line creates a formal gap -- the structure itself seems to be failing, which mirrors the soldiers' loss of certainty about whether they are alive or dead. Owen's form is not a container for content; it is content. The poem could not be paraphrased into prose without losing its meaning, because a significant part of its meaning exists only in the formal experience of reading it.",
        "common_errors": [
          "Analysing form as a separate layer that 'supports' content rather than as an integral part of meaning that cannot be separated from content",
          "Discussing metre and rhyme scheme in general terms without demonstrating precise knowledge of how specific formal disruptions create specific effects at specific moments"
        ]
      }
    ]
  },
  {
    "concept_id": "ELT-KS4-C010",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Assumes the poet and the speaker are the same person, referring to 'the poet feels...' and treating the poem as a direct expression of personal emotion.",
        "example_task": "Who is speaking in this poem? How can you tell what their attitude is?",
        "example_response": "The poet is speaking. They feel sad because they say 'I watched the last light go'. The poet is describing their own experience of watching a sunset and feeling lonely.",
        "common_errors": [
          "Writing 'the poet feels...' or 'the poet thinks...' rather than 'the speaker conveys...' or 'the persona suggests...'",
          "Assuming the poem is autobiographical without evidence"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Distinguishes between the poet and the speaker, identifies the speaker's attitude or tone, and begins to analyse how the poet constructs the voice through pronoun choice, register and diction.",
        "example_task": "Analyse the speaker's voice in this poem. How does the poet create a specific persona through language choices?",
        "example_response": "The speaker in this poem is not necessarily the poet -- the use of 'I' creates a persona rather than a direct autobiography. The speaker's tone is bitter and disillusioned: phrases like 'they promised us' and 'what we were given instead' create a sense of betrayal. The use of 'we' in the first stanza shifts to 'I' in the final stanza, suggesting the speaker moves from collective grievance to individual isolation. The colloquial register ('it was a load of nothing') contrasts with the more formal opening, suggesting that the speaker's composure is breaking down as the poem progresses.",
        "common_errors": [
          "Identifying the speaker's tone as a single quality throughout the poem without tracking shifts",
          "Distinguishing between poet and speaker in theory but reverting to 'the poet feels' in practice"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses how the poet constructs a complex or shifting voice through pronoun choice, register, tone, implied audience and the relationship between what the speaker says and what the poem reveals, including in dramatic monologues where the speaker may be unreliable.",
        "example_task": "Analyse the speaker's voice in 'My Last Duchess' by Robert Browning. How does Browning create dramatic irony through the dramatic monologue form?",
        "example_response": "Browning constructs the Duke of Ferrara as a speaker who reveals far more than he intends, and this gap between what the Duke thinks he is communicating and what the reader understands is the poem's primary source of meaning. The Duke believes he is demonstrating his sophistication and authority: he discusses art, commands attention ('Will't please you sit'), and controls the conversation. But Browning's use of the dramatic monologue form allows the reader to hear what the Duke cannot: his own monstrousness. When the Duke says of his previous wife that 'she liked whate'er / She looked on, and her looks went everywhere', he intends to criticise her for indiscriminate pleasure -- but the reader hears a woman who found joy in the world being punished for it by a man who wanted to be her only source of happiness. The phrase 'I gave commands; / Then all smiles stopped together' is the poem's most chilling moment because of what it does not say: the Duke reveals that he had his wife killed without using the word 'kill', and the euphemistic restraint ('gave commands') is more disturbing than explicit violence would be. The implied audience -- the marriage envoy -- creates a secondary irony: the Duke is negotiating for his next wife while revealing what happened to the last one, apparently unaware that his confession might give the envoy pause. Browning thus uses the dramatic monologue to create a speaker who is simultaneously articulate and oblivious, powerful and morally repulsive, and the reader's discomfort comes from being positioned as the silent listener who understands what the speaker cannot -- or will not -- see about himself.",
        "common_errors": [
          "Analysing the dramatic monologue as though the speaker is transparent and reliable",
          "Identifying the dramatic irony without explaining the specific mechanism through which Browning creates the gap between the speaker's intention and the reader's understanding"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluates how poetic voice functions as a complex rhetorical and ideological construction, analysing how the relationship between poet, speaker and reader produces specific political, ethical or aesthetic effects, and considering how different poems construct voice in fundamentally different ways.",
        "example_task": "Compare how two poems from your anthology construct different kinds of poetic voice. Evaluate how the difference in voice produces different effects on the reader.",
        "example_response": "Browning's 'My Last Duchess' and Shelley's 'Ozymandias' both use speakers whose voices are mediated through framing devices, but they construct voice in fundamentally different ways that produce contrasting relationships between reader and poem. Browning's Duke speaks directly to an implied listener (the envoy), and the reader overhears. This eavesdropping position is essential to the poem's effect: dramatic irony depends on the reader understanding more than the speaker intends, and the Duke's confidence that his listener shares his values ('Even had you skill / In speech -- which I have not') is misplaced precisely because the poem has a second audience (the reader) who does not share those values. The voice is therefore double: the Duke hears himself being impressive; we hear him being terrifying. The gap between these two hearings is where the poem's moral meaning resides. Shelley's 'Ozymandias' constructs voice through a triple framing: the poet tells us what a traveller told him about what a sculptor depicted about what a king commanded. This chain of mediation means that Ozymandias's voice -- 'Look on my Works, ye Mighty, and despair!' -- reaches us already ironised by its context: the 'Works' are ruins, the 'Mighty' audience has vanished, and the 'despair' the inscription intended (despair at my greatness) has been replaced by the despair the poem creates (despair at the futility of human ambition). Voice in 'Ozymandias' is therefore not a window into character (as in Browning) but a demonstration of temporal irony: every assertion of permanence is undermined by the passage of time. The two poems produce different reader positions. Browning's reader is morally engaged -- we judge the Duke, feel implicated in his performance, perhaps recognise aspects of his controlling personality in ourselves or others. Shelley's reader is philosophically contemplative -- we are invited not to judge Ozymandias but to recognise the universal vanity of power, including, by implication, our own. Voice in Browning is a revelation of character; voice in Shelley is a revelation of time. Both are constructed, both are mediated, but they construct different kinds of knowledge and produce different kinds of reading experience.",
        "common_errors": [
          "Comparing the content of the voices (what the speakers say) without comparing the formal strategies through which voice is constructed",
          "Treating poetic voice as a transparent window into a speaker's psychology rather than as a rhetorical construction shaped by the poet's choices of form, framing and diction"
        ]
      }
    ]
  },
  {
    "concept_id": "ELT-KS4-C011",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can spot figurative language in a poem (e.g. 'the poet uses a simile') but tends to name techniques without exploring their specific effect or the layers of meaning they create.",
        "example_task": "Find one example of figurative language in this poem and explain what it means.",
        "example_response": "The poet uses a simile: 'the river moved like a slow grey snake'. This compares the river to a snake, which makes it sound dangerous and alive.",
        "common_errors": [
          "Identifying the comparison ('river = snake') without exploring the connotations activated by the specific image",
          "Offering a single interpretation ('it sounds dangerous') without considering other possible associations"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Analyses figurative language with some precision, exploring connotations and explaining how specific images create specific effects, though analysis tends to cover several images briefly rather than one or two in depth.",
        "example_task": "Analyse how the poet uses imagery in this poem to present the idea of memory. Refer to at least two specific images.",
        "example_response": "The poet presents memory as something physical and unreliable. The metaphor 'memory is a house with rooms I cannot enter' creates a spatial image where the past is organised but inaccessible -- the 'rooms' suggest distinct, contained experiences, but the inability to 'enter' them implies that memories are locked away, perhaps deliberately. The later image, 'what I remember has the colour of old photographs -- not true, just warm', complicates this further: photographs seem to preserve the past faithfully, but 'not true, just warm' suggests that memory does not record reality but filters it through nostalgia. The word 'warm' is particularly effective because it is simultaneously comforting and deceptive: warmth feels good but it is not the same as accuracy.",
        "common_errors": [
          "Analysing multiple images at surface level rather than selecting one or two for deep exploration",
          "Discussing what an image 'means' without exploring its connotations, associations and the semantic field it activates"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses poetic imagery with precision and depth, selecting specific images for sustained close reading, exploring multiple layers of meaning, and tracing image patterns across the poem to show how they develop the poem's themes.",
        "example_task": "Choose one image from this poem and analyse it in detail. Explore its literal meaning, its connotations, the semantic field it activates, and how it connects to the poem's wider concerns.",
        "example_response": "The poem's central image -- 'I carried the silence of the house in my chest, a stone I could not put down' -- operates on four interconnected levels. Literally, the speaker describes an oppressive quietness associated with a childhood home that has become an internalised weight. The metaphor of 'silence' as something you can 'carry' transforms absence (no sound) into presence (a physical burden), which captures the paradox of emotional repression: what is not said weighs more than what is. The 'stone' extends the metaphor into the specific: stones are cold, hard, natural objects that resist human will -- you cannot reshape them, dissolve them or ignore them. The phrase 'could not put down' is ambiguous: does 'could not' mean 'was unable to' (the silence is too heavy to release) or 'would not' (the speaker chooses to carry it)? This ambiguity is central to the poem's exploration of inherited silence: is the speaker imprisoned by family reticence or complicit in perpetuating it? The semantic field of geology ('stone', 'carried', 'weight') runs throughout the poem, and by the final stanza, the silence has become 'a seam of quartz running through everything I build' -- geological imagery suggesting that the inherited silence is not just a burden but a structural element, embedded in the speaker's foundations. The word 'seam' is brilliantly double: it refers to a stratum of mineral (something natural and permanent) and to a line of stitching (something constructed and potentially undoable). The poem's imagery thus enacts the question it asks: is this silence nature or nurture, geology or needlework?",
        "common_errors": [
          "Analysing the image in isolation without connecting it to the poem's wider pattern of imagery and thematic development",
          "Offering a single reading of an ambiguous image rather than exploring how the ambiguity itself creates meaning"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Produces imagery analysis of exceptional precision and originality, demonstrating the ability to read poetic images at multiple levels simultaneously, to trace how images interact across a poem, and to evaluate how the poet's choice of imagery encodes specific philosophical or emotional positions.",
        "example_task": "Analyse how a poet in your anthology uses a sustained pattern of imagery to develop a complex argument or emotional trajectory across the whole poem.",
        "example_response": "In Ted Hughes's 'Bayonet Charge', the imagery undergoes a systematic transformation from the mechanical to the animal to the abstract, charting the soldier's psychological disintegration under fire. The opening images are kinetic and almost cinematic: 'suddenly he awoke and was running -- raw / In raw-seamed hot khaki'. 'Raw' functions simultaneously as physical sensation (chafing fabric), emotional state (exposed, unprotected) and temporal condition (newly arrived, unprepared). The repetition of 'raw' in 'raw-seamed' binds the soldier's body to his uniform to his experience, dissolving the boundary between person and equipment -- he is as much material as human. As the charge continues, the imagery shifts from mechanical to natural: 'the patriotic tear that had brimmed in his eye / Sweating like molten iron from the centre of his chest'. The simile is extraordinary because it transforms an emotion (patriotic feeling) into a physical substance (molten iron) located in the wrong place (the chest, not the eye): the abstraction of patriotism is literalised, heated, and relocated to the body's centre, where it becomes not inspiration but agony. The imagery insists that ideology is experienced physically, not intellectually, and that the experience bears no resemblance to the rhetoric. The final image of 'a yellow hare that rolled like a flame / And crawled in a threshing circle' introduces an animal whose suffering is both irrelevant to the battle and central to the poem's argument. The hare's 'threshing circle' -- a phrase that combines agricultural violence (threshing) with geometric futility (circle) -- mirrors the soldier's own trajectory: purposeful momentum reduced to purposeless pain. The hare cannot be read as allegory (it is too specific, too physical) but it cannot be read as mere detail either (its placement is too deliberate). It functions as what Hughes elsewhere called 'the thought-fox': a concrete image that carries a meaning the poem cannot state directly -- that the suffering of war is as arbitrary and meaningless as the suffering of a hare caught in a field, and that recognising this equivalence dismantles every abstraction ('King, honour, human dignity, etcetera') the soldier was given to justify his presence. The final word of the poem -- 'etcetera' -- is the most devastating image of all, though it is not an image at all: it reduces the entire vocabulary of ideological justification to a dismissive Latin abbreviation, performing in a single word the disenchantment that the poem's imagery has been charting across thirty-nine lines.",
        "common_errors": [
          "Producing a comprehensive survey of images without building a sustained argument about how the imagery develops across the poem",
          "Analysing imagery only in terms of what it represents rather than considering how the physical texture of the image (its sound, rhythm, and sensory quality) contributes to its meaning"
        ]
      }
    ]
  },
  {
    "concept_id": "ELT-KS4-C012",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can identify what two poems are about and notes basic similarities or differences in topic, but discusses each poem separately rather than making genuine comparisons.",
        "example_task": "Compare how two poems from your anthology present the theme of power. Write about both poems.",
        "example_response": "The first poem is about a powerful ruler. The poet describes his statue in the desert. The second poem is about a soldier in a war. The poet describes what it is like to charge at the enemy. Both poems are about power but they are quite different.",
        "common_errors": [
          "Writing about each poem in turn without making direct comparisons",
          "Comparing only the topic ('both are about power') without comparing the methods the poets use"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Makes direct comparisons using comparative connectives, addressing both thematic similarities/differences and some aspects of each poet's method, though analysis of method may be uneven.",
        "example_task": "Compare how 'Ozymandias' and 'My Last Duchess' present the theme of power and control. You should compare both what the poets say and how they say it.",
        "example_response": "Both 'Ozymandias' and 'My Last Duchess' present powerful men whose desire for control is ultimately undermined. Shelley's Ozymandias commanded that his statue proclaim 'Look on my Works, ye Mighty, and despair!' but the irony is that his 'works' have crumbled to 'lone and level sands'. Similarly, Browning's Duke attempts to control his wife even after her death, displaying her portrait behind a curtain that 'none puts by' without his permission. Both men seek to control how they are perceived, but both fail: Ozymandias's reputation is destroyed by time, while the Duke's self-presentation is destroyed by his own words (the reader sees his cruelty, not his refinement). However, the poets' methods differ significantly. Shelley uses a framing narrative to distance the reader from Ozymandias, creating a philosophical meditation on the impermanence of power. Browning uses the dramatic monologue to bring the reader uncomfortably close to the Duke, creating psychological drama rather than philosophical argument.",
        "common_errors": [
          "Comparing themes effectively but analysing methods only superficially",
          "Producing an unbalanced comparison that discusses one poem in much more detail than the other"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Produces a genuinely integrated comparison that analyses themes, perspectives and methods simultaneously, using precisely selected evidence from both poems to support comparative points and demonstrating how differences in method produce differences in effect.",
        "example_task": "Compare how two poems from your anthology explore the effects of conflict. You should compare the poets' ideas, perspectives and methods.",
        "example_response": "Both 'Exposure' by Wilfred Owen and 'Bayonet Charge' by Ted Hughes present conflict as psychologically devastating, but they explore this devastation through fundamentally different temporal strategies that produce different effects on the reader. Owen writes from within the experience: the present tense ('Our brains ache', 'We only know war lasts') creates an unbroken immersion in the soldiers' moment-by-moment suffering. The repetition of 'But nothing happens' across multiple stanzas enacts the monotony of waiting, and the half-rhymes ('silent/salient', 'wire/war') create an aural discomfort that mirrors the soldiers' psychological state. Hughes, by contrast, writes about a single charged moment: the poem covers the few seconds of a bayonet charge, and its compressed timeframe ('Suddenly he awoke and was running') creates urgency rather than monotony. Where Owen's soldiers are frozen in place, Hughes's soldier is in violent motion -- the contrast in physical experience produces a contrast in poetic method. Owen's perspective is collective ('we', 'our') while Hughes uses a distanced third person ('he'), which creates different reader positions: Owen's 'we' includes the reader in the suffering, while Hughes's 'he' observes it from outside, creating clinical precision rather than empathetic immersion. Both poets use the natural world as a counterpoint to human conflict, but with opposite effects. In Owen, nature is the enemy: 'the merciless iced east winds that knive us'. The personification transforms weather into a weapon, suggesting that the universe itself has turned against the soldiers. In Hughes, the natural world provides the poem's most compassionate image: the 'yellow hare that rolled like a flame', whose suffering is as arbitrary and bewildering as the soldier's. Owen's nature attacks; Hughes's nature mirrors. The cumulative effect is that Owen's poem produces despair (suffering is inescapable, even nature conspires) while Hughes's produces disenchantment (the hare's purposeless pain exposes the soldier's equally purposeless obedience). Both are anti-war poems, but they arrive at their critique through different emotional and formal routes.",
        "common_errors": [
          "Comparing methods in general terms ('both poets use imagery') rather than analysing how specific methods produce specific effects that differ between the poems",
          "Discussing the poems' themes as though they are identical and only the methods differ, without recognising that different methods produce different thematic emphases"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Produces a sophisticated and critically original comparison that identifies unexpected or nuanced points of connection, evaluates how the poets' formal and rhetorical strategies produce different effects on the reader, and develops a sustained comparative argument rather than a series of parallel observations.",
        "example_task": "Compare two poems from your anthology that you believe illuminate each other in unexpected ways. Develop a sustained comparative argument about how the poems' methods create different kinds of meaning.",
        "example_response": "Comparing Browning's 'My Last Duchess' with Owen's 'Exposure' might seem perverse -- one is a Victorian dramatic monologue about a Renaissance art collector, the other a First World War lyric about trench warfare -- but both poems are fundamentally concerned with how language conceals violence, and placing them side by side reveals each poem's strategies more clearly. Browning's Duke uses language to aestheticise murder: 'I gave commands; then all smiles stopped together' converts killing into grammar -- the passive construction ('commands' given to unnamed agents) and the euphemistic metaphor ('smiles stopped') remove the physical reality of death from the sentence, just as the Duke removes it from his conscience. Language here is a tool of power: by controlling the narrative, the Duke controls the meaning of his wife's death. Owen's soldiers, by contrast, have no language adequate to their experience. The half-rhymes ('knive us/nervous', 'wire/war') are a formal enactment of linguistic failure -- the words almost rhyme but cannot quite connect, just as the soldiers' language almost describes their experience but cannot quite reach it. The refrain 'But nothing happens' is the poem's most devastating admission: the experience is not inexpressible because it is too much but because it is too nothing, too empty of the meaning that language normally carries. Browning's Duke has too much language -- he can narrate murder as connoisseurship. Owen's soldiers have too little -- they cannot narrate suffering at all. Both poems thus expose the relationship between language and power from opposite directions: the Duke's eloquence is a weapon, the soldiers' inarticulacy is a wound. The formal consequences are revealing. Browning's poem is a single unbroken verse paragraph -- a monologue that allows no interruption, no alternative perspective, no silence. This formal totalitarianism mirrors the Duke's personality: he permits no voice but his own. Owen's poem is broken into stanzas separated by the refrain, and the gaps between stanzas are as meaningful as the words: they are the spaces where language fails, where the wind blows through, where the experience exists beyond the reach of the poem. If Browning demonstrates what language can do when wielded by power, Owen demonstrates what it cannot do when confronted by suffering. Reading them together does not diminish either poem but reveals a shared concern -- the adequacy and inadequacy of human speech -- that neither poem, read alone, makes fully visible.",
        "common_errors": [
          "Choosing poems that are obviously similar (both about war, both about love) rather than demonstrating the critical sophistication to find illuminating connections between apparently dissimilar texts",
          "Producing a technically accomplished comparison that lacks a unifying argument -- the best comparative essays are not just 'about two poems' but 'about an idea that two poems together make visible'"
        ]
      }
    ]
  },
  {
    "concept_id": "ELT-KS4-C013",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Finds unseen poems intimidating and tends to either summarise the poem's content or list spotted techniques without developing an interpretation.",
        "example_task": "Read this unseen poem. What is it about? How does the poet present their ideas?",
        "example_response": "The poem is about a tree. The poet describes the tree in different seasons. They use personification ('the tree reached out') and alliteration ('branches bending'). The poem seems to be saying that nature is important.",
        "common_errors": [
          "Summarising the poem's content without analysing how it creates meaning",
          "Listing techniques without connecting them to the poem's ideas or the reader's experience"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Approaches an unseen poem with a systematic method, establishes the poem's overall meaning, and analyses specific language choices with some precision, though the response may not be fully sustained.",
        "example_task": "Read this unseen poem carefully. Analyse how the poet presents the experience of waiting. Support your answer with evidence from the poem.",
        "example_response": "The poet presents waiting as both unbearable and strangely addictive. The opening line -- 'I have worn a groove in the hallway floor' -- uses hyperbole to suggest that waiting has become a physical habit, and the metaphor of a 'groove' implies that repetition has literally shaped the speaker's environment. The shift from 'I waited' in stanza one to 'I wait' in stanza three changes tense from past to present, which removes the safety of retrospection: the speaker is not remembering waiting but doing it now, which draws the reader into the immediate experience. The final image of the telephone as 'a small black altar' is effective because it transforms a mundane object into something sacred, suggesting that the speaker has invested the act of waiting with almost religious significance.",
        "common_errors": [
          "Establishing an overall interpretation but not sustaining it through the analysis of specific details",
          "Analysing individual features without connecting them to the poem's overall argument or emotional trajectory"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Produces a sustained and coherent analytical response to an unseen poem, establishing an interpretation and supporting it through detailed analysis of language, form and structure, demonstrating the ability to apply transferable analytical skills independently.",
        "example_task": "Read this unseen poem. Analyse how the poet uses language, form and structure to present the experience of homecoming.",
        "example_response": "The poet presents homecoming not as arrival but as recognition -- the slow, layered process of a place becoming familiar again after absence. The poem's structure enacts this process: the opening stanza describes the house from outside ('the same green door, the same cracked step'), the middle stanzas move inside ('the kitchen smelled of something I could almost name'), and the final stanza reaches the garden ('the apple tree had grown around the swing'). This spatial progression -- outside to inside to the most personal space -- mirrors the emotional progression from observation to memory to belonging. The language shifts correspondingly: the opening stanza uses the definite article ('the door', 'the step') to suggest recognition of specific, known objects, but the adjective 'same' carries an ambiguity -- does 'same' mean reassuringly unchanged or disturbingly frozen? The middle stanza introduces the senses of smell and sound ('a radio playing something half-remembered'), and the adverb 'almost' in 'almost name' captures the experience of recognition that falls just short of certainty. The most powerful formal choice is the final couplet, which breaks from the poem's loose tercets: 'The tree had grown around the swing. / I had not noticed I was still inside the house.' The shift to a two-line stanza creates a structural surprise, and the revelation that the speaker is 'still inside the house' -- that the garden was imagined, not visited -- reframes the entire poem. What the reader took as a physical journey was a mental one: the speaker has not yet crossed the threshold. The form's final disruption (couplet after tercets) mirrors the content's final disruption (imagination revealed as imagination), and both leave the reader with the question: is the speaker unable or unwilling to go further? Homecoming, the poem suggests, is not a physical act but a negotiation between the person you were and the person you have become, and the threshold between them may be harder to cross than any distance.",
        "common_errors": [
          "Producing a competent analysis that treats the poem as static rather than tracing how its meaning develops across its structure",
          "Not engaging with the poem's form -- line breaks, stanza breaks, rhyme or absence of rhyme -- as meaning-making elements"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Approaches an unseen poem with critical confidence, producing an original and sustained interpretation that engages with the poem's complexities and ambiguities, demonstrates precise analysis of form and language, and evaluates how the poem creates effects that resist simple paraphrase.",
        "example_task": "Read this unseen poem. Produce a detailed critical response that analyses how the poet creates meaning through language, form and structure. You should engage with the poem's complexities and ambiguities.",
        "example_response": "The poem resists the reader's desire for a stable interpretation, and this resistance is itself the poem's subject. The title -- 'Instructions' -- promises clarity: instructions tell you what to do. But the poem delivers the opposite: a series of contradictions ('Remember everything. Forget what you can.'), impossible commands ('Hold the light steady while you look away'), and conditional statements that cancel themselves ('If you find the door, do not open it. / If you do not find the door, you were not looking'). The form participates in this contradiction: the poem is arranged in regular quatrains with a consistent ABAB rhyme scheme, creating an appearance of order that the content systematically undermines. The rhymes themselves are deceptive: 'door/floor' is a full rhyme that creates closure, but the meaning of the couplet ('If you find the door, do not open it') refuses closure. The form promises resolution; the content denies it. The speaker's identity is deliberately unstable. The imperative mood ('Remember', 'Hold', 'Find') suggests authority, but the contradictions undermine that authority: this is either a speaker who knows something the reader does not, or a speaker who knows nothing and is performing knowledge. The poem does not resolve this ambiguity, and the reader must choose: is this wisdom or nonsense? The answer, I think, is that the poem dramatises the experience of receiving advice that is simultaneously true and useless -- the kind of guidance that only makes sense in retrospect, when you no longer need it. The final line -- 'These are the instructions. There are no instructions.' -- collapses the poem's entire premise in a single paradox, and the full stop after 'instructions' (the only end-stopped line in the poem) creates a finality that the content contradicts. The poem's achievement is to make the reader feel the frustration of being told how to live by someone who admits they cannot tell you how to live -- and to recognise, uncomfortably, that this is the condition of all instruction, all poetry, all language that attempts to transmit experience from one consciousness to another.",
        "common_errors": [
          "Resolving the poem's ambiguities into a single interpretation rather than holding multiple readings in productive tension",
          "Producing an intellectually confident response that is not sufficiently grounded in the specific language and form of the poem"
        ]
      }
    ]
  },
  {
    "concept_id": "ELT-KS4-C014",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knows the plot of the studied text and can recall a few key quotations, but quotations tend to be from the opening or the most famous scenes, and the student struggles to connect quotations to analytical points.",
        "example_task": "Write a paragraph about the theme of ambition in 'Macbeth'. Include at least one quotation from memory.",
        "example_response": "Ambition is an important theme in Macbeth. Macbeth says 'Is this a dagger which I see before me?' which shows that he is thinking about killing Duncan. Lady Macbeth is also ambitious because she wants Macbeth to be king.",
        "common_errors": [
          "Using a quotation that is famous but not well-suited to the specific point being made",
          "Including a quotation but not analysing its language -- the quotation sits in the response without doing analytical work"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Can recall quotations from across the text (not just the opening or the most famous scenes) and uses them to support analytical points, though quotations may be long and imprecisely selected.",
        "example_task": "Write a paragraph about how Shakespeare presents guilt in 'Macbeth'. Use quotations from at least two different points in the play.",
        "example_response": "Shakespeare presents guilt as a force that destroys the mind. After the murder, Macbeth asks 'Will all great Neptune's ocean wash this blood clean from my hand?' -- the hyperbole of the entire ocean suggests that Macbeth believes his guilt is infinite and permanent. Later, Lady Macbeth's sleepwalking scene shows that guilt has penetrated her unconscious mind: 'Out, damned spot! Out, I say!' The imperative verbs reveal her desperate attempt to remove the guilt, but the fact that she is asleep and repeating the gesture suggests she has been reliving this moment for a long time. The shift from Macbeth's guilt (expressed in eloquent poetry) to Lady Macbeth's guilt (expressed in fragmented prose) shows that guilt has degraded her language, as though the weight of conscience has destroyed her ability to think coherently.",
        "common_errors": [
          "Selecting quotations that are longer than necessary -- a shorter, more precise quotation usually generates better analysis",
          "Recalling quotations accurately from the early acts but becoming less precise for later parts of the text"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Deploys memorised quotations precisely and strategically across the whole text, selecting short, analytically rich quotations that generate multiple points of analysis, and connecting specific textual moments to whole-text arguments.",
        "example_task": "Write an analytical response to the question: 'How does Shakespeare present the relationship between appearance and reality in Macbeth?' You must write from memory without the text.",
        "example_response": "Shakespeare establishes the disjunction between appearance and reality in the play's opening line -- 'Fair is foul, and foul is fair' -- a paradox that reverses moral categories and announces the play's central preoccupation: that surfaces cannot be trusted. This is confirmed by Duncan, who confesses 'There's no art to find the mind's construction in the face', speaking of the treacherous Thane of Cawdor -- but the irony is that Duncan says this immediately before welcoming Macbeth, whose face will conceal an identical treachery. Lady Macbeth codifies the theme as strategy: 'Look like the innocent flower, / But be the serpent under't.' The botanical and Biblical imagery (the serpent in Eden) suggests that deception is not merely political but cosmically sinful -- Lady Macbeth is advising Macbeth to re-enact the original Fall. As the play progresses, the gap between appearance and reality widens until it becomes psychologically unsustainable. The banquet scene is the crisis point: Macbeth attempts to perform 'the perfect host' while the ghost of Banquo -- visible only to Macbeth and the audience -- exposes the truth the performance conceals. Lady Macbeth's 'Are you a man?' is both a challenge to his composure and an unwitting question about identity: is the 'real' Macbeth the gracious host or the haunted murderer? By Act 5, the apparitions' prophecies exploit this theme to deadly effect: Birnam Wood 'moving' to Dunsinane appears impossible until the reality is revealed (soldiers carrying branches), and the man 'not born of woman' appears impossible until the reality is revealed (Macduff was delivered by Caesarean section). In each case, the truth was hidden in plain sight, concealed by the assumption that words mean what they appear to mean. Shakespeare's ultimate statement on appearance and reality may be Macbeth's 'Life's but a walking shadow, a poor player / That struts and frets his hour upon the stage' -- a speech that describes all of existence as performance, suggesting that the distinction between appearance and reality is not a political problem to be solved but a metaphysical condition to be endured.",
        "common_errors": [
          "Deploying quotations to illustrate the theme without using them to build a developing argument across the essay",
          "Drawing on quotations from only two or three scenes rather than demonstrating knowledge of the whole text"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Demonstrates comprehensive and precise knowledge of the complete text, deploying quotations with strategic selectivity to build a complex and sustained argument, and using textual knowledge to connect specific moments to whole-text patterns, contextual significance and critical debates.",
        "example_task": "Write a critical essay in response to the statement: 'Macbeth is a play about the destruction of a noble mind.' How far do you agree? You must write from memory and refer to the whole play.",
        "example_response": "[The student produces a 600-word essay that draws on precise quotations from Acts 1, 2, 3, 4 and 5, demonstrates knowledge of scenes that are not commonly quoted (e.g. the conversation with the murderers in Act 3, Scene 1; the Doctor's observation of Lady Macbeth in Act 5, Scene 1), and builds a sustained argument that both agrees and challenges the statement. The essay agrees that Macbeth possesses a 'noble mind' -- evidenced by his capacity for moral imagination before the murder ('his virtues will plead like angels, trumpet-tongued') and his agonised awareness of what he is losing ('I have lived long enough; my way of life / Is fallen into the sere, the yellow leaf'). But it challenges whether Macbeth's mind was destroyed by external forces or by his own choices, arguing that the witches provide temptation, Lady Macbeth provides encouragement, but the decision is Macbeth's alone: 'I am settled, and bend up / Each corporal agent to this terrible feat.' The essay concludes by arguing that Macbeth's final soliloquy ('Tomorrow, and tomorrow, and tomorrow') is simultaneously the destruction of a noble mind (he has lost the ability to feel) and its last act of nobility (he articulates his own destruction with the same imaginative power that defined his earlier soliloquies). The quotations are short (rarely more than one line), precisely selected, and each one generates at least two analytical points. The student refers to the play's opening, middle and conclusion, demonstrating whole-text knowledge that extends beyond the most commonly taught extracts.]",
        "common_errors": [
          "Demonstrating extensive quotation recall but not using it strategically -- quantity of quotation is less important than precision and analytical yield",
          "Drawing on well-known quotations without demonstrating knowledge of less frequently discussed scenes that would strengthen the argument"
        ]
      }
    ]
  },
  {
    "concept_id": "ELT-KS4-C015",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Writes about literature in a predominantly narrative mode ('Then Macbeth kills Duncan...'), uses informal register, and does not embed quotations or sustain an analytical argument.",
        "example_task": "Write a paragraph analysing how Shakespeare presents Lady Macbeth as a powerful character. Use a quotation to support your point.",
        "example_response": "Lady Macbeth is a very powerful character. She tells Macbeth what to do and he listens to her. She says 'unsex me here' which shows she wants to be more like a man because she thinks women are weak. She is ambitious and wants power.",
        "common_errors": [
          "Retelling what happens rather than analysing how the writer creates effects",
          "Using quotations as illustration rather than as the starting point for analysis"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writes in a recognisably analytical mode, uses some critical vocabulary, embeds quotations within sentences, and sustains a point across a paragraph, though the argument may not develop beyond a single idea.",
        "example_task": "Write a paragraph analysing how Shakespeare presents ambition in 'Macbeth'. Your paragraph should be written in a critical analytical style with embedded quotations.",
        "example_response": "Shakespeare presents ambition as a force that distorts moral reasoning. In his soliloquy in Act 1 Scene 7, Macbeth acknowledges that Duncan is a good king -- his 'virtues will plead like angels, trumpet-tongued, against the deep damnation of his taking-off' -- yet proceeds to murder him regardless. The imagery of angels and damnation frames the decision in explicitly religious terms: Macbeth knows this is not merely criminal but spiritually catastrophic, and his willingness to proceed despite this knowledge reveals that ambition has overridden his moral judgement. Shakespeare suggests that ambition does not eliminate conscience but overpowers it, which makes Macbeth's crime more psychologically complex than simple villainy.",
        "common_errors": [
          "Sustaining a point within a paragraph but not developing it across multiple paragraphs into a full argument",
          "Embedding quotations grammatically but not analysing the specific language within the quotation"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Writes sustained literary essays in a formal critical style, developing a coherent argument across multiple paragraphs, embedding quotations fluently, using precise critical vocabulary, and maintaining a personal interpretive voice.",
        "example_task": "Write the opening three paragraphs of an essay responding to: 'Lady Macbeth is the real villain of the play.' How far do you agree?",
        "example_response": "The claim that Lady Macbeth is the 'real villain' of 'Macbeth' is seductive but reductive. It relies on a reading of Act 1 in which Lady Macbeth drives the murder and Macbeth is merely her instrument -- a reading that subsequent acts systematically dismantle. A more precise formulation might be that Lady Macbeth is the catalyst for Macbeth's villainy, but that the play carefully distinguishes between instigating a crime and sustaining one, and it is the capacity to sustain -- to continue killing after the initial horror has passed -- that defines the true villain. In Act 1, Lady Macbeth does indeed appear to be the dominant force. Her invocation of the spirits -- 'Come, you spirits that tend on mortal thoughts, unsex me here' -- is a deliberate summoning of evil that Macbeth never matches: while he agonises, she acts. Her contempt for his hesitation -- 'Was the hope drunk wherein you dressed yourself?' -- uses the metaphor of clothing to suggest that Macbeth's courage is a costume he puts on and takes off, which frames his ambition as performative and her resolve as authentic. At this point in the play, the audience might reasonably conclude that Lady Macbeth is the more dangerous figure. However, the play's moral architecture shifts decisively after the murder of Duncan. From Act 3 onwards, Macbeth acts without consulting Lady Macbeth: the murder of Banquo is his plan, his execution, his secret. The line 'Be innocent of the knowledge, dearest chuck, / Till thou applaud the deed' is chilling not because of what it conceals but because of what it reveals: Macbeth has moved beyond needing Lady Macbeth's encouragement and is now concealing his actions from her. The power dynamic has inverted. The figure who drove the first murder is excluded from the subsequent ones, which suggests that villainy in 'Macbeth' is not a fixed quality but a developing condition -- and it is Macbeth, not Lady Macbeth, who develops it.",
        "common_errors": [
          "Writing competent analytical paragraphs that do not connect into a developing argument -- each paragraph should advance the essay's position, not just illustrate it",
          "Using critical vocabulary ('Shakespeare suggests', 'the imagery conveys') without precision -- what specifically does the imagery convey?"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Writes literary essays of exceptional quality: a distinctive critical voice, a sustained and sophisticated argument, precise quotation deployment, confident engagement with alternative interpretations, and a prose style that is itself a demonstration of the analytical and stylistic skills the essay discusses.",
        "example_task": "Write a complete critical essay in response to: 'Shakespeare's tragedies are ultimately about the failure of self-knowledge.' How far do you agree with reference to your studied play?",
        "example_response": "[The student produces a complete essay of approximately 800 words that: opens with a thesis that both accepts and complicates the statement ('Self-knowledge in Macbeth is not absent but agonisingly present -- the tragedy is not that Macbeth fails to know himself but that he knows himself precisely and acts against that knowledge'); develops the argument through three or four paragraphs that trace the trajectory of self-knowledge across the play, using precisely selected quotations from Acts 1, 2, 3 and 5; engages with an alternative interpretation ('A more conventional reading might identify Macbeth's hamartia as a failure of self-knowledge -- he does not understand his own nature -- but the soliloquies contradict this'); uses a critical vocabulary that is precise rather than generic ('Shakespeare dramatises not ignorance but complicity -- Macbeth is an accomplice in his own destruction, not its victim'); and concludes with a personal critical voice that offers an original synthesis ('The play's deepest tragedy may be that self-knowledge is necessary but insufficient: Macbeth knows what he is doing, knows it is wrong, knows it will destroy him, and does it anyway. This is not a failure of knowledge but a failure of will, and it is more frightening because it suggests that understanding evil and resisting evil are entirely different capacities'). The prose style models the qualities it analyses: embedded quotations, varied sentence structures, precise vocabulary, evaluative tentativeness ('arguably', 'perhaps'), and a voice that is simultaneously rigorous and personal.]",
        "common_errors": [
          "Writing a technically accomplished essay that lacks a distinctive critical voice -- the best essays sound like a specific, thinking person, not a template",
          "Producing a sustained argument that does not engage with the strongest counter-argument -- critical confidence requires the willingness to address the best objection to your position"
        ]
      }
    ]
  }
]
