[
  {
    "concept_id": "EN-Y4-C040",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Using diagonal and horizontal joining strokes to connect common letter pairs.",
        "example_task": "Practise joining these letter combinations: th, in, an, er, ou, ch. Write each pair five times.",
        "example_response": "[Consistent joins between letters, with clear diagonal strokes from baseline to midline for letters like i-n and a-n]",
        "common_errors": [
          "Lifting the pen between letters that should be joined",
          "Joins that distort the letter shapes"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using joined handwriting consistently in short writing tasks, with most joins formed correctly.",
        "example_task": "Copy this sentence in your best joined handwriting: 'The quick brown fox jumps over the lazy dog.'",
        "example_response": "[All letters joined appropriately, with clear ascenders (l, d, h, k) and descenders (g, p, y), consistent letter size]",
        "common_errors": [
          "Inconsistent letter size within words",
          "Breaking joins mid-word unnecessarily"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using joined handwriting throughout all independent writing, knowing which letter combinations are best left unjoined.",
        "example_task": "Write a paragraph about your weekend using joined handwriting. Remember that some letters (like after p, b, g, j) are sometimes best left unjoined to the next letter.",
        "example_response": "[Fluent joined handwriting with appropriate breaks after descender letters where joining would distort the following letter. Consistent size, spacing and slant throughout.]",
        "common_errors": [
          "Forcing joins that make handwriting illegible",
          "Reverting to print in longer pieces of writing"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Adapting handwriting style for different purposes, maintaining both fluency and legibility at speed.",
        "example_task": "Write the same three sentences twice: first as a neat final copy, then as quick notes. What did you change?",
        "example_response": "[Neat version: careful joins, consistent size, clear spacing. Quick version: slightly less precise joins but still legible, smaller writing, some abbreviations] I changed the size and care of my joins. In quick notes I don't worry about perfect ascenders, but I keep it readable. In a final copy I make sure every letter is clearly formed.",
        "common_errors": [
          "Making notes so quickly they become illegible",
          "Not adapting at all — writing both versions at the same slow pace"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y4-C041",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Writing with consistent letter size and clear spacing between words.",
        "example_task": "Write three sentences about your pet or a pet you would like. Focus on making all your letters the same size and leaving a finger space between words.",
        "example_response": "[Letters are consistently sized, with clear ascenders/descenders and visible spaces between words]",
        "common_errors": [
          "Letters gradually getting larger or smaller across a line",
          "Inconsistent spacing — some words crammed together, others far apart"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writing with fluent joined handwriting that maintains legibility across a full page.",
        "example_task": "Write a half-page story. Keep your handwriting neat and joined all the way through, even when you are concentrating on the story.",
        "example_response": "[Joined handwriting maintained throughout, no reversion to print. Ascenders and descenders do not collide with lines above and below. Consistent slant.]",
        "common_errors": [
          "Handwriting deteriorating in quality towards the end of the page",
          "Legible handwriting in the first paragraph but increasingly messy thereafter"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Writing with sufficient fluency that handwriting keeps pace with ideas, with parallel downstrokes and clear ascenders/descenders.",
        "example_task": "Complete a timed writing task (10 minutes). Write as much as you can about the topic, keeping your handwriting legible throughout.",
        "example_response": "[Produces a substantial amount of text without sacrificing legibility. Downstrokes are parallel. Ascenders (b, d, h, k, l) reach the top of the line. Descenders (g, j, p, q, y) drop below the line consistently.]",
        "common_errors": [
          "Writing slowly to maintain neatness and running out of time",
          "Sacrificing legibility to write faster"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating own handwriting against clear criteria and identifying specific areas for improvement.",
        "example_task": "Look at your writing from today. Circle your best line and your worst line. What specific thing would improve your worst line?",
        "example_response": "My best line is line 4 — all the letters are consistent, the joins are smooth and the spacing is even. My worst line is line 11 — my 'r' and 's' letters start looking the same because I rush the formation. I need to slow down slightly on the 'r' to make sure the shoulder is clearly formed.",
        "common_errors": [
          "Identifying general issues ('it's messy') rather than specific letter formation problems",
          "Not connecting the evaluation to a specific improvement action"
        ]
      }
    ]
  }
]