[
  {
    "concept_id": "EN-KS3-C015",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can identify simple figurative devices (simile, metaphor) when prompted but struggles to explain their effect beyond naming them.",
        "example_task": "The writer says the storm 'roared like a wounded animal'. What technique is this and what does it suggest?",
        "example_response": "It is a simile because it uses 'like'. It makes the storm sound loud and scary.",
        "common_errors": [
          "Naming the device without explaining its effect ('the writer uses a simile')",
          "Confusing simile and metaphor"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifies figurative language and explains its effect with some detail, beginning to consider why the writer chose a particular image.",
        "example_task": "In the poem, the writer describes old age as 'the evening of life'. Explain the effect of this metaphor.",
        "example_response": "The metaphor compares old age to evening, which is when the day is ending and darkness is coming. This suggests that old age is a time of fading light and approaching death. Evening can also be peaceful and beautiful, which might suggest the writer sees old age as calm and reflective. The metaphor works because evening is a natural, inevitable part of every day, just as ageing is a natural part of life.",
        "common_errors": [
          "Explaining only one layer of meaning when the image supports multiple readings",
          "Identifying effect in general terms ('it makes the reader feel sad') without precision"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses figurative language with precision, exploring connotation, semantic fields and the interaction between images, and explaining how figurative devices contribute to the text's overall meaning.",
        "example_task": "In 'Macbeth', Lady Macbeth says 'Look like the innocent flower, but be the serpent under't.' Analyse the figurative language in detail.",
        "example_response": "This line contains a compound metaphor that operates through contrast. The 'innocent flower' suggests beauty, fragility and harmlessness -- qualities associated with nature, femininity and innocence. The 'serpent' carries biblical connotations of the snake in the Garden of Eden: deception, temptation and evil. The word 'under' is crucial -- the serpent is hidden beneath the flower, creating an image of concealed danger that looks beautiful on the surface. Lady Macbeth is instructing Macbeth to present a false, welcoming appearance while harbouring murderous intent. The flower-serpent opposition also connects to the play's wider theme of appearance versus reality and the idea that evil hides behind beauty. Shakespeare's audience would have immediately recognised the serpent as Satan, making Lady Macbeth's instruction not just tactical advice but a moral corruption -- she is teaching Macbeth to embody the devil's method.",
        "common_errors": [
          "Analysing each image separately without exploring how they interact within the line",
          "Missing the biblical allusion and its implications for characterisation"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluates how figurative language operates across a whole text, tracking image patterns, analysing how they develop and change, and assessing their contribution to the text's thematic argument.",
        "example_task": "Trace Shakespeare's use of blood imagery across 'Macbeth'. How does it develop and what does it contribute to the play's meaning?",
        "example_response": "Blood imagery in 'Macbeth' undergoes a transformation that mirrors the moral arc of the play. In Act 1, blood is honourable: Macbeth returns from battle as a 'brave' warrior, and the 'bloody man' (the Captain) reports his courage. Blood represents loyalty and service. After Duncan's murder, blood becomes guilt: Macbeth stares at his hands asking 'Will all great Neptune's ocean wash this blood clean from my hand?' The shift from literal (battle blood) to metaphorical (guilt blood) signals Macbeth's crossing of a moral boundary. Lady Macbeth dismisses this: 'A little water clears us of this deed' -- her confident literalism will later collapse into the sleepwalking scene where she obsessively washes phantom blood from her hands. In the final acts, blood becomes prophecy and retribution: the witches' 'bloody child' apparition and Macduff's revenge-driven return bring blood full circle from honour to guilt to justice. The image pattern argues that violence, once unleashed, cannot be contained -- it spreads, stains, and ultimately returns to its source.",
        "common_errors": [
          "Listing examples of blood imagery without tracing its development",
          "Not connecting the image pattern to the play's thematic argument"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C016",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Notices that writers choose particular words but cannot explain why one word was chosen over another.",
        "example_task": "The writer describes a character as 'slinking' through the corridor. Why might the writer have chosen 'slinking' instead of 'walking'?",
        "example_response": "Slinking sounds more interesting than walking. It is a better word.",
        "common_errors": [
          "Saying a word is 'effective' or 'good' without explaining why",
          "Not considering what the word connotes beyond its literal meaning"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explains how specific word choices create particular impressions, beginning to consider connotation and tone.",
        "example_task": "The writer describes a house as 'crouching' among the trees. What effect does the verb 'crouching' create?",
        "example_response": "Crouching makes the house sound like an animal that is hiding or waiting to pounce. It creates a sense of threat and unease. A house that crouches is not welcoming -- it feels like it is alive and watching. The word suggests something predatory.",
        "common_errors": [
          "Explaining effect in only one dimension when the word has multiple connotations",
          "Not connecting the word choice to the wider tone of the passage"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses vocabulary choices with precision, exploring denotation, connotation, semantic fields and the effect of individual words on tone, mood and characterisation.",
        "example_task": "Compare the effect of these two descriptions: 'The man entered the room' versus 'The man invaded the room'. What does the verb change tell us?",
        "example_response": "The verb 'invaded' transforms the sentence from neutral description to characterisation. 'Enter' denotes arrival without implication, but 'invade' carries connotations of military aggression, unwelcome intrusion and violation of territory. The room becomes a space that belongs to someone else, and the man becomes a threat to it. 'Invade' also activates a semantic field of conflict: the reader begins to expect tension, resistance or confrontation. The single verb change shifts the reader's relationship to both character and setting -- we are now positioned to view the man with suspicion and the room's existing occupant with sympathy. This demonstrates how a single word can do the work of an entire paragraph of description.",
        "common_errors": [
          "Comparing the words without explaining what the difference reveals about characterisation or theme",
          "Analysing the word in isolation rather than considering its effect within the whole sentence"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluates how vocabulary choices operate as part of a writer's larger strategy, analysing patterns of diction across a text and assessing how word-level choices serve thematic and structural purposes.",
        "example_task": "How does Steinbeck's vocabulary in the opening of 'Of Mice and Men' establish the novel's setting and themes?",
        "example_response": "Steinbeck's opening is saturated with natural vocabulary: 'willows', 'sycamores', 'recumbent limbs', 'golden foothill slopes', 'warm'. This Edenic diction constructs the Salinas River clearing as a prelapsarian paradise -- a place of beauty, rest and abundance before the human story intrudes. The verb 'recumbent' (lying down, resting) personifies the trees as peaceful sleepers, creating an atmosphere of tranquillity that the narrative will systematically destroy. The animals -- 'rabbits', 'lizards', 'deer' -- create a food chain that foreshadows the novel's Darwinian world of survival and predation. When humans arrive, they 'beat' a path through the undergrowth -- the verb signals disruption. The entire vocabulary strategy of the opening establishes a contrast between natural harmony and human violence that structures the whole novel: Lennie dreams of tending rabbits (pastoral innocence) but his hands, described as 'paws', always destroy what they touch. Steinbeck's word choices are not decorative -- they are the thematic architecture of the novel.",
        "common_errors": [
          "Analysing individual words without connecting them to a pattern or strategy",
          "Not showing how opening vocabulary choices anticipate the novel's themes"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C017",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Reads sentences without considering how their grammatical construction affects meaning.",
        "example_task": "This sentence uses the passive voice: 'The window was smashed.' How is this different from 'Someone smashed the window'?",
        "example_response": "They say the same thing, just in different ways.",
        "common_errors": [
          "Not recognising that different grammatical constructions create different effects",
          "Treating grammar as rules for correctness rather than tools for meaning"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Recognises that grammatical choices affect meaning and can identify basic effects such as the difference between active and passive voice or short and long sentences.",
        "example_task": "The writer uses a one-word sentence: 'Gone.' after describing a character looking at an empty room. What effect does this create?",
        "example_response": "The short sentence creates a sudden, sharp impact. After longer descriptive sentences, the one word 'Gone' feels abrupt and final. It shows the character's shock and emphasises the emptiness. The full stop makes it feel like a punch.",
        "common_errors": [
          "Saying short sentences 'create tension' as a default explanation without considering the specific context",
          "Not explaining how the grammatical choice works in relation to surrounding sentences"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses how grammatical features such as sentence structure, tense, voice, clause arrangement and punctuation create specific effects on meaning, tone and pace.",
        "example_task": "Analyse how the writer uses sentence structure in this action scene to create a sense of urgency.",
        "example_response": "The writer shifts from compound sentences with multiple clauses ('He turned the corner and the street opened before him, wider than expected, the buildings pulling apart') to short, fragmented sentences ('Run. Footsteps behind. Closer.'). The compound sentences create a sense of the character absorbing information, processing the environment. The fragments strip away grammatical completeness -- there is no subject, no full clause -- mimicking the character's loss of rational thought under extreme fear. The present tense ('Run') rather than past ('He ran') creates immediacy, placing the reader inside the moment. The lack of conjunctions (asyndetic listing) removes the logical connections between thoughts, conveying panic. The grammatical fragmentation is the experience of fear rendered in syntax.",
        "common_errors": [
          "Noting sentence length variation without analysing what each sentence type does in its specific context",
          "Not using grammatical terminology accurately (e.g. confusing clause types)"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluates how grammatical choices function as part of a writer's overall craft, connecting syntactic analysis to characterisation, theme and narrative strategy across extended texts.",
        "example_task": "How does Bronte's use of complex, multi-clause sentences in 'Jane Eyre' reflect the novel's exploration of Jane's inner life?",
        "example_response": "Bronte's characteristically complex syntax -- long sentences with multiple subordinate clauses, parenthetical asides, conditional constructions and embedded reflections -- mirrors the recursive, self-examining quality of Jane's consciousness. When Jane describes her feelings, the grammar itself enacts the process of thought: 'I could not help it: the restlessness was in my nature; it agitated me to pain sometimes.' The colon introduces the explanation, the semicolon extends it, and the qualification 'sometimes' moderates the claim. This is not a character who simply states what she feels; the grammar shows her analysing, qualifying and refining her self-understanding as she writes. The complexity of the syntax is an argument about the complexity of her interiority. Bronte also uses shorter, declarative sentences at moments of moral clarity ('I am no bird; and no net ensnares me; I am a free human being with an independent will'), where the simplified grammar reflects Jane's certainty. The shifting syntactic register between complexity and simplicity maps onto the novel's central tension: between Jane's rich inner life and her clear moral convictions.",
        "common_errors": [
          "Describing the syntax without connecting it to character psychology or theme",
          "Treating all long sentences as having the same function"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C018",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Follows the order of events in a text but does not consider why the writer chose to organise the text in a particular way.",
        "example_task": "Why do you think the writer starts this story with the ending and then goes back to the beginning?",
        "example_response": "Maybe they wanted to do something different. It was a bit confusing at first.",
        "common_errors": [
          "Not recognising that structure is a deliberate authorial choice",
          "Treating structural features as accidental or confusing rather than purposeful"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifies basic structural features (chronological order, flashback, opening hook, climax) and explains their general effect.",
        "example_task": "This article starts with a dramatic anecdote before presenting facts and statistics. Why might the writer have structured it this way?",
        "example_response": "Starting with the anecdote hooks the reader with an emotional story before giving the facts. The personal story makes us care about the issue, and then the statistics show it is a widespread problem. If the writer had started with statistics, we might not have been interested enough to keep reading.",
        "common_errors": [
          "Identifying the structure without explaining its effect on the reader",
          "Describing what the text does paragraph by paragraph without analysing the overall structural strategy"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses how a text's structure creates meaning, considering how openings, endings, shifts in focus, pacing and section arrangement work together to achieve the writer's purpose.",
        "example_task": "How does the structure of 'An Inspector Calls' contribute to Priestley's message?",
        "example_response": "Priestley structures the play as a gradual stripping away of the Birling family's self-satisfaction. The opening establishes their comfortable, self-congratulatory world: the engagement dinner is a celebration of bourgeois success. The Inspector's arrival disrupts this by revealing each family member's involvement in Eva Smith's death, moving from Mr Birling (the least remorseful) to Sheila (the most changed). This structural ordering is deliberate: the audience sees increasing levels of moral awareness, culminating in the generational divide between parents who refuse to change and children who are transformed. The final twist -- the phone call announcing a real Inspector is coming -- creates a cyclical structure that denies resolution. The family will go through this again. Priestley's structural choice argues that moral reckoning cannot be evaded: history repeats until the lesson is learned.",
        "common_errors": [
          "Describing the sequence of events without analysing why Priestley ordered them this way",
          "Not connecting structural analysis to the play's political message"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluates how structural choices across a whole text create layered meaning, analysing how form and structure interact with theme, character and reader response.",
        "example_task": "How does the three-part structure of Shelley's 'Frankenstein' (Walton's letters framing Victor's narrative framing the Creature's narrative) affect the novel's exploration of perspective and truth?",
        "example_response": "Shelley's nested narrative structure -- three first-person narrators embedded within each other like Russian dolls -- systematically destabilises the reader's understanding of truth. Walton's letters establish a frame of heroic aspiration; Victor's narrative within that frame tells a story of ambition turned to horror; the Creature's narrative at the centre reverses the reader's sympathy entirely. The structure matters because each narrator controls what the next level knows: Walton only hears Victor's version; Victor only hears what the Creature chooses to reveal. The reader, positioned at the outermost layer, must judge all three accounts simultaneously, aware that each narrator is unreliable in different ways. Victor's narrative is driven by self-justification; the Creature's is driven by the desire for sympathy; Walton's is driven by ambition. The structural choice forces the reader to do what Victor refuses to: consider the Creature's perspective as equally valid. The centre of the novel -- the Creature's account -- is also structurally the most deeply buried, reflecting how marginalised voices must fight through layers of more powerful narratives to be heard.",
        "common_errors": [
          "Describing the frame narrative without analysing what each layer does differently",
          "Not connecting the structural choice to the novel's theme of perspective and power"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C019",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Recognises that poetry looks different from prose on the page but cannot name or describe specific poetic conventions.",
        "example_task": "What makes this text a poem rather than a piece of prose?",
        "example_response": "It has short lines and some of the words rhyme. It looks different on the page.",
        "common_errors": [
          "Defining poetry only by rhyme, missing free verse and other forms",
          "Not recognising stanza breaks as meaningful structural choices"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifies common poetic forms and features including rhyme scheme, stanza form and basic metre, and recognises that these are deliberate choices.",
        "example_task": "Identify the rhyme scheme and stanza form of this poem. What effect do these features create?",
        "example_response": "The poem has four-line stanzas (quatrains) with an ABAB rhyme scheme. The regular rhyme creates a musical, almost song-like quality. The consistent stanza length gives the poem a sense of order and control, even though the subject is chaotic. The rhyme pairs 'night/light' and 'fear/clear' create connections between ideas.",
        "common_errors": [
          "Identifying the rhyme scheme without commenting on its effect",
          "Describing stanza form without considering why the poet chose it"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses how poetic conventions including form, metre, rhyme, enjambment, caesura and stanza structure work together to create meaning and effect.",
        "example_task": "How does Wilfred Owen use the sonnet form in 'Anthem for Doomed Youth' to challenge romantic notions of war?",
        "example_response": "Owen takes the Petrarchan sonnet -- traditionally a form for love poetry -- and repurposes it for a poem about mass death in war. The octave (first 8 lines) uses aggressive, cacophonous imagery of the battlefield ('stuttering rifles' rapid rattle', 'monstrous anger of the guns') that deliberately clashes with the sonnet's associations with beauty and romance. The sestet shifts to the quiet, domestic rituals of mourning: 'candles', 'pallor of girls' brows', 'drawing-down of blinds'. The structural turn (volta) between octave and sestet enacts the distance between the front line and home -- the same structural convention that sonnet-writers use to shift from problem to resolution, Owen uses to shift from battlefield to funeral. By choosing a love poem form for a war poem, Owen argues that the traditional language of honour and glory (the romantic rhetoric of war) is as inadequate to reality as a love sonnet is to describing machine-gun fire.",
        "common_errors": [
          "Identifying the sonnet form without explaining why Owen chose it",
          "Describing the octave/sestet structure without analysing the effect of the volta"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluates how poets use, adapt and subvert poetic conventions to create complex meaning, understanding the relationship between form and content as itself an argument.",
        "example_task": "Compare how two poets use or subvert the same poetic form to achieve different effects.",
        "example_response": "Shakespeare's Sonnet 18 ('Shall I compare thee to a summer's day?') and Carol Ann Duffy's 'Valentine' both respond to the conventions of the love poem, but in opposite directions. Shakespeare works within the Petrarchan tradition of idealising the beloved, but subtly subverts it: the comparison to summer is rejected ('Thou art more lovely and more temperate'), and the conventional conceit of beauty's permanence is attributed not to the beloved's physical qualities but to the poem itself ('So long lives this, and this gives life to thee'). The sonnet form -- with its logical octave and resolving sestet -- provides the structure for this elegant argument. Duffy's 'Valentine' abandons formal conventions entirely: free verse, irregular stanzas, no rhyme scheme. The rejection of form mirrors the rejection of conventional romance symbols -- 'Not a red rose or a satin heart.' Instead, the poem offers an onion: honest, layered, capable of making you cry. The absence of form is the argument: love that conforms to a pattern (sonnet, red roses, Valentine's card) is less truthful than love that finds its own shape. Shakespeare uses form to house a subversive argument; Duffy rejects form to make the same kind of point about authenticity.",
        "common_errors": [
          "Comparing the poems' content without analysing how form itself carries meaning",
          "Describing both poets' use of form without reaching a comparative conclusion"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C020",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Identifies obvious poetic devices (rhyme, alliteration) but cannot explain their effect beyond saying the poem 'sounds nice'.",
        "example_task": "Find an example of alliteration in this poem and explain its effect.",
        "example_response": "The poet writes 'dark, deep dungeon'. The alliteration of the 'd' sound makes it sound good.",
        "common_errors": [
          "Identifying a device without explaining its specific effect in context",
          "Using vague evaluative language ('sounds nice', 'flows well') instead of precise analysis"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Analyses the effect of poetic devices with some detail, beginning to connect sound, imagery and structure to meaning.",
        "example_task": "How does the poet use enjambment in this stanza? What effect does it create?",
        "example_response": "The line breaks in the middle of sentences so the reader has to carry on to the next line without pausing. For example, 'I wandered lonely as a / cloud' puts a pause before 'cloud' which isolates the word and makes it stand out. The enjambment creates a flowing feeling that mirrors the drifting movement described in the poem.",
        "common_errors": [
          "Describing enjambment as simply 'the sentence continues onto the next line' without explaining the effect of the specific break point",
          "Not considering how enjambment interacts with other devices in the poem"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses how multiple poetic devices interact to create layered effects, connecting sound, imagery, structure and meaning with precision.",
        "example_task": "Analyse how the poet uses sound and imagery together in this stanza to create atmosphere.",
        "example_response": "The poet combines sibilance ('silent, silver serpents sliding') with a visual image of snakes moving through water. The repeated 's' sound mimics the hissing movement of the snakes and creates a hushed, secretive atmosphere. The word 'silver' adds a visual shimmer that contrasts with the threat implied by 'serpents'. The soft consonants throughout the stanza slow the reader's pace, forcing them to read at the speed of the snakes' movement. This interplay between sound (sibilance creating the hiss), imagery (silver-serpent creating both beauty and danger), and rhythm (slowed pace mimicking movement) creates an atmosphere that is simultaneously beautiful and threatening -- which is exactly the paradox the poem explores.",
        "common_errors": [
          "Analysing sound and imagery separately without exploring how they work together",
          "Identifying the atmosphere without explaining precisely how the combination of devices creates it"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluates how poetic devices function within the total design of a poem, assessing how technique serves the poet's thematic and emotional argument across the entire work.",
        "example_task": "Choose a poem you have studied and argue that one specific poetic technique is central to its meaning.",
        "example_response": "In Seamus Heaney's 'Digging', the central technique is the extended metaphor that equates writing with manual labour. The poem opens with a pen resting 'snug as a gun' in the speaker's hand, establishing writing as a tool with the potential for power or violence. The middle stanzas describe the speaker's father and grandfather digging -- literally, with a spade -- in rhythms that Heaney makes muscular through consonance ('the squelch and slap of soggy peat') and strong stresses that mimic the physical effort. The final lines complete the metaphor: 'Between my finger and my thumb / The squat pen rests. / I'll dig with it.' The verb 'dig' now means both to excavate earth and to excavate meaning through writing. This metaphor is not decorative -- it is the poem's argument: that intellectual work and manual work share a dignity, a discipline and a tradition. By structuring the entire poem around this single extended metaphor, Heaney resolves his anxiety about abandoning his family's farming tradition by reconceiving writing as a continuation of it rather than a departure from it.",
        "common_errors": [
          "Choosing a technique that is incidental rather than central to the poem's meaning",
          "Describing how the technique works without arguing why it is essential to the poem's thematic purpose"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C021",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Notices where a story takes place but does not consider how setting contributes to mood, theme or character.",
        "example_task": "Describe the setting of this story. How does it make you feel?",
        "example_response": "The story is set in an old house in the countryside. It sounds a bit creepy.",
        "common_errors": [
          "Describing setting as background information rather than as a meaningful literary choice",
          "Not connecting setting to mood or atmosphere"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explains how setting creates mood and atmosphere, identifying how specific details of place, weather and time contribute to the reader's experience.",
        "example_task": "How does the writer use the setting of the abandoned factory to create atmosphere in this extract?",
        "example_response": "The writer describes 'shattered windows' and 'rusted machinery frozen in mid-motion', which creates a sense of decay and abandonment. The 'echo of footsteps' suggests emptiness and makes the character seem small and vulnerable. The factory used to be a place of life and work but now it is dead and silent, which creates an eerie, ghostly atmosphere.",
        "common_errors": [
          "Listing setting details without explaining what atmosphere they create",
          "Describing the atmosphere in one word ('scary', 'sad') without analysing how it is built"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses how writers use setting symbolically and structurally, understanding how place reflects character, reinforces theme and shapes narrative development.",
        "example_task": "How does Charlotte Bronte use the red room in 'Jane Eyre' to develop character and theme?",
        "example_response": "The red room operates on multiple levels. Literally, it is the room where Mr Reed died, which Jane is locked in as punishment. The colour red connotes danger, anger and blood, reflecting Jane's emotional state: rage at her unjust treatment and terror at being imprisoned. The room is 'chill' and 'silent', creating a physical environment that mirrors Jane's emotional isolation in the Reed household. Symbolically, the room represents the patriarchal structures that trap Jane: she is literally enclosed in a dead man's space, controlled by women (Mrs Reed, Bessie) who enforce male authority. The episode also foreshadows Jane's later imprisonments -- at Lowood, at Thornfield -- where she must fight to be free. Bronte uses this single setting to crystallise the novel's central themes of confinement, resistance and the desire for autonomy. The red room is not just a place; it is the condition Jane must escape.",
        "common_errors": [
          "Analysing the symbolic meaning without also considering the literal and emotional effects",
          "Not connecting the setting analysis to the wider themes of the novel"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluates how settings function as dynamic elements within a text, changing in significance as the narrative develops, and contributing to the text's structural and thematic architecture.",
        "example_task": "Compare how two writers use contrasting settings within the same text to develop their argument about human nature.",
        "example_response": "In 'Great Expectations', Dickens constructs a moral geography through the contrast between the marsh and London. The marsh is where Pip encounters Magwitch: it is described as 'dark flat wilderness', 'low leaden line', 'savage lair' -- a place of fear, exposure and rawness. London, by contrast, offers culture, wealth and social advancement: Pip moves there to become a gentleman. However, Dickens systematically reveals that London's civilisation is surface-deep: the legal system (Jaggers's office), the class system (Miss Havisham's decaying mansion) and the prison (Newgate) are as morally savage as the marsh. The twist -- that Magwitch, the convict from the marsh, is Pip's true benefactor -- collapses the moral distinction between the two settings entirely. The 'savage' marsh produced genuine generosity; the 'civilised' city produced Miss Havisham's cruelty and Compeyson's fraud. Dickens uses the setting contrast structurally to reverse the reader's assumptions: the moral argument of the novel is that social respectability does not correlate with moral worth, and the settings are the primary vehicle for this argument.",
        "common_errors": [
          "Comparing settings at a descriptive level without connecting the contrast to thematic argument",
          "Not showing how the relationship between settings changes across the novel"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C022",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can retell the events of a story in order but does not consider why the writer structured the narrative in a particular way.",
        "example_task": "What are the main events in this story? Put them in the order they happen.",
        "example_response": "First the character goes on a journey. Then they meet a stranger. Then there is a fight. Then they win and go home.",
        "common_errors": [
          "Treating plot as a simple sequence of events rather than a deliberate construction",
          "Not recognising that the order of events is a choice the writer makes"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifies key plot elements (exposition, rising action, climax, resolution) and begins to explain how the writer builds tension and interest.",
        "example_task": "Identify the climax of the story and explain how the writer builds towards it.",
        "example_response": "The climax is when the detective reveals who the murderer is. The writer builds towards it by dropping clues throughout the story and creating red herrings that make us suspect the wrong person. The tension increases because each chapter eliminates a suspect and the remaining characters become more suspicious of each other.",
        "common_errors": [
          "Identifying the most dramatic moment rather than the structural turning point",
          "Not explaining how earlier narrative choices prepare for the climax"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses how plot structure creates suspense, meaning and emotional impact, understanding how writers manipulate narrative order, pacing and revelation.",
        "example_task": "How does the dual timeline structure in a novel you have studied create tension and meaning?",
        "example_response": "In 'The Book Thief' by Markus Zusak, the narrator (Death) reveals early on that certain characters will die, then tells the story of how it happens. This creates a dual timeline: we know the outcome but not the journey. The effect is a particular kind of tension -- not 'what will happen?' but 'how and when will it happen?'. Every moment of happiness in Liesel's life is shadowed by our knowledge of what is coming, which makes those moments simultaneously more precious and more painful. Zusak's structural choice also reflects the novel's theme: in wartime, everyone lives under the shadow of potential death, and the characters' courage lies not in avoiding fate but in living fully despite knowing it is coming. The plot structure is the novel's argument made visible.",
        "common_errors": [
          "Describing what happens in each timeline without analysing the effect of their juxtaposition",
          "Not connecting the structural choice to the novel's thematic concerns"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluates how plot structure functions as a form of argument, understanding how narrative architecture shapes the reader's moral and intellectual response across the whole text.",
        "example_task": "Argue that the plot structure of a novel you have studied is essential to its meaning -- that telling the story in a different order would change the argument.",
        "example_response": "The plot structure of 'A Christmas Carol' is not merely a sequence of events but a moral argument enacted through time. Dickens structures the novella around three chronological visions: past, present and future. This is not arbitrary: Scrooge must first understand how he became who he is (the Past shows his loss of love and warmth), then see the consequences of who he is now (the Present shows the Cratchits' suffering), then confront what he will become if nothing changes (the Future shows his unmourned death). The order is essential because it follows the logic of moral conversion: self-knowledge, then empathy, then fear. If the Future came first, Scrooge would be frightened but not changed -- he would have no understanding of why he must change. If the Present came first, he might feel pity but lack the self-knowledge to connect others' suffering to his own choices. Dickens's plot structure is a pedagogical sequence: it teaches Scrooge (and the reader) how to become moral by showing that moral transformation requires understanding the past, seeing the present clearly, and accepting responsibility for the future.",
        "common_errors": [
          "Arguing that the structure creates tension without showing how it makes an argument",
          "Not demonstrating convincingly that a different order would change the meaning"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C023",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Describes characters by their physical appearance or basic personality traits but does not analyse how the writer constructs them.",
        "example_task": "Describe the main character. What are they like?",
        "example_response": "The main character is brave and kind. They help their friends and stand up to bullies.",
        "common_errors": [
          "Treating characters as real people rather than as constructions by the writer",
          "Describing personality without using evidence from the text"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explains how a character is presented through specific textual details, including what they say, do and how others respond to them.",
        "example_task": "How does the writer present the villain in this story? Use evidence from the text.",
        "example_response": "The writer presents the villain through other characters' reactions: when he enters the room, 'everyone fell silent' and 'the child hid behind her mother'. This shows he is feared without the writer having to tell us directly. His dialogue is short and commanding -- 'Sit down' -- which shows he expects to be obeyed. The writer also describes his hands as 'precise' and 'unhurried', suggesting controlled menace rather than wild aggression.",
        "common_errors": [
          "Relying only on what the writer explicitly tells us rather than analysing indirect characterisation",
          "Not considering how different techniques (dialogue, action, others' reactions) work together"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses how characters are constructed through multiple techniques, understanding how characterisation develops across a text and how characters serve thematic purposes.",
        "example_task": "How does Shakespeare develop the character of Lady Macbeth across the play? What techniques does he use?",
        "example_response": "Shakespeare constructs Lady Macbeth through a carefully controlled arc of apparent strength collapsing into destruction. In Act 1, she is characterised through her own speech: her soliloquy calling on dark spirits to 'unsex me here' and 'fill me from the crown to the toe top-full of direst cruelty' presents her as more ruthless than Macbeth, deliberately rejecting femininity to pursue power. Her dialogue with Macbeth is commanding and manipulative: she questions his masculinity ('When you durst do it, then you were a man'). But Shakespeare signals her vulnerability through the telling detail that she cannot kill Duncan herself because he resembles her father -- the first crack in her armour. In Act 5, the sleepwalking scene reverses her earlier confidence entirely: her involuntary hand-washing echoes her dismissive 'A little water clears us of this deed' from Act 2, revealing that the guilt she denied has consumed her subconscious. Shakespeare uses the contrast between her public persona (commanding, rational) and her private collapse (involuntary, irrational) to argue that suppressing guilt does not eliminate it -- it merely drives it underground.",
        "common_errors": [
          "Tracing the character arc without analysing the specific techniques Shakespeare uses",
          "Discussing Lady Macbeth as if she were a real person rather than a dramatic construction"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluates how characterisation functions within the text's larger thematic and structural design, analysing how characters relate to each other, to genre conventions and to the writer's moral or political argument.",
        "example_task": "Argue that a character you have studied functions as a structural device as much as a realistic person.",
        "example_response": "The Ghost of Christmas Present in 'A Christmas Carol' is not a psychologically realistic character but a structural and rhetorical device. He functions as a mirror: he shows Scrooge (and the reader) the present moment without interpretation, forcing Scrooge to draw his own moral conclusions. His torch that sprinkles 'Christmas cheer' on the poor but not the rich is a visual argument about the unequal distribution of generosity. The two children hidden under his robe -- Ignorance and Want -- are allegorical rather than realistic, turning the character into a vehicle for Dickens's political argument: that society's refusal to address poverty will destroy it. Even his physical appearance -- the giant in the green robe surrounded by abundance -- is a personification of Christmas generosity itself, not a person but an idea embodied. His ageing across a single night (he is born at midnight and dies at midnight) makes his structural function explicit: he exists only to serve the narrative's time-based argument. Dickens does not attempt psychological realism because the Ghost's purpose is polemical: he is a teaching tool within a moral fable. The character's effectiveness lies precisely in his lack of individuality -- he is a lens, not a person.",
        "common_errors": [
          "Arguing that the character is a device without showing how this serves the text's purpose",
          "Not considering whether the character also has elements of psychological realism alongside their structural function"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C024",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Understands that plays are performed on stage but focuses primarily on the written text without considering performance elements.",
        "example_task": "How is reading a play different from reading a novel?",
        "example_response": "A play has dialogue and stage directions. You have to imagine the actors saying the words.",
        "common_errors": [
          "Reading plays as if they were novels, ignoring performance dimensions",
          "Not considering how actors, directors and designers interpret the written text"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Recognises that drama is intended for performance and considers how acting, staging and direction contribute to the audience's experience.",
        "example_task": "If you were directing this scene, how would you want the actor playing Macbeth to deliver the 'dagger' soliloquy?",
        "example_response": "I would want the actor to start quietly and slowly, as if confused. He should reach out towards the imaginary dagger, showing that he almost believes it is real. As the speech builds, his voice should become more urgent and agitated. The lighting should be dim with perhaps a single spotlight, creating shadows that add to the sense of hallucination.",
        "common_errors": [
          "Making directorial suggestions without connecting them to the text's meaning",
          "Focusing only on acting without considering staging, lighting or sound"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses how performance elements (acting, staging, lighting, sound, set design, blocking) create meaning and how different productions can create different interpretations of the same text.",
        "example_task": "How could two different directors stage the final scene of 'Romeo and Juliet' to create different effects on the audience?",
        "example_response": "A traditional staging might use candlelight, a stone tomb and formal costumes, emphasising the classical tragedy and the weight of the feud that destroys the lovers. The audience would feel sorrow and pity within a recognisable historical setting. A modern staging might set the scene in a hospital or morgue under harsh fluorescent lighting, with the families in business suits, transforming the feud from a Renaissance blood vendetta into corporate rivalry or gang warfare. This would make the audience feel that the story is not historical but contemporary -- that these deaths happen now. Both are valid interpretations of Shakespeare's text, but the staging choices determine whether the audience leaves feeling 'how tragic' (distance) or 'this is us' (immediacy). The director's staging choices are themselves an interpretation -- an argument about what the play means.",
        "common_errors": [
          "Describing staging ideas without explaining how they create different interpretations",
          "Assuming there is one 'correct' way to stage a play"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluates how specific production choices create interpretive arguments about a play's meaning, and critiques how performance can reveal dimensions of a text that reading alone cannot access.",
        "example_task": "Argue that a specific staging choice in a production you have seen or studied reveals something about the play that is not visible in the text alone.",
        "example_response": "In the 2015 National Theatre production of 'Hamlet', Benedict Cumberbatch's Hamlet entered for the 'To be or not to be' soliloquy wearing a David Bowie t-shirt and playing with a toy soldier. This apparently casual staging choice made a sophisticated interpretive argument: the toy soldier literalised the theme of Hamlet being 'played with' by the adults around him -- he is Claudius's pawn, the Ghost's instrument, Polonius's surveillance target. The Bowie shirt connected Hamlet to artistic outsiders and cultural revolutionaries, positioning him not as a melancholic prince but as a misfit. This reading is latent in the text but invisible on the page -- it requires a body, a costume, a physical presence to bring it to life. The director's staging choice functioned as literary criticism: it argued that Hamlet's indecision is not weakness but a form of resistance against a court that is trying to script his behaviour.",
        "common_errors": [
          "Describing the production without explaining how the staging choice functions as interpretation",
          "Not connecting the staging choice to specific textual evidence"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C025",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Assumes that there is one correct way to stage a play and does not consider how different interpretive choices might change meaning.",
        "example_task": "Could this play be set in a different time period? Would that change anything?",
        "example_response": "I suppose you could set it in modern times but it would not really work because the characters wear old-fashioned clothes.",
        "common_errors": [
          "Confusing surface details (costume, set) with deeper interpretive choices",
          "Assuming historical plays must be staged historically"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Understands that plays can be staged in different ways and that these choices affect interpretation, though may focus on obvious changes like setting or costume.",
        "example_task": "If you moved 'Romeo and Juliet' from Verona to a modern city, what would change about how the audience understands the story?",
        "example_response": "If you set it in a modern city with gangs instead of families, the audience would understand the feud differently. Instead of noble families with swords, it would be street violence. This would make the story feel more relevant and might make the audience think about violence in their own communities.",
        "common_errors": [
          "Describing the change in setting without analysing how it changes meaning",
          "Assuming modernisation always makes a play more accessible"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses how specific staging choices create distinct interpretations of a play, understanding that every production is an argument about what the text means.",
        "example_task": "Compare two possible stagings of the witches in 'Macbeth': one traditional (old women in ragged cloaks) and one modern (three schoolchildren). How does each staging change the play's meaning?",
        "example_response": "Traditional witch staging -- old women, rags, cauldron -- emphasises the supernatural and external evil. The audience sees Macbeth as tempted by forces beyond his control, which partly excuses his actions. Modern staging with schoolchildren creates a completely different argument: children are supposedly innocent, so if they speak prophecies of murder, the horror is in the ordinariness of evil. Macbeth is not tempted by the supernatural but by his own ambition, which the children merely vocalise. The traditional staging asks: 'Would you resist supernatural temptation?' The modern staging asks: 'Is the capacity for violence already inside you?' The schoolchild witches also connect to the play's theme of corrupted innocence (the murder of Macduff's children) and suggest that violence passes between generations.",
        "common_errors": [
          "Describing both stagings without reaching an analytical conclusion about how they change meaning",
          "Not considering how the staging choice interacts with other elements of the play"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluates how alternative stagings reveal, challenge or extend the play's possible meanings, understanding that interpretation is an active, creative process and that no single staging exhausts a text's possibilities.",
        "example_task": "Argue that a controversial or unconventional staging of a Shakespeare play reveals something genuinely new about the text.",
        "example_response": "An all-female staging of 'Julius Caesar' reveals a dimension of the play that male-dominated productions obscure: the play's obsession with masculinity as performance. When female actors deliver lines like 'Cowards die many times before their deaths; the valiant never taste of death but once', the audience is forced to hear the rhetoric of masculine courage as rhetoric -- as something performed rather than natural. Brutus's honour, Caesar's ambition, Antony's grief: all are revealed as carefully constructed performances of masculinity competing for the audience's approval. An all-female cast makes this visible because the audience cannot take the masculinity for granted -- they must watch it being performed, which is exactly what Shakespeare's characters are doing. The text already contains this insight (Cassius says 'How many ages hence shall this our lofty scene be acted o'er in states unborn'), but a conventional staging allows the audience to accept the masculine posturing as authentic. The unconventional casting strips that comfort away and reveals that 'Julius Caesar' is a play about political theatre -- about the dangerous power of rhetorical performance.",
        "common_errors": [
          "Arguing for a controversial staging on grounds of novelty or representation without showing how it illuminates the text",
          "Not grounding the argument in specific textual evidence that supports the staging interpretation"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C026",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "When asked to compare texts, tends to discuss each separately without making connections between them.",
        "example_task": "Compare how these two poems present the theme of nature.",
        "example_response": "The first poem is about a forest and the writer describes the trees and animals. The second poem is about the sea and the writer describes the waves.",
        "common_errors": [
          "Writing about each text in turn rather than comparing them",
          "Comparing only subject matter without considering technique"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Makes basic comparisons between texts, identifying similarities and differences in theme, character or setting, with some use of comparative language.",
        "example_task": "Compare how two stories you have read present a coming-of-age experience.",
        "example_response": "Both stories are about young characters learning something important. In the first story, the character learns through a painful experience -- losing a friend. In the second story, the character learns through a positive experience -- travelling to a new place. Both characters change by the end but in different ways: the first becomes more cautious while the second becomes more confident. However, both stories use first-person narration to show the character's inner thoughts.",
        "common_errors": [
          "Making only surface-level comparisons (both are about X) without analysing technique",
          "Not using comparative discourse markers consistently"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Develops integrated comparisons that address theme, technique and effect simultaneously, using comparative discourse markers fluently and supporting points with evidence from both texts.",
        "example_task": "Compare how Dickens in 'A Christmas Carol' and Priestley in 'An Inspector Calls' present the theme of social responsibility.",
        "example_response": "Both Dickens and Priestley argue that the wealthy have a moral obligation to the poor, but they use different dramatic strategies to make this argument. Dickens uses supernatural intervention: Scrooge must be shown, through ghostly visions, the human cost of his selfishness before he can change. The transformation is individual -- one man's conscience is awakened. Priestley, by contrast, uses a detective structure: the Inspector systematically exposes each family member's complicity in Eva Smith's death, creating a collective guilt. While Dickens's argument is 'look at the consequences of your personal cruelty', Priestley's is 'you are all responsible for the society you create'. Dickens offers redemption (Scrooge changes and is forgiven); Priestley withholds it (the Birlings learn nothing, and the Inspector's final speech warns of 'fire and blood and anguish'). The difference reflects their historical contexts: Dickens in 1843 believed in individual moral reform; Priestley in 1945, writing after two world wars, demanded systemic political change.",
        "common_errors": [
          "Comparing content without comparing technique and approach",
          "Not connecting the comparison to the writers' different contexts and purposes"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Constructs sophisticated comparative arguments that evaluate how different texts address shared concerns through fundamentally different artistic strategies, and reflects on what the comparison reveals about literature itself.",
        "example_task": "Compare how a prose fiction writer and a poet address the same human experience, and argue what the comparison reveals about the difference between prose and poetry as forms.",
        "example_response": "Wilfred Owen's poem 'Dulce et Decorum Est' and Sebastian Faulks's novel 'Birdsong' both depict the horror of World War I trench warfare, but the formal differences between poetry and prose produce fundamentally different kinds of truth. Owen's poem compresses the experience into 28 lines: the gas attack is rendered through a sequence of precise, visceral images ('guttering, choking, drowning') that assault the reader with the same relentlessness as the gas itself. The poem's power lies in its compression -- it does not explain or contextualise, it confronts. Faulks's novel, by contrast, uses the expansiveness of prose to build a world around the horror: the reader knows Stephen Wraysford's pre-war life, his love affair, his inner psychology. When the tunnelling collapse comes, it is devastating not because of its imagery alone but because we have invested hundreds of pages in this character. Poetry creates truth through intensity and compression; prose creates truth through accumulation and immersion. Owen makes you flinch; Faulks makes you grieve. The comparison suggests that the question 'which is the better war text?' is wrong -- poetry and prose do different work on the reader, and the fullest understanding comes from reading both.",
        "common_errors": [
          "Comparing the texts without reaching a conclusion about what prose and poetry do differently",
          "Treating the comparison as an evaluation (which is better) rather than an analysis of different formal capacities"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C027",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "May have read multiple works by the same author but does not consider how they connect in terms of style, theme or development.",
        "example_task": "You have read two books by the same author. Did you notice anything similar about them?",
        "example_response": "They were both good. The second one was longer. I think they had similar characters.",
        "common_errors": [
          "Not noticing recurring themes, styles or preoccupations across an author's work",
          "Treating each book as entirely separate rather than part of an author's body of work"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifies recurring themes, character types or stylistic features across two or more works by the same author.",
        "example_task": "What themes or techniques appear in more than one Roald Dahl story?",
        "example_response": "Dahl often writes about children who are mistreated by adults and who find clever ways to get revenge or escape. In 'Matilda', Matilda is neglected by her parents but uses her intelligence. In 'James and the Giant Peach', James is abused by his aunts but escapes through magic. Dahl also uses dark humour -- terrible things happen but they are described in a funny way. His adult characters are often grotesque exaggerations.",
        "common_errors": [
          "Noting surface similarities without considering why the author returns to these themes",
          "Not using examples from specific texts to support observations"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses how studying multiple works by the same author deepens understanding of their style, preoccupations and development, supporting observations with detailed textual evidence.",
        "example_task": "How does studying multiple Shakespeare plays deepen your understanding of how he explores the theme of power?",
        "example_response": "Across 'Macbeth', 'The Tempest' and 'Julius Caesar', Shakespeare explores different dimensions of power. In 'Macbeth', power is seized illegitimately through violence, and the play argues it corrupts and destroys the usurper. In 'Julius Caesar', power is removed through assassination, and the play shows how the power vacuum is more dangerous than the original ruler. In 'The Tempest', power is relinquished voluntarily: Prospero breaks his staff and drowns his book, choosing to give up magic. Studying all three reveals that Shakespeare is not simply interested in power as a theme but in the specific mechanisms of how power is gained, held and lost -- and the moral consequences of each. His recurring preoccupation suggests he sees power as the central question of both politics and human nature.",
        "common_errors": [
          "Discussing each text separately rather than building a comparative argument across them",
          "Not considering how the author's treatment of a theme develops or changes across works"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluates an author's body of work as a developing artistic project, understanding how their style, concerns and technique evolve, and situating their work within broader literary and historical contexts.",
        "example_task": "Argue that studying an author in depth reveals something that reading a single text cannot.",
        "example_response": "Reading a single Dickens novel reveals a great storyteller. Reading several reveals a systematic social critic whose artistic choices serve a political project. 'Oliver Twist' (1837) exposes the workhouse system through a child victim; 'Bleak House' (1853) exposes the legal system through a labyrinthine plot that mirrors its subject; 'Great Expectations' (1861) exposes class aspiration through a first-person narrator whose self-deception the reader must see through. Each novel uses a different narrative technique to expose a different institution, but the underlying argument -- that Victorian social systems crush individual humanity -- is consistent. What changes across the career is sophistication: the early novels use sentimental characterisation (Oliver as innocent victim) while the late novels use moral ambiguity (Pip as complicit beneficiary of exploitation). Studying Dickens in depth reveals that his artistic development is also a political development: he moves from asking 'look how terrible this is' to asking 'how are you complicit in this?' This progression from sympathy to complicity is invisible in any single novel.",
        "common_errors": [
          "Describing the author's career chronologically without building an argument about development",
          "Not showing how in-depth study produces insights unavailable from a single text"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C078",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Reads only when required to and does not choose to read independently for enjoyment.",
        "example_task": "Do you read outside of school? If not, what would make you want to?",
        "example_response": "Not really. I would read more if there were books about things I am interested in.",
        "common_errors": [
          "Associating reading exclusively with schoolwork rather than personal enjoyment",
          "Not having explored enough genres to find one they enjoy"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Reads for pleasure occasionally, typically within a narrow range of preferred genres, and can articulate what they enjoy about reading.",
        "example_task": "Tell me about a book you read recently for pleasure. What did you enjoy about it?",
        "example_response": "I read a thriller over the holidays. I enjoyed it because it was fast-paced and I could not stop turning the pages. The chapters were short which made it easy to keep reading. I liked trying to guess what would happen next.",
        "common_errors": [
          "Reading only within one genre and not being willing to experiment",
          "Describing enjoyment in terms of ease ('it was easy to read') rather than engagement"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Reads widely and frequently for pleasure across different genres and forms, and can reflect on what different types of reading offer them.",
        "example_task": "How has your reading for pleasure changed over the last year? What do you enjoy reading now that you did not before?",
        "example_response": "A year ago I only read fantasy novels. Now I also read historical fiction and I have started reading some poetry. I found that historical fiction gives me something fantasy does not -- a connection to real events and the feeling that I am learning something true about the past while being entertained. Poetry is different again -- I read it more slowly and I enjoy the way a single poem can make me think for hours. My reading for pleasure has become wider because my teacher recommended books I would not have chosen myself, and most of them turned out to be excellent.",
        "common_errors": [
          "Describing what they read without reflecting on what different types of reading provide",
          "Not recognising that reading tastes should develop and broaden over time"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Has a rich and self-directed reading life, reads for both pleasure and intellectual stimulation, and understands reading as a lifelong practice that shapes thinking and identity.",
        "example_task": "How has reading shaped who you are? What would be different about you if you did not read?",
        "example_response": "Reading has given me access to experiences I could never have in one lifetime. Through fiction, I have understood what it feels like to be a refugee, a soldier, a person facing racial prejudice, a Victorian governess. Each perspective has expanded my empathy and challenged my assumptions. Reading has also shaped how I think: I notice patterns, question claims, and look for evidence because years of close reading have trained me to do so. Without reading, I would have a narrower understanding of the world and fewer ways of thinking about problems. I would probably also have less patience -- reading difficult texts has taught me that meaning sometimes requires sustained effort and that the reward is proportional to the investment. Reading is not just something I do; it is part of how I think.",
        "common_errors": [
          "Making vague claims about reading being 'important' without personal, specific reflection",
          "Focusing only on the content of books rather than on the process and habit of reading"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C079",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Has limited awareness of the English literary heritage and may not understand what 'literary heritage' means.",
        "example_task": "Can you name three important writers from the English literary tradition?",
        "example_response": "Shakespeare. I think Dickens wrote books. I am not sure of a third one.",
        "common_errors": [
          "Knowing only one or two canonical authors",
          "Not understanding why some texts are considered part of a literary heritage"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Recognises key authors and works from the English literary heritage and understands that certain texts are considered important because of their influence and quality.",
        "example_task": "Why do you think schools still teach Shakespeare hundreds of years after he wrote his plays?",
        "example_response": "Schools teach Shakespeare because his plays explore themes that are still relevant, like love, jealousy, power and ambition. He also invented many words and phrases we still use. His plays are considered some of the best ever written in the English language and they have influenced many other writers and artists.",
        "common_errors": [
          "Accepting canonical status without critical thought ('they are taught because they are good')",
          "Not considering that literary heritage is constructed and can be questioned"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Engages critically with the English literary heritage, understanding how canonical texts have shaped the tradition and how the canon itself has been constructed and contested.",
        "example_task": "What does the term 'literary canon' mean, and why might some people argue it needs to change?",
        "example_response": "The literary canon is the collection of texts considered the most important and valuable in a literary tradition. In English literature, this has traditionally included Shakespeare, Austen, Dickens, the Romantic poets, the Brontes and other predominantly white, male, British writers. Critics argue the canon needs to change because it reflects the values and power structures of the people who created it -- historically, university-educated white men. This means that writers from working-class backgrounds, women writers, Black and Asian writers, and writers from former colonies have been systematically undervalued. Expanding the canon does not mean removing Shakespeare; it means recognising that literary quality is not confined to one tradition. A wider canon gives readers more perspectives, challenges assumptions, and produces a richer understanding of what literature can be.",
        "common_errors": [
          "Defending or attacking the canon without nuance or evidence",
          "Assuming that 'heritage' means 'old' rather than recognising it as an evolving tradition"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluates the literary heritage as both a resource and a cultural construction, understanding how engagement with canonical and non-canonical texts together produces a richer and more critically aware reading practice.",
        "example_task": "Argue that reading canonical literature alongside non-canonical literature produces a richer understanding than reading either alone.",
        "example_response": "Reading Jean Rhys's 'Wide Sargasso Sea' (non-canonical, 1966) alongside Charlotte Bronte's 'Jane Eyre' (canonical, 1847) demonstrates why both kinds of text are necessary. 'Jane Eyre' is a masterpiece of first-person narration that invites total identification with its protagonist -- but it renders Bertha Mason, the 'madwoman in the attic', as a voiceless figure of horror. Rhys's novel gives Bertha her voice, her history and her humanity, revealing that Bronte's canonical masterpiece depends on silencing a Caribbean woman to tell a white woman's story. Reading Rhys alone would be politically aware but artistically thin -- the novel's power comes from its dialogue with Bronte. Reading Bronte alone would be artistically rich but critically incomplete -- the reader would never question whose voice is missing. Together, the two texts create a conversation about power, perspective and whose stories get told. This is what literary heritage should be: not a fixed list of great books, but an ongoing argument about how we read, who we listen to, and what we consider worthy of attention.",
        "common_errors": [
          "Arguing for one side (canonical or non-canonical) without showing how both together are more valuable",
          "Not grounding the argument in specific textual analysis"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C080",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Gives up when a text becomes difficult, interpreting struggle as a sign that the text is too hard or not worth reading.",
        "example_task": "What do you do when you find a text really difficult to understand?",
        "example_response": "I stop reading. If I cannot understand it, it is probably too hard for me.",
        "common_errors": [
          "Equating difficulty with impossibility",
          "Not having strategies for dealing with challenging texts"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Persists with difficult texts when encouraged, using basic strategies like re-reading and asking for help, though may become frustrated.",
        "example_task": "This extract is from a Victorian novel and uses unfamiliar vocabulary. Read it twice and tell me what you understand after the second reading.",
        "example_response": "On first reading I was confused by the long sentences and some of the words. On second reading I understood more because I focused on the main point of each paragraph rather than trying to understand every word. I think the passage is about a character arriving in a new city and feeling overwhelmed. I still do not understand some vocabulary but I got the main idea.",
        "common_errors": [
          "Re-reading without a specific strategy or focus",
          "Becoming discouraged if the second reading does not resolve all confusion"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Approaches challenging texts with confidence and a range of strategies, understanding that difficulty is a normal part of reading demanding literature and that meaning builds through sustained engagement.",
        "example_task": "Read this challenging poem and describe your process for making sense of it.",
        "example_response": "First reading: I got a general impression of loss and regret but many specific images were unclear. Second reading: I focused on the speaker -- who is talking, to whom, and what is their attitude? I identified that the speaker is addressing someone who has died. Third reading: I focused on the imagery, particularly the repeated references to water (rain, river, tears) which form a semantic field connecting grief to natural cycles. I annotated unfamiliar phrases and used context to infer meaning. I still find the final stanza ambiguous -- it could mean acceptance or continued despair -- but I think the ambiguity is deliberate. Difficult poems are not puzzles with one answer; they are experiences that reward attention.",
        "common_errors": [
          "Expecting complete understanding after one or two readings",
          "Not tolerating ambiguity as a legitimate feature of literary texts"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Embraces textual difficulty as intellectually rewarding, understanding that the most challenging texts often yield the richest insights, and reflects on how struggling with difficult texts strengthens their reading abilities.",
        "example_task": "Reflect on a text you found very difficult. How did the difficulty itself contribute to your understanding?",
        "example_response": "When I first read Hopkins's 'The Windhover', I understood almost nothing. The compressed syntax, invented compound words ('dapple-dawn-drawn'), and unfamiliar metre defeated my usual reading strategies. But the difficulty was productive: because I could not skim, I was forced to attend to every word. I spent an hour on 14 lines and emerged with a richer understanding of how language works than any 'easy' text has given me. The difficulty was not a barrier to meaning -- it was the meaning. Hopkins compresses language because his subject (the beauty and power of a kestrel in flight) exceeds ordinary expression. To understand the poem, I had to learn to read differently: slowly, attentively, accepting that meaning accumulates rather than arriving instantly. This experience has changed how I read all texts: I now trust that difficulty signals something worth understanding, and I have more patience with texts that resist easy interpretation.",
        "common_errors": [
          "Claiming difficulty was rewarding without explaining specifically what the struggle taught them",
          "Treating all difficulty as equally productive, not distinguishing between productive challenge and genuine inaccessibility"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C085",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Prefers short texts or extracts and finds sustaining attention through a whole book challenging.",
        "example_task": "Have you read a complete novel recently? What was your experience of reading it from start to finish?",
        "example_response": "I started one but I did not finish it. It was quite long and I got bored in the middle.",
        "common_errors": [
          "Giving up on books during slower sections without recognising that pacing is a deliberate technique",
          "Preferring short extracts because they require less sustained attention"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Reads complete novels, plays or longer texts when required, sustaining attention through the whole work with some effort.",
        "example_task": "Tell me about a novel you have finished this term. Was there a point where you found it difficult to continue? How did you get past it?",
        "example_response": "I finished 'Holes' by Louis Sachar. I found the middle section confusing because it kept jumping between time periods, but I kept reading because my teacher said it would make sense later. By the end, I understood how the different stories connected, which was satisfying. If I had stopped in the middle, I would have missed how everything came together.",
        "common_errors": [
          "Finishing books only when required rather than developing independent commitment",
          "Skipping sections rather than reading the complete text"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Reads complete novels, plays and longer texts independently, understanding that whole-text reading provides insights unavailable from extracts.",
        "example_task": "Why is it important to read whole books rather than just extracts? Give an example from a text you have read.",
        "example_response": "Extracts can show you a writer's style but they cannot show you how a narrative develops. In 'To Kill a Mockingbird', the trial of Tom Robinson is the most famous section, but reading the whole novel reveals that the trial is part of a larger coming-of-age story. Scout's experiences with Boo Radley, Mrs Dubose and Calpurnia all build towards her understanding of what courage and moral integrity mean. If you only read the trial extract, you would understand the racial injustice theme but miss the parallel narrative about Scout learning not to judge people by appearances. The ending -- when Scout finally meets Boo -- only has emotional power if you have read from the beginning. Whole-text reading allows you to trace character development, thematic development and structural choices that are invisible in extracts.",
        "common_errors": [
          "Arguing for whole-text reading without giving a specific example of what extracts miss",
          "Not recognising that reading complete texts builds analytical skills that transfer to other texts"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Chooses to read complete and demanding texts independently, sustaining engagement across complex, lengthy works and reflecting on how whole-text reading deepens critical understanding.",
        "example_task": "Describe the most challenging complete text you have read and explain what whole-text reading gave you that an extract could not.",
        "example_response": "The most challenging complete text I have read is 'Great Expectations'. It is over 400 pages, written in Victorian prose, and the plot is deliberately slow in places. What whole-text reading gave me was the experience of living with a character over time -- of watching Pip's self-deception unfold so gradually that I, like him, was complicit in it. The famous marsh opening only becomes fully meaningful when you reach the final chapter and Pip returns to the same place, transformed. Dickens's structural choice -- beginning and ending in the same location -- can only be appreciated by reading the whole novel. The slow middle sections, where Pip's life in London seems aimless, mirror his moral emptiness; the pacing is the argument. An extract of the Magwitch revelation scene would be dramatic, but without 300 pages of Pip's snobbery, the reader cannot feel the full weight of the moral reversal. Whole-text reading is not just about information -- it is about experiencing how time, development and structure create meaning.",
        "common_errors": [
          "Claiming whole-text reading is important without demonstrating specific insights it provided",
          "Not acknowledging the discipline required to sustain engagement with a long, complex text"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-KS3-C086",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Reads texts at surface level for plot and basic meaning without engaging in close analysis or deeper reflection.",
        "example_task": "What did you notice about the language in this passage?",
        "example_response": "The language was quite descriptive. There were some long words.",
        "common_errors": [
          "Reading for plot only without attending to how meaning is created",
          "Not annotating or responding actively to the text while reading"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Begins to read texts more closely, annotating key passages and noticing how writers use language and structure to create effects.",
        "example_task": "Annotate this passage, highlighting any words or phrases that stand out to you and explaining why.",
        "example_response": "I highlighted 'crept silently' because the alliteration of 'cr' sounds creates a sense of stealth and danger. I also highlighted the short sentence 'She stopped' because after several long sentences it creates a sudden pause that builds tension. The word 'devoured' to describe how the character reads a letter suggests desperation -- she does not just read it, she consumes it.",
        "common_errors": [
          "Highlighting large sections rather than selecting precise words and phrases",
          "Annotating only obvious features like similes and metaphors"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Reads in depth as standard practice, engaging closely with language, structure and theme, and building layered interpretations through annotation, discussion and reflection.",
        "example_task": "Choose a passage from a text you are studying and explain three layers of meaning you have found through close reading.",
        "example_response": "In the opening of 'Jane Eyre', Jane describes reading a book about birds while hiding behind a curtain: 'the words gave no sound of birds -- only Arctic landscapes, rock and ice.' Layer 1 (literal): Jane is reading a book with pictures of remote, cold landscapes. Layer 2 (psychological): the cold landscapes mirror Jane's emotional state -- she is an unloved, isolated child in a cold household. Layer 3 (structural): the bird imagery foreshadows the novel's central metaphor of freedom -- Jane is a trapped bird who will eventually fly. The curtain she hides behind is both a literal barrier and a symbol of her exclusion from the Reed family. Close reading reveals that Bronte packs the opening with images and symbols that the whole novel will develop.",
        "common_errors": [
          "Identifying layers of meaning without supporting each with textual evidence",
          "Not showing how close reading of one passage connects to the whole text"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Reads with the sustained depth and precision of an emerging literary critic, building complex interpretations that integrate language analysis, contextual understanding and thematic awareness.",
        "example_task": "Perform a close reading of a short passage (5-10 lines) and demonstrate how detailed analysis of language reveals the writer's larger concerns.",
        "example_response": "In 'Macbeth' Act 2 Scene 2, Macbeth says: 'Will all great Neptune's ocean wash this blood clean from my hand? No, this my hand will rather the multitudinous seas incarnadine, making the green one red.' Close reading reveals Shakespeare's argument about guilt in miniature. The question form ('Will...?') shows Macbeth seeking reassurance he knows he cannot find. 'Great Neptune's ocean' -- the entire ocean -- is inadequate for a single hand, establishing guilt as infinite compared to any possible cleansing. The answer ('No') is a single syllable of absolute certainty. Then the image reverses: instead of the ocean washing the blood, the blood will stain the ocean. 'Incarnadine' -- a Latinate, polysyllabic word meaning 'to make red' -- is immediately followed by the Anglo-Saxon monosyllables 'making the green one red', translating the elevated register into stark simplicity. This shift from Latin to Anglo-Saxon enacts the stripping away of Macbeth's rhetorical self-protection: he tries to intellectualise his guilt ('incarnadine') but the truth forces itself into plain English ('red'). In five lines, Shakespeare moves from question to answer, from hope to despair, from elevated diction to brutal plainness, and from the possibility of absolution to the certainty of permanent guilt.",
        "common_errors": [
          "Analysing the passage without connecting the close reading to the play's larger themes",
          "Not explaining the significance of register shifts and their effect on meaning"
        ]
      }
    ]
  }
]
