[
  {"concept_id":"EN-KS3-C060","levels":[{"level_number":1,"label":"emerging","description":"Uses informal speech patterns in all contexts, including formal ones, without recognising when Standard English is required.","example_task":"You are introducing a guest speaker at a school assembly. How would you speak?","example_response":"'So yeah, this is Mr Davis and he is like really good at science and stuff.'","common_errors":["Using fillers ('like', 'basically', 'literally') in formal spoken contexts","Not recognising the difference between casual conversation and formal speech"]},{"level_number":2,"label":"developing","description":"Recognises when Standard English is appropriate in speech and makes conscious efforts to use it, though may lapse into informal patterns under pressure.","example_task":"Present your findings to the class using Standard English. Avoid slang and fillers.","example_response":"'Our group found that the majority of students preferred longer break times. The survey showed that 72 per cent wanted a 20-minute break rather than a 15-minute one. We believe this is because... um... because students need time to relax between lessons.'","common_errors":["Sustaining Standard English in rehearsed sections but lapsing in spontaneous moments","Using Standard English vocabulary but with non-standard grammar ('we was')"]},{"level_number":3,"label":"secure","description":"Uses Standard English fluently and confidently in formal spoken contexts, adapting register, vocabulary and syntax to the formality of the situation.","example_task":"Deliver a two-minute speech to a panel of adults about an issue you care about, using Standard English throughout.","example_response":"[Delivers a speech with consistent Standard English grammar, formal vocabulary, clear sentence structure and no fillers. The register is appropriately formal without being stiff. The student adapts their level of formality to the audience, using slightly more accessible language than they would in writing while maintaining Standard English grammar throughout.]","common_errors":["Using Standard English but in a way that sounds scripted rather than natural","Not adjusting formality within the Standard English spectrum (e.g. being equally formal to a teacher and to a head of state)"]},{"level_number":4,"label":"mastery","description":"Speaks in Standard English with complete fluency across all formal contexts, code-switching naturally between Standard English and informal speech as context demands.","example_task":"Participate in a formal panel discussion with adults, maintaining Standard English while also being engaging and personable.","example_response":"[Participates in a formal discussion with assured, natural Standard English. Adapts vocabulary and register fluidly: uses precise formal terminology when making analytical points, shifts to slightly warmer register when responding to personal questions, but never drops below Standard English in grammar or vocabulary. Demonstrates that Standard English is not a constraint on personality but a medium through which personality can be expressed.]","common_errors":["Maintaining Standard English at the cost of warmth or engagement","Not recognising that fluent Standard English speakers still adapt their register within Standard English"]}]},
  {"concept_id":"EN-KS3-C063","levels":[{"level_number":1,"label":"emerging","description":"Does not distinguish between situations requiring formal and informal speech, using the same casual register everywhere.","example_task":"When might you need to speak formally? Give three examples.","example_response":"When you are in trouble. When there are important people around. Maybe in a meeting.","common_errors":["Associating formal speech only with negative situations (being in trouble, telling off)","Not recognising everyday formal contexts like class discussions or presentations"]},{"level_number":2,"label":"developing","description":"Identifies contexts where formal speech is appropriate and attempts to adjust register, though the adjustment may be inconsistent or self-conscious.","example_task":"You are in a job interview. The interviewer asks: 'Why should we hire you?' Respond formally.","example_response":"'I think I would be a good fit for this role because I am hardworking and I always try my best. I am also good at working in a team and I am reliable.'","common_errors":["Using formal vocabulary but retaining casual sentence structures","Being too stiff, losing personality in the attempt to be formal"]},{"level_number":3,"label":"secure","description":"Navigates formal spoken contexts with confidence, adjusting vocabulary, syntax, posture and delivery to match the formality of the occasion.","example_task":"Participate in a formal mock interview, adapting your speech to the professional context.","example_response":"[Performs well in a formal speaking context: makes eye contact, speaks clearly, uses complete sentences, deploys formal vocabulary naturally, avoids fillers, responds to unexpected questions with composure. The formality feels natural rather than performed.]","common_errors":["Achieving appropriate formality but losing authenticity","Not adapting non-verbal communication alongside verbal register"]},{"level_number":4,"label":"mastery","description":"Excels in formal spoken contexts, projecting authority, competence and engagement while maintaining appropriate register throughout extended interactions.","example_task":"Chair a formal meeting or discussion, managing contributions while maintaining register.","example_response":"[Chairs a meeting with authority: opens formally, manages turn-taking, summarises contributions accurately, moves the discussion forward, and closes with a clear summary. Throughout, the register is consistently formal but not rigid. Demonstrates that chairing requires both linguistic competence and interpersonal skill.]","common_errors":["Maintaining register but losing control of the meeting's structure","Focusing on formality at the expense of genuine engagement with contributors' ideas"]}]},
  {"concept_id":"EN-KS3-C064","levels":[{"level_number":1,"label":"emerging","description":"Uses informal speech without considering clarity, defaulting to slang, incomplete sentences and vague language.","example_task":"Explain to a classmate how to do a task they have missed.","example_response":"'So basically you just like do the thing where you read it and then answer the questions or whatever.'","common_errors":["Using vague language that fails to communicate clearly","Not recognising that informal speech still requires clarity"]},{"level_number":2,"label":"developing","description":"Speaks informally with reasonable clarity, communicating meaning effectively while maintaining a relaxed register.","example_task":"Explain to a classmate what happened in the lesson they missed.","example_response":"'We read a poem about war and we had to analyse how the poet creates tension. Miss asked us to find three techniques and write about their effects. It is due tomorrow.'","common_errors":["Being clear but not engaging -- communicating information without making it interesting","Using informal register as an excuse for imprecise language"]},{"level_number":3,"label":"secure","description":"Speaks informally with clarity, precision and engaging expression, understanding that informal speech can be articulate and effective without being formal.","example_task":"Describe a complex idea to a friend in an engaging, informal way.","example_response":"[Explains a complex idea (e.g. dramatic irony, the water cycle, the causes of WWI) in informal, accessible language that is nonetheless precise and well-organised. Uses analogy, humour and concrete examples to make the idea vivid. Demonstrates that informality and intelligence are not opposites.]","common_errors":["Simplifying ideas rather than making complex ideas accessible","Losing precision in the pursuit of informality"]},{"level_number":4,"label":"mastery","description":"Uses informal speech as a skilled communicator, calibrating informality precisely to context, relationship and purpose, and understanding that effective informal speech is a sophisticated skill.","example_task":"Explain why informal speech is a skill, not just the absence of formality.","example_response":"[Articulates that informal speech requires awareness of audience, relationship dynamics, cultural norms and the specific informality expected in each context. A student speaking to a teacher informally deploys a different informality from speaking to a friend. Informal speech with a younger child requires accessible vocabulary; informal speech with peers may include shared references and in-group language. The student demonstrates that skilled informality is not laziness but calibration.]","common_errors":["Treating all informal contexts as identical","Not recognising that informality has its own rules and conventions"]}]},
  {"concept_id":"EN-KS3-C065","levels":[{"level_number":1,"label":"emerging","description":"Speaks without clear structure, wandering between points and losing the audience's attention.","example_task":"Give a one-minute talk about a topic you know well.","example_response":"[Begins with the topic but quickly digresses, includes irrelevant details, does not signal when moving between points, and ends abruptly without a conclusion.]","common_errors":["Not planning spoken contributions in advance","Lacking a clear beginning, middle or end"]},{"level_number":2,"label":"developing","description":"Organises speeches and presentations with a recognisable structure (introduction, body, conclusion) and signals transitions between points.","example_task":"Give a two-minute presentation with a clear introduction, three points and a conclusion.","example_response":"[Delivers a structured presentation with: an opening that states the topic, three points each introduced with a signpost ('First...', 'Second...', 'Finally...'), and a conclusion that summarises. The structure is clear but may be formulaic.]","common_errors":["Using rigid signposting that sounds mechanical ('My first point is...')", "Structuring the presentation but not pacing it for audience engagement"]},{"level_number":3,"label":"secure","description":"Structures speeches and presentations with skill, using varied organisational strategies and pacing content for maximum impact.","example_task":"Deliver a three-minute speech that builds to a powerful conclusion.","example_response":"[Delivers a speech where the structure serves the argument: opens with an anecdote or provocative question rather than a statement, builds through evidence and analysis, and arrives at a conclusion that feels inevitable rather than tacked on. The pacing varies -- some sections are delivered quickly for energy, others slowly for emphasis.]","common_errors":["Using structural variety for its own sake rather than to serve the argument","Not adapting structure to the specific purpose and audience"]},{"level_number":4,"label":"mastery","description":"Structures spoken presentations as purposefully as the best written arguments, using organisational strategies that shape the audience's understanding and emotional response.","example_task":"Deliver a speech where the structure itself makes an argument (e.g. circular structure, delayed thesis, problem-solution).","example_response":"[Delivers a speech with a sophisticated structure: perhaps begins with a question, explores it from multiple angles with building complexity, and returns to the opening question with a transformed understanding. The structure mirrors the argument -- the audience's journey through the speech replicates the journey the speaker wants them to take intellectually.]","common_errors":["Using sophisticated structures that confuse rather than enlighten the audience","Not ensuring that structural sophistication serves clarity"]}]},
  {"concept_id":"EN-KS3-C066","levels":[{"level_number":1,"label":"emerging","description":"Struggles to express ideas clearly in speech, using vague language, false starts and incomplete sentences.","example_task":"Explain your opinion on a topic and give one reason for it.","example_response":"'I think it is like... I mean... it is sort of not fair because... well, people should not do that kind of thing.'","common_errors":["Starting sentences without knowing how they will end","Using vague pronouns ('it', 'that', 'they') without making clear what they refer to"]},{"level_number":2,"label":"developing","description":"Expresses ideas with reasonable clarity, using complete sentences and specific vocabulary, though may struggle with more complex ideas.","example_task":"Explain why a character's decision is important to the plot of the novel.","example_response":"'The character's decision to leave home is important because it starts the main conflict of the story. Without this decision, the character would never meet the antagonist and the plot would not develop.'","common_errors":["Expressing simple ideas clearly but becoming unclear with complex ones","Not providing enough detail or explanation to make the point fully clear"]},{"level_number":3,"label":"secure","description":"Expresses complex ideas clearly and concisely in speech, using precise vocabulary and well-constructed sentences that communicate meaning effectively.","example_task":"Explain a complex literary concept (such as dramatic irony) to someone who has not heard the term before.","example_response":"[Explains the concept with clarity and precision: defines it, gives a concrete example from a text the audience knows, and explains why it matters to the reader's experience. Uses analogy if helpful. The explanation is clear enough for a non-specialist to understand but precise enough that a specialist would recognise it as accurate.]","common_errors":["Being precise at the cost of accessibility, or accessible at the cost of precision","Not checking understanding or adapting explanation when the audience looks confused"]},{"level_number":4,"label":"mastery","description":"Articulates ideas with the clarity and precision of a skilled communicator, adapting explanation to audience and context in real time.","example_task":"Explain a complex idea to two different audiences: first to a peer who knows the subject, then to a younger student who does not.","example_response":"[Explains the same idea twice with fundamentally different approaches. To the peer: uses precise terminology, assumes shared knowledge, focuses on nuance and interpretation. To the younger student: uses concrete examples, simpler vocabulary, analogies from everyday life, and checks understanding. Demonstrates that clear communication is not a fixed skill but an adaptive one.]","common_errors":["Using the same explanation regardless of audience","Talking down to less experienced audiences rather than making ideas genuinely accessible"]}]},
  {"concept_id":"EN-KS3-C067","levels":[{"level_number":1,"label":"emerging","description":"Digresses frequently during speeches and presentations, losing the audience's attention and the thread of the argument.","example_task":"Give a one-minute talk without going off topic.","example_response":"[Begins on topic but within 20 seconds introduces a tangent that leads to a further tangent. The original point is not returned to.]","common_errors":["Not recognising when they have left the topic","Including interesting but irrelevant information"]},{"level_number":2,"label":"developing","description":"Stays mostly on topic during speeches with occasional digressions, and can return to the main point when prompted.","example_task":"Give a two-minute talk. If you notice yourself going off topic, bring yourself back.","example_response":"[Stays on topic for most of the talk. One digression occurs but the student self-corrects: 'Actually, what I really want to say is...' Returns to the main point and concludes on topic.]","common_errors":["Self-correcting after digression but losing time and momentum","Not distinguishing between relevant supporting detail and irrelevant tangents"]},{"level_number":3,"label":"secure","description":"Maintains clear focus throughout speeches and presentations, making every point relevant to the central argument and cutting tangents before they develop.","example_task":"Deliver a three-minute speech on a topic you are passionate about without any digressions.","example_response":"[Delivers a focused, purposeful speech where every sentence advances the argument. Supporting examples are chosen for relevance and disposed of efficiently. The speech has a sense of discipline and direction that builds the audience's confidence in the speaker.]","common_errors":["Maintaining focus at the cost of engagement (too rigid and dry)","Not recognising that brief, purposeful digressions can enhance a speech if they serve the argument"]},{"level_number":4,"label":"mastery","description":"Controls focus with the skill of an experienced speaker, knowing when to stay tightly on topic and when a strategic aside can enhance the argument.","example_task":"Deliver a speech that includes one deliberate aside or anecdote that enhances rather than distracts from the argument.","example_response":"[Delivers a speech with clear focus throughout. Includes one deliberate aside (an anecdote, an analogy, a moment of humour) that appears to be a digression but actually illuminates the central argument from an unexpected angle. The speaker returns to the main thread seamlessly. The aside strengthens the speech because it provides a moment of variety and human connection within a focused argument.]","common_errors":["Including asides that genuinely are digressions rather than strategic enhancements","Not returning to the main argument quickly enough after an aside"]}]},
  {"concept_id":"EN-KS3-C068","levels":[{"level_number":1,"label":"emerging","description":"Participates in debate reluctantly or chaotically, making assertions without evidence or repeating the same point.","example_task":"Debate whether homework should be abolished. You are arguing in favour.","example_response":"'Homework should be abolished because it is boring and unfair. Everyone hates it. It is just boring.'","common_errors":["Repeating assertions without developing them","Not anticipating or responding to the opposing argument"]},{"level_number":2,"label":"developing","description":"Participates in formal debates with some structure, presenting claims with evidence and attempting to address opposing arguments.","example_task":"Present a two-minute argument in a formal debate, including evidence and a response to the opposition.","example_response":"[Presents an argument with claims supported by at least one piece of evidence. Acknowledges a counter-argument ('Some people say... however...'). Maintains formal register for most of the speech. May not fully rebut the counter-argument.]","common_errors":["Presenting arguments in random order rather than building strategically","Acknowledging counter-arguments without effectively rebutting them"]},{"level_number":3,"label":"secure","description":"Debates formally with skill, building structured arguments, rebutting opposition points effectively, and adapting to the debate's development in real time.","example_task":"Participate in a full debate, including opening statement, rebuttal and closing summary.","example_response":"[Delivers a structured opening argument with three clear points. During rebuttal, responds directly to specific points made by the opposition rather than repeating the original argument. Closing summary synthesises the debate rather than simply restating the opening position. Adapts to unexpected arguments from the opposition with composure.]","common_errors":["Preparing a strong opening but being unable to rebut in real time","Closing with a summary that does not account for what happened during the debate"]},{"level_number":4,"label":"mastery","description":"Debates with authority and strategic skill, using rhetorical technique, evidence and persuasive delivery to build a compelling case while engaging genuinely with opposing arguments.","example_task":"Lead a debate team, coordinating arguments across speakers and responding to the strongest opposition points.","example_response":"[Coordinates a team debate where arguments are distributed strategically across speakers, each building on the previous one. Anticipates the strongest opposition points and prepares rebuttals in advance. Deploys rhetorical techniques (anaphora, tricolon, strategic concession) for maximum persuasive impact. Engages with the opposition's strongest points rather than attacking their weakest ones, demonstrating intellectual confidence.]","common_errors":["Focusing on winning the debate rather than engaging genuinely with the ideas","Using rhetoric to obscure rather than illuminate"]}]},
  {"concept_id":"EN-KS3-C069","levels":[{"level_number":1,"label":"emerging","description":"Participates minimally in discussions, either remaining silent or making brief, undeveloped contributions.","example_task":"Share your view on this topic with the group.","example_response":"'I agree with what they said.'","common_errors":["Not developing contributions beyond agreement or disagreement","Waiting to be asked rather than volunteering ideas"]},{"level_number":2,"label":"developing","description":"Contributes to discussions with developed points, responding to others' ideas and asking clarifying questions.","example_task":"In this discussion, make at least two contributions that respond to what someone else has said.","example_response":"'I agree with Alex's point about the character being selfish, but I think the writer also wants us to feel sorry for them. In chapter 3, the narrator describes their childhood, which suggests their selfishness comes from insecurity rather than cruelty. What do others think -- is the character more selfish or more scared?'","common_errors":["Responding to others but not building on their ideas","Asking questions that are not genuinely exploratory"]},{"level_number":3,"label":"secure","description":"Contributes effectively to structured discussions, building on others' ideas, introducing new perspectives, and helping to develop the discussion's intellectual direction.","example_task":"Participate in a Socratic seminar about a text you have studied.","example_response":"[Makes multiple contributions that demonstrate active listening, intellectual engagement and collaborative thinking. Builds on others' points ('Building on what Sarah said, I think the evidence also suggests...'), introduces new evidence to test existing ideas, asks probing questions ('If we accept that reading, how do we explain the ending?'), and helps the group reach a more nuanced understanding than any individual could reach alone.]","common_errors":["Contributing individually strong points without connecting them to the group's developing argument","Dominating the discussion rather than facilitating it"]},{"level_number":4,"label":"mastery","description":"Leads and enriches discussions with intellectual generosity, drawing out quieter voices, synthesising diverse contributions and advancing the group's collective understanding.","example_task":"Lead a discussion that helps the group reach a more sophisticated understanding of a text.","example_response":"[Leads the discussion by asking open questions that generate genuine debate, summarising where the group has reached ('So we seem to agree that... but we are still divided on...'), drawing in quieter participants ('Maya, you mentioned something interesting earlier -- could you develop that?'), and introducing challenging perspectives that push the group beyond easy consensus. The discussion ends with a more sophisticated collective understanding than where it began.]","common_errors":["Leading in a way that directs the group towards a predetermined conclusion","Not genuinely listening to contributions that challenge their own view"]}]},
  {"concept_id":"EN-KS3-C070","levels":[{"level_number":1,"label":"emerging","description":"Struggles to summarise what others have said, either repeating their exact words or misrepresenting their point.","example_task":"Summarise what your partner just said in one sentence.","example_response":"'They said the poem is about nature or something.'","common_errors":["Paraphrasing so loosely that the original point is lost","Not listening carefully enough to summarise accurately"]},{"level_number":2,"label":"developing","description":"Summarises others' spoken contributions with reasonable accuracy, capturing the main point if not the nuance.","example_task":"Listen to this discussion and summarise the two main positions that have been expressed.","example_response":"'The first position is that the character is a villain because they deliberately cause harm. The second position is that the character is a victim of circumstances and does not have real choices.'","common_errors":["Capturing the positions but missing the reasoning behind them","Summarising in a way that oversimplifies the original contribution"]},{"level_number":3,"label":"secure","description":"Summarises spoken contributions accurately and concisely, capturing both the position and the reasoning, and using the summary to advance the discussion.","example_task":"Summarise the discussion so far and identify the key point of disagreement.","example_response":"[Provides an accurate summary: 'We have discussed three aspects of the poem: the imagery, the form and the speaker's tone. There is broad agreement that the imagery creates a sense of loss, but we disagree about whether the tone is angry or resigned. The key evidence on both sides is the final stanza, which Alex reads as a demand for justice and which I read as acceptance.' The summary moves the discussion forward by identifying what still needs to be resolved.]","common_errors":["Summarising accurately but not using the summary to advance the discussion","Giving equal weight to all contributions rather than identifying the most important points"]},{"level_number":4,"label":"mastery","description":"Summarises with precision and insight, capturing not just what was said but what was implied, and using summaries strategically to clarify, challenge or redirect discussion.","example_task":"Use a summary of the discussion so far to redirect it towards a point that has been overlooked.","example_response":"[Provides a summary that is both accurate and strategic: 'We have spent most of our time discussing what the character does and why, but I notice we have not discussed how the writer wants us to respond. Every interpretation so far assumes the writer wants us to sympathise with the character, but what if the writer deliberately creates an unsympathetic character to make a different kind of argument?' The summary identifies an assumption the group has been operating under and opens a new direction.]","common_errors":["Using summaries to impose their own view rather than to genuinely redirect","Summarising selectively to exclude contributions they disagree with"]}]},
  {"concept_id":"EN-KS3-C071","levels":[{"level_number":1,"label":"emerging","description":"Listens to others but does not engage with their ideas, either waiting for a gap to make their own point or simply agreeing.","example_task":"Respond to your partner's idea by building on it or challenging it.","example_response":"'Yeah, I agree. And also, I think something completely different...' [Changes the subject entirely.]","common_errors":["Pretending to respond to others' ideas while actually introducing an unrelated point","Not distinguishing between building on an idea and changing the topic"]},{"level_number":2,"label":"developing","description":"Responds to others' ideas with some genuine engagement, extending or qualifying what has been said.","example_task":"In this discussion, develop someone else's idea further.","example_response":"'I think what Sarah said about the character being lonely is right, and I want to add that the setting reinforces this. The writer puts the character in an empty house with 'silence pressing on the walls', which makes the loneliness physical as well as emotional.'","common_errors":["Building on ideas at a surface level rather than adding genuine analytical depth","Only building on ideas they agree with, not engaging with challenging ones"]},{"level_number":3,"label":"secure","description":"Engages substantively with others' ideas, extending, challenging, qualifying and developing them to advance collective understanding.","example_task":"Respond to an idea you disagree with by explaining what is valuable about it and then challenging it constructively.","example_response":"[Acknowledges the value in the other person's point before challenging it: 'I can see why you read the ending as hopeful -- the sun breaking through is a conventional symbol of new beginnings. But I think the context undermines that reading: the sun appears just as the character has lost everything, which could be ironic rather than optimistic. What if the writer is using the conventional symbol to highlight how empty conventional comfort is?' This response validates the original idea while offering a substantive challenge.]","common_errors":["Challenging ideas dismissively rather than constructively","Building on others' ideas but not giving credit"]},{"level_number":4,"label":"mastery","description":"Develops others' ideas with generosity and insight, synthesising multiple contributions into new understanding and demonstrating that the best thinking is collaborative.","example_task":"Take two different ideas from the discussion and synthesise them into a new insight that neither alone could produce.","example_response":"[Synthesises: 'Alex argued that the character is driven by guilt, and Maya argued that the character is driven by ambition. I want to suggest these are not contradictory -- in fact, the character's ambition IS a form of guilt. They drive themselves relentlessly because they feel guilty about their privilege, and achievement is their way of proving they deserve what they have. This reading explains both the determination Alex noticed and the self-punishment Maya identified.' The synthesis creates a new understanding from the combination of two separate insights.]","common_errors":["Synthesising superficially by simply combining two ideas rather than creating genuine new understanding","Not acknowledging the original contributors whose ideas the synthesis builds on"]}]},
  {"concept_id":"EN-KS3-C072","levels":[{"level_number":1,"label":"emerging","description":"Finds improvisation difficult and tends to freeze, repeat others' ideas, or break character quickly.","example_task":"Improvise a scene where a shopkeeper discovers a customer has been stealing.","example_response":"[Stands awkwardly, says 'Um, you stole something?' in their own voice rather than a character's, and quickly breaks off.]","common_errors":["Breaking character immediately when uncertain","Not committing to the improvised scenario"]},{"level_number":2,"label":"developing","description":"Engages with improvisation, sustaining a character and scenario for a short time and responding to partners' contributions.","example_task":"Improvise a two-minute scene in role. Stay in character and respond to what your partner says.","example_response":"[Stays in character for most of the scene, adopting a different voice or manner. Responds to the partner's dialogue rather than scripting the scene alone. May occasionally break character or lose direction.]","common_errors":["Trying to control the whole scene rather than responding to the partner","Falling back on stereotypes rather than creating a specific character"]},{"level_number":3,"label":"secure","description":"Improvises confidently, creating believable characters, sustaining scenarios, and using dramatic techniques such as tension, status shifts and subtext.","example_task":"Improvise a scene that includes a moment of dramatic tension where the audience knows something a character does not.","example_response":"[Creates a scene with genuine dramatic tension through improvisation. Uses subtext (what the character says is different from what they mean), physical action and pacing to build towards a reveal. Partners collaborate effectively, building on each other's contributions.]","common_errors":["Creating tension through melodrama rather than subtlety","Not trusting the partner to contribute to the dramatic development"]},{"level_number":4,"label":"mastery","description":"Improvises with creativity, skill and dramatic intelligence, creating scenes that explore complex ideas and emotions through spontaneous performance.","example_task":"Improvise a scene that explores a moral dilemma without resolving it neatly.","example_response":"[Creates a scene that genuinely explores moral complexity: two characters with competing legitimate claims, dialogue that reveals the difficulty of the situation without simplifying it, and an ending that leaves the audience thinking rather than satisfied. The improvisation demonstrates that drama can be a form of thinking -- a way of exploring ideas that cannot be resolved through argument alone.]","common_errors":["Resolving the dilemma too neatly rather than letting it remain complex","Using improvisation to be entertaining rather than to explore meaning"]}]},
  {"concept_id":"EN-KS3-C073","levels":[{"level_number":1,"label":"emerging","description":"Reads scripts aloud without rehearsing or considering how to perform them effectively.","example_task":"Rehearse this scene with your partner. Think about how you will deliver each line.","example_response":"[Reads lines directly from the script in a flat, unvaried tone without looking up or engaging with the partner.]","common_errors":["Treating rehearsal as simply reading through the script","Not considering how delivery affects meaning"]},{"level_number":2,"label":"developing","description":"Rehearses scripts with some attention to delivery, experimenting with tone, pace and emphasis to bring the text to life.","example_task":"Rehearse this scene three times, trying a different approach to the main character each time.","example_response":"[Tries the scene with the character angry, then sad, then sarcastic. Notices how the different interpretations change the meaning of the same words. Begins to make deliberate choices about delivery.]","common_errors":["Rehearsing only once rather than experimenting with different interpretations","Focusing on individual line delivery without considering the scene as a whole"]},{"level_number":3,"label":"secure","description":"Rehearses scripts purposefully, making and refining interpretive choices about character, pace, emphasis and staging, and using rehearsal to deepen understanding of the text.","example_task":"Rehearse this scene and make three specific directorial decisions about how it should be performed. Explain each decision.","example_response":"[Makes specific decisions: 'In this line, the character pauses before 'never' to show they are choosing the word carefully. In the second speech, I will speak more quickly to show the character's anxiety building. I will position the characters facing away from each other because the scene is about miscommunication -- they literally cannot see each other's faces.' Each decision is justified with reference to the text's meaning.]","common_errors":["Making directorial decisions without connecting them to the text's meaning","Rehearsing performance skills (volume, movement) without considering interpretation"]},{"level_number":4,"label":"mastery","description":"Uses rehearsal as a form of textual analysis, understanding that performing a text is interpreting it, and that the rehearsal process reveals dimensions of meaning that reading alone cannot access.","example_task":"After rehearsing a scene, explain what you discovered about the text through the process of performing it.","example_response":"[Reflects: 'Rehearsing Macbeth's dagger speech, I discovered that the line 'Come, let me clutch thee' is physically impossible to deliver without reaching out -- the imperative verb demands a physical action. When I reached and grasped nothing, I felt the character's desperation in my body, not just my mind. This is something reading cannot give you: the kinaesthetic experience of a character's state. I also discovered that the speech's rhythm changes after 'I have thee not, and yet I see thee still' -- the metre breaks, which I felt as a stumble in delivery. The break in metre IS the break in Macbeth's sanity. Rehearsal taught me that dramatic texts encode meaning in the body, not just on the page.']","common_errors":["Reflecting on the performance experience without connecting it to textual meaning","Not recognising that rehearsal is a form of analysis, not just preparation for performance"]}]},
  {"concept_id":"EN-KS3-C074","levels":[{"level_number":1,"label":"emerging","description":"Performs scripts and poetry by reading aloud in a flat, unexpressive manner without considering how delivery affects meaning.","example_task":"Perform this poem to the class.","example_response":"[Reads the poem in a monotone, without pauses, emphasis or variation in pace. Looks down at the text throughout.]","common_errors":["Reading rather than performing","Not varying tone, pace or volume"]},{"level_number":2,"label":"developing","description":"Performs with some expression, varying tone and pace and attempting to convey the mood and meaning of the text.","example_task":"Perform this dramatic speech, paying attention to how your delivery conveys the character's emotions.","example_response":"[Delivers the speech with some variation in tone and pace. Attempts to convey the character's emotions through vocal delivery. May look up from the text occasionally. The performance shows awareness of meaning but may be uneven.]","common_errors":["Over-acting (shouting for anger, whispering for sadness) rather than using subtle vocal variation","Performing the emotions without conveying the meaning of the words"]},{"level_number":3,"label":"secure","description":"Performs scripts and poetry with skill and sensitivity, using vocal and physical techniques to convey meaning, mood and character effectively.","example_task":"Perform a poem using vocal techniques to bring out its meaning. Consider pace, pause, emphasis, tone and volume.","example_response":"[Performs with skilled delivery: uses pause to create tension or allow images to land, varies pace to mirror the poem's rhythm, emphasises key words that carry the most meaning, modulates tone to reflect shifts in the speaker's attitude. The performance demonstrates genuine understanding of the text and makes meaning visible to the audience.]","common_errors":["Using vocal techniques for effect without grounding them in the text's meaning","Performing well technically but without emotional authenticity"]},{"level_number":4,"label":"mastery","description":"Performs with the skill and interpretive intelligence of a trained performer, making deliberate choices that create a specific reading of the text and communicate complex meaning to the audience.","example_task":"Perform the same poem twice with two different interpretations. Explain how your delivery choices created each interpretation.","example_response":"[Performs the poem twice: once as a lament (slow, measured, with long pauses and falling intonation) and once as an accusation (faster, with sharp emphasis, rising intonation and direct address to the audience). Explains: 'In the first reading, I used long pauses after each image to let the loss accumulate. In the second, I removed the pauses and directed the words at the audience because I wanted them to feel implicated. Both readings are supported by the text -- the ambiguity is in the poem, and performance choices resolve it temporarily in different directions.' The student demonstrates that performance is interpretation.]","common_errors":["Creating two performances that differ in energy but not in interpretation","Not being able to explain how specific delivery choices create different meanings"]}]},
  {"concept_id":"EN-KS3-C075","levels":[{"level_number":1,"label":"emerging","description":"Performs without awareness of how physical and vocal techniques affect the audience's experience.","example_task":"What techniques could you use to make your performance more engaging?","example_response":"I could speak louder. Maybe use some actions.","common_errors":["Knowing only volume as a variable","Not considering stillness, silence or subtlety as performance tools"]},{"level_number":2,"label":"developing","description":"Uses some performance techniques including changes in volume, pace, gesture and facial expression to enhance delivery.","example_task":"Perform this scene using at least three different performance techniques.","example_response":"[Uses: a change in volume (louder for the angry moment), a gesture (pointing to emphasise a demand), and a facial expression (surprise when receiving news). The techniques are visible and intentional but may not be fully integrated into the performance.]","common_errors":["Applying techniques mechanically rather than organically","Using too many techniques at once, creating a cluttered performance"]},{"level_number":3,"label":"secure","description":"Uses a range of performance techniques with control and purpose, understanding how intonation, tone, volume, pace, silence, stillness, gesture and movement create specific effects on the audience.","example_task":"Perform a speech using silence and stillness as deliberately as you use words and movement.","example_response":"[Delivers a performance where silence and stillness carry as much weight as speech and movement. A long pause before a key revelation builds anticipation; absolute stillness during a moment of shock communicates the character's internal state more effectively than any gesture could. The student demonstrates that what is withheld in performance can be more powerful than what is expressed.]","common_errors":["Using silence and stillness as techniques without understanding their specific effect","Not trusting that the audience can read subtlety"]},{"level_number":4,"label":"mastery","description":"Performs with the full range of theatrical techniques at their command, making sophisticated choices about when to use restraint and when to use intensity, and understanding how performance techniques serve the text's meaning.","example_task":"Perform a scene where you deliberately restrict your performance to one technique (e.g. only voice, no movement; or only movement, no voice). Explain what the restriction reveals.","example_response":"[Performs a scene using only voice (seated, eyes closed, no movement) and reflects: 'Removing physical performance forced the audience to listen to the language alone. Every word had to carry its own weight because gesture could not supplement it. I noticed that Shakespeare's iambic pentameter becomes physically audible when the body is still -- the rhythm does the work that movement usually does. The restriction revealed that the text itself is a performance: it does not need a body to be dramatic, but the body can either amplify or compete with it.' The student demonstrates that understanding performance technique includes understanding its limitations.]","common_errors":["Treating the restriction as a gimmick rather than as an analytical exercise","Not reflecting on what the restriction revealed about the relationship between text and performance"]}]},
  {"concept_id":"EN-KS3-C076","levels":[{"level_number":1,"label":"emerging","description":"Participates in drama activities without connecting them to language development.","example_task":"After this improvisation, write down three interesting words or phrases that came up during the scene.","example_response":"I cannot remember any. We were just acting.","common_errors":["Treating drama as separate from language learning","Not noticing the language generated during dramatic activity"]},{"level_number":2,"label":"developing","description":"Generates language through drama activities and can identify interesting vocabulary, phrases or ideas that emerged from the performance.","example_task":"Improvise a scene and then write a paragraph inspired by the language you used in the scene.","example_response":"[After improvising a scene about a farewell, writes a paragraph that incorporates language and ideas from the improvisation: the exact phrase 'I will be back before you know it' becomes the opening, and the emotional tone of the scene shapes the paragraph's mood.]","common_errors":["Using drama as a stimulus for writing but not transferring the specific language generated","Not recognising that spoken language generated in drama can be richer than written first drafts"]},{"level_number":3,"label":"secure","description":"Uses drama deliberately as a tool for generating language, understanding that embodied, collaborative performance produces vocabulary, phrases and ideas that solitary writing cannot.","example_task":"Use a drama activity (hot-seating, role play, freeze frame) to generate ideas and language for a piece of writing.","example_response":"[Uses hot-seating (answering questions in character) to explore a character's motivation before writing a monologue. The hot-seating produces specific language that the student incorporates: a phrase like 'I did not choose this -- it chose me' that emerged spontaneously in the dramatic context becomes the central idea of the written monologue. The student explains that the drama produced a more authentic voice than planning on paper could have.]","common_errors":["Using drama to generate plot ideas rather than language","Not transferring the spontaneous, authentic language from drama into writing"]},{"level_number":4,"label":"mastery","description":"Understands the relationship between embodied performance and language generation, using drama strategically as part of the writing process.","example_task":"Design a drama activity that would help a group of writers generate language for a specific writing task.","example_response":"[Designs a drama activity: 'To generate language for a descriptive piece about a war zone, I would use a soundscape activity where the group creates the sounds of a battlefield using only their voices. Each person adds one sound and sustains it -- distant artillery, whispering, running footsteps, a bird singing. Then, in the silence after the soundscape, each person writes for five minutes capturing the sensory experience in words. The embodied experience of creating and hearing the sounds produces more specific and vivid language than simply imagining the scene. The bird singing -- which someone added unexpectedly -- creates a contrast that no one would have planned but everyone will use.']","common_errors":["Designing drama activities that are engaging but do not generate transferable language","Not explaining how the embodied experience translates into written language"]}]},
  {"concept_id":"EN-KS3-C077","levels":[{"level_number":1,"label":"emerging","description":"Performs drama without reflecting on or discussing the language used in the performance.","example_task":"After performing this scene, discuss how the character's language reveals their personality.","example_response":"They sounded angry because they were shouting.","common_errors":["Discussing what characters did rather than what their language revealed","Confusing volume with linguistic analysis"]},{"level_number":2,"label":"developing","description":"Discusses the language used in dramatic performance with some analytical awareness, noticing how word choice, register and tone create character.","example_task":"After watching this scene performed, discuss how the language of the two characters differs and what this tells us about them.","example_response":"Character A uses formal language and complete sentences, which makes them seem educated and in control. Character B uses short, interrupted sentences and informal words, which makes them seem anxious and less confident. The language difference shows a power imbalance between them.","common_errors":["Describing the language without analysing what it reveals","Not considering how performance choices (delivery, pace, emphasis) affect how language is received"]},{"level_number":3,"label":"secure","description":"Uses dramatic performance as a basis for sophisticated discussion of how language works, analysing how performance reveals dimensions of language that reading alone does not.","example_task":"After performing and watching two different interpretations of the same scene, discuss how delivery changes the meaning of the language.","example_response":"[Analyses how the same words, delivered differently, create different meanings: 'When the line 'I am fine' was delivered quickly with a smile, it seemed genuine. When it was delivered slowly with a pause before 'fine' and averted eyes, it clearly meant the opposite. The words are identical but the performance creates subtext -- the gap between what is said and what is meant. This shows that in drama, meaning is not in the words alone but in the relationship between words and delivery. In written analysis, we can only discuss what the words mean; in performance analysis, we can discuss what the words do.']","common_errors":["Discussing performance without connecting it to language analysis","Treating performance and text as separate rather than as interacting systems of meaning"]},{"level_number":4,"label":"mastery","description":"Uses drama as a sophisticated analytical tool for understanding how language creates meaning, discussing performance and text as interrelated systems.","example_task":"Argue that performing a text is a form of literary criticism.","example_response":"[Argues that every performance choice is an interpretive decision: choosing to emphasise a particular word is equivalent to highlighting a quotation in an essay; choosing a fast or slow pace is equivalent to arguing that a passage conveys urgency or contemplation. The performer-critic makes visible what the reader-critic describes. The advantage of performance as criticism is that it operates on the audience's body (creating physical responses like tension, laughter, discomfort) as well as their mind. The student demonstrates that the discussion of drama-as-language-analysis connects performance studies and literary criticism.]","common_errors":["Making the argument abstractly without grounding it in specific examples from performance","Not recognising the limitations of performance as criticism (e.g. it cannot make the kind of comparative or contextual arguments that written criticism can)"]}]},
  {"concept_id":"EN-KS3-C083","levels":[{"level_number":1,"label":"emerging","description":"Avoids speaking in formal contexts due to anxiety or lack of confidence, contributing minimally or not at all.","example_task":"Share one idea with the class about the text we have been studying.","example_response":"[Remains silent, or says 'I do not know' or 'I agree with what someone else said' without elaboration.]","common_errors":["Equating lack of confidence with lack of ability","Not recognising that confidence develops through practice, not through waiting until one feels ready"]},{"level_number":2,"label":"developing","description":"Speaks in formal contexts with some nervousness but pushes through anxiety to make contributions, particularly when the environment feels supportive.","example_task":"Present your group's findings to the class.","example_response":"[Delivers the presentation with visible nervousness (rapid speech, reading from notes, limited eye contact) but completes it. The content is clear even if the delivery is hesitant. The student demonstrates courage in pushing through discomfort.]","common_errors":["Rushing through presentations to finish quickly","Reading directly from notes rather than speaking to the audience"]},{"level_number":3,"label":"secure","description":"Speaks with confidence in formal contexts, managing nervousness effectively and projecting competence through clear delivery, eye contact and composed body language.","example_task":"Deliver a presentation to an unfamiliar audience (e.g. another class, visiting adults).","example_response":"[Delivers a clear, engaging presentation with appropriate pace, eye contact with different parts of the audience, and composed body language. Any nervousness is managed rather than eliminated -- the student speaks despite anxiety rather than without it.]","common_errors":["Appearing confident but not genuinely engaging with the audience","Confusing confidence with loudness"]},{"level_number":4,"label":"mastery","description":"Speaks with genuine confidence and presence in any formal context, engaging audiences of different sizes and types, and understanding that confidence comes from preparation, practice and self-awareness.","example_task":"Reflect on how your speaking confidence has developed and what strategies you use to manage nerves.","example_response":"[Reflects with metacognitive awareness: 'My confidence has developed through repeated exposure to speaking situations. I used to believe I could not speak in public, but I have learned that the feeling of nervousness does not prevent effective speech. My strategies: I prepare thoroughly so I trust my content. I arrive early so the space feels familiar. I breathe slowly before starting. I look at friendly faces first. Most importantly, I focus on communicating my ideas rather than on how I appear. Confidence is not the absence of nervousness but the ability to speak well despite it.']","common_errors":["Attributing confidence to personality rather than to practice and strategy","Not recognising that even confident speakers experience nerves"]}]},
  {"concept_id":"EN-KS3-C084","levels":[{"level_number":1,"label":"emerging","description":"Struggles to work effectively with peers in discussions, either dominating, withdrawing or failing to engage with different viewpoints.","example_task":"Work with your group to reach a shared interpretation of this passage.","example_response":"[Either dominates ('I think it means X and that is the answer') or withdraws ('I will go with whatever everyone else thinks').]","common_errors":["Not recognising that discussion is a collaborative process, not a competition","Treating disagreement as personal rather than intellectual"]},{"level_number":2,"label":"developing","description":"Participates in collaborative discussions with growing effectiveness, listening to peers, sharing ideas and beginning to negotiate different viewpoints.","example_task":"Discuss this question in your group. Everyone must contribute at least one idea.","example_response":"[Contributes ideas, listens to others, and shows willingness to consider different perspectives: 'I had not thought of it that way. Your reading makes sense because of the evidence you mentioned. But I still think my interpretation is possible too. Maybe both can be true?']","common_errors":["Agreeing too quickly to maintain harmony rather than pursuing productive disagreement","Listening to others but not genuinely considering their viewpoints"]},{"level_number":3,"label":"secure","description":"Collaborates effectively in discussions, balancing assertiveness with openness, managing disagreement constructively and helping the group reach shared understanding.","example_task":"Lead a group discussion where members disagree. Help the group reach a more nuanced position.","example_response":"[Manages disagreement constructively: validates each perspective, identifies the underlying reason for disagreement, and helps the group find a position that accommodates both views: 'I think we agree that the character changes, but we disagree about whether the change is genuine. What if we say the evidence supports partial change -- the character changes in some ways but not others? Can we find evidence for both?']","common_errors":["Resolving disagreement by finding a compromise rather than by deepening understanding","Not challenging ideas that the group has accepted too easily"]},{"level_number":4,"label":"mastery","description":"Excels in collaborative discussion, creating an environment where all voices are heard, intellectual risk-taking is encouraged, and the group's collective understanding exceeds any individual's.","example_task":"Facilitate a discussion that produces a genuinely new insight that no individual in the group had before the discussion began.","example_response":"[Facilitates a discussion where the combination of different perspectives produces a new understanding: one student notices a language pattern, another connects it to a theme, a third challenges the connection with counter-evidence, and the group arrives at a reading that synthesises all three contributions into something none had considered alone. The facilitator's role is to create the conditions for this emergence: asking the right questions, drawing connections between contributions, and ensuring every voice is heard.]","common_errors":["Claiming credit for the group's insight rather than recognising it as genuinely collaborative","Creating conditions for good discussion but not trusting the group to produce insight without heavy direction"]}]}
]
