[
  {
    "concept_id": "EN-Y6-C045",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Delivering a short prepared talk to the class with clear speech, audible volume and basic structure (introduction, main points, ending).",
        "example_task": "Prepare a one-minute talk about a topic you know well, such as your favourite hobby. Use three prompt cards to help you. Speak clearly so everyone in the class can hear.",
        "example_response": "The pupil stands at the front and speaks at an audible volume. They use their prompt cards to move through three points: what the hobby is, why they enjoy it, and what they would recommend to someone trying it. They look up from their cards occasionally and finish with a clear closing sentence.",
        "common_errors": [
          "Reading word for word from a full script rather than using prompt cards as memory aids",
          "Speaking too quietly or too quickly for the audience to follow"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Delivering a prepared presentation with some attention to audience engagement, using deliberate eye contact, varied pace and appropriate formality for the context.",
        "example_task": "Present your research findings about a historical figure to the class. Aim to speak for two minutes. Use formal language because you are presenting facts, not chatting to a friend.",
        "example_response": "The pupil begins with a clear opening: 'Today I am going to share what I have discovered about Mary Anning.' They maintain eye contact with different parts of the audience, slow down for key facts, and use formal vocabulary such as 'significant' and 'contributed to'. They close with a summary sentence and invite one question.",
        "common_errors": [
          "Mixing informal language into a formal presentation without noticing the register shift",
          "Making eye contact with only the teacher rather than scanning the whole audience"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Delivering formal presentations with command and clarity, adapting register to audience, using rhetorical techniques such as repetition, rhetorical questions or the rule of three, and responding confidently to audience questions.",
        "example_task": "Deliver a formal persuasive presentation to a panel of governors arguing for a change you would like to see in the school. You have three minutes. Anticipate at least one counter-argument and address it in your speech.",
        "example_response": "The pupil opens with a rhetorical question: 'Have you ever wondered why our school library closes at lunchtime, the only time pupils are free to use it?' They present three structured arguments using formal register, include a statistic from their survey, and pre-empt the counter-argument about supervision by proposing a rota of Year 6 library monitors. They conclude with a call to action: 'I urge you to consider this proposal, not for my benefit alone, but for every pupil who deserves access to books.' They answer two follow-up questions with composure.",
        "common_errors": [
          "Presenting arguments without anticipating or addressing likely counter-arguments",
          "Dropping into informal register when answering questions after maintaining formality during the speech"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Delivering presentations with confidence, artistry and adaptive audience awareness, adjusting content and register in real time based on audience response, and critically evaluating the effectiveness of their own and others' presentations.",
        "example_task": "After delivering your persuasive speech, watch a recording of your presentation. Write a self-evaluation identifying two specific techniques you used effectively and one area for improvement, with reference to how each affected the audience.",
        "example_response": "My opening rhetorical question worked well because I noticed the governors lean forward and several nodded, which showed I had engaged their attention immediately. My use of the rule of three in my conclusion was effective because it gave a sense of completeness and made my final point memorable. However, when Governor Patel asked about cost, I hesitated and my voice became quieter. Next time I would prepare supporting data for likely budget questions so I could maintain the same confident register throughout the question-and-answer section.",
        "common_errors": [
          "Evaluating performance in vague terms such as 'I spoke clearly' without identifying specific rhetorical techniques and their impact",
          "Focusing only on content accuracy rather than analysing how delivery choices affected the audience"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y6-C046",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Contributing relevant points in a group discussion, listening to others and responding to what has been said rather than simply stating an unrelated opinion.",
        "example_task": "In a group of four, discuss whether school uniform should be compulsory. Each person must respond to what the previous speaker said before adding their own point. Use the sentence stem 'I agree/disagree with [name] because...'",
        "example_response": "I disagree with Aisha because she said uniform saves time in the morning, but I think it actually takes longer because you have to iron it. My own point is that uniform makes everyone look the same, which some people think is fair but I think stops you expressing who you are.",
        "common_errors": [
          "Ignoring what the previous speaker said and jumping straight to a prepared point",
          "Agreeing or disagreeing without giving any reason"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Participating in structured discussions with evidence-based contributions, building on others' ideas and beginning to distinguish between opinion, evidence and anecdote.",
        "example_task": "In a Socratic seminar about the class novel, respond to this question: 'Is the main character brave or foolish?' Support your answer with evidence from the text. Listen to at least one other person's point and respond to it.",
        "example_response": "I think the character is brave because on page 47 she chooses to go into the cave even though she is frightened, and the author writes 'her hands trembled but she stepped forward anyway'. That shows she felt the fear but acted despite it, which is what bravery means. James said she was foolish because she went alone, and I can see his point, but I think that makes her even braver because she did not have anyone to rely on.",
        "common_errors": [
          "Offering an opinion based on personal feelings without referencing textual evidence",
          "Treating anecdote as evidence, for example saying 'my cousin did something like that and it was brave'"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Participating in and contributing substantively to formal debates and structured academic discussions, using evidence, evaluating opposing arguments fairly, and maintaining formal register throughout.",
        "example_task": "Participate in a structured academic controversy on the motion: 'Space exploration is a waste of money that should be spent on problems on Earth.' You will argue both sides. First, present the strongest case FOR the motion with evidence. Then switch and present the strongest case AGAINST.",
        "example_response": "FOR: Space exploration costs billions every year. NASA's annual budget is over 25 billion dollars. Meanwhile, millions of people lack clean water. Spending this money on water purification projects would save lives today rather than searching for possibilities in the distant future. AGAINST: Many technologies we use daily, including water filters, satellite weather forecasting and medical imaging, were developed through space research. Without space exploration these breakthroughs would not exist. Investment in space is not separate from solving problems on Earth; it contributes directly to solving them.",
        "common_errors": [
          "Presenting a much weaker case for the side they personally disagree with, revealing bias rather than evaluating both positions fairly",
          "Using emotional language rather than evidence-based reasoning when arguing the side they find harder"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Leading and facilitating formal discussions, synthesising multiple viewpoints, identifying logical fallacies in arguments, and reaching reasoned conclusions that acknowledge complexity rather than oversimplifying.",
        "example_task": "Lead a philosophical enquiry session with your class on the question: 'Is it ever right to break a rule?' Facilitate contributions from at least four speakers, summarise the key positions, and offer a concluding synthesis that acknowledges the strongest points on each side.",
        "example_response": "The pupil opens by framing the question and establishing discussion norms. After facilitating four contributions, they summarise: 'We have heard two main positions. Priya and David argued that rules exist to keep everyone safe and fair, so breaking them is always wrong because it undermines trust. Fatima and Owen argued that some rules are unjust and that people like Rosa Parks showed breaking an unjust rule can be morally right. I think the key distinction is between rules that protect people and rules that harm people. Breaking a safety rule for personal convenience is different from breaking an unjust law to protect others. The answer depends on which type of rule we are talking about and whether the person has exhausted other options first.'",
        "common_errors": [
          "Summarising only the viewpoints they agree with rather than representing all positions fairly",
          "Reaching a conclusion that ignores the complexity raised during discussion and defaults to a simple yes or no"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y6-C048",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Participating in simple role-play activities, staying in character and using voice and body language to convey a role, with teacher direction.",
        "example_task": "You are going to hot-seat as the wolf from the class story. Your classmates will ask you questions. Stay in character and answer as if you are the wolf. Think about how the wolf would speak and what the wolf would say.",
        "example_response": "The pupil adopts a different voice or posture for the wolf character. When asked 'Why did you blow down the house?', they answer in character: 'I was hungry and those pigs had no right to build on my land. I only blew because they would not open the door.'",
        "common_errors": [
          "Breaking out of character to answer as themselves rather than as the wolf",
          "Giving one-word answers without elaborating on the character's perspective or motivations"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using drama techniques such as freeze-frame, thought-tracking and role-play to explore characters and situations from texts, showing understanding of different perspectives.",
        "example_task": "In groups of three, create a freeze-frame showing the moment in the story when the evacuee arrives at the new family's house. Each person takes a different role: the evacuee, the host mother, the host child. When the teacher taps your shoulder, speak your character's thoughts aloud.",
        "example_response": "Evacuee (thought-track): 'I do not know these people. Everything smells different. I am holding my suitcase so tightly because it is the only thing from home.' Host mother: 'This poor child looks terrified. I must make them feel welcome, but I am nervous too because I have never looked after someone else's child before.' Host child: 'I do not want to share my room. But they look so sad. Maybe it will be all right.'",
        "common_errors": [
          "All characters expressing the same emotion rather than showing distinct perspectives",
          "Thought-tracking that describes what happened in the plot rather than revealing the character's inner feelings"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using drama as a tool for learning across the curriculum, sustaining character, improvising responses to unexpected situations, and reflecting on how drama deepens understanding of texts and topics.",
        "example_task": "Your class is studying the Roman invasion of Britain. In pairs, improvise a scene between a Roman soldier arriving in a Celtic village and a Celtic villager. Neither character speaks the other's language. Afterwards, explain what the drama helped you understand about the topic that reading alone did not.",
        "example_response": "The pair use gesture, facial expression and simple repeated words to communicate. The Roman soldier mimes putting down a weapon and offering food to show peaceful intentions. The Celtic villager steps back suspiciously, then cautiously approaches. Reflection: 'The improvisation helped me understand how frightening and confusing first contact must have been. Reading told me it happened, but acting it out made me feel the fear and the difficulty of not sharing a language. It also made me think about why some tribes cooperated and others resisted.'",
        "common_errors": [
          "Treating drama as entertainment rather than using it to explore the topic more deeply",
          "Breaking character or laughing through the scene without committing to the learning purpose"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Directing and evaluating drama, making deliberate choices about staging, characterisation and dramatic techniques to convey meaning, and analysing how drama contributes to understanding that other learning methods do not.",
        "example_task": "Direct a short scene from the class novel. Decide where the actors stand, how they speak, and what they do. After the performance, explain three directorial choices you made and how each one helped convey meaning to the audience.",
        "example_response": "I placed the two characters on opposite sides of the stage to show they are in conflict. I asked the actor playing the father to speak quietly rather than shout, because I think controlled anger is more powerful and more realistic. I added a long pause before the final line so the audience would feel the weight of the decision. Each of these choices was about showing meaning through staging rather than just saying the words, which is what a director does differently from a reader.",
        "common_errors": [
          "Making staging decisions based on what looks interesting rather than what conveys the meaning of the scene",
          "Evaluating the scene only in terms of acting quality rather than analysing how directorial choices affected the audience's understanding"
        ]
      }
    ]
  }
]
