[
  {
    "concept_id": "EN-Y5-C034",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Reading own writing aloud with basic clarity, projecting voice so that listeners can hear.",
        "example_task": "Read the poem you wrote last week to your partner. Make sure they can hear every word clearly.",
        "example_response": "The pupil reads their poem at an audible volume, pronouncing each word clearly, though without much variation in tone or pace.",
        "common_errors": [
          "Reading too quietly for the listener to hear",
          "Rushing through the text without pausing at punctuation"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Performing compositions with some variation in intonation, volume and pace to convey meaning, with preparation time.",
        "example_task": "Prepare to perform your story opening to the class. Practise three times, focusing on using your voice to show the mood of the scene.",
        "example_response": "The pupil reads their story opening more slowly during the spooky parts and speeds up during the action. They lower their voice for suspense and raise it for dialogue.",
        "common_errors": [
          "Reading in a flat monotone without varying pitch or pace",
          "Over-performing so dramatically that the meaning is obscured"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Performing compositions using appropriate intonation, volume and movement so that meaning is clear to the audience, with evidence of rehearsal and deliberate interpretive choices.",
        "example_task": "Perform your persuasive speech to the class. Use eye contact, deliberate pauses and changes in volume to emphasise your key arguments.",
        "example_response": "The pupil makes eye contact with the audience rather than reading from the page. They pause before their strongest argument for dramatic effect. They raise their voice for the key statistic and slow down for the conclusion to give the audience time to reflect.",
        "common_errors": [
          "Reading directly from notes rather than using them as prompts",
          "Not varying delivery to highlight the most important points"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Performing with confidence and artistry, making interpretive choices that enhance meaning, and evaluating own and others' performances with reference to specific techniques.",
        "example_task": "Watch a classmate perform their poem. Give specific feedback on one technique they used well and one suggestion for improvement, with reference to how their choices affected the meaning for the audience.",
        "example_response": "You used a long pause before the final line really effectively because it made the audience lean in and pay attention to the ending. One suggestion: when you described the storm, your voice stayed at the same volume throughout. If you had started quietly and built to a loud climax, the audience would have felt the storm growing, which would match the meaning of the poem more closely.",
        "common_errors": [
          "Giving vague feedback ('it was good') rather than identifying specific techniques",
          "Not connecting performance choices to the meaning of the text"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y5-C035",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Contributing a spoken point or opinion in a whole-class or small-group discussion, with some structure provided by the teacher.",
        "example_task": "In our class discussion about whether animals should be kept in zoos, share your opinion with the group. Start with 'I think...' and give one reason.",
        "example_response": "I think animals should not be kept in zoos because they cannot run around freely like they would in the wild.",
        "common_errors": [
          "Stating an opinion without giving any reason",
          "Speaking too quietly for the group to hear"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Giving a short spoken presentation using notes as prompts, and beginning to respond to others' points in discussion.",
        "example_task": "Give a one-minute talk to your group about a book you would recommend. Use notes to help you, but do not read a script. Then answer one question from the group.",
        "example_response": "The pupil speaks for about a minute using brief notes, making eye contact with listeners. They mention the title, author, what it is about, and why they recommend it. When asked 'Who would enjoy it?', they answer with a specific suggestion.",
        "common_errors": [
          "Reading a prepared script word for word rather than speaking from notes",
          "Not responding to the question and instead repeating part of the prepared talk"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Giving structured formal presentations and participating in debates with proposition, opposition and rebuttal, maintaining focus on the topic, using notes where necessary, and evaluating different viewpoints courteously.",
        "example_task": "Participate in a class debate on the motion 'Homework should be banned in primary schools.' Prepare arguments for your assigned side, including a rebuttal of the opposing view.",
        "example_response": "Proposition: Homework should be banned because research shows it has little impact on primary-age learning. Children need time to play, rest and spend time with their families after a full school day. The opposition may argue that homework builds independent study skills, but we believe these can be developed in school through project-based learning instead. In summary, the evidence does not support homework for primary children, and the time would be better spent on activities that support wellbeing.",
        "common_errors": [
          "Repeating the same point more loudly rather than addressing the opposing argument",
          "Confusing personal feelings with structured argument"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Leading and managing formal discussions, evaluating the strength of arguments (including their own), adapting register for formal contexts, and using rhetorical techniques to persuade.",
        "example_task": "Chair a class debate. Introduce the motion, manage speakers from both sides, and deliver a fair summing up that identifies the strongest arguments from each side.",
        "example_response": "The pupil introduces the motion clearly and explains the rules. They manage turn-taking fairly, ensuring both sides get equal time. In summing up: 'The strongest argument from the proposition was that homework research shows minimal impact at primary level, because this was supported by evidence. The strongest argument from the opposition was that homework teaches responsibility, which is harder to measure but important for secondary readiness. Both sides made valid points, but the proposition's evidence base was stronger overall.'",
        "common_errors": [
          "Showing bias towards one side when chairing rather than maintaining neutrality",
          "Summing up by choosing the side they agree with rather than evaluating argument quality"
        ]
      }
    ]
  }
]