[
  {
    "concept_id": "EN-Y3-C034",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Adding a common prefix to a root word without changing the root spelling, understanding the basic meaning change.",
        "example_task": "Add the prefix un- to these words: happy, kind, fair. Write the new words and say what each means.",
        "example_response": "'Unhappy — not happy. Unkind — not kind. Unfair — not fair.'",
        "common_errors": [
          "Changing the spelling of the root word when adding the prefix (e.g., writing 'unhapppy')",
          "Not understanding that the prefix changes the meaning systematically"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Applying prefix and suffix spelling rules to words, including choosing the correct prefix from a set and spelling the resulting word correctly.",
        "example_task": "Choose the correct prefix (dis-, mis-, re-) for each word: ___appear, ___behave, ___turn. Spell each word correctly.",
        "example_response": "'Disappear, misbehave, return.'",
        "common_errors": [
          "Choosing the wrong prefix (e.g., 'misappear' instead of 'disappear')",
          "Misspelling by doubling letters at the join (e.g., 'dissappear')"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Applying Year 3 prefix and suffix spelling rules accurately in independent writing, including rules requiring spelling changes such as dropping the final 'e' or changing 'y' to 'i'.",
        "example_task": "Add the suffix -ous to these root words: fame, poison, danger, fury. Write each word correctly, applying the spelling rule.",
        "example_response": "'Famous (drop the e, add ous), poisonous, dangerous, furious (change y to i, add ous).'",
        "common_errors": [
          "Forgetting to drop the final 'e' before a vowel suffix (e.g., writing 'fameous')",
          "Forgetting to change 'y' to 'i' before adding the suffix (e.g., writing 'furyous')"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Applying prefix and suffix rules to unfamiliar words, explaining the spelling rule used, and self-correcting errors by identifying which rule applies.",
        "example_task": "You have misspelled 'irresponsible' as 'irresponsable'. Find and correct the error. Explain which spelling rule you need to apply.",
        "example_response": "'The correct spelling is irresponsible. The suffix is -ible, not -able. The prefix ir- means not, and the root word is responsible. I need to remember that some words use -ible instead of -able — I can check in a dictionary if I'm unsure.'",
        "common_errors": [
          "Not recognising the error because the incorrect version looks plausible",
          "Correcting one part of the word but introducing a new error elsewhere"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C035",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Doubling the final consonant before adding -ing or -ed to simple one-syllable CVC words, revisiting the Year 2 rule.",
        "example_task": "Add -ing to these words: run, sit, hop. Write each word.",
        "example_response": "'Running, sitting, hopping.'",
        "common_errors": [
          "Not doubling the consonant (e.g., writing 'runing' or 'hoping' instead of 'hopping')",
          "Doubling when it's not needed (e.g., writing 'jumping' as 'jumpping')"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Applying the doubling rule to two-syllable words where the stress falls on the final syllable.",
        "example_task": "Add -ing to: begin, forget, prefer. Remember the doubling rule for stressed syllables.",
        "example_response": "'Beginning, forgetting, preferring.'",
        "common_errors": [
          "Not doubling because the word is longer (e.g., writing 'begining')",
          "Being unsure which syllable is stressed and guessing incorrectly"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Correctly applying the doubling rule by distinguishing between stressed and unstressed final syllables in polysyllabic words.",
        "example_task": "Add -ing to these words: garden, travel, commit, open, submit. Decide which need doubling and which don't. Explain the rule.",
        "example_response": "'Gardening (no double — stress on first syllable), travelling (double — stress on second syllable), committing (double — stress on second syllable), opening (no double — stress on first syllable), submitting (double — stress on second syllable).'",
        "common_errors": [
          "Applying the doubling rule inconsistently, sometimes doubling unstressed syllables",
          "Not hearing which syllable is stressed and applying the rule randomly"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Applying the doubling rule confidently to unfamiliar words, explaining the stress pattern, and self-correcting by applying the rule consciously.",
        "example_task": "A pupil has written 'enterring' and 'prefered'. Are these correct? Explain the rule for each.",
        "example_response": "'Enterring is wrong — it should be entering because the stress is on the first syllable (EN-ter), so we don't double. Prefered is also wrong — it should be preferred because the stress is on the second syllable (pre-FER), so we do double the r.'",
        "common_errors": [
          "Explaining the rule correctly but still making the error in independent writing",
          "Confusing the doubling rule with other suffix spelling rules"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C036",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Distinguishing between two common homophones when the meanings are given, choosing the correct one to complete a sentence.",
        "example_task": "Choose the correct word: 'Their/There is a cat on the wall.' 'The children ate their/there lunch.'",
        "example_response": "'There is a cat on the wall. The children ate their lunch.'",
        "common_errors": [
          "Always choosing the more familiar spelling regardless of meaning",
          "Not connecting each spelling to its specific meaning"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Spelling common Year 3-4 homophones correctly in dictated sentences, with the context making the intended meaning clear.",
        "example_task": "Write these sentences from dictation: 'The weather was cold.' 'I wonder whether we should go.'",
        "example_response": "'The weather was cold. I wonder whether we should go.' (Both homophones spelled correctly.)",
        "common_errors": [
          "Using 'weather' in both sentences because it is the more familiar spelling",
          "Writing 'wether' as a blend of the two correct forms"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using Year 3-4 homophones correctly in independent writing, choosing the right spelling based on meaning in context.",
        "example_task": "Write a paragraph about a school trip that includes the words: brake/break, peace/piece, scene/seen. Use each word correctly.",
        "example_response": "'During the break, we watched a peaceful scene by the river. I had a piece of cake. On the way home, the driver had to brake suddenly because a deer crossed the road. We had never seen anything like it.'",
        "common_errors": [
          "Using the correct spelling in isolation but reverting to errors in extended writing when attention is on content",
          "Mixing up less common pairs like accept/except or affect/effect"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining the difference in meaning between homophones, spotting homophone errors in others' writing, and using less common pairs accurately.",
        "example_task": "Find and correct the homophone errors in this paragraph: 'The knight road his horse passed the castle. The king waved but the knight had all ready scene the danger.'",
        "example_response": "'Road should be rode (past tense of ride). Passed should be past (going beyond). All ready should be already (by this time). Scene should be seen (past participle of see).'",
        "common_errors": [
          "Correcting some errors but missing others, especially less common pairs",
          "Identifying that something is wrong but choosing the wrong correction"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C037",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that some English words have unusual spelling patterns that come from other languages.",
        "example_task": "Look at these words: chef, school, antique. Do they follow the usual English spelling rules? Say each word aloud.",
        "example_response": "'Chef has ch but it makes a sh sound. School has ch but it makes a k sound. Antique ends in que but it sounds like k. They don't follow normal English rules.'",
        "common_errors": [
          "Trying to decode these words using standard English phonics rules",
          "Not noticing that the spelling-sound patterns are unusual"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Spelling words with one specific etymological pattern correctly after instruction, grouping words by their shared pattern.",
        "example_task": "Sort these words into two groups — French ch (sounds like sh) and Greek ch (sounds like k): chorus, machine, character, brochure, chemistry, chef.",
        "example_response": "'French ch (sh sound): machine, brochure, chef. Greek ch (k sound): chorus, character, chemistry.'",
        "common_errors": [
          "Sorting by another feature rather than the sound the ch makes",
          "Knowing the grouping rule but misspelling the words when writing them"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Spelling words from multiple etymological patterns correctly in independent writing and explaining why the spelling follows a particular pattern.",
        "example_task": "Write these words from dictation: myth, league, character, brochure, science. For each, explain which language the spelling pattern comes from.",
        "example_response": "'Myth — the y making an i sound comes from Greek. League — the -gue ending comes from French. Character — the ch making a k sound comes from Greek. Brochure — the ch making a sh sound comes from French. Science — the sc making an s sound comes from Latin.'",
        "common_errors": [
          "Spelling the words phonetically using standard English patterns (e.g., 'karekter' for 'character')",
          "Remembering the etymological group but not the specific spelling of each word"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using etymological knowledge to attempt the spelling of unfamiliar words, making informed guesses about spelling patterns based on word origins.",
        "example_task": "You encounter the word 'chameleon' for the first time. Using what you know about words from Greek, how would you try to spell it? Explain your thinking.",
        "example_response": "'I know that words from Greek often have ch making a k sound, like character and chorus. So chameleon probably starts with ch. The -eon ending is also common in Greek words. I would spell it c-h-a-m-e-l-e-o-n. Greek words often have unusual vowel patterns too.'",
        "common_errors": [
          "Not applying etymological knowledge to unfamiliar words, treating each new word as a completely separate spelling challenge",
          "Over-applying one pattern (e.g., assuming all ch words are Greek)"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C038",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Reading and recognising words from the Years 3-4 statutory word list, and spelling the most common ones in supported contexts.",
        "example_task": "Read these words aloud: different, February, favourite, island, knowledge. Now write three of them from memory.",
        "example_response": "(Reads all five correctly. Writes 'different', 'favourite' and 'island' from memory.)",
        "common_errors": [
          "Spelling phonetically (e.g., 'diffrent', 'Febuary', 'iland')",
          "Recognising the word when reading but being unable to reproduce the spelling from memory"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Spelling a growing number of words from the statutory list correctly in dictation, including words with tricky patterns.",
        "example_task": "Write these words from dictation: address, business, century, describe, exercise, guard.",
        "example_response": "'Address, business, century, describe, exercise, guard.' (All spelled correctly.)",
        "common_errors": [
          "Common phonetic errors: 'adress', 'bisniss', 'sentury', 'discribe', 'exersise', 'gard'",
          "Confusing similar words (e.g., writing 'century' when 'centre' is dictated)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Spelling the majority of the Years 3-4 statutory word list correctly in independent writing, not just in spelling tests.",
        "example_task": "Write a paragraph about your favourite subject at school. Try to include at least five words from the Year 3-4 word list, spelled correctly.",
        "example_response": "'My favourite subject is science because I find experiments really interesting. Last February, we did an exercise where we had to describe different materials. It was difficult but I enjoyed it because I had the experience of actually touching and testing each material.'",
        "common_errors": [
          "Spelling words correctly in tests but reverting to errors in free writing when attention is on content",
          "Avoiding using challenging words in writing to prevent spelling errors"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Spelling all words on the statutory list accurately and consistently, and using etymological or morphological reasoning to remember tricky spellings.",
        "example_task": "A friend has written 'nollege' for 'knowledge'. Help them remember the correct spelling. Explain a strategy for remembering it.",
        "example_response": "'Knowledge is spelled k-n-o-w-l-e-d-g-e. The tricky part is the silent k at the start and the silent w. One way to remember is that it comes from the word know — if you can spell know, you can spell knowledge by adding -ledge. You could also say the silent letters when you practise: kuh-now-ledge.'",
        "common_errors": [
          "Being able to spell the word but not explain a strategy for remembering it",
          "Using strategies that only work for one word rather than transferable approaches"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C039",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that an apostrophe shows belonging, revisiting the Year 2 singular possessive (the dog's bone).",
        "example_task": "What does the apostrophe show in 'the girl's coat'?",
        "example_response": "'It shows the coat belongs to the girl.'",
        "common_errors": [
          "Thinking the apostrophe shows a missing letter (contraction) rather than possession",
          "Not knowing what an apostrophe is or what it does"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Placing the possessive apostrophe correctly with regular plural nouns ending in -s.",
        "example_task": "Write these phrases with the apostrophe in the right place: the dogs bone (one dog), the dogs bones (many dogs).",
        "example_response": "'The dog's bone (one dog — apostrophe before the s). The dogs' bones (many dogs — apostrophe after the s).'",
        "common_errors": [
          "Placing the apostrophe before the s for both singular and plural (e.g., 'the dog's bones' for multiple dogs)",
          "Omitting the apostrophe entirely for the plural possessive"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using the possessive apostrophe correctly with both regular and irregular plural nouns in writing.",
        "example_task": "Write sentences using the possessive form of: girls (regular plural), children (irregular plural), babies (regular plural).",
        "example_response": "'The girls' PE lesson was cancelled because of rain. The children's playground has new equipment. The babies' toys were all over the floor.'",
        "common_errors": [
          "Writing 'childrens'' (putting the apostrophe after a non-existent s) instead of 'children's'",
          "Confusing the plural -s with the possessive 's (e.g., 'the baby's' when meaning multiple babies)"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Distinguishing confidently between plural, singular possessive and plural possessive in complex sentences, and explaining the rule to others.",
        "example_task": "Explain the difference in meaning between: 'the teacher's books', 'the teachers' books', and 'the teachers books'. Which is incorrect and why?",
        "example_response": "'The teacher's books means one teacher owns the books. The teachers' books means several teachers own the books. The teachers books is incorrect because if the books belong to the teachers, there needs to be an apostrophe. Without an apostrophe, teachers is just a plural noun and books doesn't belong to anyone — the sentence doesn't make grammatical sense.'",
        "common_errors": [
          "Being able to apply the rule in exercises but not explain the reasoning behind it",
          "Still making errors with irregular plurals like 'women's' or 'people's'"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C040",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Using alphabetical order to the first letter to locate a word in a dictionary.",
        "example_task": "Find the word 'bridge' in the dictionary. Which section will you look in?",
        "example_response": "'I look in the B section because bridge starts with b.' (Locates the B section.)",
        "common_errors": [
          "Not knowing alphabetical order confidently beyond the first few letters",
          "Opening the dictionary randomly and searching by flicking pages"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using alphabetical order to the second and third letter to locate a word in a dictionary to check its spelling.",
        "example_task": "You think the word 'separate' might be spelled 'seperate'. Use the dictionary to check. Explain how you found it.",
        "example_response": "'I looked in the S section, then found SE, then SEP. I found separate spelled s-e-p-a-r-a-t-e. My spelling was wrong — it has an a in the middle, not an e.'",
        "common_errors": [
          "Getting stuck if the initial guess is too far from the correct spelling to navigate",
          "Finding the word but not noticing the difference between their spelling and the dictionary spelling"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using a dictionary efficiently during writing to check and correct spellings, trying plausible alternatives when the first attempt doesn't appear in the dictionary.",
        "example_task": "During your writing, you want to use the word 'necessary' but aren't sure how to spell it. Use the dictionary to find the correct spelling.",
        "example_response": "'I tried looking up n-e-s-s but couldn't find it. Then I tried n-e-c and found necessary — n-e-c-e-s-s-a-r-y. The tricky part is the c and the double s.'",
        "common_errors": [
          "Giving up if the first attempted spelling isn't in the dictionary rather than trying alternative plausible spellings",
          "Spending so long looking up words that writing fluency is disrupted"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using a dictionary strategically and efficiently as part of the writing and proof-reading process, including selecting the correct spelling from similar entries.",
        "example_task": "Proof-read this paragraph and use a dictionary to check any spellings you are unsure about. Correct any errors.",
        "example_response": "(Identifies 'accomodation' and 'occassionally' as potentially incorrect. Looks up both efficiently.) 'Accommodation has two c's and two m's — a-c-c-o-m-m-o-d-a-t-i-o-n. Occasionally has two c's and one s — o-c-c-a-s-i-o-n-a-l-l-y.'",
        "common_errors": [
          "Not recognising which words might be misspelled, so not checking them",
          "Relying on the dictionary for every uncertain word rather than using phonics and morphology first"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C041",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Writing a short dictated phrase of 3-4 words using familiar vocabulary, focusing on accurate letter formation.",
        "example_task": "Listen carefully and write: 'the big red bus'.",
        "example_response": "'The big red bus.' (All four words spelled correctly with a capital letter at the start.)",
        "common_errors": [
          "Forgetting one of the words because the phrase was not held in memory",
          "Spelling phonetically where conventional spelling is expected (e.g., 'buss')"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writing a simple dictated sentence demonstrating knowledge of basic punctuation and spelling patterns taught so far.",
        "example_task": "Write this sentence from dictation: 'The children played happily in the garden.'",
        "example_response": "'The children played happily in the garden.' (Capital letter, full stop, correct spelling including -ly suffix.)",
        "common_errors": [
          "Missing the full stop because attention was focused on spelling",
          "Spelling 'happily' as 'happaly' (incorrect suffix application)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Writing dictated sentences that include Year 3 spelling patterns, punctuation and statutory word list words accurately.",
        "example_task": "Write these two sentences from dictation: 'In February, the weather was extremely cold. The children's favourite activity was building enormous snowmen.'",
        "example_response": "(Both sentences written accurately with correct spelling of February, weather, extremely, children's, favourite, and enormous. Commas, full stops and possessive apostrophe all correct.)",
        "common_errors": [
          "Misspelling statutory words (e.g., 'Febuary', 'favrite')",
          "Missing the comma after the fronted adverbial 'In February'"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Writing longer dictated passages with complex sentences, applying the full range of Year 3 spelling, punctuation and grammar knowledge accurately.",
        "example_task": "Write this passage from dictation: 'Although the weather was difficult, the experienced guide led the group safely through the mountain pass. \"We should continue,\" she said, because the path ahead is actually easier than it appears.'",
        "example_response": "(Passage written accurately with correct spelling, punctuation of dialogue, commas after subordinate clauses, and statutory word list words.)",
        "common_errors": [
          "Losing track of the longer passage and missing words or phrases",
          "Correctly spelling individual words but making errors with speech punctuation or comma placement"
        ]
      }
    ]
  }
]