[
  {
    "concept_id": "EN-Y3-C042",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Forming basic diagonal and horizontal joining strokes between two letters in isolation.",
        "example_task": "Practise joining these letter pairs: in, an, un, at. Use the diagonal joining stroke.",
        "example_response": "(Writes the letter pairs with recognisable joining strokes, though size and spacing may be inconsistent.)",
        "common_errors": [
          "Lifting the pen between letters rather than maintaining the join",
          "Making the joining stroke but distorting the letter shapes"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using joining strokes consistently in short, familiar words during handwriting practice.",
        "example_task": "Write these words in joined handwriting: run, man, fish, stop, think.",
        "example_response": "(Words written in joined handwriting with most joins formed correctly. Letters are mostly consistent in size.)",
        "common_errors": [
          "Joining letters that are best left unjoined (e.g., after certain letters like b, p, or before s)",
          "Correct joins in practice but reverting to print in independent writing"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using diagonal and horizontal joining strokes fluently in independent writing, knowing which letters are best left unjoined.",
        "example_task": "Write a paragraph about your weekend in your best joined handwriting. Remember which letters don't need joining.",
        "example_response": "(Paragraph written in fluent joined handwriting. Most joins are correct and consistent. Letters after round letters like b, p and before s are appropriately left unjoined.)",
        "common_errors": [
          "Inconsistent use of joins — some words joined, others printed in the same piece",
          "Sacrificing letter formation quality in order to maintain joins"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Writing fluently in a consistent joined style across all writing tasks, maintaining legibility and appropriate speed.",
        "example_task": "Write a timed paragraph (3 minutes) about your favourite book in joined handwriting. Aim for both speed and legibility.",
        "example_response": "(Writes a substantial paragraph in consistent joined handwriting, maintaining letter size, spacing and join accuracy at a reasonable speed. The writing is legible to others.)",
        "common_errors": [
          "Speed compromising legibility, particularly with ascenders and descenders",
          "Inconsistency in letter size when writing at speed"
        ]
      }
    ]
  },
  {
    "concept_id": "EN-Y3-C043",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Writing letters on a line with most letters sitting on the baseline, though with inconsistent sizing.",
        "example_task": "Copy this sentence onto lined paper, making sure your letters sit on the line: 'The quick brown fox jumped.'",
        "example_response": "(Letters sit on the baseline. Some inconsistency in letter height but overall readable.)",
        "common_errors": [
          "Letters floating above or sinking below the baseline",
          "All letters the same height — not distinguishing ascenders, descenders and x-height letters"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writing with more consistent letter sizing, distinguishing between ascenders, descenders and x-height letters.",
        "example_task": "Write this sentence, paying attention to the different sizes of letters: 'The happy girl played by the pond.'",
        "example_response": "(Ascenders (h, l, d, b) are clearly taller than x-height letters. Descenders (y, p, g) drop below the line. Spacing between words is mostly even.)",
        "common_errors": [
          "Ascenders not reaching the full height line",
          "Descenders not dropping far enough below the baseline to be distinct"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Writing with consistent letter size, even spacing, and parallel downstrokes across extended pieces of work.",
        "example_task": "Write a full page of your story draft. Focus on keeping your handwriting consistent throughout — even letter sizes, regular spacing, and neat presentation.",
        "example_response": "(A full page of writing with consistent letter formation throughout. Downstrokes are parallel. Spacing between words is even. Ascenders and descenders are correctly proportioned. The writing is clearly legible.)",
        "common_errors": [
          "Starting neatly but deteriorating as the writing continues and fatigue sets in",
          "Inconsistent word spacing — some words crowded together, others widely spaced"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Producing handwriting of a high standard consistently across all subjects and contexts, self-monitoring and self-correcting for quality.",
        "example_task": "Compare your handwriting at the start and end of this piece. Is it consistent throughout? Identify anything you would improve.",
        "example_response": "'My handwriting is mostly consistent but I notice that my letter d gets smaller towards the end. The spacing stays even throughout. I could improve the height of my ascenders in the last paragraph — they are slightly shorter than in the first paragraph.'",
        "common_errors": [
          "Not noticing deterioration in quality across a longer piece",
          "Focusing only on one aspect of handwriting quality and ignoring others"
        ]
      }
    ]
  }
]