[
  {
    "concept_id": "EAD-R-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to explore different materials freely, handling, combining and experimenting to discover what they can do.",
        "example_task": "Provide paint, collage materials, clay and construction resources. Observe how the child explores them.",
        "example_response": "The child picks up different materials, squeezes the clay, mixes paint colours on the paper, sticks sequins onto card. They explore freely without a specific goal but discover effects ('Look, I mixed red and yellow and got orange!').",
        "common_errors": [
          "Only using one material and not exploring the range available",
          "Needing adult direction to start exploring rather than initiating independently"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes exploring materials with developing purpose, choosing materials for their visual or tactile qualities and commenting on what they discover.",
        "example_task": "Ask the child to make a picture of a fireworks display. What materials do they choose and why?",
        "example_response": "The child chooses glitter, foil and bright paint. 'I'm using glitter because fireworks are sparkly. The foil is shiny like the light.' They select materials for specific qualities related to their subject.",
        "common_errors": [
          "Using the same materials every time regardless of the task",
          "Choosing materials without considering how their properties match the purpose"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Safely using and exploring a variety of materials, tools and techniques, experimenting with colour, design, texture, form and function.",
        "example_task": "Create something that represents 'under the sea' using any materials you like. Explain your choices.",
        "example_response": "The child creates a layered collage: blue tissue paper for water (because you can see through it), bubble wrap for bubbles, shiny card fish, and string for seaweed. 'I chose bubble wrap because it looks like real bubbles. The tissue paper is see-through like water. I used string because seaweed is long and wavy.'",
        "common_errors": [
          "Using materials without thinking about why, just because they are there",
          "Creating work that is attractive but shows no experimentation or discovery"
        ]
      }
    ]
  },
  {
    "concept_id": "EAD-R-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to make things with a simple intention, stating what they are making before or during the process.",
        "example_task": "In the construction area, observe whether the child says what they are making.",
        "example_response": "'I'm making a house!' The child builds something and can describe it, though the end result may not closely match the stated intention.",
        "common_errors": [
          "Making something and then deciding what it is afterward, rather than planning",
          "Stating an intention but not being able to sustain it through the making process"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes creating with clear purpose, selecting appropriate materials and showing a developing ability to explain the process and choices.",
        "example_task": "Ask the child to make a birthday card for a friend. Observe their planning and choices.",
        "example_response": "The child folds card, draws a cake with candles, writes their friend's name (with phonic spelling), and decorates with their friend's favourite colour. 'I used purple because Fatima likes purple. I drew 5 candles because she's going to be 5.'",
        "common_errors": [
          "Making something for themselves rather than considering the recipient's preferences",
          "Starting without planning and running into problems part-way through"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Sharing their creations, explaining the process they have used, and returning to and building on their previous learning to refine ideas.",
        "example_task": "Over several sessions, develop a model of a garden using junk modelling. Observe whether the child improves it over time.",
        "example_response": "Session 1: The child builds a basic garden with boxes and green paper. Session 2: They add flowers made from cupcake cases and pipe cleaners. Session 3: They create a pond using foil and add a bench from lolly sticks. 'I kept making it better. Yesterday I thought it needed water so I added the pond. Today I'm making a path because gardens have paths.'",
        "common_errors": [
          "Finishing after one session without returning to develop the work further",
          "Not being able to explain the process or the choices made"
        ]
      }
    ]
  },
  {
    "concept_id": "EAD-R-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to use objects as props in pretend play, understanding that one thing can represent another (a block becomes a phone).",
        "example_task": "In the home corner, observe whether the child uses objects symbolically in their play.",
        "example_response": "The child picks up a banana and holds it to their ear: 'Hello? Yes, I'll come to the party.' The banana represents a phone — symbolic thinking.",
        "common_errors": [
          "Only using realistic props (toy phone) and not substituting everyday objects",
          "Using props without incorporating them into a narrative or role"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes creating and using props to support more complex role play, extending scenes through dialogue and action.",
        "example_task": "Observe the child in role-play. Do they create props or adapt objects to serve their narrative?",
        "example_response": "The child wraps a blanket around their shoulders as a cape, uses a ruler as a sword, and makes a crown from a paper strip. They stay in character: 'I am the king and this is my castle. You must bring me treasure!'",
        "common_errors": [
          "Using props but not sustaining the role-play narrative beyond initial setup",
          "Relying on ready-made dressing-up clothes rather than creating improvised props"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Inventing, adapting and recounting narratives and stories with peers through collaborative role play using props, demonstrating sustained imagination.",
        "example_task": "Observe extended role play with props over 15+ minutes.",
        "example_response": "Three children set up a veterinary surgery. One child makes a 'waiting room' with chairs, another creates appointment cards from paper, a third sets up a table with toy medical equipment. They sustain the play for 20 minutes, with a narrative that develops: a pet arrives sick, gets examined, receives medicine, and goes home better. Props are central to the story and created collaboratively.",
        "common_errors": [
          "Setting up an elaborate scene but not sustaining the narrative play within it",
          "One child dominating the prop choices while others are passive"
        ]
      }
    ]
  },
  {
    "concept_id": "EAD-R-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to tell simple stories through talk and play, with events linked by 'and then'.",
        "example_task": "Ask the child to tell you a story using the small-world toys.",
        "example_response": "'The dinosaur is walking and then he found a egg and then the egg hatched and then there was a baby dinosaur.' — a sequence of events connected by 'and then'.",
        "common_errors": [
          "Describing single actions without linking them into a story",
          "Using only 'and then' to connect events without any other structure"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes creating stories with a beginning, a middle and an end, including a problem or event that gives the story shape.",
        "example_task": "Tell me a story about an animal that has an adventure.",
        "example_response": "'Once there was a rabbit who lived in a burrow. One day she went exploring and got lost in the big forest. She was scared. Then she met a friendly owl who showed her the way home. She was so happy to be home and she never went that far again.' — clear beginning, problem, resolution and ending.",
        "common_errors": [
          "Starting a story but not including a problem or complication",
          "Including a problem but not resolving it ('and then it ended')"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Inventing and adapting narratives with characters, settings, problems and resolutions, performing and retelling them to others with expression and detail.",
        "example_task": "Make up a story to perform to the class. Include characters with feelings and a problem that gets solved.",
        "example_response": "The child tells a story with distinct characters who have names and personalities, a setting described with detail, a problem that creates tension, and a satisfying resolution. They use different voices for characters, expression in their delivery, and story language. The audience is engaged and responds.",
        "common_errors": [
          "Creating characters without distinct personalities or motivations",
          "Telling rather than performing — monotone delivery without expression"
        ]
      }
    ]
  },
  {
    "concept_id": "EAD-R-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to join in with familiar songs and rhymes, knowing some of the words and attempting to match the melody.",
        "example_task": "Sing 'Twinkle Twinkle Little Star' with the group. Does the child join in?",
        "example_response": "The child sings along, knowing most of the words. Their pitch approximately follows the melody though not always accurately. They enjoy participating.",
        "common_errors": [
          "Knowing the words but not attempting to match the tune",
          "Singing confidently but significantly off-pitch"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes singing a range of songs and rhymes with reasonable accuracy of words, rhythm and pitch, and beginning to perform to a small audience.",
        "example_task": "Sing your favourite nursery rhyme. Try to sing in tune.",
        "example_response": "The child sings 'Humpty Dumpty' with all the words correct, keeping a steady rhythm, and the melody is recognisable. They perform with confidence to a small group.",
        "common_errors": [
          "Knowing many songs but singing them all at the same pace and volume",
          "Becoming self-conscious when performing to others, even a small group"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Singing in a group or alone, increasingly matching pitch and following the melody, performing songs, rhymes, poems and stories with expression.",
        "example_task": "Perform a song or poem to the class. Use your voice expressively.",
        "example_response": "The child sings or recites with clear words, reasonable pitch accuracy, and expressive use of dynamics (loud for exciting parts, quiet for scary parts). They make eye contact with the audience and use gestures. The performance has been rehearsed and shows preparation.",
        "common_errors": [
          "Performing accurately but without expression — singing mechanically",
          "Using expression but at the expense of accuracy (wrong words, lost melody)"
        ]
      }
    ]
  },
  {
    "concept_id": "EAD-R-C006",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to move in response to music, showing awareness that music makes them want to move, though movement may not relate to the musical features.",
        "example_task": "Play different types of music. Observe whether the child moves in response.",
        "example_response": "The child bounces, sways or runs when music plays. They move more energetically to fast music and slow down when the music is calm, showing basic responsiveness to tempo.",
        "common_errors": [
          "Moving at the same speed regardless of the music",
          "Not showing any physical response to music"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes matching movement to the character of the music — slow and gentle for lullabies, fast and bouncy for energetic music — and beginning to move in time with the pulse.",
        "example_task": "Play a march and a lullaby. 'Move your body to match the music.'",
        "example_response": "For the march, the child stamps their feet and swings their arms like marching. For the lullaby, they sway gently and rock. They are beginning to step in time with the beat of the march.",
        "common_errors": [
          "Responding to the mood but not attempting to synchronise with the pulse",
          "Moving expressively to music they like but not engaging with unfamiliar music"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Responding to what they hear with relevant movement, attempting to move rhythmically with the music and showing awareness of the pulse.",
        "example_task": "Dance to this music, trying to move in time with the beat. When the music changes, change your movement.",
        "example_response": "The child moves in approximate time with the music's pulse, stepping or clapping on the beat. When the music changes from fast to slow, they adjust their movement to match. When a new section starts with a different character, they change their movement style — from skipping to swaying, for example.",
        "common_errors": [
          "Moving rhythmically for a few beats but then losing the pulse",
          "Responding to the first piece of music but not adapting when it changes"
        ]
      }
    ]
  }
]
