[
  {
    "concept_id": "LIT-R-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to retell a familiar story with adult prompts, recalling some key events but not always in the correct order.",
        "example_task": "After hearing 'The Three Little Pigs' several times, ask: 'Can you tell me the story?'",
        "example_response": "'There was a pig and he builded a house. And the wolf blowed it down. And then... the brick house.' The child recalls key events but jumps around in sequence.",
        "common_errors": [
          "Recalling only the most dramatic event without beginning or ending",
          "Mixing up events from different stories"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes retelling a story in the correct sequence with key events, beginning to use story language ('once upon a time', 'then', 'in the end').",
        "example_task": "Retell 'Goldilocks and the Three Bears' using a story map or picture prompts.",
        "example_response": "'Once upon a time there were three bears and they went for a walk. Then Goldilocks came to their house. She ate the porridge — the first one was too hot, the second was too cold, and the baby one was just right. Then she sat in the chairs and the little one breaked. Then she went to sleep in baby bear's bed. Then the bears came home and she ran away!'",
        "common_errors": [
          "Correctly sequencing the middle but missing the beginning or ending",
          "Using 'and then' repeatedly without more varied connectives"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Retelling stories accurately in sequence, using story language and vocabulary from the text, and including details about characters' feelings and motivations.",
        "example_task": "Retell a recently heard story without picture support, including how the characters felt.",
        "example_response": "Full retelling with correct sequence, story language ('one day', 'suddenly', 'finally'), character names, and emotional detail ('The bear was frightened because he had never been alone before. He felt brave when he found his way home.')",
        "common_errors": [
          "Retelling events accurately but not including characters' emotions",
          "Recounting what happened without using the vocabulary and phrases from the book"
        ]
      }
    ]
  },
  {
    "concept_id": "LIT-R-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to show awareness that stories have patterns — noticing repeated phrases or predicting what comes next in a very familiar text.",
        "example_task": "While reading 'We're Going on a Bear Hunt', pause before the repeated refrain. Does the child join in?",
        "example_response": "The child says 'We can't go over it, we can't go under it' along with the reader, showing they know the pattern repeats.",
        "common_errors": [
          "Joining in with repeated phrases but not anticipating what happens next in the plot",
          "Only participating with the most well-known phrase, not other predictable elements"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes predicting what might happen next in a story based on the pictures, the title or what has happened so far.",
        "example_task": "Show the child the cover of an unfamiliar book. 'What do you think this story might be about? Why do you think that?'",
        "example_response": "'I think it's about a boy who gets lost in the forest because he looks scared and there are big trees. Maybe he finds his way home at the end because stories usually end happy.'",
        "common_errors": [
          "Making predictions unrelated to the visual or textual clues",
          "Only predicting happy endings without considering story clues"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Anticipating key events in stories based on knowledge of narrative structure, character behaviour and genre, and adjusting predictions as the story unfolds.",
        "example_task": "Pause part-way through a new story. 'What do you think will happen now? Why?'",
        "example_response": "'I think the fox is going to trick the hen because foxes are usually the tricky ones in stories. And he keeps saying he's her friend but he's looking at her in a sneaky way in the pictures. But I bet the hen will outsmart him at the end.'",
        "common_errors": [
          "Making reasonable predictions but not explaining the reasoning behind them",
          "Sticking with an initial prediction even when new story information contradicts it"
        ]
      }
    ]
  },
  {
    "concept_id": "LIT-R-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to understand the meaning of new words encountered in stories when the adult explains them, but not yet using them independently.",
        "example_task": "While reading, the adult explains 'enormous means really, really big.' Observe if the child responds to the word in context.",
        "example_response": "The child nods and points to the picture: 'That IS enormous!' They understand the meaning in context with adult support.",
        "common_errors": [
          "Seeming to understand during the story but not retaining the word afterward",
          "Confusing the new word with a similar-sounding word"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes understanding and using vocabulary from stories and teaching in appropriate contexts, making links between new words and known concepts.",
        "example_task": "After reading a book featuring the word 'miniature', observe if the child uses it during the week.",
        "example_response": "During small-world play later that week, the child says: 'These are miniature people for my miniature house.' They have transferred the word to a new context.",
        "common_errors": [
          "Using the word but with the wrong meaning",
          "Understanding the word receptively but not producing it in their own speech"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using new vocabulary from stories, non-fiction and teaching accurately in discussion and play, demonstrating understanding through correct usage.",
        "example_task": "During a science activity about habitats, observe whether the child uses vocabulary from the week's reading.",
        "example_response": "The child says: 'The caterpillar lives on the leaf — that's its habitat. It needs the leaf for food and for shelter from predators.' They use 'habitat', 'shelter' and 'predators' accurately, having encountered them in a non-fiction text earlier in the week.",
        "common_errors": [
          "Using topic vocabulary only when an adult models it first, not independently",
          "Knowing the word for a short time but not retaining it long-term"
        ]
      }
    ]
  },
  {
    "concept_id": "LIT-R-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to recognise some letter shapes and associate a few with their sounds, particularly letters in their own name.",
        "example_task": "Show the child the letters in their name. 'Can you tell me any of the sounds these letters make?'",
        "example_response": "The child recognises the first letter of their name: 'That's my letter! S — sss!' They may recognise 2-3 other letters from their name.",
        "common_errors": [
          "Knowing letter names but not their sounds",
          "Recognising the letter visually but not being able to produce the sound"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes saying the sound for most single letters of the alphabet, with growing speed and accuracy.",
        "example_task": "Show flashcards of single letters in random order. Can the child say the sound for each?",
        "example_response": "The child correctly identifies the sounds for 18-20 out of 26 letters, hesitating on some less common ones (x, q, v).",
        "common_errors": [
          "Confusing visually similar letters (b/d, p/q, m/n)",
          "Saying the letter name instead of the sound ('ess' instead of 'sss')"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Saying a sound for each letter in the alphabet confidently and quickly, and knowing at least some letter groups that represent one sound (digraphs).",
        "example_task": "Rapid letter sound recognition: show all 26 letters in random order plus 5 common digraphs (sh, ch, th, ng, ai).",
        "example_response": "The child says all 26 letter sounds correctly and without hesitation. They also identify sh ('shh'), ch ('ch'), th ('th'), and at least 2-3 other digraphs.",
        "common_errors": [
          "All single letters secure but digraph recognition still developing",
          "Knowing the sounds but not being quick enough for fluent reading"
        ]
      }
    ]
  },
  {
    "concept_id": "LIT-R-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to recognise that some pairs of letters work together to make one sound, even if they can only identify 1-2 digraphs.",
        "example_task": "Show the child 'sh' and 'ch'. 'These two letters work together. Can you tell me the sound they make?'",
        "example_response": "The child says 'shhh' for 'sh' and 'ch' for 'ch'. They understand the concept that two letters make one sound.",
        "common_errors": [
          "Sounding out each letter separately (s-h instead of 'sh')",
          "Confusing 'sh' and 'ch' sounds"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes recognising and producing the sounds for common digraphs (sh, ch, th, ng, ai, ee, oo, ar) with growing reliability.",
        "example_task": "Read these words using your digraph knowledge: ship, chin, feet, moon, park.",
        "example_response": "The child reads: 'sh-i-p — ship', 'ch-i-n — chin', 'f-ee-t — feet', 'm-oo-n — moon', 'p-ar-k — park'. They recognise the digraphs within words.",
        "common_errors": [
          "Recognising digraphs in isolation but not spotting them within words",
          "Confusing vowel digraphs that look similar (ai/ay, ee/ea)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Recognising and using at least 10 digraphs confidently when reading and writing, applying them to decode unfamiliar words.",
        "example_task": "Read these unfamiliar words using your digraph knowledge: sheet, chain, tooth, bring, light.",
        "example_response": "The child reads: 'sh-ee-t — sheet', 'ch-ai-n — chain', 't-oo-th — tooth', 'b-r-i-ng — bring', 'l-igh-t — light'. They identify digraphs (and trigraphs like 'igh') within words they haven't seen before.",
        "common_errors": [
          "Recognising consonant digraphs (sh, ch, th) but struggling with vowel digraphs (igh, oa, ow)",
          "Not recognising split digraphs (a-e, i-e) as a single sound unit"
        ]
      }
    ]
  },
  {
    "concept_id": "LIT-R-C006",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to blend two or three phonemes together orally to make a word, with adult support sounding out each phoneme slowly.",
        "example_task": "Adult says the sounds slowly: 's — a — t'. 'Can you push the sounds together to make a word?'",
        "example_response": "The child says: 's...a...t... sat!' — blending after a pause, possibly needing the adult to repeat the sounds.",
        "common_errors": [
          "Saying the individual sounds but not being able to merge them into a word",
          "Adding extra sounds (saying 'suh-a-tuh' instead of 's-a-t')"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes blending sounds in CVC words (consonant-vowel-consonant) independently to read simple words in print.",
        "example_task": "Read these words by sounding out and blending: cat, dog, pen, big, sun.",
        "example_response": "The child points to each letter, says the sound, then blends: 'c-a-t... cat!', 'd-o-g... dog!'. They manage most CVC words but may struggle when the vowel sound is less familiar.",
        "common_errors": [
          "Blending the first two sounds but guessing the last ('ca... car? cat?')",
          "Reading each sound correctly but not smoothly merging them into a word"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Reading words by blending sounds with fluency, including words with digraphs and adjacent consonants (CCVC, CVCC), demonstrating secure phonemic blending.",
        "example_task": "Read these words: ship, train, jump, clap, fish, green, chest.",
        "example_response": "The child reads fluently: 'ship' (recognising sh digraph), 'train' (blending consonant cluster tr and digraph ai), 'jump', 'clap' (managing consonant clusters), 'fish', 'green', 'chest'. Blending is smooth and automatic for most words.",
        "common_errors": [
          "Struggling with initial consonant clusters (bl, tr, gr) — saying the sounds but not merging them",
          "Blending CVC words fluently but slowing down significantly for CCVC/CVCC words"
        ]
      }
    ]
  },
  {
    "concept_id": "LIT-R-C007",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to recognise 2-3 common exception words by sight (I, the, to, no, go) without needing to decode them.",
        "example_task": "Show the child the words 'I', 'the' and 'to' in a sentence. Can they read them?",
        "example_response": "The child recognises 'I' and 'the' instantly. They attempt to decode 'to' phonically as 't-o' but then correct themselves: 'Oh, that's to!'",
        "common_errors": [
          "Trying to decode exception words phonically, producing incorrect pronunciations",
          "Recognising words in isolation but not in continuous text"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes reading common exception words automatically in context, with a growing bank of 10-15 sight words.",
        "example_task": "Read this sentence: 'The dog was in the garden and he said hello.'",
        "example_response": "The child reads the sentence, recognising 'the', 'was', 'in', 'and', 'he', 'said' as sight words and decoding 'dog', 'garden' and 'hello' phonically.",
        "common_errors": [
          "Recognising high-frequency words but not less common exception words ('said', 'was')",
          "Reading exception words correctly in one text but not recognising them in another"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Reading most common exception words automatically, enabling fluent reading of simple sentences and short texts.",
        "example_task": "Read this short passage fluently: 'Once there was a boy who could not find his shoes. He looked under the bed and behind the door. They were in the garden!'",
        "example_response": "The child reads the passage fluently, recognising exception words (once, there, was, who, could, not, his, he, the, behind, were) automatically and decoding other words smoothly. Reading sounds like natural speech rather than word-by-word.",
        "common_errors": [
          "Reading individual words correctly but not with the flow and expression of natural speech",
          "Still decoding some high-frequency exception words rather than recognising them automatically"
        ]
      }
    ]
  },
  {
    "concept_id": "LIT-R-C008",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to form some recognisable letters, particularly those in their own name, though formation may be inconsistent and some letters reversed.",
        "example_task": "Ask the child to write the first letter of their name and two other letters they know.",
        "example_response": "The child writes the first letter of their name recognisably. They form 's' and 'o' — the 's' is a bit wobbly and the 'o' doesn't fully close, but both are identifiable.",
        "common_errors": [
          "Starting letters from the wrong point (bottom instead of top)",
          "Consistently reversing certain letters (b/d, s/z)"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes forming most letters of the alphabet recognisably, with improving consistency in size, orientation and starting point.",
        "example_task": "Write all the letters of the alphabet. How many can the child form recognisably?",
        "example_response": "The child forms 20+ letters recognisably. Most are the correct orientation. Size is becoming more consistent. Some letters (k, q, z) are still uncertain.",
        "common_errors": [
          "Good formation when writing slowly and carefully but losing quality when writing at speed",
          "Letters recognisable but with inconsistent sizing (some huge, some tiny)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Forming lower-case and capital letters correctly, with letters that are mostly correctly oriented, appropriately sized and formed with the correct movement.",
        "example_task": "Write a sentence from dictation: 'The cat sat on the mat.' Observe letter formation.",
        "example_response": "The child writes the sentence with clearly formed letters. Capital 'T' at the start and full stop at the end. Letters sit on the line, are consistently sized, and are correctly oriented. Writing is readable by others.",
        "common_errors": [
          "Capital and lower-case letters the same size",
          "Letters floating above the line or descenders not going below it"
        ]
      }
    ]
  },
  {
    "concept_id": "LIT-R-C009",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to hear the first sound in a word and represent it with a letter, even if the rest of the word is not represented.",
        "example_task": "Ask the child to write 'cat'. Observe what they produce.",
        "example_response": "The child says 'c-c-cat' and writes 'c'. They have segmented the first phoneme and represented it correctly, even though the rest is missing.",
        "common_errors": [
          "Writing a random letter rather than the correct initial sound",
          "Hearing the sound but not being able to recall which letter represents it"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes segmenting CVC words into all their phonemes and writing a letter for each sound, producing phonically plausible spellings.",
        "example_task": "Write these words: dog, cup, hen, big.",
        "example_response": "The child writes: 'dog', 'cup', 'hen', 'big' — segmenting each word into its component sounds and representing each with the correct letter. May write 'hen' as 'hn' (missing the middle vowel).",
        "common_errors": [
          "Representing initial and final consonants but missing the medial vowel",
          "Choosing a letter that represents a similar sound (writing 'b' for 'd')"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Segmenting words confidently to spell them, including words with digraphs and adjacent consonants, producing readable writing.",
        "example_task": "Write: 'The fish swam in the pond.' from dictation.",
        "example_response": "The child writes: 'The fish swam in the pond.' — segmenting 'fish' as f-i-sh, 'swam' as s-w-a-m, 'pond' as p-o-n-d. Digraphs (sh, th) and consonant clusters (sw) are represented correctly.",
        "common_errors": [
          "Spelling CVC words correctly but not yet representing digraphs (writing 'fis' for 'fish')",
          "Struggling with consonant clusters at the beginning of words"
        ]
      }
    ]
  },
  {
    "concept_id": "LIT-R-C010",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to combine words into a simple phrase or label, understanding that writing communicates meaning.",
        "example_task": "After drawing a picture, ask the child to write something about it.",
        "example_response": "The child writes 'mi dog' (my dog) underneath their drawing. The writing shows intention and phonic knowledge even though spelling is developmental.",
        "common_errors": [
          "Writing a string of random letters without intention to communicate",
          "Drawing a picture but refusing to attempt any writing"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes writing short phrases and simple sentences that can be read by themselves and others, using finger spaces between words.",
        "example_task": "Write a sentence about what you did at the weekend.",
        "example_response": "'I went to the park.' — written with finger spaces, recognisable words, and a full stop. The child can read back what they wrote.",
        "common_errors": [
          "Running all words together without spaces",
          "Writing a sentence but not being able to read it back"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Writing simple phrases and sentences that can be read by others, using capital letters, full stops, finger spaces, and phonically plausible spellings.",
        "example_task": "Write 2-3 sentences about a story character.",
        "example_response": "'Goldilocks went in the bears house. She ate the porridge. The bears were cross.' — capital letters at the start, full stops at the end, finger spaces, readable phonic spellings. The meaning is clear and the sentences form a coherent piece.",
        "common_errors": [
          "Using full stops and capital letters inconsistently",
          "Writing one good sentence but not being able to sustain quality across multiple sentences"
        ]
      }
    ]
  }
]
