[
  {
    "concept_id": "CL-R-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to listen to a short story or instruction for a few minutes with adult support, needing frequent reminders to refocus attention.",
        "example_task": "During story time, sit and listen to a short picture book (3-4 minutes) with the adult pausing to engage the child.",
        "example_response": "The child sits for the story with occasional fidgeting but looks at the pictures when prompted and responds to questions like 'What can you see?'",
        "common_errors": [
          "Leaving the carpet area before the story ends",
          "Attending to the pictures but not the adult's spoken words"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes sustaining attention through a whole story or group discussion with encouragement, showing engagement through eye contact and body language.",
        "example_task": "Listen to a 5-minute story without picture support, then answer a question about what happened.",
        "example_response": "The child listens to the whole story, sits still, and can recall a key event: 'The bear went into the cave.'",
        "common_errors": [
          "Tuning out when there are no pictures to look at",
          "Attending to other children's behaviour rather than the speaker"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Listening attentively and responding to what they hear with relevant questions, comments and actions during whole-class activities and small-group discussions.",
        "example_task": "During a group discussion about 'What makes a good friend?', listen to other children's ideas and add your own that builds on what they said.",
        "example_response": "The child listens to a peer say 'A good friend shares toys' and responds: 'Yes, and a good friend helps you when you fall over, like when Ayesha helped me yesterday.'",
        "common_errors": [
          "Talking over others without waiting for them to finish",
          "Making a comment unrelated to what the previous speaker said"
        ]
      }
    ]
  },
  {
    "concept_id": "CL-R-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to indicate when they do not understand, through facial expression, hesitation or repeating back incorrectly, but not yet formulating questions.",
        "example_task": "Give the child a two-part instruction with one unfamiliar word. Observe whether they show confusion.",
        "example_response": "The child looks puzzled when hearing an unfamiliar word and says 'What?' or looks to the adult for help, rather than ignoring the confusion.",
        "common_errors": [
          "Nodding as if understanding but then doing the wrong thing",
          "Not showing any sign that they didn't understand"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes asking simple questions when they don't understand: 'What does that mean?' or 'Can you say it again?'",
        "example_task": "During a science activity, use the word 'dissolve'. See if the child asks what it means.",
        "example_response": "The child asks: 'What does dissolve mean?' or 'Can you show me?'",
        "common_errors": [
          "Asking 'What?' without specifying what they don't understand",
          "Waiting too long to ask, losing the thread of the activity"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Asking questions to find out more and to check they understand what has been said to them, targeting the specific gap in their understanding.",
        "example_task": "Tell the child: 'After snack, we're going to the hall for a special visitor.' Observe what questions they ask.",
        "example_response": "The child asks: 'Who is the special visitor?' or 'What are they going to do?' — showing they understood the instruction but want more information.",
        "common_errors": [
          "Asking the same question repeatedly without processing the answer",
          "Not distinguishing between what they know and what they need to find out"
        ]
      }
    ]
  },
  {
    "concept_id": "CL-R-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to take turns in conversation with an adult, responding to a question or comment with a single turn before moving on.",
        "example_task": "During snack time, engage the child in conversation: 'What did you have for breakfast?' Observe if they respond and whether they sustain the topic.",
        "example_response": "The child answers: 'Toast.' but does not ask a follow-up or extend the conversation beyond one turn.",
        "common_errors": [
          "Giving one-word answers and then walking away",
          "Talking about something completely different in response to the question"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes sustaining a back-and-forth exchange across 3-4 turns with an adult, staying on topic and adding new information.",
        "example_task": "Ask the child about their weekend. Sustain the conversation for several turns.",
        "example_response": "Adult: 'What did you do at the weekend?' Child: 'I went to the park.' Adult: 'What did you do there?' Child: 'I went on the swings and I saw a dog.' Adult: 'What kind of dog?' Child: 'A big brown one. It was friendly.'",
        "common_errors": [
          "Repeating the same information instead of adding new details",
          "Switching topic after 1-2 turns"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Holding back-and-forth conversations with both adults and peers, taking turns to listen and respond, staying on topic, and building on what others say.",
        "example_task": "During small-world play, observe the child negotiating roles and storylines with peers through sustained conversation.",
        "example_response": "Child A: 'I'll be the shopkeeper.' Child B: 'Can I buy some food?' Child A: 'What do you want?' Child B: 'Some apples and bread please.' Child A: 'That's three pounds.' Child B: 'Here you go. I need a bag.' The conversation sustains across multiple turns with both children responding to each other.",
        "common_errors": [
          "Talking at the same time as the other child instead of taking turns",
          "Dominating the conversation without listening to the other child's contributions"
        ]
      }
    ]
  },
  {
    "concept_id": "CL-R-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to use some recently introduced vocabulary in familiar contexts, though not always accurately.",
        "example_task": "After learning the word 'enormous' during a story, observe if the child uses it during play.",
        "example_response": "During block play, the child says: 'Look at my enormous tower!' — using the new word in an appropriate context.",
        "common_errors": [
          "Using the new word incorrectly (e.g. 'I enormoused it')",
          "Understanding the word when heard but never producing it spontaneously"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes using new vocabulary learned in stories and teaching to describe, explain or comment, with generally appropriate meaning.",
        "example_task": "After a topic on minibeasts, ask the child to tell you about a caterpillar using words they have learned.",
        "example_response": "The child says: 'Caterpillars have lots of legs. They eat leaves and then they go in a cocoon and turn into a butterfly. It's called a chrysalis.'",
        "common_errors": [
          "Only recalling the most common words (legs, eats) and not the topic-specific vocabulary",
          "Using new words in rehearsed phrases but not adapting them to new situations"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using new vocabulary throughout the day in different contexts, demonstrating understanding of the word's meaning and using it accurately and appropriately.",
        "example_task": "Observe whether the child uses vocabulary from the week's learning in contexts beyond the taught activity.",
        "example_response": "Having learned 'hibernate' during a topic on animals, the child says at home time: 'I'm so tired, I want to hibernate like a bear!' — transferring the word to a new, creative context that shows genuine understanding.",
        "common_errors": [
          "Only using new vocabulary when directly prompted by an adult",
          "Knowing the word but using it with the wrong meaning"
        ]
      }
    ]
  },
  {
    "concept_id": "CL-R-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to use 'because' in speech, though the reason given may be circular or not logically connected.",
        "example_task": "Ask the child: 'Why did the caterpillar eat so much?'",
        "example_response": "The child says: 'Because he was hungry' — a valid but simple cause. Or 'Because he eated lots' — circular, restating the effect as the cause.",
        "common_errors": [
          "Using 'because' followed by a restatement of the effect rather than a cause",
          "Saying 'because' and then trailing off without completing the explanation"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes giving explanations using 'because', 'so' or 'if...then' with logical connections, especially for familiar situations.",
        "example_task": "Ask the child: 'Why do we need to wear coats today?'",
        "example_response": "'Because it's raining outside so we'll get wet if we don't wear them.' — a chain of cause and effect.",
        "common_errors": [
          "Giving explanations only for concrete, immediate situations (not abstract ones)",
          "Using 'because' correctly sometimes but not consistently"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Offering explanations for why things might happen, making use of recently learned vocabulary and connecting cause and effect clearly in speech.",
        "example_task": "After planting seeds, ask: 'What do you think will happen to the seeds? Why?'",
        "example_response": "'I think the seeds will grow into plants because we put them in soil and gave them water. Plants need water and light to grow. If we put them in the dark cupboard they wouldn't grow because there's no light.'",
        "common_errors": [
          "Stating what will happen without explaining why",
          "Not using conditional language ('if...then') to explore possibilities"
        ]
      }
    ]
  },
  {
    "concept_id": "CL-R-C006",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to use past tense in speech, though often with overgeneralised forms ('I goed', 'I runned') which show understanding of the tense concept.",
        "example_task": "Ask the child: 'What did you do at the weekend?'",
        "example_response": "'I goed to the park and I runned really fast.' — overgeneralised past tense, but correctly placing events in the past.",
        "common_errors": [
          "Overgeneralising regular past tense to irregular verbs ('goed', 'eated', 'bringed')",
          "Using present tense for past events ('Yesterday I go to the park')"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes using past, present and future tenses correctly, with common irregular forms becoming more accurate.",
        "example_task": "Ask: 'Tell me about yesterday, today and tomorrow.'",
        "example_response": "'Yesterday I went to Grandma's house. Today I am at school. Tomorrow I'm going to play at Tom's house.' — uses went (correct irregular), am (present), going to (future).",
        "common_errors": [
          "Still overgeneralising some irregular forms while getting others correct",
          "Finding future tense harder to express than past or present"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using past, present and future forms accurately and appropriately in extended speech, including irregular past tenses and progressive forms.",
        "example_task": "During show-and-tell, observe the child's tense use when describing a recent experience.",
        "example_response": "'At the weekend, I went to the beach with my family. We were swimming in the sea and I saw a crab! It was hiding under a rock. Next weekend, we're going again and I'm going to look for more crabs.' — accurate past simple, past progressive, and future forms.",
        "common_errors": [
          "Mixing tenses within a single narrative ('I went and then I am playing')",
          "Avoiding complex tense forms and sticking only to simple past"
        ]
      }
    ]
  }
]
