[
  {
    "concept_id": "UW-R-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to use words like 'yesterday', 'today', 'tomorrow', 'before' and 'after', though not always accurately.",
        "example_task": "Ask the child: 'What did you do yesterday?' Observe whether they use past-tense language and time vocabulary.",
        "example_response": "'Yesterday I went to the shops with Mummy.' — uses 'yesterday' and past tense correctly.",
        "common_errors": [
          "Using 'yesterday' to mean any time in the past ('Yesterday at Christmas...')",
          "Mixing up 'yesterday' and 'tomorrow'"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes using chronological language accurately to sequence events in their own life and in stories.",
        "example_task": "Tell me about your morning using time words: first, then, after that, finally.",
        "example_response": "'First I woke up. Then I had breakfast. After that I brushed my teeth. Finally Mummy took me to school.'",
        "common_errors": [
          "Using 'and then' repeatedly instead of varied time connectives",
          "Sequencing events correctly but not using specific time vocabulary"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using past, present and future language confidently to talk about events, comparisons and changes, with accurate vocabulary.",
        "example_task": "Show the child baby photos and current photos. 'How have you changed? What could you do then that you can't now? What can you do now?'",
        "example_response": "'When I was a baby I couldn't walk or talk. Now I can read and ride my bike. In the future I want to learn to swim. I've changed a lot — I used to be tiny and now I'm big!'",
        "common_errors": [
          "Describing changes without using comparative language (bigger, faster, more)",
          "Talking about now and then but not about the future"
        ]
      }
    ]
  },
  {
    "concept_id": "UW-R-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to notice that things were different 'in the old days' when shown photographs or objects from the past.",
        "example_task": "Show an old telephone and a smartphone. 'What do you notice about these two things?'",
        "example_response": "'That one is big and has a wire. My mummy's phone is small and has a screen.' The child identifies physical differences.",
        "common_errors": [
          "Noticing differences in appearance but not connecting them to time/age",
          "Not understanding that the old object served the same purpose as the new one"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes identifying specific things that have changed and things that have stayed the same when comparing past and present.",
        "example_task": "Compare these photos of our school from long ago and now. What has changed? What is the same?",
        "example_response": "'The building is the same but it looks cleaner now. The children wore different clothes — some were in aprons. But they're still playing in the playground like us.'",
        "common_errors": [
          "Only noticing changes and not recognising any continuity",
          "Making assumptions about the past based on fiction rather than evidence"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Comparing and contrasting characters from stories and figures from the past, explaining how things have changed over time.",
        "example_task": "Compare what children did for fun in your grandparents' time with what you do. Use the photos and stories we've shared.",
        "example_response": "'Children used to play outside more because they didn't have tablets or TVs. They played marbles and skipping. We still play outside sometimes, so that's the same. But they didn't have computers. I think they had more time to make up games because there were fewer toys.'",
        "common_errors": [
          "Describing the past as entirely negative or entirely positive",
          "Not using evidence from sources to support their comparisons"
        ]
      }
    ]
  },
  {
    "concept_id": "UW-R-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to engage with stories about the past, showing interest in 'when things were different' and asking questions.",
        "example_task": "Read a story set in the past (e.g. a story about a Victorian child). Does the child notice that things were different?",
        "example_response": "The child says: 'Why is she wearing that funny dress?' or 'They don't have a car!' — noticing differences from their own experience.",
        "common_errors": [
          "Not noticing that the story is set in a different time period",
          "Thinking the story characters are from another country rather than another time"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes using information from stories to talk about what life was like in the past, distinguishing between story and real history.",
        "example_task": "After reading a story about life during WWII, ask: 'Is this story true? What does it tell us about what life was really like?'",
        "example_response": "'The story isn't exactly true because it's made up, but it tells us about real things — children really were sent away from their families during the war. That must have been scary.'",
        "common_errors": [
          "Treating the story as entirely factual or entirely fictional",
          "Not connecting fictional stories to real historical events or conditions"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Understanding that stories and non-fiction texts can tell us about the past, using them as evidence to explain how people lived in different times.",
        "example_task": "Using a story and a non-fiction text about the same period, discuss what we can learn about people's lives.",
        "example_response": "'The story about the Roman soldier shows what it might have felt like to be far from home. The information book tells us real facts about what Romans ate and wore. Together they help me understand that Roman soldiers had a hard life but were brave. The story helps me imagine it and the facts help me know it was real.'",
        "common_errors": [
          "Preferring stories over facts or vice versa without seeing the value of both",
          "Not being able to distinguish what is factual from what is imagined"
        ]
      }
    ]
  },
  {
    "concept_id": "UW-R-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to name some features of their immediate environment using simple vocabulary: school, park, road, shop, house.",
        "example_task": "During a walk around the school grounds, ask: 'What can you see? What do we call this?'",
        "example_response": "'There's the playground. And that's the gate. There's a tree and a fence.' The child names visible features.",
        "common_errors": [
          "Using very general terms ('thing', 'stuff') instead of specific vocabulary",
          "Not noticing features unless specifically asked about them"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes describing features of the local environment with more detail, including some geographical vocabulary (hill, river, bridge, church).",
        "example_task": "After a local walk, ask: 'What did we see? Describe our local area to someone who has never been here.'",
        "example_response": "'Our school is near a main road. There's a park with a pond and some ducks. We walked past the church and the post office. There's a big hill behind the school.'",
        "common_errors": [
          "Describing only human features (shops, roads) and not natural ones (trees, hills)",
          "Not using geographical vocabulary when they know it, reverting to everyday language"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Describing their immediate environment and drawing information from maps, offering reasons for observations and using vocabulary from teaching.",
        "example_task": "Draw a simple map of the route from school to the park. What do you pass? Why is the park where it is?",
        "example_response": "The child draws a simple route showing the school, road, shops and park. 'We turn left out of school, walk past the shops, cross the road at the crossing, and the park is on the corner. I think the park is there because there's flat ground and it's where lots of streets meet so everyone can get to it.'",
        "common_errors": [
          "Drawing a picture rather than a map (showing things from the side, not from above)",
          "Describing what they see without attempting to explain why things are where they are"
        ]
      }
    ]
  },
  {
    "concept_id": "UW-R-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to notice that different families celebrate different things and have different customs.",
        "example_task": "During a discussion about celebrations, ask: 'Does everyone celebrate the same things? What does your family celebrate?'",
        "example_response": "'My family celebrates Christmas. Amir's family celebrates Eid. We both have parties and special food!'",
        "common_errors": [
          "Assuming everyone celebrates the same festivals as their family",
          "Showing surprise or confusion about unfamiliar celebrations"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes showing respect for and interest in the beliefs, traditions and celebrations of others, and identifying similarities across different cultures.",
        "example_task": "After learning about Diwali and Christmas, ask: 'What is similar about these celebrations?'",
        "example_response": "'Both have special lights — Diwali has candles called diyas and Christmas has fairy lights. Both have special food and families get together. They're about different things but they're both happy celebrations.'",
        "common_errors": [
          "Focusing only on differences between cultures without seeing commonalities",
          "Treating unfamiliar celebrations as strange rather than interesting"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Knowing that people have different beliefs and celebrating this diversity, explaining similarities and differences between communities with respect and understanding.",
        "example_task": "Why is it good that people in our class come from different backgrounds and celebrate different things?",
        "example_response": "'It's good because we learn about lots of different things. When Priya told us about Holi, I learned about the colours and I thought it sounded fun. Everyone's celebrations are special to them. We're all different but we're all in the same class and we can learn from each other.'",
        "common_errors": [
          "Giving a rehearsed 'tolerance' answer without genuine understanding",
          "Being respectful but not showing curiosity or interest in learning about difference"
        ]
      }
    ]
  },
  {
    "concept_id": "UW-R-C006",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to recognise that there are places beyond their local area, shown through pictures, maps or stories about other countries.",
        "example_task": "Show photographs of a village in Kenya. 'This is where some children live. What do you notice?'",
        "example_response": "'It looks hot and sunny. The houses are different from ours. There are animals like goats.' The child notices differences.",
        "common_errors": [
          "Assuming all foreign places are the same",
          "Making value judgements ('Their houses are bad') rather than observations"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes identifying similarities and differences between their community and a community in another country, using photographs and stories.",
        "example_task": "Compare a day at school in our village with a day at school in a village in India.",
        "example_response": "'Both places have children going to school. We wear uniforms and they do too but different ones. They might learn different languages. The weather is hotter so their school might look different. But the children are learning and playing just like us.'",
        "common_errors": [
          "Only identifying differences without recognising shared human experiences",
          "Assuming life in the other country is entirely different from their own"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining some similarities and differences between life in this country and life in other countries, drawing on knowledge from stories, non-fiction texts and discussions.",
        "example_task": "If you visited the country in our stories, what would be the same as here and what would be different? Why?",
        "example_response": "'Families love their children everywhere — that's the same. But the food might be different because different things grow there — it's hotter so they might grow rice and mangoes instead of potatoes. The language would be different so I'd need to learn some words. Houses look different because they're built for hot weather, not cold weather like ours.'",
        "common_errors": [
          "Describing differences without attempting to explain why they exist",
          "Not recognising universal human experiences across different communities"
        ]
      }
    ]
  },
  {
    "concept_id": "UW-R-C007",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to look at living things with interest and noticing basic features: 'It has legs', 'It's furry', 'The flower is yellow'.",
        "example_task": "Take the child to look at the school garden. 'What living things can you see? What do you notice about them?'",
        "example_response": "'There's a spider — it has lots of legs! And a snail with a shell on its back. The flowers are red and yellow.' The child observes and comments on features.",
        "common_errors": [
          "Looking briefly without sustained observation",
          "Naming the creature/plant but not describing any features"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes observing living things closely and with more detail, using descriptive vocabulary and beginning to compare.",
        "example_task": "Use a magnifying glass to look at two different leaves. What is the same? What is different?",
        "example_response": "'Both leaves are green but this one is bigger and has a smooth edge. This one is smaller and has a jagged edge like teeth. I can see lines on both of them — like little roads on the leaf.'",
        "common_errors": [
          "Comparing only one feature (colour) instead of multiple features",
          "Not using the magnifying glass effectively to see detail"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Exploring the natural world around them, making observations and drawing pictures that show care, detail and accuracy.",
        "example_task": "Draw a detailed observational picture of this caterpillar. Look very carefully and include everything you notice.",
        "example_response": "The child draws the caterpillar with segments, legs (three pairs of true legs plus prolegs), patterns on its body, and antennae. They look back and forth between the real caterpillar and their drawing, adding details they initially missed.",
        "common_errors": [
          "Drawing from memory or schema instead of from careful observation",
          "Drawing quickly without looking carefully at the real specimen"
        ]
      }
    ]
  },
  {
    "concept_id": "UW-R-C008",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to recognise that different places look and feel different, naming basic environments (beach, forest, snow).",
        "example_task": "Show pictures of a desert, a rainforest and a snowy mountain. 'Which of these places is hot? Cold? Wet?'",
        "example_response": "'The desert is hot and sandy. The snowy place is really cold. The forest is wet with lots of trees.'",
        "common_errors": [
          "Identifying one characteristic but not connecting it to the type of environment",
          "Thinking all foreign places are hot"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes describing different environments using detail and beginning to understand that different animals and plants live in different places.",
        "example_task": "Which animals live in the ocean? Which live in the forest? Why can't a fish live in the forest?",
        "example_response": "'Fish live in the ocean because they need water to breathe through their gills. Squirrels live in forests because they need trees for their homes and nuts to eat. A fish can't live in the forest because there's no water — it would die.'",
        "common_errors": [
          "Knowing where animals live but not being able to explain why",
          "Thinking animals 'choose' where to live rather than being suited to their environment"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Understanding that different environments support different living things, and that features of animals and plants help them survive in their particular environment.",
        "example_task": "Why do polar bears have thick white fur? What would happen if a polar bear lived in the desert?",
        "example_response": "'Polar bears have thick fur to keep warm in the ice and snow. The white colour helps them hide in the snow so they can catch seals. If a polar bear lived in the desert, it would be too hot because of its thick fur, and it wouldn't be able to hide because deserts aren't white. Different animals are made for different places.'",
        "common_errors": [
          "Describing animal features without connecting them to the environment",
          "Not understanding that animals are adapted to specific conditions"
        ]
      }
    ]
  },
  {
    "concept_id": "UW-R-C009",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to notice seasonal changes: leaves falling in autumn, snow in winter, flowers in spring, warm sunshine in summer.",
        "example_task": "Take the child outside in autumn. 'What is happening to the trees? Why do you think this is happening?'",
        "example_response": "'The leaves are falling off the trees. They're turning brown and orange. Maybe because it's getting cold.'",
        "common_errors": [
          "Noticing the change but not connecting it to the season",
          "Thinking leaves fall because the wind blows them, not because of seasonal change"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes describing features of all four seasons and beginning to understand that water can change form (liquid water, solid ice).",
        "example_task": "Put water in a cup in the freezer. What happens? Why? What will happen if we bring it back to the warm classroom?",
        "example_response": "'The water turned into ice because the freezer is very cold! It's hard now. If we bring it inside, it will melt back into water because the classroom is warm.'",
        "common_errors": [
          "Knowing that ice melts but not understanding that ice IS water in a different form",
          "Thinking ice and water are different substances rather than the same substance in different states"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Understanding the effect of changing seasons on the natural world and knowing some important processes, including that water can freeze and melt.",
        "example_task": "Why do some animals hibernate in winter? What happens to the puddles in the playground when it gets very cold?",
        "example_response": "'Animals like hedgehogs hibernate because there's not much food in winter. They sleep to save energy until spring when there's more food. When it gets really cold, the puddles freeze and turn into ice because water freezes when it gets below zero. When it warms up, the ice melts back into water. It's the same water — it just changes.'",
        "common_errors": [
          "Understanding freezing and melting as separate events rather than as reversible changes",
          "Knowing about hibernation but thinking all animals hibernate"
        ]
      }
    ]
  }
]
