[
  {
    "concept_id": "PSED-R-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to identify basic emotions (happy, sad, angry) in themselves and others using pictures, facial expressions or adult modelling.",
        "example_task": "During circle time, show emotion cards. 'Point to the face that looks happy. How do you feel today?'",
        "example_response": "The child points to the happy face and says 'I feel happy today because it's my friend's birthday.'",
        "common_errors": [
          "Labelling all negative emotions as 'sad' without distinguishing angry, scared, frustrated",
          "Identifying emotions in pictures but not recognising them in real situations"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes naming a wider range of emotions (worried, excited, frustrated, scared) in themselves and recognising emotions in peers from context clues.",
        "example_task": "When a child is upset because their tower fell down, prompt them: 'How are you feeling? What word describes that?'",
        "example_response": "The child says: 'I feel frustrated because my tower keeps falling down and I tried really hard.'",
        "common_errors": [
          "Knowing emotion words but not connecting them to their own felt experience",
          "Needing adult prompting every time — not yet self-initiating emotional language"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Talking about their own and others' feelings confidently, explaining why they feel that way, and showing awareness that others may feel differently.",
        "example_task": "During a disagreement over a toy, observe whether the child can name their emotion and consider the other child's feelings.",
        "example_response": "The child says: 'I'm angry because I was playing with it first. But I think Alfie is sad because he wants a turn too. We could take turns.'",
        "common_errors": [
          "Naming their own emotions but not considering how the other person feels",
          "Assuming everyone feels the same way they do about a situation"
        ]
      }
    ]
  },
  {
    "concept_id": "PSED-R-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to wait for a short time when asked, though needs frequent adult reminders and may struggle when the wait is uncertain.",
        "example_task": "During a turn-taking game, observe whether the child can wait for their turn with adult support.",
        "example_response": "The child waits for one other person to take their turn before having theirs, with the adult saying 'It's nearly your turn, just one more.'",
        "common_errors": [
          "Grabbing the resource before their turn",
          "Becoming distressed when asked to wait, even briefly"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes managing to wait, take turns and resist impulses with encouragement, particularly in structured activities.",
        "example_task": "In a circle game, the child must wait for the song to reach them before performing their action.",
        "example_response": "The child waits through the whole song, fidgeting but not acting until it is their turn. They perform their action and pass to the next child.",
        "common_errors": [
          "Managing impulse control in calm situations but losing it when excited or frustrated",
          "Needing physical strategies (sitting on hands) to manage waiting"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Managing their own behaviour and impulses, including waiting for turns, completing a task before moving on, and explaining why rules about waiting are fair.",
        "example_task": "During free-flow play, the child wants to use the computer but it is occupied. Observe their response.",
        "example_response": "The child checks who is using the computer, puts their name on the waiting list, finds another activity to do while waiting, and checks back after a reasonable time. When asked why they waited, they say: 'Because Ravi was using it first and you have to wait for your turn.'",
        "common_errors": [
          "Finding an alternative activity but then forgetting to return for their turn",
          "Waiting externally but showing increasing agitation (complaining, hovering)"
        ]
      }
    ]
  },
  {
    "concept_id": "PSED-R-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to follow simple, single-step instructions from a familiar adult ('Sit down', 'Come here', 'Wash your hands').",
        "example_task": "Give the child a one-step instruction: 'Please put your coat on your peg.'",
        "example_response": "The child hangs their coat on the correct peg after one request.",
        "common_errors": [
          "Starting to follow the instruction but getting distracted part-way",
          "Needing the instruction repeated multiple times"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes following two-step instructions without reminders ('Get your coat and line up by the door').",
        "example_task": "Give the child a two-step instruction: 'Put your lunchbox in the box and then sit on the carpet.'",
        "example_response": "The child puts their lunchbox away and then sits on the carpet without needing a reminder for the second step.",
        "common_errors": [
          "Completing the first step but forgetting the second",
          "Completing both steps but in the wrong order"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Following multi-step instructions independently, remembering the sequence and completing all steps without reminders.",
        "example_task": "Give the instruction: 'Get your reading book from your tray, put it in your bag, and then sit quietly on the carpet.'",
        "example_response": "The child completes all three steps in order without reminders, carrying the instruction in working memory through to completion.",
        "common_errors": [
          "Managing two steps but struggling with three or more",
          "Needing to ask 'What was the last thing?' after completing the first two steps"
        ]
      }
    ]
  },
  {
    "concept_id": "PSED-R-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to attempt challenging tasks but giving up quickly when encountering difficulty, needing adult encouragement to try again.",
        "example_task": "When a jigsaw puzzle piece doesn't fit, observe whether the child tries a different piece or gives up.",
        "example_response": "The child tries one piece, it doesn't fit, and they push the puzzle away saying 'I can't do it.' With encouragement, they try another piece.",
        "common_errors": [
          "Giving up after a single attempt",
          "Becoming upset rather than trying a different approach"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes persisting with a difficult task for several minutes, trying different approaches before seeking help, with encouragement.",
        "example_task": "During a construction activity, the child's model keeps collapsing. Observe their response.",
        "example_response": "The child says 'It keeps falling' but tries building it differently — wider at the base — before asking the adult for help. They accept the suggestion and continue building.",
        "common_errors": [
          "Trying the same approach repeatedly rather than adapting their strategy",
          "Asking for adult help immediately without attempting to solve the problem independently"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Persevering when tasks are challenging, managing frustration, adapting their approach, and bouncing back from setbacks without persistent distress.",
        "example_task": "The child is learning to write their name. The letter 's' keeps going wrong. Observe their persistence and self-regulation.",
        "example_response": "The child says: 'My s is tricky. Let me look at the card again.' They try several times, comparing each attempt to the model. When one is better, they say: 'That one is more like it! I need to start at the top and curve round.' They continue practising without becoming distressed.",
        "common_errors": [
          "Persevering with physical tasks but giving up on cognitive ones (or vice versa)",
          "Persisting so long that frustration builds to an unmanageable level"
        ]
      }
    ]
  },
  {
    "concept_id": "PSED-R-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to follow simple class rules when reminded ('We walk inside', 'We use kind hands'), and understanding that some actions are not allowed.",
        "example_task": "Observe whether the child follows the rule 'walking feet inside' after one reminder.",
        "example_response": "The child starts running, is reminded, and then walks — showing they understand the rule even if they don't yet follow it automatically.",
        "common_errors": [
          "Following rules when an adult is watching but not when unsupervised",
          "Knowing what the rule is but not understanding why it exists"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes explaining why rules exist and beginning to distinguish between right and wrong in familiar social contexts.",
        "example_task": "Ask: 'Why do we have the rule about not snatching toys from each other?'",
        "example_response": "'Because it makes people sad and it's not fair. We should ask if we can have a turn.'",
        "common_errors": [
          "Explaining rules as 'because the teacher said so' rather than understanding the reason",
          "Applying rules to others but not to themselves"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining rules and the reasons behind them, distinguishing right from wrong in social situations, and attempting to self-correct when they make mistakes.",
        "example_task": "The child accidentally knocks over another child's painting. Observe their response.",
        "example_response": "The child says: 'Oh no, I'm sorry! I didn't mean to. Let me help you fix it.' They attempt to repair the situation and comfort the upset child, showing understanding that accidents happen but you should try to put things right.",
        "common_errors": [
          "Denying responsibility ('It wasn't me!') instead of taking ownership",
          "Apologising when prompted but not showing genuine understanding of the impact"
        ]
      }
    ]
  },
  {
    "concept_id": "PSED-R-C006",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to manage some self-care tasks with adult help: attempting to put on shoes, using the toilet with reminders, recognising their own coat.",
        "example_task": "Observe whether the child attempts to put their coat on independently.",
        "example_response": "The child picks up their coat and tries to put it on, managing the arms but needing help with the zip.",
        "common_errors": [
          "Waiting for an adult to dress them without attempting it themselves",
          "Putting shoes on the wrong feet consistently"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes managing self-care tasks independently: dressing, toileting, washing hands, making simple food choices, with occasional support.",
        "example_task": "At lunchtime, observe whether the child manages their lunchbox, opens containers and eats independently.",
        "example_response": "The child opens their lunchbox, manages most containers, eats their lunch independently, and puts rubbish in the bin. They need help with one tight lid.",
        "common_errors": [
          "Being able to dress but not undress (or vice versa)",
          "Managing self-care routines in the familiar setting but not in new contexts"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Managing all basic self-care needs independently: dressing, toileting, hand-washing, healthy eating choices — and beginning to explain why these matter.",
        "example_task": "Observe the child's self-care routine across a full day without prompting.",
        "example_response": "The child puts their coat on independently (including zip), uses the toilet and washes hands without reminders, manages their lunch independently, and chooses to wash hands after messy play. When asked why they washed hands, they say: 'Because there's paint on them and I don't want to get it on my reading book.'",
        "common_errors": [
          "Completing self-care tasks but rushing and doing them poorly (not actually washing with soap)",
          "Being independent with routines but not understanding the health reasons behind them"
        ]
      }
    ]
  },
  {
    "concept_id": "PSED-R-C007",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to play alongside other children (parallel play) and sometimes joining in group play with adult support.",
        "example_task": "During construction play, observe whether the child plays near others and responds to invitations to join.",
        "example_response": "The child builds their own model next to another child. When the other child says 'We could join our roads together', the child agrees and connects them.",
        "common_errors": [
          "Playing alone and ignoring attempts by peers to include them",
          "Wanting to join in but not knowing how to enter an existing game"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes taking turns, sharing resources and cooperating in small-group play, though disputes still arise frequently.",
        "example_task": "During a board game, observe whether the child takes turns and follows the rules.",
        "example_response": "The child waits for their turn, rolls the dice and moves their piece. When they land on a bad square, they are disappointed but continue playing. They say 'Your turn!' to the next player.",
        "common_errors": [
          "Taking turns in structured games but not in free play",
          "Sharing with some children but not others"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Working and playing cooperatively, taking turns, negotiating, sharing resources, and showing sensitivity to others' needs in sustained group play.",
        "example_task": "Observe a group of children setting up a pretend shop. Note cooperative behaviours.",
        "example_response": "The children negotiate roles: 'I'll be the shopkeeper, you be the customer, and you bring the food.' They share the play food, take turns being customers, and adapt when someone wants to change roles: 'OK, you can be the shopkeeper now and I'll make the food.' They sustain this cooperatively for 15+ minutes.",
        "common_errors": [
          "Cooperating in adult-led activities but not in child-initiated play",
          "Dominating the play and assigning roles without negotiation"
        ]
      }
    ]
  },
  {
    "concept_id": "PSED-R-C008",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to show preference for a key adult in the setting, seeking them out for comfort and reassurance.",
        "example_task": "At drop-off time, observe whether the child separates from their parent and approaches their key person.",
        "example_response": "The child clings briefly to their parent but then goes to their key person when invited, accepting comfort from this familiar adult.",
        "common_errors": [
          "Remaining distressed after parent leaves for a prolonged period",
          "Accepting any adult equally without forming a specific attachment"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes using the key adult as a secure base — exploring the setting confidently but returning for reassurance when needed, and beginning to form friendships.",
        "example_task": "Observe the child's social behaviour during a new activity (e.g. a visiting storyteller).",
        "example_response": "The child is initially cautious but watches from near their key person. After a few minutes, they move closer to the storyteller and join in, glancing back at their key person occasionally. They sit next to a preferred friend.",
        "common_errors": [
          "Needing to stay physically close to the key adult at all times",
          "Being so independent that they don't seek adult support when they actually need it"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Building constructive and respectful relationships with staff and peers, showing confidence in new social situations and empathy towards others' feelings.",
        "example_task": "A new child joins the class. Observe how the established child responds.",
        "example_response": "The child approaches the new child and says: 'Do you want to play with me? This is the water tray — you can use these cups.' They show the new child around and include them in an activity, helping them feel welcome.",
        "common_errors": [
          "Ignoring the new child or being territorial about resources",
          "Being friendly initially but not sustaining the welcoming behaviour"
        ]
      }
    ]
  },
  {
    "concept_id": "PSED-R-C009",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to notice when another child is upset, through facial expression or crying, though may not know how to respond.",
        "example_task": "When a nearby child is crying, observe whether the child notices and how they respond.",
        "example_response": "The child looks at the crying child with concern. They may point and say to an adult: 'He's crying.' They notice but don't yet know how to help.",
        "common_errors": [
          "Not noticing peers' distress when absorbed in their own activity",
          "Noticing but becoming distressed themselves rather than responding helpfully"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes responding to others' emotions with appropriate comfort or concern, and beginning to understand that others may feel differently from them.",
        "example_task": "A child falls over in the playground. Observe the response.",
        "example_response": "The child goes over and says: 'Are you OK?' They offer to get a teacher or stay with the child. They may offer their own comfort object: 'Do you want to hold my teddy?'",
        "common_errors": [
          "Comforting others in ways that would comfort themselves but might not help the other child",
          "Understanding that others are upset but not understanding why"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Showing sensitivity to their own and others' needs, considering other people's feelings, and adjusting their behaviour in response to others' emotions.",
        "example_task": "During a game, one child keeps losing and is getting upset. Observe the response.",
        "example_response": "The child notices their friend is upset and says: 'It's just a game, don't worry. Do you want to play something different?' They may suggest changing the rules to make it fairer, or choosing an activity they know the upset child enjoys. They adjust their own behaviour in response to the other child's emotional state.",
        "common_errors": [
          "Dismissing others' feelings ('Don't be silly, it's just a game')",
          "Understanding what the other child feels but not adapting their own behaviour in response"
        ]
      }
    ]
  }
]
