[
  {
    "concept_id": "EYMA-R-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to count objects to 10 with one-to-one correspondence, knowing that the last number said represents the quantity.",
        "example_task": "Count these 7 toy cars. How many are there?",
        "example_response": "The child touches each car once while counting: '1, 2, 3, 4, 5, 6, 7. There are 7 cars.' They understand the last number gives the total.",
        "common_errors": [
          "Touching objects faster than counting, losing one-to-one correspondence",
          "Recounting from 1 when asked 'how many?' instead of giving the last number"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes showing that numbers can be made up of smaller numbers, using practical equipment (e.g. showing that 5 is 3 and 2, or 4 and 1).",
        "example_task": "Using 5 counters, show me all the different ways you can split them into two groups.",
        "example_response": "The child shows: 5 and 0, 4 and 1, 3 and 2. They may need prompting to find all combinations but can create and describe each partition.",
        "common_errors": [
          "Showing one way to partition but not understanding there are multiple ways",
          "Counting all the objects again each time instead of using part-whole understanding"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Automatically knowing that each number to 10 is composed of smaller numbers and exploring these compositions, including understanding of the relationship between addition and subtraction.",
        "example_task": "I have 8 sweets. I give you 3. How many do I have left? How do you know? Can you think of another number fact using 8, 3 and 5?",
        "example_response": "'You have 5 left because 8 take away 3 is 5. I know because 3 and 5 make 8. So 5 and 3 make 8 too, and 8 take away 5 is 3.' The child demonstrates understanding of the relationship between composition and decomposition.",
        "common_errors": [
          "Being able to add (compose) but not seeing the connection to subtraction (decompose)",
          "Knowing number bonds for 5 and 10 but not for numbers between"
        ]
      }
    ]
  },
  {
    "concept_id": "EYMA-R-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to instantly recognise quantities of 1, 2 and 3 objects without counting (perceptual subitising).",
        "example_task": "Flash a card showing 3 dots for one second, then hide it. 'How many dots did you see?'",
        "example_response": "'Three!' — the child responds immediately without needing to count.",
        "common_errors": [
          "Needing to count rather than instantly recognising small quantities",
          "Reliably subitising 1 and 2 but not yet 3"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes subitising quantities to 4 or 5 by seeing them as composed of smaller groups (conceptual subitising: seeing 5 as 3 and 2).",
        "example_task": "Flash a card showing 5 dots arranged as 3 on top and 2 on the bottom. 'How many?'",
        "example_response": "'Five! I saw 3 and 2.' — the child recognises the sub-groups and combines them without counting each dot.",
        "common_errors": [
          "Subitising the sub-groups but then counting to combine them instead of knowing the total",
          "Only subitising familiar arrangements (dice patterns) but not irregular ones"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Subitising quantities to 5 confidently and beginning to subitise larger quantities by seeing them as composed groups, across different arrangements and representations.",
        "example_task": "Show 7 counters arranged as a group of 5 and a group of 2, briefly. 'How many?'",
        "example_response": "'Seven! I saw 5 and 2.' The child subitises familiar groups and combines them quickly. They can do this with different arrangements, not just one pattern.",
        "common_errors": [
          "Reliable with structured arrangements but reverting to counting with unstructured groups",
          "Subitising on cards but not applying the skill to real objects in play"
        ]
      }
    ]
  },
  {
    "concept_id": "EYMA-R-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to recall some number bonds to 5, particularly doubles (1+1, 2+2) and bonds involving 0 or 1.",
        "example_task": "What numbers add up to make 5? Can you tell me one pair?",
        "example_response": "'2 and 3 make 5!' — the child recalls at least one bond, possibly from frequent practical experience.",
        "common_errors": [
          "Needing to use fingers or objects to work out bonds each time rather than recalling them",
          "Knowing 2+3 but not recognising 3+2 as the same fact"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes recalling most number bonds to 5 with increasing speed, and beginning to use them to solve simple addition and subtraction problems.",
        "example_task": "Quick fire: 1+4? 3+2? 5+0? 5-2?",
        "example_response": "The child answers: '5, 5, 5, 3' — recalling most bonds quickly, though may pause on subtraction.",
        "common_errors": [
          "Secure with addition bonds but slower with corresponding subtraction facts",
          "Quick with some bonds but not all (e.g. knowing 2+3 but not 4+1)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Automatically recalling all number bonds to 5, including subtraction, and beginning to apply this knowledge to solve problems.",
        "example_task": "I have 5 apples in a bag. I take 2 out. How many are still in the bag? How do you know without looking?",
        "example_response": "'3 apples are in the bag. I know because 5 take away 2 is 3. And 3 and 2 make 5.' The child uses recalled facts, not counting, and can explain the relationship.",
        "common_errors": [
          "Recalling bonds in a practice context but not applying them to word problems",
          "Knowing the bonds but not connecting addition and subtraction as inverse operations"
        ]
      }
    ]
  },
  {
    "concept_id": "EYMA-R-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to explore bonds to 10, knowing that 5+5=10 (the anchor bond) and a few other pairs through practical activity.",
        "example_task": "Using a ten frame and counters, fill in 6 spaces. How many empty spaces are there?",
        "example_response": "The child fills 6 spaces and counts the empty ones: '4! So 6 and 4 make 10.'",
        "common_errors": [
          "Counting the remaining spaces but not connecting it to a number bond",
          "Knowing 5+5 but not yet seeing other bonds to 10"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes recalling several number bonds to 10, particularly doubles and near-doubles, with growing automaticity.",
        "example_task": "Quick: 5+5? 6+4? 7+3? 8+2?",
        "example_response": "The child answers: '10, 10, 10, 10' — recalling most bonds, though may hesitate on less familiar ones like 7+3.",
        "common_errors": [
          "Secure with doubles (5+5) but needing to derive non-doubles",
          "Knowing bonds in one direction (6+4) but not automatically recalling the complement (4+6)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Recalling some number bonds to 10, including doubles, and beginning to use them to support calculation and problem-solving.",
        "example_task": "I have 10 grapes. I eat some and there are 3 left. How many did I eat? How do you know?",
        "example_response": "'You ate 7 because 7 and 3 make 10. I know my number bonds to 10.' The child uses bond knowledge to solve a subtraction problem without counting.",
        "common_errors": [
          "Knowing bonds as isolated facts but not applying them in problem contexts",
          "Confusing bonds to 10 with bonds to other numbers"
        ]
      }
    ]
  },
  {
    "concept_id": "EYMA-R-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to count reliably to 20, though the sequence may break down between 13 and 19 where the pattern is less regular.",
        "example_task": "Count as high as you can from 1.",
        "example_response": "The child counts: '1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15...' and may become uncertain after 15.",
        "common_errors": [
          "Getting stuck at 'teen' numbers (saying 'thirteen, fourteen, fiveteen')",
          "Skipping from 19 to 30 (missing 20)"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes counting reliably to 20 and beyond, beginning to notice the repeating pattern in the twenties (twenty-one, twenty-two...).",
        "example_task": "Count from 1 to 30. What pattern do you notice after 20?",
        "example_response": "The child counts to 30. 'After 20, it goes twenty-one, twenty-two... it's like starting again with the same numbers but with twenty in front!'",
        "common_errors": [
          "Counting to 20 reliably but getting lost in the twenties",
          "Noticing the pattern with support but not spontaneously"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Verbally counting beyond 20, recognising the pattern of the counting system and using it to count to at least 50 with reasonable accuracy.",
        "example_task": "Count from 1 to 50. What helps you know what comes next?",
        "example_response": "The child counts to 50 with confidence. 'I know the pattern — after twenty-nine comes thirty, then thirty-one, thirty-two... The ones part is always the same: one, two, three, four, five, six, seven, eight, nine. Then the tens part changes.'",
        "common_errors": [
          "Counting fluently to 29 but stumbling at decade boundaries (29 to 30, 39 to 40)",
          "Knowing the pattern conceptually but making errors with unfamiliar decade names (fifty, sixty)"
        ]
      }
    ]
  },
  {
    "concept_id": "EYMA-R-C006",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to compare two small groups by matching objects one-to-one or by counting, identifying which has 'more'.",
        "example_task": "Here are 3 red counters and 5 blue counters. Which group has more?",
        "example_response": "'The blue ones have more because there are 5 and only 3 red ones.' The child counts each group and compares the totals.",
        "common_errors": [
          "Judging 'more' by which group takes up more space rather than which has more objects",
          "Being able to say 'more' but not 'fewer' or 'less'"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes comparing numbers and quantities using 'more than', 'fewer than' and 'equal to', with growing confidence and accuracy.",
        "example_task": "Which is more: 6 or 4? How many more? Are these two groups equal?",
        "example_response": "'6 is more than 4. It is 2 more because 4 and 2 make 6. These two groups are equal — they both have 5.'",
        "common_errors": [
          "Knowing which is more but not being able to say how many more",
          "Confusing 'fewer' with 'less' (though both are developmentally appropriate at this stage)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Comparing quantities and numbers to 10 confidently, using the language of comparison accurately, and beginning to order numbers based on their value.",
        "example_task": "Put these number cards in order from smallest to biggest: 7, 3, 9, 1, 5. Which number is between 3 and 7?",
        "example_response": "'1, 3, 5, 7, 9. The number 5 is between 3 and 7. 9 is the biggest and 1 is the smallest. 7 is 2 more than 5.'",
        "common_errors": [
          "Ordering numbers correctly but not being able to identify 'between' numbers",
          "Comparing numbers using quantity understanding but not yet connecting to a number line"
        ]
      }
    ]
  },
  {
    "concept_id": "EYMA-R-C007",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to notice simple patterns in everyday contexts: ABAB colour patterns, day/night alternation, repeating sequences.",
        "example_task": "Continue this pattern with coloured blocks: red, blue, red, blue, red, ___",
        "example_response": "'Blue! Because it goes red, blue, red, blue — so the next one is blue.'",
        "common_errors": [
          "Choosing a colour they like rather than following the pattern",
          "Continuing for one step but not being able to explain the rule"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes identifying and extending patterns, including patterns in numbers (odd/even, doubles) with concrete support.",
        "example_task": "Look at these numbers of objects: 2, 4, 6, 8. What is the pattern? What comes next?",
        "example_response": "'They're going up by 2 each time! 2, 4, 6, 8... the next one is 10.' The child may verify by counting on 2 from 8.",
        "common_errors": [
          "Seeing the pattern visually but not being able to describe the rule",
          "Extending a pattern one step but not being able to predict further ahead"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Identifying and describing structural patterns in numbers to 10, including odd/even, doubles, and beginning to see how patterns help predict and calculate.",
        "example_task": "Sort the numbers 1-10 into two groups. What pattern do you notice? How do doubles connect to even numbers?",
        "example_response": "'Even numbers are 2, 4, 6, 8, 10. Odd numbers are 1, 3, 5, 7, 9. Even numbers can be split into two equal groups — like 6 is 3 and 3. That's a double! So every even number is a double. Odd numbers always have one left over when you try to split them equally.'",
        "common_errors": [
          "Knowing which numbers are odd/even but not understanding why",
          "Not connecting the concept of doubles to even numbers"
        ]
      }
    ]
  }
]
