[
  {
    "concept_id": "PD-R-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to move around the setting without bumping into others or objects, needing reminders to look where they are going.",
        "example_task": "During free play, observe whether the child navigates around furniture and other children without collisions.",
        "example_response": "The child moves around the classroom with some awareness of others, mostly avoiding obstacles but occasionally bumping into furniture when moving quickly.",
        "common_errors": [
          "Running without looking and colliding with others",
          "Not adjusting speed or direction when approaching obstacles"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes moving confidently through shared spaces, adjusting speed and direction to avoid others, with growing awareness of personal space.",
        "example_task": "During a movement activity in the hall, observe whether the child moves through a busy space without collisions.",
        "example_response": "The child moves at different speeds — fast across open space, slowing near other children. They change direction to go around others rather than through them.",
        "common_errors": [
          "Managing spatial awareness when walking but losing it when running or excited",
          "Being aware of large obstacles but not of other children's personal space"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Moving confidently in a range of ways, negotiating space successfully, adjusting speed and direction, and showing awareness of others and the environment for safety.",
        "example_task": "During outdoor play on a busy climbing frame area, observe the child's spatial awareness and safe movement.",
        "example_response": "The child climbs confidently, waits for space before moving to the next section, adjusts their route when another child is in the way, and uses the slide only when the bottom is clear. They say: 'Wait, I need to move first!' to a child climbing behind them.",
        "common_errors": [
          "Taking risks without assessing whether the space is clear",
          "Being overly cautious and avoiding busy areas entirely rather than navigating them"
        ]
      }
    ]
  },
  {
    "concept_id": "PD-R-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to develop core strength through climbing, hanging and crawling, with balance supported by equipment or adults.",
        "example_task": "Observe the child on the climbing frame. Can they hold their own weight, climb a few steps, and balance on a low beam with support?",
        "example_response": "The child climbs three rungs of the ladder, holding tightly. They walk along a low balance beam with an adult holding one hand.",
        "common_errors": [
          "Grip strength insufficient to support body weight on climbing equipment",
          "Needing both hands held to balance rather than just one"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes demonstrating strength to support activities like climbing, and balancing on equipment with growing confidence, occasionally without support.",
        "example_task": "Can the child balance along a line on the ground, climb to the top of the frame, and hang from a bar briefly?",
        "example_response": "The child walks along a chalk line with arms out for balance. They climb to the top of the frame without adult help. They hang from a bar for 3-4 seconds before dropping.",
        "common_errors": [
          "Good balance when stationary but losing it during movement",
          "Upper body strength developing more slowly than lower body"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Demonstrating strength, balance and coordination across a range of physical activities: climbing, balancing, jumping, negotiating obstacles with confidence.",
        "example_task": "Complete an obstacle course: balance along a beam, climb over a low wall, jump across stepping stones, and hang from a bar for 5 seconds.",
        "example_response": "The child balances along the beam independently, climbs over the wall confidently, jumps between stepping stones landing on each with control, and hangs from the bar for 6 seconds with a strong grip. They move through the whole course with confidence.",
        "common_errors": [
          "Being strong and coordinated in familiar activities but hesitant in new physical challenges",
          "Good gross motor skills but struggling with activities requiring sustained effort"
        ]
      }
    ]
  },
  {
    "concept_id": "PD-R-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to run, jump, hop and climb with developing confidence, though movements may lack coordination and control.",
        "example_task": "Ask the child to run to the fence, jump over a low rope, and hop back. Observe their movement vocabulary.",
        "example_response": "The child runs with a basic running action. They jump over the rope with both feet. They attempt to hop but put the other foot down after two hops.",
        "common_errors": [
          "Not being able to hop (putting both feet down immediately)",
          "Jumping with one foot instead of two (or vice versa when hopping)"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes demonstrating a range of whole-body movements with improving coordination: running, jumping, hopping, skipping, climbing, dancing.",
        "example_task": "Play a movement game: 'When I say go, skip to the tree, hop around it, and dance back.'",
        "example_response": "The child skips with a recognisable skipping action (not galloping). They hop around the tree (5-6 hops). They dance back with free, energetic movement.",
        "common_errors": [
          "Confusing skipping with galloping",
          "Good at some movements but avoiding those they find difficult"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Moving energetically with confidence, strength and control across a broad range of movements: running, jumping, hopping, skipping, climbing, dancing.",
        "example_task": "During outdoor play, observe the range and quality of the child's self-chosen physical activities.",
        "example_response": "The child runs fast across the playground with coordinated arm swing, climbs to the top of the frame confidently, skips along a path, hops on each foot, jumps from a low height landing with bent knees, and dances expressively to music. They move between activities with enthusiasm and control.",
        "common_errors": [
          "Having a broad movement vocabulary but lacking endurance for sustained activity",
          "Avoiding challenging movements in favour of those they are already confident in"
        ]
      }
    ]
  },
  {
    "concept_id": "PD-R-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to hold a pencil, though grip may be whole-fist (palmar) or awkward. Marks are large and lack directional control.",
        "example_task": "Observe how the child holds a pencil and the marks they make.",
        "example_response": "The child holds the pencil in a fist grip and makes large scribbling movements from the shoulder. The marks fill the page but don't form recognisable shapes.",
        "common_errors": [
          "Holding pencil in a full fist grip with no finger control",
          "Pressing too hard or too lightly for the pencil to make clear marks"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes using a tripod or near-tripod grip, with developing control over line direction and letter-like shapes.",
        "example_task": "Ask the child to draw a circle and write the first letter of their name.",
        "example_response": "The child uses a grip where the pencil rests between thumb and fingers (not yet a consistent tripod). They draw a recognisable circle (may not be fully closed) and form the first letter of their name, though it may be large and inconsistent.",
        "common_errors": [
          "Reverting to a fist grip when tired or concentrating hard",
          "Forming letters from bottom to top rather than using correct starting points"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Holding a pencil effectively with a comfortable tripod grip, using it with good control to form recognisable letters.",
        "example_task": "Ask the child to write their first name and draw a detailed picture of themselves.",
        "example_response": "The child holds the pencil in a comfortable tripod grip with fingers near the pencil point. They write their name with recognisable letters, mostly correctly formed and oriented. Their self-portrait includes head, body, arms, legs, and facial features with reasonable proportion.",
        "common_errors": [
          "Holding in tripod grip but with tense fingers, causing fatigue",
          "Letters recognisable but some consistently reversed (b/d, p/q)"
        ]
      }
    ]
  },
  {
    "concept_id": "PD-R-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to use scissors and paintbrushes with adult support, managing basic open-and-close or back-and-forth movements.",
        "example_task": "Give the child scissors and paper. Observe their grip and cutting action.",
        "example_response": "The child holds scissors with two hands (one cutting, one supporting the paper with adult help) and makes snipping motions, producing rough cuts rather than a smooth line.",
        "common_errors": [
          "Holding scissors with both hands in the blades",
          "Tearing the paper rather than cutting because the scissors are the wrong way up"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes using scissors to cut along a line, and using paintbrushes and cutlery with developing control.",
        "example_task": "Ask the child to cut along a thick straight line and then cut around a simple shape.",
        "example_response": "The child cuts along the straight line staying mostly within 1cm of it. They cut around a large circle shape with some wobbles but a recognisable result. They use a knife and fork at lunchtime with developing coordination.",
        "common_errors": [
          "Cutting straight lines competently but struggling with curves",
          "Holding scissors correctly but moving the paper rather than the scissors"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using a range of small tools — scissors, paintbrushes, cutlery, hole punches — competently and safely, with purpose and control.",
        "example_task": "Observe the child's use of tools across different activities during the day.",
        "example_response": "The child cuts confidently along lines and around shapes. They use a thin paintbrush with control for detailed painting. They use a knife and fork to cut soft food. They use a hole punch and a stapler for a making activity. They handle all tools safely without reminders.",
        "common_errors": [
          "Competent with familiar tools but hesitant with less common ones (hole punch, stapler)",
          "Good tool control when calm but losing precision when excited or rushing"
        ]
      }
    ]
  },
  {
    "concept_id": "PD-R-C006",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to draw with intention — the child can say what their drawing is about, even if the marks do not yet represent the subject recognisably.",
        "example_task": "Ask the child to draw their family. Then ask: 'Tell me about your drawing.'",
        "example_response": "The child draws circular shapes and lines. They point and say: 'That's Mummy and that's me and that's our cat.' The drawing shows intention even though the figures are basic.",
        "common_errors": [
          "Drawing without intention — random marks with no narration",
          "Drawing the same schema repeatedly without observation or variation"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sometimes drawing recognisable representations of people, objects and scenes, with increasing detail (facial features, limbs, basic clothing).",
        "example_task": "Ask the child to draw themselves at the park.",
        "example_response": "The child draws a person with a head (eyes, mouth, some hair), body, arms and legs. There are recognisable items in the scene — a slide, a tree. The drawing shows care and some detail.",
        "common_errors": [
          "Tadpole figures (head with limbs, no body) persisting when the child is developmentally ready for more detail",
          "Drawing people but not adding environmental detail"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Drawing with increasing accuracy and detail, representing observed or imagined subjects with care, intention and a desire to capture what they see or think.",
        "example_task": "Ask the child to draw a detailed observational drawing of a plant in the classroom.",
        "example_response": "The child looks carefully at the plant and draws the pot, stem, leaves and a flower. They notice that some leaves are bigger than others and that the stem has a curve. They add detail: the pattern on the pot, the veins on the leaves. They compare their drawing to the real plant and add things they initially missed.",
        "common_errors": [
          "Drawing from schema ('what a plant looks like') rather than from observation ('what this plant looks like')",
          "Starting with detail rather than overall shape"
        ]
      }
    ]
  }
]
