[
  {
    "concept_id": "GE-KS2-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying the Equator, North Pole and South Pole on a globe and understanding that latitude lines run horizontally.",
        "example_task": "Point to the Equator on this globe. Is it closer to the North Pole or the South Pole?",
        "example_response": "The Equator is this line around the middle of the globe. It is exactly in between the North Pole and the South Pole — the same distance from both.",
        "common_errors": [
          "Confusing the Equator with the Prime Meridian",
          "Thinking the Equator only passes through Africa"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying lines of latitude and longitude on a map and using them to describe approximate locations of countries and features.",
        "example_task": "Using this world map with latitude and longitude lines, describe where Brazil is located.",
        "example_response": "Brazil is mostly between the Equator and about 30 degrees south latitude. It is between about 35 and 75 degrees west longitude. It crosses the Equator, so part of it is in the Northern Hemisphere.",
        "common_errors": [
          "Confusing latitude (horizontal) with longitude (vertical)",
          "Reading longitude values incorrectly (mixing east and west)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using latitude and longitude to locate places precisely and explaining the significance of the Tropics of Cancer and Capricorn, Arctic and Antarctic Circles.",
        "example_task": "What are the Tropics of Cancer and Capricorn? Why are they important for understanding climate?",
        "example_response": "The Tropic of Cancer is at about 23.5°N and the Tropic of Capricorn is at about 23.5°S. The area between them is the tropics, where the sun can be directly overhead. This means tropical regions get the most direct sunlight and are generally the hottest parts of Earth. The Arctic and Antarctic Circles mark where there are 24 hours of daylight or darkness at the solstices.",
        "common_errors": [
          "Confusing the Tropic of Cancer (north) with the Tropic of Capricorn (south)",
          "Not connecting latitude to climate patterns"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining why the global grid system was developed, how it enables navigation, and why different map projections distort latitude and longitude differently.",
        "example_task": "Why do some world maps make Greenland look almost as big as Africa, even though Africa is actually 14 times larger?",
        "example_response": "Flat maps have to stretch the round Earth onto a flat surface, which distorts shapes and sizes. The Mercator projection stretches areas near the poles, making Greenland look huge. Africa, being near the Equator, is shown more accurately. A globe doesn't have this problem because it is the same shape as the Earth. Different map projections make different trade-offs between accuracy of size, shape and direction.",
        "common_errors": [
          "Assuming flat maps are completely accurate representations of the Earth",
          "Not understanding that all flat maps involve some kind of distortion"
        ]
      }
    ]
  },
  {
    "concept_id": "GE-KS2-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Naming at least three different climate zones or biomes and identifying one feature of each.",
        "example_task": "Name three different environments (biomes) and describe one thing about each.",
        "example_response": "Rainforest — very hot and wet with lots of trees. Desert — very dry with sandy or rocky ground. Arctic — very cold with ice and snow.",
        "common_errors": [
          "Confusing biomes with countries (e.g. 'Africa' instead of 'savannah')",
          "Thinking all deserts are hot (cold deserts exist)"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing the climate, vegetation and animal life of specific biomes and locating them on a world map.",
        "example_task": "Describe the tropical rainforest biome. Where in the world are rainforests found?",
        "example_response": "Tropical rainforests have hot temperatures all year round and very high rainfall. They have dense vegetation with tall trees forming a canopy. Animals include monkeys, parrots and insects. Rainforests are found near the Equator in South America, Africa and Southeast Asia.",
        "common_errors": [
          "Describing only one aspect (climate OR wildlife, not both)",
          "Not connecting the location of biomes to latitude and climate zones"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining why different biomes exist in different locations, connecting climate zones to latitude, and explaining how plants and animals are adapted.",
        "example_task": "Why are tropical rainforests found near the Equator and not near the poles? How are rainforest plants adapted?",
        "example_response": "Tropical rainforests need constant warmth and heavy rainfall, which occurs near the Equator because direct sunlight heats the air, causing evaporation and daily rain. Near the poles, sunlight is weaker so temperatures are too low. Rainforest trees grow tall to reach sunlight above the canopy, and some have drip-tip leaves to shed water quickly. Plants on the forest floor have huge leaves to capture what little light reaches them.",
        "common_errors": [
          "Describing biomes without explaining why they occur where they do",
          "Not connecting adaptations to the specific environmental conditions"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating human impact on biomes, explaining how deforestation, climate change or land use alters ecosystems, and considering sustainability.",
        "example_task": "How is deforestation affecting the Amazon rainforest, and why should this matter to people in other countries?",
        "example_response": "Deforestation removes trees for cattle ranching and farming, destroying habitats and reducing biodiversity. Rainforests absorb carbon dioxide, so cutting them down increases greenhouse gases that affect the whole planet's climate. The Amazon also produces moisture that affects weather patterns far away. It matters to everyone because the rainforest provides global services — climate regulation, oxygen production and biodiversity — not just local ones.",
        "common_errors": [
          "Describing deforestation without explaining the wider consequences",
          "Presenting the issue as one-sided without acknowledging why people clear forests"
        ]
      }
    ]
  },
  {
    "concept_id": "GE-KS2-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying the main stages of the water cycle (evaporation, condensation, precipitation) and labelling a simple diagram.",
        "example_task": "Label this water cycle diagram with the words: evaporation, condensation, precipitation.",
        "example_response": "Evaporation is where water goes up from the sea. Condensation is where it forms clouds. Precipitation is where it falls as rain.",
        "common_errors": [
          "Confusing evaporation and condensation",
          "Thinking the water cycle only involves rain falling into the sea"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing the water cycle as a continuous process and identifying the main features of a river from source to mouth.",
        "example_task": "Describe what happens to water from the moment it falls as rain on a mountain until it reaches the sea.",
        "example_response": "Rain falls on the mountain and flows downhill as small streams. Streams join together to form a river. The river flows through valleys, getting wider and slower as it reaches flatter land. Eventually it reaches the sea at the river's mouth. Then the water evaporates and the cycle starts again.",
        "common_errors": [
          "Thinking rivers only flow from mountains (some start from springs or lakes)",
          "Not recognising the continuous, cyclical nature of the process"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining how rivers shape the landscape through erosion, transportation and deposition, and identifying specific landforms created by these processes.",
        "example_task": "How does a river create a meander? What happens to the material that the river erodes?",
        "example_response": "Water flows faster on the outside of a river bend, eroding the bank and making the curve larger. On the inside of the bend, the water flows more slowly so it drops the material it is carrying — this is deposition. Over time, the bends become larger and more curved, creating meanders. The eroded material is transported downstream and deposited where the river slows, forming features like floodplains and deltas at the river's mouth.",
        "common_errors": [
          "Confusing erosion (wearing away) with deposition (building up)",
          "Not understanding that fast water erodes while slow water deposits"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating human interaction with rivers — how people use rivers, how flooding affects communities, and how humans modify river systems.",
        "example_task": "Rivers provide benefits but also pose risks. Explain how people manage this balance, using examples.",
        "example_response": "Rivers provide water, transport, power and fertile floodplains for farming. But flooding destroys homes and infrastructure. People manage this by building flood defences, creating flood plains to absorb excess water, and using early warning systems. However, building on floodplains increases risk, and upstream deforestation makes flooding worse by increasing run-off. Managing rivers involves trade-offs between economic use and flood risk.",
        "common_errors": [
          "Presenting rivers as entirely beneficial or entirely dangerous",
          "Not recognising that human actions upstream can cause problems downstream"
        ]
      }
    ]
  },
  {
    "concept_id": "GE-KS2-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying different types of settlement (village, town, city) and naming one reason why people live in settlements.",
        "example_task": "What is the difference between a village and a city? Why do people live together in settlements?",
        "example_response": "A village is small with few buildings and a city is very large with lots of buildings and people. People live in settlements because they need to be near other people, shops and schools.",
        "common_errors": [
          "Not understanding that settlement size exists on a spectrum",
          "Thinking all settlements were always the size they are now"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing why settlements are located where they are, identifying physical and human factors that influence settlement location.",
        "example_task": "Why were many old towns built near rivers? Give at least two reasons.",
        "example_response": "Towns were built near rivers because rivers provided drinking water and water for animals. Rivers were used for transport — boats could carry heavy goods. The flat land near rivers was good for building on and farming. Some rivers were also good for defence — a river on one side made the town harder to attack.",
        "common_errors": [
          "Giving only one reason when multiple factors influenced settlement location",
          "Not distinguishing between physical factors (water, flat land) and human factors (trade routes)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining how economic activities are connected across places through trade, describing primary, secondary and tertiary sectors.",
        "example_task": "Explain the journey of a chocolate bar from the cocoa farm to the shop, identifying the different types of economic activity involved.",
        "example_response": "Cocoa beans are grown on a farm in Ghana — that is a primary activity (extracting raw materials). The beans are shipped to a factory in the UK where they are processed into chocolate — that is a secondary activity (manufacturing). The chocolate bar is then transported to shops and sold to customers — that is a tertiary activity (providing a service). Each stage happens in a different place and involves different workers.",
        "common_errors": [
          "Confusing primary, secondary and tertiary economic activities",
          "Not recognising that trade connects distant places in a single supply chain"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating how globalisation and economic change affect settlements, including the impact of deindustrialisation, migration and trade on communities.",
        "example_task": "Many factory towns in the UK have changed since their factories closed. What happened and how have these places adapted?",
        "example_response": "When factories closed, people lost jobs and the towns became poorer. Young people often moved away to find work elsewhere. Some towns have adapted by developing tourism, technology industries or universities. Others have struggled with unemployment and depopulation. This shows that the economy of a place can change dramatically, and that places need to adapt when their main industry disappears.",
        "common_errors": [
          "Presenting economic change as having only negative effects",
          "Not connecting local changes to wider national or global economic trends"
        ]
      }
    ]
  },
  {
    "concept_id": "GE-KS2-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising common OS map symbols (church, post office, road, woodland) and understanding that the map represents a real place from above.",
        "example_task": "Look at these map symbols. What does this symbol mean? (shows church with tower symbol)",
        "example_response": "That symbol means a church with a tower.",
        "common_errors": [
          "Guessing what symbols mean instead of checking the key",
          "Not understanding that the map is a view from above"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using four-figure grid references to locate features on an OS map and reading common symbols from the key.",
        "example_task": "What feature is at grid reference 2347 on this OS map?",
        "example_response": "At grid reference 2347 there is a church with a spire. I found it by going along to 23 and then up to 47.",
        "common_errors": [
          "Reading northings before eastings (should be 'along the corridor and up the stairs')",
          "Confusing the grid square with the grid lines"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using six-figure grid references to locate features precisely and interpreting contour lines to describe the relief of an area.",
        "example_task": "Give the six-figure grid reference for the school on this map. Describe the land around it using the contour lines.",
        "example_response": "The school is at grid reference 234471. The contour lines are close together to the north, showing a steep hill. To the south, the contour lines are spread apart, showing flatter ground near the river. The school is at about 50 metres above sea level.",
        "common_errors": [
          "Estimating the third digit inaccurately in six-figure references",
          "Confusing closely-spaced contour lines (steep) with widely-spaced ones (gentle)"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using OS maps to plan routes, estimate distances, and explain how physical features influenced the location of human features.",
        "example_task": "Plan a walking route from the village to the hilltop. Explain why you chose this route and estimate the distance.",
        "example_response": "I would follow the footpath that goes around the south side of the hill because the contour lines are more spread out there — a gentler slope. The direct route goes through closely packed contour lines, which means very steep climbing. My route is about 3km, which I estimated by comparing it to the scale bar. The village is in the valley because that's where the river and flat farmland are.",
        "common_errors": [
          "Planning routes without considering contour lines and terrain",
          "Not using the scale to estimate distance accurately"
        ]
      }
    ]
  },
  {
    "concept_id": "GE-KS2-C006",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying basic facts about a studied region: its location, one physical feature and one human feature.",
        "example_task": "Tell me three facts about the region of Europe we have been studying.",
        "example_response": "We studied the Alps in Europe. The Alps are very high mountains with snow on top. People ski there in the winter.",
        "common_errors": [
          "Confusing facts about different regions studied",
          "Giving very general statements that could apply to any region"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing the physical and human geography of a studied region using specific geographical vocabulary.",
        "example_task": "Describe the physical and human geography of the Amazon region in South America.",
        "example_response": "The Amazon region has the world's largest tropical rainforest with dense vegetation and the Amazon River, which is one of the longest rivers. The climate is hot and wet all year. Indigenous communities live in the forest. There is also logging, mining and cattle farming, which are changing the landscape.",
        "common_errors": [
          "Describing only physical OR only human geography, not both",
          "Using vague language instead of specific geographical vocabulary"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Comparing two regions from different continents, identifying similarities and differences in their physical and human geography, and explaining reasons for the differences.",
        "example_task": "Compare the Lake District in the UK with a region in the Amazon. How and why are they different?",
        "example_response": "The Lake District has a temperate climate with cool, wet weather and is at a high latitude. The Amazon is tropical with constant heat and heavy rain, near the Equator. The Lake District's economy depends on tourism and sheep farming; the Amazon has logging, farming and indigenous communities. The differences are mainly because of their locations — latitude determines climate, which determines vegetation and how people make a living.",
        "common_errors": [
          "Listing differences without explaining the geographical reasons behind them",
          "Only comparing one dimension (climate) and ignoring economy, population, or land use"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating how global issues (climate change, trade, migration) affect studied regions differently, and considering multiple perspectives on regional change.",
        "example_task": "How might climate change affect the Lake District and the Amazon region differently? Who would be most affected in each place?",
        "example_response": "Climate change could bring more flooding to the Lake District, damaging tourism and farmland. In the Amazon, higher temperatures and drought could cause forest dieback, affecting indigenous communities who depend on the forest and releasing carbon that accelerates global warming. Farmers clearing forest might benefit short-term but cause long-term damage. The impacts are connected — deforestation in the Amazon affects global climate, which affects weather in the Lake District.",
        "common_errors": [
          "Discussing climate change impacts on only one region",
          "Not recognising that different groups within a region are affected differently"
        ]
      }
    ]
  }
]
