[
  {
    "concept_id": "GE-KS1-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Naming at least three continents and two oceans when shown them on a globe or world map.",
        "example_task": "Point to and name three continents on this world map.",
        "example_response": "This is Africa, this is Europe, and this is Asia.",
        "common_errors": [
          "Confusing continents with countries (e.g. calling Africa a country)",
          "Not being able to distinguish between land (continents) and water (oceans) on a map"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Naming and locating all seven continents and five oceans on a world map, and identifying which continent the UK is on.",
        "example_task": "Label all seven continents on this blank world map. Which continent is the United Kingdom on?",
        "example_response": "Africa, Antarctica, Asia, Australia, Europe, North America, South America. The United Kingdom is in Europe.",
        "common_errors": [
          "Confusing North America and South America or placing them incorrectly",
          "Forgetting Antarctica or the Southern Ocean"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Locating continents and oceans on a world map and describing their relative positions using directional language (north, south, east, west).",
        "example_task": "Where is Africa in relation to Europe? Where is the Pacific Ocean?",
        "example_response": "Africa is south of Europe, separated by the Mediterranean Sea. The Pacific Ocean is the largest ocean and is between Asia and the Americas, on the east side of Asia.",
        "common_errors": [
          "Using 'up' and 'down' instead of compass directions",
          "Placing oceans incorrectly because of map projection distortion"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using knowledge of continents and oceans to locate unfamiliar countries or features, and explaining why the equator, poles and tropics are significant.",
        "example_task": "Brazil is in South America. Using the map, describe where South America is in relation to the Equator and the two closest oceans.",
        "example_response": "South America crosses the Equator, so it is in both the northern and southern hemispheres. The Atlantic Ocean is to its east and the Pacific Ocean is to its west. Because it crosses the Equator, the northern part is tropical and warm.",
        "common_errors": [
          "Not understanding that the Equator divides the world into hemispheres",
          "Assuming all of a continent has the same climate"
        ]
      }
    ]
  },
  {
    "concept_id": "GE-KS1-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Naming the four countries of the United Kingdom and identifying at least one capital city.",
        "example_task": "What are the four countries in the United Kingdom? What is the capital of England?",
        "example_response": "England, Scotland, Wales and Northern Ireland. The capital of England is London.",
        "common_errors": [
          "Including Ireland (the Republic) as part of the UK",
          "Confusing England with the United Kingdom"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Naming all four countries and their capital cities, and locating them on a map of the United Kingdom.",
        "example_task": "Point to each country on this UK map and name its capital city.",
        "example_response": "England — London, Scotland — Edinburgh, Wales — Cardiff, Northern Ireland — Belfast.",
        "common_errors": [
          "Confusing Edinburgh with Glasgow for Scotland's capital",
          "Not being able to distinguish the country boundaries on a map"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Describing the position of countries and their capital cities using compass directions and identifying surrounding seas.",
        "example_task": "Describe where Scotland is in relation to England. What seas surround the UK?",
        "example_response": "Scotland is north of England. They share a border. The UK is surrounded by the North Sea to the east, the English Channel to the south, the Irish Sea between Britain and Ireland, and the Atlantic Ocean to the west.",
        "common_errors": [
          "Confusing the names of surrounding seas",
          "Using 'above' and 'below' instead of compass directions"
        ]
      }
    ]
  },
  {
    "concept_id": "GE-KS1-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Describing the current weather using simple vocabulary (sunny, rainy, cloudy, windy, cold, hot) and identifying the current season.",
        "example_task": "Look outside. What is the weather like today? What season is it?",
        "example_response": "It is cloudy and cold today. It is winter.",
        "common_errors": [
          "Not being able to name the current season",
          "Using only one weather word when multiple apply (e.g. it can be windy AND cold)"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing seasonal weather patterns in the UK, explaining what kind of weather is typical in each season.",
        "example_task": "What is the weather usually like in summer in the UK? How is it different from winter?",
        "example_response": "In summer it is usually warmer and the days are longer. We get more sunshine. In winter it is colder, the days are shorter, and we get more rain and sometimes snow.",
        "common_errors": [
          "Describing one day's weather as representing a whole season",
          "Thinking it never rains in summer or is never sunny in winter"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Comparing weather patterns in the UK with weather in another location, and beginning to explain why places have different weather.",
        "example_task": "Compare the weather in our town with the weather in a hot country like Kenya. Why might they be different?",
        "example_response": "Our town has four seasons with cold winters and mild summers. Kenya is near the Equator so it is hot all year round. Kenya has a wet season and a dry season instead of our four seasons. The weather is different because Kenya is closer to the Equator where the sun is more directly overhead.",
        "common_errors": [
          "Assuming all hot countries have the same weather pattern",
          "Not connecting weather differences to geographical location"
        ]
      }
    ]
  },
  {
    "concept_id": "GE-KS1-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying whether a feature is physical (natural) or human (made by people) when given examples.",
        "example_task": "Sort these into physical features and human features: river, bridge, hill, shop, forest, road.",
        "example_response": "Physical: river, hill, forest. Human: bridge, shop, road.",
        "common_errors": [
          "Classifying a park as physical because it has grass and trees",
          "Not understanding what 'physical feature' means in a geography context"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using geographical vocabulary to describe physical and human features observed in the local area or in photographs of places.",
        "example_task": "Look at this photograph of a seaside town. Describe the physical features and human features you can see.",
        "example_response": "Physical features: cliffs, the sea, a sandy beach, rocks. Human features: houses along the seafront, a pier, a car park, a lighthouse.",
        "common_errors": [
          "Describing features without using specific geographical vocabulary",
          "Overlooking less obvious features (e.g. a harbour wall is human-made)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining the relationship between physical and human features — how the physical landscape influences what humans build and do there.",
        "example_task": "Why do you think this town was built next to the river? How do the physical features affect the human features?",
        "example_response": "The town was built by the river because people needed water for drinking, farming and transport. The flat land near the river was good for building on. The bridge was built because people needed to cross the river. The physical features — the river and flat land — helped decide where the human features would go.",
        "common_errors": [
          "Describing physical and human features separately without explaining connections",
          "Not recognising that physical geography influences where and how people live"
        ]
      }
    ]
  },
  {
    "concept_id": "GE-KS1-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Using a simple map or plan to identify features, understanding that a map represents a real place from above.",
        "example_task": "This is a map of our classroom. Can you find the door, the teacher's desk and the reading corner on the map?",
        "example_response": "The door is here, the teacher's desk is at the front, and the reading corner is in this corner.",
        "common_errors": [
          "Not understanding that the map shows a 'bird's eye view' from above",
          "Confusing left and right on a map with left and right in the room"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using a simple key to read a map and using basic compass directions (north, south, east, west) to describe where things are.",
        "example_task": "Look at this map of the school grounds. Use the key to find the playground. Is it north or south of the school building?",
        "example_response": "The playground is the green area with this symbol. Looking at the compass, the playground is south of the school building.",
        "common_errors": [
          "Not using the key and guessing what symbols mean",
          "Confusing compass directions, especially east and west"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using maps, atlases and globes to locate places and features, constructing simple maps with a key, title and compass directions.",
        "example_task": "Draw a map of the route from our classroom to the school hall. Include a key with symbols, a title and a compass arrow.",
        "example_response": "My map shows the corridor from our classroom past the office to the hall. I used a rectangle for doors, a triangle for the stairs, and coloured the hall blue. The title is 'Route to the School Hall' and north is at the top.",
        "common_errors": [
          "Drawing a picture rather than a map (showing walls from the side, not from above)",
          "Forgetting to include a key to explain the symbols used"
        ]
      }
    ]
  },
  {
    "concept_id": "GE-KS1-C006",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying one similarity and one difference between the local area and a contrasting place shown in photographs.",
        "example_task": "Look at these photographs of our village and a village in Kenya. Tell me one thing that is the same and one thing that is different.",
        "example_response": "Same: both places have houses where families live. Different: the houses look different — ours are brick and theirs are made of different materials.",
        "common_errors": [
          "Only noticing differences and not identifying any similarities",
          "Making judgements about which place is 'better' rather than comparing objectively"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing several features of two contrasting places using a consistent framework (homes, work, schools, food, weather).",
        "example_task": "Compare our school with a school in a village in India. Think about the building, what children do, and the weather.",
        "example_response": "Our school is a brick building with a playground. The school in India might be outdoors or in a simpler building. Both places have children learning to read and write. The weather in India is much hotter, so children might have school at different times of day.",
        "common_errors": [
          "Assuming life in the contrasting place is uniformly 'poor' or 'simple'",
          "Comparing only one aspect instead of using multiple categories"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining why places are similar or different by connecting features to physical geography, climate or human choices.",
        "example_task": "Why do houses look different in our area compared to a village in a hot, dry climate? What explains the differences?",
        "example_response": "Houses in our area have sloped roofs because it rains a lot and the rain needs to run off. They have thick walls and heating because winters are cold. Houses in a hot, dry climate might have flat roofs, small windows to keep out heat, and thick walls to stay cool inside. The climate and available materials explain why the houses are different, but both are designed to keep families comfortable.",
        "common_errors": [
          "Describing differences without explaining the geographical reasons behind them",
          "Not recognising that people in all places make rational choices suited to their environment"
        ]
      }
    ]
  }
]
