[
  {
    "concept_id": "HI-KS1-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising and using basic time vocabulary (before, after, now, then, long ago) to describe the order of two events.",
        "example_task": "Look at these two pictures: one shows a baby, one shows a grown-up. Which happened first? Which word tells us: before or after?",
        "example_response": "The baby picture happened first. The baby came before the grown-up.",
        "common_errors": [
          "Using 'before' and 'after' interchangeably without distinguishing their meaning",
          "Placing all events described as 'old' at the same point in the past"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Sequencing three or more events or objects on a simple timeline, using vocabulary such as 'first', 'next', 'then', 'finally', 'a long time ago'.",
        "example_task": "Put these three pictures in order on the timeline: a horse and cart, a modern car, a steam train. Which came first? Which came last?",
        "example_response": "First the horse and cart, then the steam train, then the modern car. The horse and cart is the oldest.",
        "common_errors": [
          "Ordering by personal preference rather than chronological sequence",
          "Placing the steam train after the car because trains are less familiar"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Placing events, people and objects from different periods on a timeline and explaining how they know the order, using evidence from sources.",
        "example_task": "Here are five objects: a candle, a gas lamp, a light bulb, an LED light, and a torch from Victorian times. Place them on the timeline and explain how you decided the order.",
        "example_response": "I put the candle first because people used candles before they had gas. The gas lamp came next, then the light bulb was invented. The torch is modern and the LED light is the newest. I know because the materials and design look more modern as you go along the timeline.",
        "common_errors": [
          "Placing objects in order of size or appearance rather than age",
          "Not being able to explain the reasoning behind the sequence"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using chronological understanding to explain that different periods of time varied in length, and that some changes happened quickly while others took a long time.",
        "example_task": "People used candles for hundreds of years, but we have only had LED lights for about 20 years. What does this tell us about how quickly things change?",
        "example_response": "Things used to change very slowly — people used candles for a very long time because there was nothing better. Now things change much faster because people are always inventing new technology. The gap between each invention on the timeline gets shorter.",
        "common_errors": [
          "Assuming all historical change happens at the same pace",
          "Struggling to grasp that 'hundreds of years' and '20 years' represent very different spans of time"
        ]
      }
    ]
  },
  {
    "concept_id": "HI-KS1-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying one thing that has changed and one thing that has stayed the same when comparing old and new versions of a familiar object or setting.",
        "example_task": "Look at this old photograph of a classroom and this photograph of our classroom. Tell me one thing that is different and one thing that is the same.",
        "example_response": "The old classroom has wooden desks in rows — that is different. Both classrooms have a board at the front — that is the same.",
        "common_errors": [
          "Identifying only differences and not recognising any continuity",
          "Focusing solely on colour differences in photographs rather than meaningful changes"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing several changes and continuities between past and present in a familiar context, using comparative language.",
        "example_task": "Compare how children travelled to school in your grandparents' time with how you travel to school. List things that have changed and things that have stayed the same.",
        "example_response": "Changed: grandparents walked or cycled more, there were fewer cars, no car seats. Stayed the same: children still walk to school sometimes, school is still in the morning, parents still take children to school.",
        "common_errors": [
          "Assuming everything in the past was completely different from today",
          "Listing changes without using comparative language (older/newer, more/fewer)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining why some things have changed while others have stayed the same, giving reasons linked to people's needs or new inventions.",
        "example_task": "Telephones have changed a lot since they were invented, but people still use them to talk to each other. Why has the telephone changed, and why do people still want to talk to each other?",
        "example_response": "Telephones changed because people invented better technology — first they had wires, then they became mobile. But people still want to talk because they need to share news, ask questions and stay in touch with family. The need stayed the same but the way we do it changed.",
        "common_errors": [
          "Describing changes without offering any explanation for why they happened",
          "Treating all change as automatic 'progress' rather than a response to needs"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Recognising that change can involve loss as well as gain, and that not everyone experiences change in the same way.",
        "example_task": "When cars replaced horses for transport, was this change entirely good? Think about what was gained and what might have been lost.",
        "example_response": "Cars are faster and can carry more, so people could travel further. But horses didn't cause pollution, and people who worked with horses lost their jobs. Some people in the countryside still preferred horses. So the change was good in some ways but not in every way.",
        "common_errors": [
          "Viewing all historical change as purely positive progress",
          "Struggling to imagine disadvantages of modern inventions"
        ]
      }
    ]
  },
  {
    "concept_id": "HI-KS1-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recalling basic facts about a significant individual studied in class: their name, when they lived, and one thing they did.",
        "example_task": "Tell me one thing you remember about Florence Nightingale.",
        "example_response": "Florence Nightingale helped sick soldiers in a hospital. She carried a lamp at night to check on them.",
        "common_errors": [
          "Confusing details of different significant individuals studied",
          "Remembering the story but not the person's name"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing what a significant individual did and beginning to explain why their actions mattered to other people.",
        "example_task": "What did Mary Seacole do, and why was it important?",
        "example_response": "Mary Seacole travelled to the Crimean War to help injured soldiers. She set up a hotel near the battlefield where soldiers could get medicine and food. It was important because the soldiers needed help and she made them better.",
        "common_errors": [
          "Describing actions without connecting them to their impact on others",
          "Retelling the individual's story as a simple sequence without explaining significance"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining why an individual is considered significant by identifying the impact of their actions and comparing them with another individual.",
        "example_task": "Both Florence Nightingale and Mary Seacole helped soldiers in the Crimean War. How were their contributions similar and different?",
        "example_response": "Both helped sick and injured soldiers and both were brave to go to a war zone. Florence Nightingale worked in a hospital and changed how hospitals were kept clean. Mary Seacole went closer to the battlefield and paid for her own supplies. Florence Nightingale became more famous at the time, but both made a big difference.",
        "common_errors": [
          "Stating that one individual was 'better' than the other rather than comparing contributions",
          "Focusing only on similarities or only on differences, not both"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating why some individuals are better remembered than others, considering factors such as bias, record-keeping and whose stories get told.",
        "example_task": "Florence Nightingale is more famous than Mary Seacole. Why might that be? Is fame the same as importance?",
        "example_response": "Florence Nightingale was more famous because she was written about more and came from a wealthy family, so more people heard about her. Mary Seacole faced prejudice because of her background. Being famous doesn't always mean being more important — Mary Seacole helped just as many soldiers but fewer people told her story.",
        "common_errors": [
          "Equating fame with historical significance",
          "Not considering that record-keeping and social factors affect who gets remembered"
        ]
      }
    ]
  },
  {
    "concept_id": "HI-KS1-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Observing a historical source (photograph, artefact, picture) and saying what they can see.",
        "example_task": "Look at this old photograph of a street. Tell me three things you can see in the picture.",
        "example_response": "I can see a horse pulling a cart. There are people wearing long clothes. The road is made of cobblestones.",
        "common_errors": [
          "Making up details that are not visible in the source",
          "Describing feelings about the picture rather than what is actually shown"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Asking simple questions about a historical source and suggesting what it might tell us about the past.",
        "example_task": "Look at this old toy. What questions could you ask about it? What does it tell us about children in the past?",
        "example_response": "I wonder who played with it and how old it is. It tells us that children in the past played with wooden toys, not plastic ones. It doesn't have batteries so children had to use their imagination.",
        "common_errors": [
          "Asking questions that cannot be answered from the source",
          "Assuming the source tells us everything about the past rather than just one part"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using more than one source to find out about a historical event or person, and recognising that sources can tell us different things.",
        "example_task": "Here is a photograph and a letter from the same period. What does each one tell us? Do they tell us the same things or different things?",
        "example_response": "The photograph shows us what the building looked like — it had a thatched roof and small windows. The letter tells us how the person who lived there felt — they said it was cold in winter. The photograph shows the outside but the letter tells us about life inside. Together they tell us more than one source alone.",
        "common_errors": [
          "Treating both sources as saying the same thing rather than offering different perspectives",
          "Not recognising that sources have limitations — each one only shows part of the story"
        ]
      }
    ]
  },
  {
    "concept_id": "HI-KS1-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recalling a fact about a local historical event, person or place studied in class.",
        "example_task": "Tell me one thing you learned about the history of our school or local area.",
        "example_response": "Our school was built over 100 years ago. The old photograph shows it looked different — there was no playground.",
        "common_errors": [
          "Confusing local history facts with general history knowledge",
          "Not being able to recall any specific local historical detail"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing a local historical event or feature and explaining how it connects to the wider area or community.",
        "example_task": "Why is the war memorial in our town important to the local community?",
        "example_response": "The war memorial has the names of people from our town who died in the wars. It is important because families come to remember their relatives and the whole community gathers there on Remembrance Day.",
        "common_errors": [
          "Describing the physical feature without explaining its historical or community significance",
          "Not making connections between the local feature and the people who use it"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Connecting local history to national history, explaining how a national event affected the local area or how a local story is part of a bigger picture.",
        "example_task": "During World War Two, many children were evacuated from cities. How did evacuation affect our local area?",
        "example_response": "Children from London were sent to our village to be safe from the bombing. Local families had to look after children they had never met. This shows how a national event — the war — changed life in our local area. Some evacuees stayed and became part of the community.",
        "common_errors": [
          "Treating local and national history as completely separate topics",
          "Describing the national event without connecting it to the specific local impact"
        ]
      }
    ]
  }
]
