[
  {
    "concept_id": "HI-KS2-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying a single cause or consequence of a historical event when given options or prompts.",
        "example_task": "Why did the Romans invade Britain? Choose from these reasons: they wanted Britain's metals, they were lost, they wanted a holiday.",
        "example_response": "The Romans invaded Britain because they wanted Britain's metals like tin and gold.",
        "common_errors": [
          "Selecting an answer without being able to explain why it makes sense",
          "Confusing cause (why something happened) with consequence (what happened as a result)"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing more than one cause or consequence of a historical event and beginning to distinguish between short-term and long-term effects.",
        "example_task": "Give two reasons why the Romans invaded Britain and one thing that happened as a result of the invasion.",
        "example_response": "The Romans invaded because they wanted Britain's resources and because Emperor Claudius wanted a military victory. As a result, the Romans built roads, towns and forts across Britain.",
        "common_errors": [
          "Listing causes without distinguishing their relative importance",
          "Describing only immediate consequences and missing longer-term effects"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining how multiple causes combined to produce a historical event, and distinguishing between intended and unintended consequences.",
        "example_task": "Explain why the Anglo-Saxons settled in Britain after the Romans left. Were there both 'push' and 'pull' factors?",
        "example_response": "The Anglo-Saxons came because their own lands were flooding and overcrowded (push factors) and because Britain had good farmland and the Roman defences had weakened (pull factors). These causes worked together — if Britain had still been well defended, the push factors alone might not have been enough.",
        "common_errors": [
          "Treating causes as a simple list rather than explaining how they interact",
          "Assuming every consequence was intended by the historical actors"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating the relative importance of different causes, arguing which was most significant and supporting the argument with evidence.",
        "example_task": "Several factors led to the Viking raids on Britain: desire for wealth, overcrowded Scandinavian farmland, and weak Anglo-Saxon defences. Which do you think was the most important cause? Explain your reasoning.",
        "example_response": "I think the desire for wealth was most important because the Vikings specifically targeted monasteries with gold and silver. Even if their farmland hadn't been overcrowded, the wealth of British monasteries would have attracted raiders. However, weak defences made it possible — without that, the raids might have been smaller.",
        "common_errors": [
          "Stating a cause is 'most important' without providing evidence or reasoning",
          "Refusing to prioritise causes and insisting all were equally important without analysis"
        ]
      }
    ]
  },
  {
    "concept_id": "HI-KS2-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recalling why a person or event studied in class is considered important in history.",
        "example_task": "Why do we still remember the Great Fire of London?",
        "example_response": "We remember the Great Fire of London because it destroyed most of the city and changed how London was rebuilt.",
        "common_errors": [
          "Confusing 'remembered' with 'significant' — something can be remembered but not important",
          "Giving a circular answer: 'It is important because it is famous'"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using at least two criteria to explain why a historical event, person or development is significant.",
        "example_task": "Using the criteria 'how many people were affected' and 'did it change what happened next', explain why the Roman invasion of Britain was significant.",
        "example_response": "The Roman invasion was significant because it affected everyone in Britain — all the Celtic tribes came under Roman rule. It also changed what happened next because the Romans built roads, introduced new laws and their language influenced English.",
        "common_errors": [
          "Applying criteria mechanically without connecting them to specific evidence",
          "Only using one criterion when asked for multiple"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining that significance can change over time or be viewed differently by different groups, using specific historical examples.",
        "example_task": "Is the Norman Conquest equally significant to everyone? Think about how different people might view it.",
        "example_response": "The Norman Conquest was very significant to the Anglo-Saxon nobles who lost their land and power. For ordinary people, life changed more slowly. Today, historians see it as a turning point because it changed England's language, laws and connections to Europe. So its significance depends on who you are and when you are looking at it.",
        "common_errors": [
          "Treating significance as a fixed, objective fact rather than something that can be debated",
          "Only considering the perspective of the 'winners' in a historical event"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Constructing an argument about which of several events or individuals was most historically significant, applying criteria systematically and considering counter-arguments.",
        "example_task": "Which was more significant for Britain: the Roman invasion or the Norman Conquest? Build an argument for one side.",
        "example_response": "I would argue the Norman Conquest was more significant because its effects lasted longer and went deeper. The Romans eventually left and much of their influence faded, but the Normans permanently changed the English language, the class system and the legal system. However, someone could argue the Roman invasion was more significant because it first connected Britain to European civilisation.",
        "common_errors": [
          "Making an assertion without supporting it with historical evidence",
          "Not acknowledging that the other side of the argument has merit"
        ]
      }
    ]
  },
  {
    "concept_id": "HI-KS2-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying whether a source is from the time being studied (primary) or created later (secondary), and stating one thing the source tells us.",
        "example_task": "This is a Roman coin found in Britain. Is it a primary source or a secondary source? What does it tell us?",
        "example_response": "It is a primary source because it was made by the Romans. It tells us the Romans used coins with pictures of their emperors on them.",
        "common_errors": [
          "Confusing primary and secondary sources",
          "Describing the physical appearance of the source without saying what it tells us about the past"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Asking questions about who created a source, when and why, and considering what it can and cannot tell us.",
        "example_task": "Here is an account of a battle written by the winning side. What questions should we ask about this source? What might it not tell us?",
        "example_response": "We should ask: who wrote it and were they there? Why did they write it? It might not tell us what the losing side experienced. The writer probably wanted to make their side look good, so it might exaggerate their bravery.",
        "common_errors": [
          "Accepting the source at face value without questioning its origin or purpose",
          "Dismissing a biased source as useless rather than recognising what it still reveals"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Comparing two or more sources about the same event, identifying where they agree and disagree, and explaining why different interpretations exist.",
        "example_task": "Here are two accounts of the Viking attack on Lindisfarne: one from a Saxon monk and one from a modern historian. How do they differ and why?",
        "example_response": "The Saxon monk describes the Vikings as terrible savages sent by God as punishment. The modern historian explains the attack as part of Viking expansion driven by trade and settlement. They differ because the monk was there and was terrified, while the historian has more evidence and is looking at the bigger picture. Neither is completely right or wrong — they have different perspectives.",
        "common_errors": [
          "Assuming the modern account must be correct and the older one wrong",
          "Not explaining why the differences exist, only listing them"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating the reliability and utility of sources for answering specific historical questions, and understanding that interpretation changes as new evidence emerges.",
        "example_task": "A historian in 1950 wrote that the Anglo-Saxons were simple farmers. New archaeological evidence suggests they were skilled metalworkers and traders. What does this tell us about how history is written?",
        "example_response": "It tells us that historical interpretations change when new evidence is found. The 1950 historian only had limited evidence, so their interpretation was based on what they knew. Archaeology has revealed things written sources didn't mention. This means we should treat all historical accounts as 'the best interpretation so far' rather than final truth.",
        "common_errors": [
          "Thinking historical facts never change, rather than understanding that interpretations evolve",
          "Assuming that newer interpretations are always better without considering the evidence"
        ]
      }
    ]
  },
  {
    "concept_id": "HI-KS2-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recalling key facts about an ancient civilisation studied in class: where it was, when it existed, and one distinctive feature.",
        "example_task": "Tell me three facts about Ancient Egypt.",
        "example_response": "Ancient Egypt was in Africa along the River Nile. It existed thousands of years ago. The Egyptians built pyramids as tombs for their pharaohs.",
        "common_errors": [
          "Confusing facts about different ancient civilisations",
          "Using very vague time references ('a long time ago') without any sense of period"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing key features of an ancient civilisation including its achievements, social structure or daily life, using specific details from study.",
        "example_task": "Describe the achievements of Ancient Egypt. What did the Egyptians create or discover that was impressive?",
        "example_response": "The Egyptians built enormous pyramids using precise mathematics. They invented hieroglyphic writing and wrote on papyrus. They developed a calendar based on the Nile's flooding, mummified their dead, and created beautiful art and jewellery.",
        "common_errors": [
          "Listing achievements without giving specific details or examples",
          "Describing achievements using modern comparisons that are anachronistic"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining how the geography, resources and environment of a region shaped the civilisation that developed there, using specific evidence.",
        "example_task": "How did the River Nile shape Ancient Egyptian civilisation?",
        "example_response": "The Nile flooded every year, depositing fertile soil that allowed farming in an otherwise desert landscape. This meant people could settle permanently and grow surplus food, which allowed specialisation — some people could become builders, priests or scribes instead of farmers. The river also provided transport and water for drinking and irrigation. Without the Nile, Egyptian civilisation could not have developed as it did.",
        "common_errors": [
          "Stating that the Nile was important without explaining the specific mechanisms",
          "Not connecting geographical factors to social and political developments"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Comparing two ancient civilisations, identifying similarities and differences in their development, and considering why different civilisations developed different solutions to similar problems.",
        "example_task": "Both Ancient Egypt and the Indus Valley civilisation developed near rivers. Compare how each civilisation used its river environment.",
        "example_response": "Both civilisations depended on river flooding for agriculture and used rivers for transport and trade. However, the Indus Valley civilisation developed sophisticated drainage and sewage systems in its cities, while Egypt focused more on irrigation canals. Egypt's civilisation was more centralised under pharaohs, while the Indus Valley cities seem to have been more independently governed. Both found solutions to the same problem — how to use river water — but their solutions reflected different priorities.",
        "common_errors": [
          "Only identifying similarities or only differences, not both",
          "Assuming one civilisation was 'better' than the other rather than comparing their approaches"
        ]
      }
    ]
  },
  {
    "concept_id": "HI-KS2-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Placing the main British historical periods studied (Stone Age, Bronze Age, Iron Age, Romans, Anglo-Saxons, Vikings, Normans) in the correct chronological order.",
        "example_task": "Put these periods in order from earliest to latest: Vikings, Romans, Stone Age, Anglo-Saxons.",
        "example_response": "Stone Age, Romans, Anglo-Saxons, Vikings.",
        "common_errors": [
          "Placing Vikings before Anglo-Saxons (they overlapped but Anglo-Saxon settlement came first)",
          "Confusing the order of Romans and Iron Age peoples"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing the distinctive characteristics of each period and explaining what changed between one period and the next.",
        "example_task": "What was different about life in Roman Britain compared with life in the Iron Age?",
        "example_response": "In the Iron Age, people lived in round houses in small settlements and tribes often fought each other. The Romans brought towns with stone buildings, straight roads connecting them, public baths, and a single system of laws. People started using Roman coins and some learned Latin.",
        "common_errors": [
          "Describing periods in isolation without explaining what changed between them",
          "Portraying earlier periods as purely primitive without recognising their sophistication"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining connections between periods, showing how developments in one period built on, reacted to, or were influenced by the previous period.",
        "example_task": "How did the end of Roman rule in Britain lead to the Anglo-Saxon period? What connections can you find between the two?",
        "example_response": "When the Romans left around 410 AD, Britain lost its centralised government, army and trade connections. Towns declined and the road system wasn't maintained. This created a power vacuum that the Anglo-Saxons filled, establishing their own kingdoms. However, some Roman influences continued — Christianity, which the Romans had brought, survived and later converted the Anglo-Saxons.",
        "common_errors": [
          "Treating periods as completely separate with no connections",
          "Assuming the Romans left suddenly and everything changed overnight"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using evidence to evaluate different historical interpretations of a period, and recognising that periodisation itself is a historical construction.",
        "example_task": "Historians sometimes call the period after the Romans left Britain the 'Dark Ages'. Do you think this is a fair name? What evidence supports or challenges it?",
        "example_response": "The term 'Dark Ages' suggests nothing good happened, but this isn't fair. Anglo-Saxon England produced beautiful metalwork like the Sutton Hoo treasure, complex poetry like Beowulf, and established kingdoms with sophisticated law codes. It's called 'dark' partly because fewer written records survive, so we know less — but that doesn't mean the period was less advanced. The name reflects our lack of evidence more than the quality of the period.",
        "common_errors": [
          "Accepting period labels uncritically without questioning who created them and why",
          "Equating fewer surviving sources with less historical importance"
        ]
      }
    ]
  }
]
