[
  {
    "concept_id": "HI-KS3-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can identify some key events in British political history (e.g. Magna Carta, the Civil War) and recognise that Britain is a democracy, but struggles to explain how political power changed over time.",
        "example_task": "Name two events that were important in the development of democracy in Britain.",
        "example_response": "Magna Carta in 1215 limited the power of the king. The English Civil War in the 1640s led to Parliament becoming more powerful than the monarch.",
        "common_errors": [
          "Listing events without explaining their connection to the development of democracy",
          "Assuming Magna Carta created democracy rather than being one step in a long process"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Can describe several stages in the development of British democracy and explain basic cause-and-effect relationships between events, with some understanding that change was contested and gradual.",
        "example_task": "Explain how the English Civil War changed the balance of power between Parliament and the monarchy.",
        "example_response": "Before the Civil War, Charles I believed in the divine right of kings and tried to rule without Parliament. Parliament fought against him because they wanted a say in how the country was governed, especially over taxation. After Parliament won the war, Charles I was executed in 1649, showing that even a king could be held accountable. Although the monarchy was restored in 1660, Parliament kept more power than before. The Glorious Revolution of 1688 then confirmed that Parliament, not the monarch, was the supreme authority.",
        "common_errors": [
          "Describing the Civil War as a simple fight between two sides without explaining the underlying political dispute",
          "Not connecting the Civil War to the longer story of constitutional development"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Can construct a clear narrative of constitutional change across the medieval and early modern periods, explaining multiple causes of change and analysing how different social groups experienced and drove political transformation.",
        "example_task": "How far was the development of democracy in Britain a story of steady progress? Use examples from at least three different periods to support your argument.",
        "example_response": "The development of British democracy was not a story of steady progress but of contested, uneven change with significant setbacks. Magna Carta (1215) limited royal power, but it protected baronial privilege, not ordinary people's rights. The Peasants' Revolt (1381) showed that common people demanded a voice, but it was violently suppressed. The Civil War and Glorious Revolution (1640s-1688) established parliamentary sovereignty, but Parliament represented only wealthy men. The Reform Acts of the 19th century gradually extended the franchise, but universal suffrage was not achieved until 1928. At each stage, those in power resisted change and those demanding it faced real risk. Progress was driven by economic change, religious conflict, intellectual movements like the Enlightenment, and sustained pressure from excluded groups. The outcome was never inevitable.",
        "common_errors": [
          "Presenting constitutional development as an inevitable march towards democracy without acknowledging resistance and reversals",
          "Focusing only on political events without considering the economic and social forces driving change"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Can evaluate competing historical interpretations of British constitutional development, assess the relative significance of different factors driving change, and make connections between British and comparative international developments.",
        "example_task": "Some historians argue that the development of British democracy was driven primarily by pressure from below (popular movements), while others argue it was shaped by decisions from above (elite concessions). Which interpretation do you find more convincing, and why?",
        "example_response": "Both interpretations capture part of the truth, but neither is sufficient alone. The 'pressure from below' interpretation correctly identifies moments when popular action forced change: the Peasants' Revolt challenged feudal assumptions, Chartism created mass political consciousness, and the suffragette movement made women's exclusion untenable. However, the 'concessions from above' interpretation explains why change took the specific forms it did: the Great Reform Act of 1832 was carefully designed by elites to extend just enough franchise to defuse revolutionary pressure while preserving their own dominance. The most convincing interpretation is that democratic development resulted from the interaction between popular pressure and elite calculation. Elites conceded reform when the cost of resistance exceeded the cost of concession, but the timing, form and extent of reform were shaped by the strength and organisation of popular movements. Comparing with France, where elite resistance to reform led to violent revolution, suggests that the British pattern of incremental concession was contingent on the specific balance of political forces rather than being an inherent national characteristic.",
        "common_errors": [
          "Accepting one interpretation uncritically without evaluating the evidence for and against it",
          "Not using specific historical evidence to support the evaluation of competing interpretations"
        ]
      }
    ]
  },
  {
    "concept_id": "HI-KS3-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can identify that Britain had an empire and that the slave trade was part of it, but has limited factual knowledge of the chronology, geography and mechanisms of empire.",
        "example_task": "What was the British Empire? Name one way it affected people in other countries.",
        "example_response": "The British Empire was when Britain controlled many countries around the world. One way it affected people was through the slave trade, where millions of African people were captured and forced to work on plantations in the Caribbean and America.",
        "common_errors": [
          "Describing the empire in very general terms without specific examples or dates",
          "Not recognising that the slave trade involved the forced transportation of millions of people over centuries"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Can describe the main phases of the British Empire chronologically and explain the role of the slave trade as an economic system, with some understanding of both colonial and colonised perspectives.",
        "example_task": "Explain how the transatlantic slave trade worked as an economic system and why it was important to the British Empire.",
        "example_response": "The transatlantic slave trade operated as a triangular trade system. British ships sailed to West Africa carrying manufactured goods, which were exchanged for enslaved people. The enslaved people were transported across the Atlantic on the Middle Passage to Caribbean and American colonies, where they were sold. The ships then returned to Britain carrying sugar, tobacco and cotton produced by enslaved labour. This system made enormous profits for British traders, plantation owners and port cities like Liverpool and Bristol. The slave trade was central to the British economy in the 17th and 18th centuries because the plantation colonies produced raw materials that fuelled British industry and trade.",
        "common_errors": [
          "Describing the slave trade without explaining its economic function within the wider empire",
          "Not mentioning the human suffering and mortality of the Middle Passage"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Can analyse the causes and consequences of British imperialism across multiple periods, explain the experiences of colonised peoples alongside those of colonisers, and evaluate the process of decolonisation.",
        "example_task": "Why did the British Empire come to an end in the twentieth century? Consider both the actions of colonised peoples and the changing position of Britain.",
        "example_response": "Decolonisation resulted from the interaction of multiple factors. Colonised peoples increasingly organised resistance movements demanding independence, drawing on ideas of self-determination and national identity. In India, the independence movement led by figures like Gandhi and Nehru used both non-violent protest and political organisation to make British rule unsustainable. The Second World War weakened Britain economically and militarily, making it harder to maintain control over a vast empire. The war also undermined the moral justification for empire, since Britain had fought against Nazi imperialism while maintaining its own colonies. The Cold War created pressure from both the USA and USSR, which opposed European colonialism for their own strategic reasons. Independence movements in Africa accelerated in the 1950s and 1960s, sometimes through negotiation and sometimes through armed struggle. Decolonisation did not end imperial influence: newly independent states inherited borders drawn by colonial powers, economies structured around colonial trade patterns, and political institutions shaped by colonial administration.",
        "common_errors": [
          "Attributing decolonisation entirely to British generosity rather than recognising the agency of independence movements",
          "Not explaining the lasting legacies of empire in shaping post-colonial societies"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Can critically evaluate different historical interpretations of the British Empire, assess its long-term significance using explicit criteria, and connect imperial history to contemporary global issues with analytical sophistication.",
        "example_task": "How should we assess the historical significance of the British Empire? Is it possible to reach a balanced judgement about whether the empire was, on balance, beneficial or harmful?",
        "example_response": "Assessing the significance of the British Empire requires distinguishing between its impact at the time and its long-term legacy, and recognising that impact differed enormously depending on whose perspective we adopt. For many colonised peoples, empire involved violence, exploitation, cultural destruction and economic extraction: the Bengal Famine of 1943, the suppression of the Mau Mau uprising, and the systematic extraction of resources from colonies were profoundly harmful. For Britain, empire generated enormous wealth, global influence and cultural reach. Some argue that empire also brought infrastructure, legal systems and education to colonies, but this 'balance sheet' approach is problematic because it treats colonial development as compensation for colonial exploitation, and because much colonial infrastructure was built to serve colonial economic interests, not the needs of local populations. The question of whether empire was 'beneficial or harmful' may itself be misleading, because it implies a single judgement can encompass the experiences of hundreds of millions of people across three centuries. A more historically productive approach is to examine specific consequences in specific contexts, using criteria such as scale of impact, duration, and significance for subsequent developments. The most important legacy may be structural: the patterns of global inequality, migration, cultural exchange and political boundaries that shape the contemporary world were all profoundly shaped by empire.",
        "common_errors": [
          "Adopting an uncritically positive or negative framing without engaging with the complexity of different experiences and perspectives",
          "Making sweeping judgements about 'the empire' without recognising that imperial experience varied enormously by place, period and social group"
        ]
      }
    ]
  },
  {
    "concept_id": "HI-KS3-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can identify the Holocaust as an event in which millions of Jewish people were killed by the Nazis during the Second World War, but has limited understanding of how persecution escalated or why it happened.",
        "example_task": "What was the Holocaust? Who was targeted and what happened to them?",
        "example_response": "The Holocaust was when the Nazi government in Germany murdered six million Jewish people during the Second World War. Jewish people were taken from their homes, sent to concentration camps, and killed. Other groups were also targeted including Roma people, disabled people and gay men.",
        "common_errors": [
          "Stating the facts of mass murder without any understanding of how persecution escalated over time",
          "Not recognising that the Holocaust targeted multiple groups alongside the Jewish people"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Can describe the escalation of persecution from legal discrimination to mass murder, identify key stages in the process, and explain the role of Nazi ideology in motivating the Holocaust.",
        "example_task": "Explain how the persecution of Jewish people in Germany escalated between 1933 and 1945.",
        "example_response": "Persecution escalated gradually over twelve years. After the Nazis came to power in 1933, they passed laws removing Jewish people's rights, including the Nuremberg Laws (1935) which stripped Jewish Germans of citizenship. Kristallnacht (1938) saw organised violence against Jewish businesses and synagogues. During the war, Jewish people in occupied territories were forced into ghettos where many died from starvation and disease. From 1941, the Nazis began systematic mass murder through mobile killing units (Einsatzgruppen) and then through extermination camps like Auschwitz-Birkenau. The escalation was driven by Nazi antisemitic ideology, which portrayed Jewish people as racially inferior and as enemies of the German state. At each stage, the persecution intensified, but it was not inevitable that discrimination would lead to genocide.",
        "common_errors": [
          "Jumping straight to the death camps without explaining the years of escalating persecution that preceded them",
          "Treating the Holocaust as inevitable rather than as the result of specific decisions and choices"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Can analyse the roles of different groups in the Holocaust (perpetrators, bystanders, collaborators, resisters, rescuers), explain the conditions that made genocide possible, and engage thoughtfully with the moral complexity of the period.",
        "example_task": "Why did so many ordinary people participate in, or fail to prevent, the Holocaust? Consider the roles of perpetrators, bystanders and resisters.",
        "example_response": "The Holocaust required the participation or acquiescence of millions of ordinary people, not just a small number of fanatical Nazis. Perpetrators included bureaucrats who organised deportations, soldiers who carried out shootings, and camp guards who ran the extermination process. Many were motivated by ideological conviction, but others participated through obedience to authority, career ambition, or gradual desensitisation. Bystanders across occupied Europe witnessed persecution but often did not intervene, whether from fear of personal consequences, indifference, or the belief that they could not make a difference. Some actively collaborated, handing over Jewish neighbours or profiting from seized property. However, there were also resisters and rescuers who risked their lives to help Jewish people: individuals like Oskar Schindler, communities like Le Chambon-sur-Lignon in France, and organised networks across Europe. The conditions that made the Holocaust possible included: a powerful state apparatus willing to use it for genocide; propaganda that dehumanised Jewish people over many years; a culture of obedience to authority; the disruption and moral confusion of wartime; and the fragmentation of responsibility so that each individual's contribution seemed small.",
        "common_errors": [
          "Portraying all Germans as either knowing perpetrators or completely ignorant, ignoring the complex spectrum of responses",
          "Not acknowledging the existence of resistance and rescue alongside complicity and collaboration"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Can evaluate different historical interpretations of the Holocaust, connect it to broader questions about genocide and human rights, and critically assess its significance for the contemporary world using explicit criteria.",
        "example_task": "Historians debate whether the Holocaust was a uniquely evil event or whether it should be understood as one example of a broader pattern of genocide in modern history. What is at stake in this debate, and what is your assessment?",
        "example_response": "This debate has both historical and moral dimensions. The 'uniqueness' position (associated with Elie Wiesel and others) argues that the Holocaust was unprecedented in its industrial-scale bureaucratic killing, its targeting of an entire people for total annihilation regardless of any military objective, and its occurrence in the heart of European civilisation. This interpretation emphasises that the Holocaust should not be relativised by comparison. The 'comparative' position (associated with scholars of genocide like Raphael Lemkin) argues that understanding the Holocaust alongside other genocides (the Armenian genocide, Rwanda, Cambodia) reveals patterns in how genocides develop and can be prevented. This interpretation emphasises practical lessons for prevention. Both positions have merit. The Holocaust was distinctive in its scale, method and ideological character, and treating it as merely one example among many risks losing its specific historical meaning. However, treating it as absolutely unique risks suggesting that it can never happen again and has no lessons for understanding other genocides. The most productive approach may be to study the Holocaust in its specific historical context while also recognising the patterns it shares with other genocides: the role of dehumanising ideology, the escalation from discrimination to violence, the failure of bystanders to intervene, and the conditions under which ordinary people participate in extraordinary evil. The concept of genocide itself, and the international legal frameworks designed to prevent it (the Genocide Convention, the International Criminal Court), emerged directly from the experience of the Holocaust, making its legacy central to contemporary human rights.",
        "common_errors": [
          "Treating the debate as merely academic without recognising the moral and political stakes involved",
          "Making comparisons that trivialise the Holocaust or that dismiss the experiences of victims of other genocides"
        ]
      }
    ]
  },
  {
    "concept_id": "HI-KS3-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can write about historical events in a descriptive, narrative way but struggles to organise information around an argument or answer a specific historical question analytically.",
        "example_task": "Why was the Battle of Hastings a turning point in English history?",
        "example_response": "The Battle of Hastings happened in 1066 when William of Normandy fought King Harold. William won the battle and became King of England. After this, lots of things changed in England.",
        "common_errors": [
          "Describing what happened rather than explaining why it was significant",
          "Not developing points beyond a single sentence"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Can structure a response around a historical question, making a clear point supported by evidence, though arguments may be one-sided and evidence may not be fully explained.",
        "example_task": "Was the Black Death the most important cause of the Peasants' Revolt of 1381? Explain your answer.",
        "example_response": "The Black Death was an important cause of the Peasants' Revolt because it killed about a third of the population. This meant there were fewer workers, so peasants could demand higher wages. However, the lords and the government tried to keep wages low by passing the Statute of Labourers in 1351, which made peasants angry. The Poll Tax of 1381 was the trigger that actually started the revolt because it demanded the same amount of money from rich and poor alike, which was unfair. So the Black Death was an important underlying cause, but the revolt was also caused by the government's attempts to control wages and the unfair tax.",
        "common_errors": [
          "Only explaining one cause without considering alternative factors",
          "Asserting that something was important without explaining the mechanism by which it led to the outcome"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Can construct a sustained historical argument with a clear thesis, deploying selected evidence to support the argument and addressing counter-evidence or alternative interpretations.",
        "example_task": "How far do you agree that the Industrial Revolution improved life for ordinary people in Britain? Use evidence to support your argument.",
        "example_response": "The Industrial Revolution brought both significant improvements and significant deterioration to the lives of ordinary people, and the balance varied by period, region and social group. In the short term (1780-1840), conditions for many factory and mine workers were harsh: long hours, dangerous conditions, child labour, and overcrowded urban housing with poor sanitation led to high mortality and widespread suffering. Evidence from reports like the Sadler Committee (1832) documented appalling conditions in textile mills. However, in the longer term, industrialisation generated rising real wages (from approximately 1840 onwards), cheaper manufactured goods, and expanding opportunities for employment and social mobility. The development of railways connected communities and reduced the price of food and goods. The key qualification is that improvement was uneven: factory owners and the emerging middle class benefited earlier and more substantially than manual labourers. Women's working conditions in mills were often worse than men's, and children were exploited until factory legislation provided protection. Therefore, while the Industrial Revolution ultimately raised living standards for most of the population, it did so at the cost of immense short-term suffering, and the benefits were distributed unequally. The argument that it 'improved life' depends on the timeframe and the social group being considered.",
        "common_errors": [
          "Making a one-sided argument without acknowledging counter-evidence",
          "Including evidence that is not explicitly linked to the argument being made"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Can construct a sophisticated, multi-layered historical argument that integrates multiple second-order concepts, evaluates competing interpretations, and demonstrates awareness of the limits of historical knowledge.",
        "example_task": "Construct an argument in response to the following claim: 'The most significant consequence of the First World War was the political transformation of Europe.' Do you agree?",
        "example_response": "The political transformation of Europe was certainly one of the most significant consequences of the First World War, but whether it was the most significant depends on what criteria of significance we apply and what timeframe we consider. Politically, the war destroyed four empires (Russian, Austro-Hungarian, Ottoman, German), created new nation-states across central and eastern Europe, and established the conditions for both the Russian Revolution (1917) and the rise of fascism in the 1920s-30s. These political consequences were enormous in scale and enduring in their effects. However, the social consequences were equally transformative: the experience of total war permanently altered the relationship between citizens and the state, expanded women's roles in public life, and created a generation profoundly shaped by the trauma of industrial warfare. The cultural consequences — the destruction of 19th-century optimism, the rise of modernism, the literature of disillusionment — transformed European intellectual and artistic life. Economically, the war created the debt structures and reparation demands that destabilised the 1920s and contributed to the Great Depression. If we define significance by long-term impact, the war's most significant consequence may be that it made the Second World War possible: the political settlements of 1919, particularly the Treaty of Versailles, created grievances and instabilities that directly contributed to the rise of Nazism and the outbreak of war in 1939. An argument for political transformation as the most significant consequence must therefore show that it was the political changes that generated the most far-reaching and enduring effects — which is plausible but not conclusive, since the social, economic and cultural consequences were equally profound and interconnected with the political ones.",
        "common_errors": [
          "Agreeing or disagreeing with the claim without establishing and applying criteria for assessing significance",
          "Treating the different types of consequence as separate rather than analysing how they interconnected"
        ]
      }
    ]
  }
]