[
  {
    "concept_id": "LA-KS4-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can form the present tense of regular verbs with reasonable accuracy, and recognises that other tenses exist, but uses only the present tense in free production and struggles to identify tense markers in written or spoken input.",
        "example_task": "Translate these three sentences into French: 'I play football.' 'Yesterday I played football.' 'Tomorrow I will play football.'",
        "example_response": "'Je joue au football.' 'Hier j'ai joué au football.' 'Demain je jouerai au football.' (Note: at emerging level, a typical response might produce the present tense correctly but use incorrect forms for past and future, e.g., 'Hier je joue au football.')",
        "common_errors": [
          "Using the present tense for all time frames regardless of time markers",
          "Confusing the passé composé auxiliary (avoir vs être) in common verbs"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Can form the present and past tenses (e.g., passé composé in French, preterito in Spanish) with partial accuracy, and attempts the future tense, but makes systematic errors in verb conjugation and agreement.",
        "example_task": "Write a paragraph in the target language describing what you did last weekend and what you plan to do next weekend. Use at least three different tenses.",
        "example_response": "Le week-end dernier, je suis allé au cinéma avec mes amis et nous avons regardé un film d'action. C'était vraiment passionnant. Le week-end prochain, j'irai à la piscine parce que j'adore nager. (Uses passé composé, imperfect and future.)",
        "common_errors": [
          "Forming the past participle incorrectly for irregular verbs (e.g., 'j'ai allé' instead of 'je suis allé')",
          "Using the infinitive instead of the conjugated future form (e.g., 'je vais aller' is acceptable but 'je aller' is not)"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Uses the present, past (perfect and imperfect), future and conditional tenses accurately in both speaking and writing, selecting the correct tense to convey meaning and using time adverbials appropriately.",
        "example_task": "Write a response to this GCSE writing task: 'Describe a memorable holiday. Include what you did, what it was like, and what you would do differently next time.' (90-150 words in the target language)",
        "example_response": "L'été dernier, je suis allée en Espagne avec ma famille. Nous avons passé deux semaines au bord de la mer. Tous les jours, nous allions à la plage où je nageais et jouais au volley. Le temps était magnifique et il faisait très chaud. Un jour, nous avons visité une vieille ville et j'ai acheté des souvenirs pour mes amis. C'était la meilleure vacance de ma vie! Si je pouvais y retourner, je visiterais plus de villages et j'apprendrais quelques mots d'espagnol avant de partir, parce que je ne comprenais rien quand les gens me parlaient.",
        "common_errors": [
          "Using the passé composé where the imperfect is required for description or ongoing states (e.g., 'il a fait chaud' instead of 'il faisait chaud')",
          "Avoiding the conditional tense entirely, limiting the range of expression"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Manipulates the full range of GCSE tenses including the subjunctive (where applicable) with consistent accuracy, uses complex tense sequences across extended writing, and can explain the semantic distinctions between tenses.",
        "example_task": "Translate into French: 'Although I would prefer to live in Paris, my parents want me to stay here. If I had studied harder, I would have passed the exam. It is important that everyone makes an effort.'",
        "example_response": "'Bien que je préférerais vivre à Paris, mes parents veulent que je reste ici. Si j'avais étudié plus dur, j'aurais réussi l'examen. Il est important que tout le monde fasse un effort.' (Demonstrates conditional, subjunctive after 'vouloir que' and 'il est important que', plus the pluperfect conditional structure.)",
        "common_errors": [
          "Failing to use the subjunctive after trigger expressions such as 'il faut que' or 'bien que'",
          "Confusing the conditional perfect ('j'aurais fait') with the pluperfect ('j'avais fait') in hypothetical constructions"
        ]
      }
    ]
  },
  {
    "concept_id": "LA-KS4-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Produces short, simple sentences with basic subject-verb-object structure but with frequent errors in agreement (gender, number) and limited vocabulary range.",
        "example_task": "Write three sentences in the target language describing your school. Try to include adjectives.",
        "example_response": "Mon école est grand. Les professeurs sont gentil. J'aime le sport. (Errors: 'grand' should agree with feminine 'école' → 'grande'; 'gentil' should be plural → 'gentils'.)",
        "common_errors": [
          "Omitting adjective agreement for gender and number",
          "Relying on the same basic sentence structure (subject + être + adjective) for every sentence"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Uses a range of basic structures with some accuracy, including negative forms and simple connectives, but makes errors in more complex constructions such as relative clauses or subordinate clauses.",
        "example_task": "Write a paragraph about your free-time activities. Include at least one opinion, one negative sentence, and one reason using a connective.",
        "example_response": "Pendant mon temps libre, j'aime jouer aux jeux vidéo parce que c'est amusant. Je ne fais pas de sport car je suis paresseux. Le week-end, je regarde la télé avec ma famille et je mange du chocolat.",
        "common_errors": [
          "Using 'pas' without 'ne' in negation, or placing the negation incorrectly around compound tenses",
          "Using only 'parce que' and 'mais' as connectives without attempting more varied linking expressions"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Produces grammatically accurate writing and speech with a range of structures including relative clauses, subordinate clauses and varied sentence openings, maintaining accuracy across extended text.",
        "example_task": "Write a GCSE-style response (130-150 words) about the advantages and disadvantages of social media. Use a range of grammatical structures.",
        "example_response": "Les réseaux sociaux, qui sont devenus essentiels pour les jeunes, ont des avantages et des inconvénients. D'un côté, ils permettent de rester en contact avec des amis qui habitent loin, ce qui est pratique. De plus, on peut partager des photos et des vidéos facilement. Cependant, bien qu'ils soient utiles, les réseaux sociaux peuvent être dangereux. Par exemple, certaines personnes passent trop de temps en ligne au lieu de faire du sport ou de voir leurs amis en personne. En outre, le cyberharcèlement est un problème grave dont beaucoup de jeunes souffrent. À mon avis, il faudrait limiter le temps qu'on passe sur les réseaux sociaux afin de maintenir un bon équilibre.",
        "common_errors": [
          "Losing grammatical accuracy in longer texts as concentration lapses in the second half of extended writing",
          "Using the same sentence pattern repeatedly despite knowing a wider range of structures"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Deploys a wide range of complex structures with consistent accuracy across extended writing, including passive constructions, indirect speech, and varied clause types, adapting register appropriately to context.",
        "example_task": "Write a formal letter in the target language to a local council arguing that more should be done to protect the environment. Use formal register, complex structures and persuasive language.",
        "example_response": "Monsieur le Maire, Je vous écris afin d'exprimer mon inquiétude concernant la pollution dans notre ville. Bien que des mesures aient été prises l'année dernière, il me semble que les résultats restent insuffisants. Les habitants dont les maisons se trouvent près de la zone industrielle se plaignent de la qualité de l'air, qui s'est détériorée considérablement. Il serait souhaitable que la mairie investisse dans les transports en commun pour que les citoyens puissent réduire leur utilisation de la voiture. Je vous serais reconnaissant(e) si vous pouviez prendre en considération mes suggestions. Veuillez agréer, Monsieur le Maire, l'expression de mes sentiments respectueux.",
        "common_errors": [
          "Mixing formal and informal register within the same text (e.g., using 'tu' in a formal letter)",
          "Attempting complex structures but producing grammatically incoherent sentences due to overambition"
        ]
      }
    ]
  },
  {
    "concept_id": "LA-KS4-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can give short, rehearsed responses to predictable questions but relies heavily on memorised phrases and struggles to respond to unexpected questions or develop answers beyond a single sentence.",
        "example_task": "In a role play, the examiner asks: 'What did you do in your holidays?' Then follows up with an unexpected question: 'If you could go anywhere in the world, where would you go and why?'",
        "example_response": "First question: 'Je suis allé à la plage.' (short, rehearsed). Follow-up: Long pause... 'Euh... je voudrais... aller... à... l'Amérique... parce que... c'est bien.' (Very basic, struggles to form a response.)",
        "common_errors": [
          "Resorting to English when an unexpected question is asked rather than attempting a response in the target language",
          "Giving one-word or single-phrase answers without any development or justification"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Can sustain a basic conversation on familiar topics, asking and answering questions, but pauses frequently, relies on prepared content, and struggles to use communication strategies when vocabulary is lacking.",
        "example_task": "Have a conversation in the target language about school subjects. You must give opinions, ask the examiner a question, and respond to at least one unexpected follow-up.",
        "example_response": "Ma matière préférée est les sciences parce que c'est intéressant et le professeur est sympa. Je n'aime pas les maths car c'est difficile. Et vous, qu'est-ce que vous aimez? (Examiner asks: 'Would you like to be a scientist?') Euh... oui, je voudrais être... scientifique... parce que... j'aime... les expériences.",
        "common_errors": [
          "Not asking the examiner any questions, making the interaction one-sided",
          "Giving up when a word is unknown rather than attempting circumlocution or paraphrase"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Engages in sustained spontaneous conversation, developing answers with opinions, reasons and examples, using communication strategies effectively when encountering unknown vocabulary.",
        "example_task": "The examiner shows you a photo of young people using technology. Describe the photo, give your opinions about technology, and respond to follow-up questions spontaneously.",
        "example_response": "Sur la photo, je vois des jeunes qui utilisent leurs portables dans un café. Ils ne se parlent pas, ce que je trouve un peu triste. À mon avis, la technologie est utile mais il ne faut pas en abuser. Par exemple, quand je suis avec mes amis, j'essaie de ranger mon téléphone pour profiter du moment. (Follow-up: 'Do you think schools should ban phones?') C'est une bonne question. Je pense que les écoles devraient les interdire pendant les cours parce que c'est une distraction, mais peut-être pas à la récréation parce que les élèves ont besoin de... comment dire... de se détendre.",
        "common_errors": [
          "Describing the photo literally without offering opinions or analysis",
          "Not using communication strategies such as 'comment dire' or circumlocution when stuck on a word"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Communicates fluently and spontaneously with minimal hesitation, adapting language to different registers, initiating new topics, and using sophisticated communication strategies to maintain interaction under pressure.",
        "example_task": "Engage in a general conversation where the examiner will change topic unexpectedly. You must demonstrate ability to cope with the unexpected, develop complex arguments, and justify opinions with evidence.",
        "example_response": "(Examiner suddenly shifts from holidays to global issues: 'What do you think is the biggest problem facing the world today?') Je dirais que le changement climatique est le problème le plus urgent de notre époque. Ce qui me préoccupe le plus, c'est que malgré les preuves scientifiques, beaucoup de gouvernements ne font pas assez. Si j'étais président, j'investirais massivement dans les énergies renouvelables. Cela dit, ce n'est pas seulement la responsabilité des politiciens — nous devons tous changer nos habitudes quotidiennes. Par exemple, chez moi, nous avons réduit notre consommation de viande, ce qui a un impact sur... comment dire... l'empreinte carbone. Qu'en pensez-vous?",
        "common_errors": [
          "Reverting to memorised content when the topic shifts unexpectedly rather than responding genuinely to the question",
          "Failing to justify opinions with specific examples or evidence beyond generic statements"
        ]
      }
    ]
  },
  {
    "concept_id": "LA-KS4-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can identify individual familiar words in a written text but struggles to extract meaning from sentences or paragraphs, and attempts to translate word-by-word rather than using reading strategies.",
        "example_task": "Read this short text in the target language about a person's daily routine. Identify three activities they do and when they do them.",
        "example_response": "The person goes to school (le matin), eats lunch (à midi), and watches TV (le soir). (Can identify isolated facts from high-frequency vocabulary but may miss details.)",
        "common_errors": [
          "Attempting to translate every word and giving up when unfamiliar vocabulary is encountered",
          "Confusing similar-looking words (e.g., 'poisson' fish vs 'poison' poison) without using context to check"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Can understand the gist of straightforward texts and extract specific information, but struggles with inferential comprehension and unfamiliar vocabulary where contextual clues are needed.",
        "example_task": "Read this newspaper article in the target language about a new youth centre opening. Answer: a) What facilities will it have? b) Who is it aimed at? c) What is the writer's opinion about it?",
        "example_response": "a) It will have a sports hall, a music room and a café. b) It is aimed at young people aged 12-18. c) The writer thinks it is a good idea. (Can extract explicit information but may miss the nuance of the opinion or implied criticism.)",
        "common_errors": [
          "Answering literal comprehension questions correctly but missing implied meaning or tone",
          "Not attempting to deduce the meaning of unfamiliar words from morphological clues (prefixes, suffixes, cognates)"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Reads authentic texts with confidence, using a range of strategies (skimming, scanning, inference from context, morphological analysis) to comprehend both explicit and implied meaning.",
        "example_task": "Read this authentic magazine article in the target language about environmental activism among young people. a) Summarise the main argument. b) What is the writer's attitude towards the activists? How do you know? c) Deduce the meaning of the underlined word from context.",
        "example_response": "a) The article argues that young environmental activists are more effective than politicians at raising awareness of climate change, but that they face criticism for missing school. b) The writer is sympathetic: they use positive vocabulary ('courageux', 'engagés') to describe the activists and dismissive language ('les critiques habituelles') for opponents. c) The underlined word 'manifestation' likely means 'demonstration/protest' — it appears in a sentence about people marching in the street with banners, and the prefix 'manifest-' suggests showing something publicly.",
        "common_errors": [
          "Identifying the topic of a text but not the writer's specific argument or perspective",
          "Not providing evidence from the text to support inferences about attitude or opinion"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Engages critically with authentic texts including literary extracts and journalistic writing, identifying the writer's purpose, evaluating the effectiveness of their arguments, and translating nuanced passages with precision.",
        "example_task": "Read this extract from a French/Spanish/German novel studied in class. Analyse how the writer creates a sense of tension. Then translate the highlighted passage into English, preserving the tone.",
        "example_response": "The writer creates tension through short, abrupt sentences that mirror the character's panic: 'Il courut. La porte était fermée. Pas de sortie.' The use of the imperfect ('était') alongside the passé simple ('courut') switches between describing the fixed, unchangeable situation and the character's desperate actions. The absence of the character's name — replaced by 'il' — creates distance and vulnerability. Translation: 'He ran. The door was shut. No way out.' (The translation preserves the staccato rhythm and finality of the French rather than smoothing it into more natural English.)",
        "common_errors": [
          "Translating literary prose literally without preserving tone, rhythm or stylistic effect",
          "Analysing content (what happens) rather than technique (how the writer creates an effect)"
        ]
      }
    ]
  },
  {
    "concept_id": "LA-KS4-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knows that different levels of formality exist (e.g., tu/vous in French) but does not consistently apply the correct register, and has limited knowledge of target language cultures beyond stereotypes.",
        "example_task": "You are writing an email to a French hotel to book a room. Should you use 'tu' or 'vous'? Why?",
        "example_response": "'Vous' because it is more polite and formal, and I do not know the person. You use 'tu' with friends and family.",
        "common_errors": [
          "Using 'tu' in all contexts because it is the form most practised in class",
          "Describing target language cultures using stereotypes without any specific cultural knowledge"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Can identify and apply basic register differences in structured tasks, and can describe some cultural practices of target language communities, though understanding may be superficial.",
        "example_task": "Rewrite this informal text message as a formal letter opening. Then explain one cultural difference between the UK and a country where the target language is spoken.",
        "example_response": "Informal: 'Salut! Ça va? Je veux réserver une chambre.' Formal: 'Madame, Monsieur, Je vous écris pour réserver une chambre dans votre hôtel.' Cultural difference: In France, the school day is longer but students have Wednesday afternoons off and a two-hour lunch break. This reflects a different attitude to work-life balance.",
        "common_errors": [
          "Making only vocabulary changes when shifting register without adjusting sentence structure and tone",
          "Providing factual cultural information without explaining its significance or comparing it to UK norms"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Adapts language register fluently for different communicative contexts, and demonstrates genuine understanding of cultural diversity within target language communities, connecting cultural knowledge to language use.",
        "example_task": "Write two versions of the same message — one as a social media post to a friend, one as a formal complaint to a company — both in the target language. Then explain how cultural context would affect how this complaint is received in a francophone/hispanophone/germanophone country.",
        "example_response": "Informal: 'Franchement, leur service est nul! J'ai attendu une heure et personne n'est venu. Trop énervé!' Formal: 'Je me permets de vous écrire afin de porter à votre attention un incident survenu le 15 mars. Malgré ma réservation confirmée, j'ai dû attendre une heure sans qu'aucun membre du personnel ne se présente. Je souhaiterais recevoir une explication et, le cas échéant, un dédommagement approprié.' In France, formal complaints tend to follow highly codified structures with specific opening and closing formulas. The register shift is more dramatic than in English — informal French can be very direct while formal French uses considerably more hedging and indirectness.",
        "common_errors": [
          "Producing two versions that are similar in register rather than showing genuine contrast",
          "Describing cultural differences without connecting them to how language is used differently"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Demonstrates sophisticated intercultural awareness, recognising cultural assumptions and perspectives within texts, critically evaluating representations of target language cultures, and adapting communicative behaviour to cultural context.",
        "example_task": "Read this text about attitudes to immigration in a target language country. Analyse how the language used reflects cultural attitudes. Then evaluate whether the text presents a balanced view of the issue.",
        "example_response": "The text uses 'accueil' (welcome) and 'solidarité' (solidarity) when presenting the pro-immigration perspective, evoking France's republican values. However, the opposing view is introduced with 'certains craignent' (some fear), using an emotional rather than rational framing that subtly undermines it. The text is not balanced: it presents immigration as fundamentally positive, reflecting the editorial stance of this centre-left publication. This contrasts with coverage in more conservative publications which foreground economic and security concerns. Understanding this requires knowing the French media landscape and the political spectrum, not just the vocabulary.",
        "common_errors": [
          "Accepting the text at face value without analysing the cultural assumptions embedded in its language choices",
          "Treating target language communities as culturally homogeneous rather than recognising diversity of perspectives within them"
        ]
      }
    ]
  },
  {
    "concept_id": "LA-KS4-C006",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can understand isolated words and short phrases in slowly and clearly spoken target language, but struggles to follow connected speech at natural speed and relies on visual cues or repetition.",
        "example_task": "Listen to a short recording of a native speaker describing their daily routine (spoken at near-natural speed). Identify three activities mentioned.",
        "example_response": "I heard 'école' (school), 'manger' (eat), and 'dormir' (sleep). (Can pick out familiar vocabulary but misses linking information and detail.)",
        "common_errors": [
          "Understanding only isolated high-frequency words without grasping how they connect in sentences",
          "Confusing words that sound similar in connected speech (e.g., 'j'ai' and 'je')"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Can follow the gist of spoken passages on familiar topics and extract specific factual information, but struggles with inferential listening and unfamiliar accents or fast speech.",
        "example_task": "Listen to a radio advertisement in the target language. Answer: a) What product is being advertised? b) What special offer is mentioned? c) When does the offer end?",
        "example_response": "a) A new phone. b) 50% off for students. c) The offer ends on the 31st of December. (Can extract explicit factual information but may miss implied messages about target audience.)",
        "common_errors": [
          "Hearing a number correctly but misidentifying what it refers to (e.g., confusing a price with a date)",
          "Missing negatives in spoken language because 'ne' is often dropped in informal speech"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Comprehends extended spoken texts at near-natural speed, identifying main points, specific details, opinions and attitudes, and making justified inferences about implied meaning from tone and context.",
        "example_task": "Listen to an interview in the target language where a young person discusses their experience of volunteering abroad. a) Why did they choose to volunteer? b) What challenges did they face? c) What is their overall attitude — and how do you know?",
        "example_response": "a) They wanted to improve their language skills and do something useful during their gap year. b) They found the living conditions difficult at first and felt homesick, especially when they couldn't communicate well with local people. c) Their overall attitude is very positive — they say 'c'était la meilleure expérience de ma vie' and their tone becomes enthusiastic when describing the friendships they made. However, they are honest about the difficulties, which makes the positive conclusion more convincing.",
        "common_errors": [
          "Identifying that the speaker is positive but not providing specific evidence from what was said or how it was said",
          "Missing the significance of hedging or qualifying language that modifies a speaker's stated opinion"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Processes complex authentic spoken language including varied accents and registers, discriminating between similar sounds, identifying irony and nuance, and evaluating the reliability and perspective of speakers.",
        "example_task": "Listen to a debate in the target language between two speakers with different regional accents discussing whether university should be free. Summarise each speaker's argument and evaluate whose argument is more convincing, with evidence.",
        "example_response": "Speaker 1 (from southern France, slower delivery) argues that free university increases social mobility and cites the Finnish model as evidence. Speaker 2 (Parisian accent, faster, more emphatic) counters that free tuition reduces funding quality and benefits wealthy students who would attend anyway. Speaker 2's argument is stronger because it addresses the counterargument directly and uses specific data (mentioning that 60% of university students in France come from middle-class backgrounds despite free tuition). However, Speaker 1's point about social mobility has moral force even if the evidence presented is less specific. The Parisian speaker's dismissive tone ('c'est naïf de croire que...') may alienate listeners who agree with the principle even if the data is mixed.",
        "common_errors": [
          "Summarising the topic of debate without distinguishing each speaker's specific argument and evidence",
          "Not accounting for how delivery style (tone, emphasis, pace) affects the persuasiveness of an argument beyond its content"
        ]
      }
    ]
  },
  {
    "concept_id": "LA-KS4-C007",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can write short sentences in the target language on familiar topics but with frequent grammatical errors, limited vocabulary and no awareness of text type conventions or register.",
        "example_task": "Write 4-5 sentences in the target language about your favourite hobby.",
        "example_response": "J'aime le football. Je joue le football le samedi. Mon équipe est bon. Le football est amusant. J'aime aussi le tennis. (Basic vocabulary, repetitive structure, errors: 'bon' should be 'bonne' to agree with 'équipe', 'joue le football' should be 'joue au football'.)",
        "common_errors": [
          "Writing a series of disconnected simple sentences without any connectives or text cohesion",
          "Not attempting to use any tense other than the present, even when the topic invites past or future reference"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Can write short paragraphs using connectives and more than one tense, but with inconsistent accuracy, limited vocabulary range, and difficulty adapting style for different text types.",
        "example_task": "Write a response to this GCSE task (90 words): Describe your town. Include what there is to do, your opinion, and what you would change.",
        "example_response": "J'habite à Manchester, une grande ville dans le nord de l'Angleterre. Il y a beaucoup de magasins et de restaurants. J'aime ma ville parce qu'il y a toujours quelque chose à faire, mais je n'aime pas le trafic et la pollution. Si je pouvais changer quelque chose, je voudrais plus d'espaces verts parce que les parcs sont importants pour la santé. Le week-end dernier je suis allé au centre-ville avec mes amis.",
        "common_errors": [
          "Including three tenses but not integrating them naturally — often the past tense sentence feels 'bolted on'",
          "Using a limited range of opinion phrases (always 'j'aime' / 'je n'aime pas') rather than varied expressions"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Produces well-structured extended writing (130-150 words) with grammatical accuracy, varied vocabulary, appropriate register and effective use of multiple tenses, adapting style for different text types.",
        "example_task": "Write a response to this GCSE task (130-150 words): Write an article for a French/Spanish/German magazine about healthy living. Include what you do to stay healthy, what young people should do, and whether you think schools do enough.",
        "example_response": "Pour rester en forme, je fais du sport trois fois par semaine et j'essaie de manger équilibré. L'année dernière, j'ai décidé d'arrêter de manger trop de sucreries, ce qui a vraiment amélioré mon énergie. Cependant, beaucoup de jeunes ne font pas assez d'exercice parce qu'ils passent trop de temps devant les écrans. Il faudrait que les adolescents comprennent l'importance d'un mode de vie sain. En ce qui concerne les écoles, je pense qu'elles pourraient faire davantage: par exemple, offrir des repas plus sains à la cantine et organiser plus d'activités sportives. Si j'étais directeur, j'ajouterais une heure de sport supplémentaire chaque semaine, car les études montrent que l'exercice améliore aussi la concentration en classe.",
        "common_errors": [
          "Writing accurately but without sufficient development of ideas — meeting the word count but with thin content",
          "Not adapting the style to the text type (e.g., writing an article in the same style as a personal email)"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Produces sophisticated extended writing and accurate translations between English and the target language, demonstrating consistent grammatical control over complex structures, nuanced vocabulary and effective register management across different text types.",
        "example_task": "Translate into the target language: 'If the government invested more in public transport, fewer people would drive to work. However, it must be recognised that some rural communities have no alternative to the car. A balanced approach would involve improving both public transport and electric vehicle infrastructure.'",
        "example_response": "'Si le gouvernement investissait davantage dans les transports en commun, moins de personnes prendraient la voiture pour aller au travail. Cependant, il faut reconnaître que certaines communautés rurales n'ont pas d'alternative à la voiture. Une approche équilibrée consisterait à améliorer à la fois les transports publics et l'infrastructure des véhicules électriques.'",
        "common_errors": [
          "Translating 'fewer people would drive' word-for-word rather than finding an idiomatic target language equivalent",
          "Losing the formal, impersonal register of the English (e.g., 'it must be recognised') by translating into informal constructions"
        ]
      }
    ]
  }
]
