[
  {
    "concept_id": "LA-KS2-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Listening to and repeating individual sounds and words in the target language, beginning to notice sounds that differ from English.",
        "example_task": "Listen to these French words and repeat them: bonjour, merci, croissant. Can you hear any sounds that are different from English?",
        "example_response": "Bonjour, merci, croissant. The 'r' in French sounds different from English — it comes from the back of the throat. The 'on' in bonjour sounds nasal, like you're saying it through your nose.",
        "common_errors": [
          "Pronouncing target language words with English sounds (e.g. hard English 'r' in French)",
          "Not noticing sound differences between the languages"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Producing the key sounds of the target language with increasing accuracy, including sounds that do not exist in English.",
        "example_task": "Say these French words with the correct French 'r' and nasal sounds: rouge, chanson, enfant, grenouille.",
        "example_response": "Rouge — the 'r' is from the throat and the 'ou' is a round lip sound. Chanson — 'an' and 'on' are both nasal. Enfant — 'en' and 'an' are different nasal vowels. Grenouille — throat 'r', nasal 'en', and 'ouille' all together.",
        "common_errors": [
          "Reverting to English pronunciation under pressure",
          "Confusing similar sounds in the target language (e.g. different French nasal vowels)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Speaking with generally accurate pronunciation, appropriate intonation for questions and statements, and beginning to read aloud with correct sound-spelling links.",
        "example_task": "Read this French sentence aloud with correct pronunciation: 'Est-ce que tu aimes les animaux?' Then say it as a question.",
        "example_response": "Est-ce que tu aimes les animaux? I raised my voice at the end to make it a question. I pronounced 'aimes' without the 's' sound and 'animaux' with the nasal 'an' and silent 'x'.",
        "common_errors": [
          "Pronouncing silent letters at the end of French words",
          "Using English intonation patterns instead of target language patterns"
        ]
      }
    ]
  },
  {
    "concept_id": "LA-KS2-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Learning and recalling a small set of vocabulary items (colours, numbers, animals, greetings) through repetition and games.",
        "example_task": "Match these French words to the correct pictures: chat, chien, poisson, oiseau.",
        "example_response": "Chat is cat, chien is dog, poisson is fish, oiseau is bird.",
        "common_errors": [
          "Confusing similar-sounding words (e.g. poisson/poison)",
          "Recalling words only when prompted but not producing them independently"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using learned vocabulary in simple spoken and written sentences, beginning to apply vocabulary in new contexts beyond the original learning situation.",
        "example_task": "You have learned the words for colours and animals. Describe an animal using both: 'un chat noir' (a black cat).",
        "example_response": "Un chien blanc — a white dog. Un poisson rouge — a red fish. Un oiseau bleu — a blue bird. I put the colour after the animal because in French, adjectives usually come after the noun.",
        "common_errors": [
          "Placing the adjective before the noun as in English word order",
          "Only being able to use vocabulary in the exact phrases it was taught in"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using a growing vocabulary to express personal ideas, ask and answer questions, and communicate in familiar topics with some independence.",
        "example_task": "Describe your family in French using vocabulary you have learned: names, ages, physical descriptions.",
        "example_response": "Dans ma famille, il y a quatre personnes. Ma mère s'appelle Sophie — elle a les cheveux bruns. Mon père s'appelle Thomas — il a quarante ans. Ma soeur s'appelle Emma — elle est petite. J'ai un chat noir qui s'appelle Felix.",
        "common_errors": [
          "Reverting to English when they don't know a word instead of working around it",
          "Using vocabulary items in isolation rather than building them into sentences"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using vocabulary flexibly, inferring the meaning of unfamiliar words from context, and applying word-learning strategies such as cognates and word families.",
        "example_task": "Read this French sentence: 'Le scientifique a découvert une nouvelle espèce d'insecte dans la forêt tropicale.' Work out the meaning using cognates.",
        "example_response": "Le scientifique = the scientist (looks like 'scientific'). A découvert = discovered (like 'discover'). Une nouvelle espèce = a new species (espèce is like 'species'). D'insecte = of insect (almost the same!). Dans la forêt tropicale = in the tropical forest. So: The scientist discovered a new species of insect in the tropical forest. I used cognates — words that look similar in both languages — to work it out.",
        "common_errors": [
          "Not recognising cognates because of small spelling differences",
          "Assuming every similar-looking word is a cognate (false friends exist)"
        ]
      }
    ]
  },
  {
    "concept_id": "LA-KS2-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that nouns in the target language can have a gender (masculine/feminine) and that this affects the article used.",
        "example_task": "In French, some words use 'le' (masculine) and some use 'la' (feminine). Sort these: le chat, la maison, le livre, la fleur.",
        "example_response": "Masculine (le): le chat (the cat), le livre (the book). Feminine (la): la maison (the house), la fleur (the flower). You have to learn the gender with each noun.",
        "common_errors": [
          "Assuming gender relates to biological sex (a house is not female)",
          "Forgetting to learn the article with the noun"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using correct gender articles with familiar nouns and forming simple sentences with subject-verb agreement.",
        "example_task": "Complete these French sentences with the correct article and verb form: '__ garçon ____ (manger) une pomme.' '__ fille ____ (manger) un gâteau.'",
        "example_response": "Le garçon mange une pomme. La fille mange un gâteau. The verb 'manger' is 'mange' for he/she because it is third person singular.",
        "common_errors": [
          "Using the wrong article for the gender",
          "Not conjugating the verb to match the subject"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Conjugating common verbs in the present tense, using correct gender and number agreement, and constructing sentences with appropriate word order.",
        "example_task": "Write three sentences in French about what different people in your family like to eat, using the verb 'aimer' (to like).",
        "example_response": "J'aime les fraises — I like strawberries (je + aime). Mon frère aime le chocolat — My brother likes chocolate (il + aime). Mes parents aiment la pizza — My parents like pizza (ils + aiment, plural). I changed the verb ending for each person.",
        "common_errors": [
          "Using the infinitive form instead of conjugating ('je aimer' instead of 'j'aime')",
          "Not changing the verb ending for different persons"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using grammar accurately across a range of structures, including past and future references, negative forms, and complex sentences with conjunctions.",
        "example_task": "Write a paragraph about what you did yesterday and what you will do tomorrow, using past and future constructions.",
        "example_response": "Hier, j'ai joué au football avec mes amis. Nous avons gagné le match! C'était fantastique. Demain, je vais aller à la piscine parce que j'aime nager. Je vais aussi faire mes devoirs le soir. I used 'j'ai joué' for past (passé composé), 'je vais aller' for future (futur proche), and 'parce que' to give a reason.",
        "common_errors": [
          "Mixing up past and future tense markers",
          "Forgetting the auxiliary verb in the past tense (j'ai/je suis)"
        ]
      }
    ]
  },
  {
    "concept_id": "LA-KS2-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Taking part in simple, scripted exchanges: greeting someone, saying your name, asking and answering a rehearsed question.",
        "example_task": "Practise this conversation with a partner: 'Bonjour! Comment tu t'appelles?' 'Je m'appelle [name]. Et toi?'",
        "example_response": "Bonjour! Comment tu t'appelles? Je m'appelle Sophie. Et toi? Je m'appelle Thomas. I followed the script and used the right pronunciation.",
        "common_errors": [
          "Forgetting the response when the question is asked slightly differently",
          "Speaking too quietly or without looking at the conversation partner"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Engaging in short conversations on familiar topics with some independence, asking and answering questions beyond rehearsed scripts.",
        "example_task": "Have a conversation about your hobbies. Ask your partner what they like doing and respond to their answers.",
        "example_response": "Qu'est-ce que tu aimes faire? J'aime jouer au tennis. Et toi? Moi, j'aime dessiner. Tu aimes le sport? Oui, mais je préfère la musique. I asked follow-up questions and gave my own opinions, not just repeating a script.",
        "common_errors": [
          "Only asking questions from a memorised list without responding to the answers",
          "Switching to English when they don't know a word"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Sustaining a conversation across several exchanges, adapting language to the situation, expressing opinions and giving reasons.",
        "example_task": "Your pen pal from France asks about your school. Have a conversation about subjects, teachers and what you enjoy.",
        "example_response": "J'étudie les maths, l'anglais, les sciences et le français. Ma matière préférée, c'est les sciences parce que c'est intéressant et le professeur est gentil. Je n'aime pas les maths parce que c'est difficile. On a sept leçons par jour. Et toi, quelle est ta matière préférée? I used opinion phrases, gave reasons, and asked questions back.",
        "common_errors": [
          "Giving one-word answers instead of developing responses",
          "Not using connectives to give reasons or opinions"
        ]
      }
    ]
  },
  {
    "concept_id": "LA-KS2-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Noticing basic similarities and differences between the target language and English at the word level.",
        "example_task": "These French and English words are similar: animal/animal, orange/orange, table/table. Why might they look alike?",
        "example_response": "Some words look the same because English borrowed many words from French. They come from the same original word.",
        "common_errors": [
          "Assuming all similar-looking words mean the same thing (false cognates)",
          "Not showing curiosity about why languages share words"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying patterns in how the target language works differently from English (word order, gender, verb endings) and using this awareness to avoid common errors.",
        "example_task": "In English we say 'a red car' but in French it's 'une voiture rouge' (a car red). What pattern can you see?",
        "example_response": "In French, the describing word (adjective) usually comes after the thing it describes (noun). In English, it comes before. So I need to remember to swap the order when I translate. Not all French adjectives work this way — 'grand' (big) and 'petit' (small) come before — but most do.",
        "common_errors": [
          "Trying to translate word-for-word from English without adjusting the structure",
          "Over-generalising rules without noticing exceptions"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using metalinguistic awareness to understand how languages work as systems, making connections between languages to support learning, and explaining grammatical patterns.",
        "example_task": "How does knowing about English grammar help you learn French grammar? Give a specific example.",
        "example_response": "In English, verbs change depending on the person: 'I play, she plays'. French does this much more — every person has a different ending: je joue, tu joues, il joue, nous jouons, vous jouez, ils jouent. Knowing that English already does this (just less) helps me understand why French verb endings matter. Also, knowing that English uses 'the' for all nouns helped me understand why it feels strange that French has 'le' and 'la' for different genders — English has simplified something that French still does.",
        "common_errors": [
          "Treating the target language as having no connection to English",
          "Not transferring grammatical understanding between languages"
        ]
      }
    ]
  },
  {
    "concept_id": "LA-KS2-C006",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Reading aloud familiar words and phrases in the target language, linking sounds to the written form.",
        "example_task": "Read these French words aloud: chat, maison, école, jardin. Use the pronunciation you have learned.",
        "example_response": "Chat — 'sha' (the 't' is silent). Maison — 'may-zon'. École — 'ay-kol'. Jardin — 'zhar-dan' (nasal ending).",
        "common_errors": [
          "Pronouncing words as if they were English (e.g. saying 'chat' as the English word)",
          "Sounding out every letter rather than applying target language phonics rules"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Reading and understanding short, simple texts on familiar topics, using context and known vocabulary to work out the meaning.",
        "example_task": "Read this short French text and tell me what it is about: 'Je m'appelle Marie. J'ai dix ans. J'habite à Paris. J'aime les chiens.'",
        "example_response": "It says: My name is Marie. I am ten years old. I live in Paris. I like dogs. I worked out 'j'habite' means 'I live' because 'à Paris' tells me it's about a place, and 'habite' looks a bit like 'inhabit' in English.",
        "common_errors": [
          "Trying to understand every single word instead of using context clues",
          "Panicking when they encounter an unfamiliar word"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Reading and understanding longer texts with some unfamiliar vocabulary, using reading strategies to infer meaning and extract specific information.",
        "example_task": "Read this description of a French school day and answer: What time does school start? What do they eat for lunch? What is different from your school?",
        "example_response": "School starts at 8h30 (huit heures trente). For lunch they eat in the cantine — today it is poulet avec des légumes (chicken with vegetables). It is different because they have a two-hour lunch break and school finishes at 16h30, which is later than mine. Also, they don't have school on Wednesday afternoons. I used 'poulet' (it looks like 'poultry') and 'légumes' (like 'legumes') to work out the lunch menu.",
        "common_errors": [
          "Only understanding words they have explicitly been taught, rather than inferring meaning",
          "Not using cognate strategies to decode unfamiliar vocabulary"
        ]
      }
    ]
  },
  {
    "concept_id": "LA-KS2-C007",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Writing single words and very short phrases from memory in the target language.",
        "example_task": "Write the French words for three colours and three animals from memory.",
        "example_response": "rouge, bleu, vert, chat, chien, poisson.",
        "common_errors": [
          "Spelling words using English phonics rules instead of target language rules",
          "Only being able to copy words, not write them from memory"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writing simple sentences from memory by adapting learned phrases and substituting vocabulary.",
        "example_task": "You have learned 'J'aime le football.' Write three more sentences about things you like and dislike, changing the activity.",
        "example_response": "J'aime la musique. J'aime les gâteaux. Je n'aime pas les maths. I changed the activity each time and used 'je n'aime pas' for something I dislike.",
        "common_errors": [
          "Not changing the article to match the gender of the new noun",
          "Writing sentences that only copy the model without any adaptation"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Writing short texts (a paragraph or message) in the target language, constructing sentences from memory and applying learned grammar rules.",
        "example_task": "Write a short message to a French pen pal introducing yourself: name, age, family, hobbies, a question for them.",
        "example_response": "Cher ami, je m'appelle Alex. J'ai onze ans et j'habite en Angleterre. Dans ma famille il y a ma mère, mon père et ma petite soeur. J'aime lire et jouer au tennis. Le weekend, je joue au tennis avec mon père. Qu'est-ce que tu aimes faire? À bientôt, Alex.",
        "common_errors": [
          "Writing in English and trying to translate word by word",
          "Not including a question for the pen pal, making it one-directional"
        ]
      }
    ]
  }
]
