[
  {
    "concept_id": "LA-KS3-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can form simple present tense sentences using memorised phrases and recognises that verbs change form, but cannot apply conjugation rules to new verbs independently.",
        "example_task": "Write three sentences in the target language about what you do on a typical school day, using the present tense.",
        "example_response": "Je me leve a sept heures. Je mange le petit dejeuner avec ma famille. Je vais au college a huit heures. (I get up at seven o'clock. I eat breakfast with my family. I go to school at eight o'clock.)",
        "common_errors": [
          "Using the infinitive form of the verb instead of the conjugated form (e.g., 'je manger' instead of 'je mange')",
          "Applying English word order to the target language (e.g., putting adverbs in the English position)"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Uses present, past and future tenses with regular verbs and some common irregular verbs, and understands how tense changes are signalled grammatically.",
        "example_task": "Rewrite this present tense sentence in the past tense and the future tense: 'I play football with my friends.'",
        "example_response": "Present: Je joue au football avec mes amis. Past (passe compose): J'ai joue au football avec mes amis. Future (futur proche): Je vais jouer au football avec mes amis. The past tense uses the auxiliary 'avoir' (ai) plus the past participle (joue). The near future uses 'aller' (vais) plus the infinitive (jouer).",
        "common_errors": [
          "Using the wrong auxiliary verb in the past tense (e.g., using 'etre' instead of 'avoir' for non-movement verbs)",
          "Forming the past participle incorrectly for irregular verbs"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Manipulates a range of tenses, moods and grammatical structures with confidence, applies rules to unfamiliar verbs, and understands the grammatical system as a productive rule system rather than a set of memorised forms.",
        "example_task": "Write a paragraph about your last holiday using at least three different tenses. Underline the verb in each tense and name the tense used.",
        "example_response": "L'annee derniere, je suis alle(e) en Espagne avec ma famille (passe compose — completed past action). Nous avons pris l'avion de Londres (passe compose). Il faisait tres chaud et le soleil brillait tous les jours (imparfait — ongoing past description/weather). Chaque matin, je me levais tard et je mangeais des churros au petit dejeuner (imparfait — habitual past action). Le dernier jour, j'ai achete des souvenirs pour mes amis (passe compose — single completed action). L'annee prochaine, nous irons en Italie parce que mon pere veut visiter Rome (futur simple + present tense for reason).",
        "common_errors": [
          "Using only one past tense throughout without distinguishing between completed actions (passe compose) and descriptions/habits (imparfait)",
          "Not including any future or present tense to demonstrate range"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Uses complex grammatical structures including the conditional, subjunctive (where applicable), passive voice and subordinate clauses with accuracy and flexibility, applying them to express nuanced meaning.",
        "example_task": "Write a short opinion piece (60-80 words) in the target language about whether school uniforms should be compulsory. Use at least four different grammatical structures including a conditional and a subordinate clause.",
        "example_response": "A mon avis, les uniformes scolaires devraient etre obligatoires (conditional), bien que je comprenne que certains eleves les trouvent inconfortables (subjunctive in concessive clause). Si les eleves portaient des uniformes (imperfect in si-clause), il y aurait moins de pression sociale (conditional in result clause) parce que personne ne serait juge sur ses vetements (passive construction + conditional). Cependant, il est important que chaque eleve puisse exprimer sa personnalite (subjunctive after il est important que) d'une autre maniere, par exemple a travers les activites extra-scolaires.",
        "common_errors": [
          "Avoiding complex structures and writing only simple sentences to stay safe",
          "Using the conditional without the corresponding si-clause structure (e.g., using conditional after si instead of imperfect)"
        ]
      }
    ]
  },
  {
    "concept_id": "LA-KS3-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can respond to simple, predictable questions in the target language using short memorised phrases, but struggles to initiate conversation or cope with unexpected responses.",
        "example_task": "Your partner asks: 'Comment t'appelles-tu?' and 'Quel age as-tu?' Answer both questions in the target language.",
        "example_response": "Je m'appelle Sophie. J'ai treize ans.",
        "common_errors": [
          "Responding in English rather than the target language when unsure",
          "Giving one-word answers ('Sophie', 'treize') rather than complete sentences"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Can sustain a short conversation by asking and answering questions, uses some repair strategies when communication breaks down, and shows awareness of formal register.",
        "example_task": "You are ordering food in a restaurant in France. The waiter says something you do not understand. What do you say? Then order a main course and a drink politely.",
        "example_response": "If I do not understand, I say: 'Excusez-moi, pourriez-vous repeter, s'il vous plait?' (Excuse me, could you repeat that, please?) — using the formal 'vous' because the waiter is a stranger in a professional context. To order: 'Je voudrais le poulet roti avec des frites, s'il vous plait. Et comme boisson, je prendrai une eau minerale.' (I would like the roast chicken with chips, please. And to drink, I will have a mineral water.)",
        "common_errors": [
          "Using the informal 'tu' form with the waiter instead of the formal 'vous'",
          "Switching to English when they do not understand rather than using a target language repair strategy"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Initiates and develops conversations beyond simple question-and-answer exchanges, expresses and justifies opinions, copes with unfamiliar language using inferencing and circumlocution, and speaks with accurate pronunciation and intonation.",
        "example_task": "Have a conversation about your favourite subject at school. Give your opinion, justify it with two reasons, and ask your partner for their opinion.",
        "example_response": "Ma matiere preferee, c'est les sciences parce que j'adore faire des experiences au laboratoire — c'est beaucoup plus interessant que de lire un livre. De plus, je trouve que la science est utile dans la vie quotidienne; par exemple, comprendre comment le corps fonctionne m'aide a faire de meilleurs choix pour ma sante. Cependant, je dois admettre que les controles sont parfois difficiles! Et toi, quelle est ta matiere preferee et pourquoi?",
        "common_errors": [
          "Stating an opinion without justifying it with reasons",
          "Not asking a follow-up question to keep the conversation going"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Engages in extended, nuanced discussion on abstract topics, uses a full range of communication strategies, adapts register confidently between formal and informal contexts, and speaks with near-native pronunciation and intonation.",
        "example_task": "Discuss whether technology improves or harms young people's lives. Present arguments on both sides, use at least two connectives of contrast, and conclude with your own reasoned opinion.",
        "example_response": "D'un cote, la technologie offre des avantages considerables aux jeunes: l'acces immediat a l'information facilite les etudes, les reseaux sociaux permettent de maintenir des amities malgre la distance, et les applications educatives rendent l'apprentissage plus interactif. Neanmoins, il existe des inconvenients serieux. Bien que les reseaux sociaux connectent les gens, ils peuvent aussi provoquer de l'anxiete et du harcelement. En outre, le temps passe devant les ecrans reduit l'activite physique et perturbe le sommeil. En fin de compte, je crois que la technologie est un outil — ni bon ni mauvais en soi. Ce qui compte, c'est la maniere dont on l'utilise. Si les jeunes apprennent a gerer leur temps d'ecran et a evaluer les informations de maniere critique, la technologie peut enrichir leur vie plutot que la diminuer.",
        "common_errors": [
          "Presenting only one side of the argument rather than demonstrating the ability to argue both perspectives",
          "Using only basic connectives (et, mais) rather than sophisticated discourse markers (neanmoins, en outre, en fin de compte)"
        ]
      }
    ]
  },
  {
    "concept_id": "LA-KS3-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can read and understand very short, simple texts with familiar vocabulary, but struggles with longer texts or unfamiliar words, and tends to try to translate every word.",
        "example_task": "Read this short text and answer the question in English: 'Marie habite a Paris. Elle a un chat noir qui s'appelle Felix.' Where does Marie live and what pet does she have?",
        "example_response": "Marie lives in Paris. She has a black cat called Felix.",
        "common_errors": [
          "Not recognising cognates (e.g., not realising 'habite' is related to 'inhabit')",
          "Being unable to answer if any single word in the text is unfamiliar"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Can read adapted texts of moderate length, uses contextual clues and cognate recognition to work out unfamiliar vocabulary, and distinguishes between reading for gist and reading for detail.",
        "example_task": "Read this paragraph about a school trip and answer: (a) Where did they go? (b) What was the weather like? (c) Find one word you do not know and explain how you worked out its meaning from context.",
        "example_response": "(a) They went to a château in the Loire Valley. (b) The weather was sunny but cold — 'il faisait du soleil mais il faisait froid'. (c) I did not know 'pique-niquer' but I worked it out from context: it appeared in the sentence about lunchtime ('a midi'), they were outside ('dans le jardin du chateau'), and they had food with them ('sandwichs et fruits'). The word also looks like the English 'picnic'. So 'pique-niquer' means 'to have a picnic'.",
        "common_errors": [
          "Looking up every unknown word instead of using context to infer meaning",
          "Reading for detail before establishing the overall gist of the passage"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Reads authentic and literary texts with comprehension, uses multiple reading strategies flexibly (skimming, scanning, close reading), and engages with texts as cultural artefacts rather than just language exercises.",
        "example_task": "Read this extract from a French newspaper article about climate change. Summarise the main argument in English, then translate the underlined sentence accurately.",
        "example_response": "Summary: The article argues that individual lifestyle changes (recycling, cycling) are insufficient to address climate change because the majority of emissions come from industrial and corporate sources. The author believes that systemic policy change — government regulation of industry — is more effective than placing responsibility on individual consumers. Translation of underlined sentence: 'Bien que chaque geste individuel soit important, c'est au niveau politique que les changements les plus significatifs doivent se produire.' = 'Although every individual action is important, it is at the political level that the most significant changes must occur.' The subjunctive 'soit' after 'bien que' was the grammatical challenge — it signals concession (acknowledging individual action) before the main argument (political change is more important).",
        "common_errors": [
          "Translating word-for-word rather than capturing the natural English meaning",
          "Summarising superficial content rather than identifying the author's argument and perspective"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Reads literary texts with appreciation for language, style and cultural significance, produces nuanced translations that capture tone and meaning, and uses reading as a resource for developing their own language skills.",
        "example_task": "Read this poem in the target language. Explain how the poet uses language to create a specific effect, and translate three lines in a way that captures the tone as well as the meaning.",
        "example_response": "The poet uses the repetition of the sound 'ou' (doux, toujours, amour) to create a soft, gentle sonic texture that mirrors the poem's theme of tenderness. The short lines (4-6 syllables each) create a rhythm like a heartbeat or a whisper — intimate and private. The final line breaks the pattern with a longer, 10-syllable line, creating a sense of opening out from the private world of the poem into something larger. Translation of three lines: 'Dans le silence doux / De notre chambre ancienne / Le temps s'est arrete' = 'In the gentle silence / Of our old room / Time has stopped.' I chose 'gentle' rather than 'sweet' for 'doux' because it captures the quiet, tender quality of the poem rather than a sugary sweetness. 'Our old room' rather than 'our ancient chamber' preserves the simplicity of the French while suggesting shared history.",
        "common_errors": [
          "Translating only the literal meaning without discussing how the poet uses language for effect",
          "Not justifying translation choices or explaining why one word was chosen over alternatives"
        ]
      }
    ]
  },
  {
    "concept_id": "LA-KS3-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Has a small vocabulary limited to high-frequency personal topics (family, school, food, hobbies) and relies on memorised phrases rather than generating language from vocabulary knowledge.",
        "example_task": "List five words or phrases in the target language related to the topic of 'food and drink'.",
        "example_response": "Le pain (bread), le fromage (cheese), l'eau (water), le poulet (chicken), les legumes (vegetables).",
        "common_errors": [
          "Only knowing food items taught in class rather than building vocabulary independently",
          "Not knowing the gender of nouns (le/la), which affects agreement throughout the language"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Has a growing vocabulary beyond immediate personal topics, uses word families and cognate strategies to learn new words, and begins to use opinion phrases and connectives to express more complex ideas.",
        "example_task": "Express your opinion about healthy eating using at least three opinion phrases and two connectives in the target language.",
        "example_response": "A mon avis, il est essentiel de manger sainement parce que la nourriture affecte notre sante et notre humeur. Je crois que les fruits et les legumes sont importants, cependant je pense aussi qu'il faut se faire plaisir de temps en temps. Par exemple, je trouve qu'un morceau de chocolat apres le diner n'est pas un probleme si on mange bien le reste du temps.",
        "common_errors": [
          "Using only 'je pense que' for every opinion rather than varying with 'a mon avis', 'je crois que', 'je trouve que'",
          "Using only 'et' and 'mais' as connectives rather than 'cependant', 'parce que', 'par exemple'"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Uses a wide vocabulary with precision and register awareness, distinguishes between similar words with different connotations, and deploys vocabulary for discussing abstract topics and justifying opinions.",
        "example_task": "Write about the advantages and disadvantages of social media, using vocabulary appropriate for a formal essay rather than a casual conversation.",
        "example_response": "Les reseaux sociaux presentent des avantages indeniables: ils facilitent la communication, permettent le partage d'informations et offrent des opportunites professionnelles. Neanmoins, les inconvenients sont considerables. L'utilisation excessive peut engendrer des problemes de sante mentale, notamment l'anxiete et une faible estime de soi. De surcroit, la desinformation se propage rapidement sur ces plateformes, ce qui constitue une menace pour la democratie. Il convient egalement de souligner les questions de confidentialite des donnees personnelles.",
        "common_errors": [
          "Using informal register in a formal essay context (e.g., 'c'est nul' instead of 'les inconvenients sont considerables')",
          "Using simple vocabulary ('bon' and 'mauvais') rather than precise formal alternatives ('indeniable', 'considerable')"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Commands a rich, nuanced vocabulary that enables precise expression across formal and informal registers, understands idiomatic expressions and cultural connotations, and uses vocabulary strategically to create specific effects.",
        "example_task": "Translate this English sentence into the target language in two different registers — one for a formal letter and one for a text message to a friend: 'I would be grateful if you could confirm the date of the meeting.'",
        "example_response": "Formal letter: 'Je vous serais tres reconnaissant(e) si vous pouviez confirmer la date de la reunion a votre meilleure convenance.' (Uses conditional, formal 'vous', polite formulaic language, and the closing courtesy 'a votre meilleure convenance' — at your earliest convenience.) Text message to a friend: 'Slt! Tu peux me confirmer la date de la reunion stp? Merci!' (Uses abbreviated greeting 'slt' for 'salut', informal 'tu', abbreviated 'stp' for 's'il te plait', and an exclamation mark for friendly tone.) The two versions convey the same request but the vocabulary, grammar and tone are completely different. The formal version uses the conditional mood and courteous circumlocution; the informal version uses present tense, abbreviations and directness.",
        "common_errors": [
          "Producing two versions that differ only in tu/vous rather than in overall register, vocabulary and tone",
          "Not recognising that text message language in French/Spanish/German has its own conventions and abbreviations"
        ]
      }
    ]
  },
  {
    "concept_id": "LA-KS3-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knows some basic cultural facts about countries where the target language is spoken (capital city, flag, famous landmarks) but sees culture as a set of facts rather than as inseparable from language.",
        "example_task": "Name one cultural tradition from a country where your target language is spoken and explain what happens.",
        "example_response": "In France, Bastille Day is celebrated on 14th July. There are fireworks, parades and parties across the country. It commemorates the storming of the Bastille prison in 1789, which was a key event in the French Revolution.",
        "common_errors": [
          "Describing only tourist attractions rather than cultural practices or traditions",
          "Not explaining the historical or social significance of the tradition"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Understands that language and culture are connected, recognises culturally specific features of language use (formal/informal address, social conventions), and shows curiosity about the target language community.",
        "example_task": "In French, you must choose between 'tu' and 'vous' when speaking to someone. Explain the difference and give an example of when you would use each.",
        "example_response": "'Tu' is the informal, singular 'you', used with friends, family, children and people of your own age. 'Vous' is the formal or plural 'you', used with strangers, teachers, elders, in professional settings, or when addressing multiple people. For example, I would use 'tu' with a school friend ('Tu veux jouer au foot?') but 'vous' with a teacher ('Pourriez-vous m'expliquer, s'il vous plait?'). Using 'tu' with a stranger or authority figure can be seen as disrespectful, while using 'vous' with a close friend can seem cold or distant. This distinction reflects the importance of social hierarchy and politeness in French culture.",
        "common_errors": [
          "Treating tu/vous as a simple vocabulary choice rather than a culturally significant social decision",
          "Not recognising that the rules for tu/vous vary between French-speaking countries and social contexts"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Engages with authentic cultural materials (literature, film, music, media), understands how cultural context shapes language use and meaning, and reflects on their own culture by comparison.",
        "example_task": "You have watched a French film set in a banlieue (suburb). How does the film help you understand aspects of French society that a textbook would not cover?",
        "example_response": "The film shows a side of France very different from the Paris of textbooks: the high-rise housing estates on the outskirts of cities where many immigrant families live. The characters use verlan (a form of slang where syllables are reversed — 'meuf' for 'femme', 'relou' for 'lourd'), which the textbook does not teach but which reveals a living, evolving language community. The film addresses issues of social exclusion, police relations with ethnic minority communities, and the tension between French republican ideals of equality and the reality of discrimination. Watching the film made me realise that 'French culture' is not a single thing — it is diverse, contested and shaped by immigration, class and geography, just like British culture. The language used in the film reflects social identity: the characters' slang marks them as belonging to a specific community, just as regional accents and slang do in English.",
        "common_errors": [
          "Treating the film as merely a listening exercise rather than a cultural text that reveals social realities",
          "Generalising about 'French people' from a single film rather than recognising the diversity within the culture"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Critically examines how language encodes cultural values and power structures, understands intercultural competence as a skill distinct from cultural knowledge, and engages with target language communities as a reflective participant rather than a tourist observer.",
        "example_task": "The word 'Schadenfreude' in German has no direct English equivalent. What does the existence of culture-specific words tell us about the relationship between language and thought?",
        "example_response": "Schadenfreude — pleasure derived from another person's misfortune — exists as a single word in German but requires a multi-word explanation in English. This illustrates the Sapir-Whorf hypothesis: that language shapes (or at least reflects) how a culture perceives and categorises experience. The existence of a single, commonly used word suggests that German culture has identified this emotion as a distinct, recognisable experience worth naming — not that Germans experience it more, but that the culture has made it lexically available for discussion. Every language has such untranslatable words: the Portuguese 'saudade' (a deep emotional longing for something absent), the Japanese 'wabi-sabi' (beauty in imperfection), the Danish 'hygge' (cosy togetherness). These words reveal what each culture pays attention to, values or recognises as significant. This has practical implications for language learners: truly understanding a language requires understanding the cultural concepts behind its vocabulary, not just translating word-for-word. When I learn a new word that has no English equivalent, I am not just adding vocabulary — I am gaining access to a way of seeing the world that my own language does not provide.",
        "common_errors": [
          "Treating untranslatable words as curiosities rather than as evidence of how language and culture interact",
          "Claiming that the existence of a word means the culture 'invented' the concept, rather than that they named it"
        ]
      }
    ]
  },
  {
    "concept_id": "LA-KS3-C006",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can write isolated sentences in the target language using memorised phrases, but writing lacks structure and contains frequent basic errors in spelling, agreement and word order.",
        "example_task": "Write three sentences about your family in the target language.",
        "example_response": "J'ai une soeur qui s'appelle Emma. Mon pere travaille dans un bureau. Ma mere est tres gentille.",
        "common_errors": [
          "Writing in English word order rather than target language word order",
          "Misspelling common words or forgetting accents that change meaning"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writes connected sentences using connectives, uses more than one tense in a single piece of writing, and shows growing accuracy in agreement, spelling and punctuation.",
        "example_task": "Write a paragraph (40-50 words) about what you did last weekend. Use the past tense and at least two connectives.",
        "example_response": "Le week-end dernier, je suis alle(e) au cinema avec mes amis parce qu'il y avait un nouveau film d'action. Apres le film, nous avons mange une pizza dans un restaurant italien. C'etait delicieux! Ensuite, je suis rentre(e) chez moi et j'ai fait mes devoirs.",
        "common_errors": [
          "Using only the present tense throughout, not demonstrating past tense control",
          "Writing a list of disconnected sentences without using connectives to link them"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Writes extended prose across multiple genres with a range of tenses and structures, translates short passages accurately, and uses a self-editing process to check accuracy.",
        "example_task": "Translate this passage into the target language: 'Last summer, I visited my grandmother who lives in the countryside. Although it rained every day, I had a wonderful time because she taught me how to cook.'",
        "example_response": "L'ete dernier, j'ai rendu visite a ma grand-mere qui habite a la campagne. Bien qu'il ait plu tous les jours, j'ai passe un moment merveilleux parce qu'elle m'a appris a cuisiner. (Self-editing check: 'ait plu' uses the subjunctive after 'bien que' — correct. 'a rendu visite a' — correct phrase for visiting a person, not 'a visite' which is for places. Agreement of 'dernier' with 'ete' — masculine, correct.)",
        "common_errors": [
          "Translating 'visited my grandmother' as 'j'ai visite ma grand-mere' (visite is for places, not people)",
          "Using the indicative after 'bien que' instead of the subjunctive"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Writes with sophistication, accuracy and stylistic awareness across different registers and genres, produces translations that capture meaning and tone rather than literal word substitution, and uses writing as a tool for creative and analytical expression.",
        "example_task": "Write a formal letter (80-100 words) in the target language to a hotel manager, complaining about your stay. Use appropriate formal register and at least three complex grammatical structures.",
        "example_response": "Monsieur le Directeur,\n\nJe me permets de vous ecrire afin de vous faire part de mon mecontentement concernant mon sejour dans votre etablissement du 15 au 18 janvier. Non seulement la chambre n'avait pas ete nettoyee a notre arrivee, mais de plus le chauffage ne fonctionnait pas, ce qui a rendu notre sejour extremement desagreable. Bien que j'aie signale ces problemes a la reception, aucune solution n'a ete proposee. Je souhaiterais recevoir un remboursement partiel en compensation de ces desagrements. Dans l'attente de votre reponse, je vous prie d'agreer, Monsieur le Directeur, l'expression de mes salutations distinguees.",
        "common_errors": [
          "Using informal register in a formal letter (e.g., beginning with 'Bonjour' rather than 'Monsieur le Directeur')",
          "Not using the conventional French formal letter closing formula ('je vous prie d'agreer...')"
        ]
      }
    ]
  }
]