[
  {"concept_id":"MA-KS4-C030","levels":[{"level_number":1,"label":"emerging","description":"Understands the difference between a population and a sample, and can identify potential sources of bias in data collection.","example_task":"A school wants to find out students' favourite lunch option. They survey 30 students from the football team. Explain why this sample may be biased.","example_response":"The football team may not be representative of the whole school — they might prefer higher-calorie meals. A better sample would be a random selection from all year groups.","common_errors":["Not explaining why the sample is unrepresentative","Thinking a larger sample automatically removes bias"]},{"level_number":2,"label":"developing","description":"Selects and applies appropriate sampling methods (random, systematic, stratified) and designs data collection tools including questionnaires.","example_task":"A school has 600 students: 200 in Year 7, 180 in Year 8, 120 in Year 9, 100 in Year 10. A stratified sample of 50 is needed. How many from each year?","example_response":"Year 7: (200/600) x 50 = 16.7, round to 17. Year 8: (180/600) x 50 = 15. Year 9: (120/600) x 50 = 10. Year 10: (100/600) x 50 = 8.3, round to 8. Total: 17 + 15 + 10 + 8 = 50.","common_errors":["Dividing 50 equally between four groups (12 or 13 each)","Not using the population proportions to calculate stratum sizes"]},{"level_number":3,"label":"secure","description":"Evaluates sampling methods, identifies limitations of data collection, and designs strategies to minimise bias and improve validity.","example_task":"A researcher wants to find out how much time teenagers spend on social media. Compare using an online survey versus face-to-face interviews. Which is better?","example_response":"Online survey: larger sample, cheaper, but self-selection bias (only those online will respond, and they may use social media more). Respondents may also exaggerate or underestimate. Face-to-face: more accurate responses (can clarify questions), but smaller sample, more expensive, and social desirability bias (respondents may understate usage). A better approach might be combining a stratified random online survey with follow-up interviews for a subsample.","common_errors":["Not identifying specific types of bias for each method","Concluding one method is universally better without considering trade-offs"]},{"level_number":4,"label":"mastery","description":"Designs complete statistical investigations with appropriate hypotheses, sampling strategies, and evaluates the reliability and validity of conclusions drawn from data.","example_task":"Design a statistical investigation to test whether students who eat breakfast perform better in morning tests. Include hypothesis, sampling, data collection and potential confounders.","example_response":"Hypothesis: Students who eat breakfast score higher on morning tests than those who do not. Sampling: Stratified random sample across year groups, aiming for 100+ students to ensure adequate power. Data collection: Anonymous questionnaire on breakfast habits (eaten/not eaten, type), plus morning test scores from school records. Confounders: sleep quality, prior attainment, socioeconomic status (linked to both breakfast and attainment). These should be recorded and controlled for in analysis. Limitation: This is observational, not experimental — correlation does not imply causation. Students who eat breakfast may also have other advantages.","common_errors":["Not identifying confounding variables","Claiming a causal relationship from observational data"]}]},
  {"concept_id":"MA-KS4-C031","levels":[{"level_number":1,"label":"emerging","description":"Constructs and interprets bar charts, pie charts and pictograms accurately, including reading scales and comparing categories.","example_task":"A pie chart shows exam results: A* = 36 degrees, A = 72 degrees, B = 108 degrees, C = 90 degrees, D = 54 degrees. There are 200 students. How many got a B?","example_response":"B sector = 108 degrees. Fraction = 108/360 = 3/10. Number of students = 3/10 x 200 = 60.","common_errors":["Not dividing by 360 (computing 108/200 instead)","Reading the angle incorrectly from the chart"]},{"level_number":2,"label":"developing","description":"Constructs and interprets frequency polygons, cumulative frequency graphs (plotting at upper class boundaries), and reads quartiles from cumulative frequency.","example_task":"Draw a cumulative frequency graph from: 0-10 (freq 4), 10-20 (freq 12), 20-30 (freq 18), 30-40 (freq 6). Estimate the median.","example_response":"Cumulative frequencies: 4, 16, 34, 40. Plot at upper boundaries: (10, 4), (20, 16), (30, 34), (40, 40). Total = 40, so median at 20th value. Reading from the graph: approximately 23.","common_errors":["Plotting at midpoints instead of upper class boundaries","Finding the median by looking at frequency 20 on the x-axis instead of the y-axis"]},{"level_number":3,"label":"secure","description":"Constructs and interprets histograms with unequal class widths using frequency density, and compares distributions using box plots.","example_task":"A histogram has these bars: class 0-5 with frequency density 2, class 5-15 with frequency density 3.5, class 15-20 with frequency density 4. Find the frequency for each class.","example_response":"Frequency = frequency density x class width. Class 0-5: 2 x 5 = 10. Class 5-15: 3.5 x 10 = 35. Class 15-20: 4 x 5 = 20. Total = 65.","common_errors":["Using the height as the frequency (reading 2, 3.5, 4 as the frequencies)","Not computing class width correctly for unequal intervals"]},{"level_number":4,"label":"mastery","description":"Interprets and compares complex statistical diagrams critically, including population pyramids, misleading graphs, and composite representations. Constructs histograms from raw grouped data and uses area to estimate probabilities.","example_task":"A histogram shows journey times. The class 10-20 has frequency density 3.2 and the class 20-25 has frequency density 4.0. Estimate the probability that a randomly chosen journey takes between 15 and 25 minutes.","example_response":"Area for 15-20 (half of the 10-20 bar): 3.2 x 5 = 16. Area for 20-25: 4.0 x 5 = 20. Estimated frequency for 15-25: 16 + 20 = 36. Need total frequency (sum of all bar areas) to compute probability. If total = 120, then P(15 to 25) = 36/120 = 0.3. The key insight is that area represents frequency in a histogram, so we can estimate probabilities from areas.","common_errors":["Using height instead of area to estimate frequency from a histogram","Not recognising that the area of a bar (not its height) represents the frequency"]}]},
  {"concept_id":"MA-KS4-C032","levels":[{"level_number":1,"label":"emerging","description":"Calculates mean, median, mode and range for small ungrouped data sets and knows which average each one represents.","example_task":"Find the mean, median and mode of: 3, 5, 5, 6, 8, 9, 12.","example_response":"Mean = (3+5+5+6+8+9+12)/7 = 48/7 = 6.86 (2 d.p.). Median = 6 (middle of 7 ordered values). Mode = 5 (appears twice).","common_errors":["Not ordering the data before finding the median","Confusing the position of the median (finding the 3.5th value of 7 items instead of the 4th)"]},{"level_number":2,"label":"developing","description":"Calculates the mean from a frequency table using sum of fx / sum of f, and chooses the most appropriate average for a given data set.","example_task":"Find the mean from: Score 1 (freq 5), Score 2 (freq 8), Score 3 (freq 12), Score 4 (freq 3), Score 5 (freq 2).","example_response":"Sum of fx = 1(5) + 2(8) + 3(12) + 4(3) + 5(2) = 5 + 16 + 36 + 12 + 10 = 79. Sum of f = 30. Mean = 79/30 = 2.63 (2 d.p.).","common_errors":["Dividing by the number of different scores (5) instead of the total frequency (30)","Not multiplying score by frequency before summing"]},{"level_number":3,"label":"secure","description":"Estimates the mean from a grouped frequency table using midpoints, finds the modal class, and estimates the median class. Understands why these are estimates.","example_task":"Estimate the mean from: 0 < x <= 10 (freq 6), 10 < x <= 20 (freq 14), 20 < x <= 30 (freq 8), 30 < x <= 50 (freq 2).","example_response":"Midpoints: 5, 15, 25, 40. Sum of fm = 6(5) + 14(15) + 8(25) + 2(40) = 30 + 210 + 200 + 80 = 520. Sum of f = 30. Estimated mean = 520/30 = 17.3 (1 d.p.). This is an estimate because we assume all values in each class equal the midpoint.","common_errors":["Using lower or upper bounds instead of midpoints","Not finding the correct midpoint for the unequal class width 30-50 (midpoint is 40, not 35)"]},{"level_number":4,"label":"mastery","description":"Uses cumulative frequency to estimate quartiles, interquartile range and percentiles. Compares distributions using summary statistics and evaluates which measures are most appropriate.","example_task":"Two factories produce bolts. Factory A: mean diameter 10.02 mm, IQR 0.03 mm. Factory B: mean diameter 10.00 mm, IQR 0.12 mm. The target is 10.00 mm. Which factory is more reliable?","example_response":"Factory B has the mean closer to target (10.00 vs 10.02) but much larger variability (IQR 0.12 vs 0.03). Factory A is slightly off-target but very consistent — most bolts are within 0.03 mm of each other. Factory B is centred correctly but produces bolts with wide variation — some could be far from target. Factory A is more reliable for quality control because consistency matters more than being exactly centred (which can be recalibrated). The small systematic error in A is preferable to the large random error in B.","common_errors":["Only comparing means without considering spread","Not interpreting IQR in context — just stating 'Factory A has smaller IQR' without explaining the practical implication"]}]},
  {"concept_id":"MA-KS4-C033","levels":[{"level_number":1,"label":"emerging","description":"Plots scatter graphs from paired data and describes the overall trend informally (going up, going down, no pattern).","example_task":"Plot these points on a scatter graph: (150, 45), (155, 50), (160, 55), (165, 52), (170, 60), (175, 58), (180, 65). Describe the trend.","example_response":"The points show an upward trend: as height increases, weight tends to increase. The relationship is not perfect — not all points lie on a straight line.","common_errors":["Joining the dots with a line (scatter graphs show individual points, not connected lines)","Not using appropriate scales on both axes"]},{"level_number":2,"label":"developing","description":"Identifies and describes the type and strength of correlation (strong/weak positive, strong/weak negative, none) and draws a line of best fit by eye.","example_task":"A scatter graph shows that as the age of a car increases, its value decreases. There is a clear downward trend with points close to a line. Describe the correlation.","example_response":"There is a strong negative correlation: as the age of the car increases, its value tends to decrease. A line of best fit would slope downward. The strong correlation means the points are close to the line, so age is a good predictor of value.","common_errors":["Describing the correlation as 'negative' without commenting on strength","Drawing the line of best fit through two extreme points instead of balancing it through the middle of the data"]},{"level_number":3,"label":"secure","description":"Uses a line of best fit to make predictions, distinguishing between interpolation (reliable, within data range) and extrapolation (unreliable, outside data range).","example_task":"A line of best fit for height (cm) vs shoe size has equation y = 0.1x - 7, valid for heights 150-190 cm. Estimate the shoe size for (a) height 170 cm, (b) height 210 cm.","example_response":"(a) y = 0.1(170) - 7 = 17 - 7 = size 10. This is interpolation (170 is within the data range 150-190) so the estimate is reliable. (b) y = 0.1(210) - 7 = 21 - 7 = size 14. This is extrapolation (210 is outside the data range) so the estimate is unreliable — the linear relationship may not hold for very tall people.","common_errors":["Treating extrapolated predictions as equally reliable to interpolated ones","Not checking whether the prediction value falls within or outside the data range"]},{"level_number":4,"label":"mastery","description":"Critically evaluates bivariate data, distinguishes correlation from causation, identifies lurking variables, and interprets the equation and gradient of a line of best fit in context.","example_task":"A study finds a strong positive correlation between ice cream sales and drowning incidents. A newspaper headline says 'Ice cream causes drowning'. Evaluate this claim.","example_response":"The claim is false — it confuses correlation with causation. The lurking (confounding) variable is temperature/season: hot weather causes both increased ice cream sales and increased swimming (leading to more drowning incidents). The two variables are associated because they share a common cause, not because one causes the other. To establish causation, you would need a controlled experiment (impossible here for ethical reasons). This is a classic example of a spurious correlation driven by a confounding variable.","common_errors":["Accepting the causal claim because the correlation is strong","Not identifying the confounding variable (temperature/weather)"]}]}
]
