[
  {"concept_id":"MA-KS3-C058","levels":[{"level_number":1,"label":"emerging","description":"Knows the area formula for rectangles and can apply it to find areas of simple shapes.","example_task":"Find the area of a rectangle with length 8 cm and width 5 cm.","example_response":"Area = 8 × 5 = 40 cm².","common_errors":["Computing the perimeter (26 cm) instead of the area","Forgetting to include the squared unit (cm²)"]},{"level_number":2,"label":"developing","description":"Calculates areas of triangles, parallelograms and trapezia using the correct formulae.","example_task":"Find the area of a triangle with base 12 cm and perpendicular height 7 cm.","example_response":"Area = ½ × base × height = ½ × 12 × 7 = 42 cm².","common_errors":["Forgetting to halve (getting 84 cm²)","Using the slant height instead of the perpendicular height"]},{"level_number":3,"label":"secure","description":"Derives area formulae from first principles and applies them to composite shapes by decomposition.","example_task":"Find the area of an L-shaped room: the main section is 8m × 5m and the extension is 3m × 4m.","example_response":"Main section: 8 × 5 = 40 m². Extension: 3 × 4 = 12 m². Total: 40 + 12 = 52 m².","common_errors":["Double-counting the overlapping region if the shapes overlap","Not drawing the decomposition to check all parts are covered"]},{"level_number":4,"label":"mastery","description":"Finds areas of complex composite shapes and uses area relationships to solve algebraic problems.","example_task":"A trapezium has parallel sides of length a and b, and height h. Show that its area is ½(a + b)h.","example_response":"Draw a diagonal to split the trapezium into two triangles. Triangle 1 has base a and height h: area = ½ah. Triangle 2 has base b and height h: area = ½bh. Total = ½ah + ½bh = ½h(a + b) = ½(a + b)h.","common_errors":["Not identifying that both triangles share the same perpendicular height","Placing the diagonal incorrectly so the triangles do not cover the whole trapezium"]}]},
  {"concept_id":"MA-KS3-C059","levels":[{"level_number":1,"label":"emerging","description":"Can calculate the volume of a cuboid by multiplying length × width × height.","example_task":"Find the volume of a box 5 cm long, 3 cm wide and 4 cm tall.","example_response":"Volume = 5 × 3 × 4 = 60 cm³.","common_errors":["Computing surface area instead of volume","Forgetting the cubed unit (cm³)"]},{"level_number":2,"label":"developing","description":"Calculates volumes of prisms using the general formula: volume = cross-sectional area × length.","example_task":"A triangular prism has a cross-section that is a right triangle with legs 6 cm and 8 cm. The prism is 10 cm long. Find its volume.","example_response":"Cross-section area = ½ × 6 × 8 = 24 cm². Volume = 24 × 10 = 240 cm³.","common_errors":["Not calculating the cross-sectional area correctly","Confusing length with height of the cross-section"]},{"level_number":3,"label":"secure","description":"Calculates volumes of cylinders and composite prisms, and solves problems requiring rearrangement of the volume formula.","example_task":"A cylinder has radius 5 cm and volume 500π cm³. Find its height.","example_response":"V = πr²h. 500π = π(25)h. h = 500/25 = 20 cm.","common_errors":["Forgetting to square the radius (using 5 instead of 25)","Not cancelling π from both sides"]},{"level_number":4,"label":"mastery","description":"Solves complex volume problems including unit conversions (cm³ to litres), optimisation, and comparing volumes of different shapes.","example_task":"A cylinder and a cone both have radius 6 cm and height 10 cm. How many times could you fill the cone and empty it into the cylinder?","example_response":"Cylinder volume = π(36)(10) = 360π cm³. Cone volume = ⅓π(36)(10) = 120π cm³. Number of fills = 360π/120π = 3. You can fill the cone exactly 3 times. This illustrates the general result: a cone's volume is always ⅓ of the cylinder with the same base and height.","common_errors":["Not knowing the cone volume formula (⅓πr²h)","Forgetting the ⅓ factor"]}]},
  {"concept_id":"MA-KS3-C060","levels":[{"level_number":1,"label":"emerging","description":"Knows that the circumference of a circle relates to its diameter through π, and can state C = πd.","example_task":"Find the circumference of a circle with diameter 10 cm. Use π = 3.14.","example_response":"C = πd = 3.14 × 10 = 31.4 cm.","common_errors":["Using the radius instead of the diameter (or vice versa)","Not knowing whether to multiply or divide by π"]},{"level_number":2,"label":"developing","description":"Calculates circumference and area of circles using C = 2πr and A = πr².","example_task":"Find the area of a circle with radius 7 cm. Give your answer in terms of π.","example_response":"A = πr² = π(7²) = 49π cm².","common_errors":["Computing 2π(7) = 14π (circumference instead of area)","Squaring both r and π"]},{"level_number":3,"label":"secure","description":"Calculates perimeters and areas of composite shapes involving circles, semicircles and quarter circles.","example_task":"Find the perimeter of a semicircle with diameter 12 cm.","example_response":"Curved part = ½ × π × 12 = 6π cm. Straight edge = 12 cm. Perimeter = 6π + 12 = 6π + 12 ≈ 30.85 cm.","common_errors":["Forgetting to add the straight diameter edge","Computing the full circumference instead of half"]},{"level_number":4,"label":"mastery","description":"Solves problems involving sectors, segments and rings, and uses circle measurements in applied contexts.","example_task":"A sector of a circle has radius 8 cm and angle 135°. Find its area and arc length.","example_response":"Fraction of circle = 135/360 = 3/8. Arc length = 3/8 × 2π(8) = 3/8 × 16π = 6π cm. Area = 3/8 × π(64) = 24π cm².","common_errors":["Not computing the fraction of the circle correctly","Using the area formula for arc length or vice versa"]}]},
  {"concept_id":"MA-KS3-C061","levels":[{"level_number":1,"label":"emerging","description":"Can measure line segments with a ruler to the nearest mm and angles with a protractor to the nearest degree.","example_task":"Measure the length of this line segment and the angle shown.","example_response":"The line is 7.3 cm. The angle is 52°.","common_errors":["Not aligning the ruler with the start of the line","Reading the wrong scale on the protractor (inner vs outer)"]},{"level_number":2,"label":"developing","description":"Draws line segments and angles accurately, and constructs simple scale drawings.","example_task":"Draw an angle of 115° accurately using a protractor.","example_response":"I draw a base line, place the protractor centre at the vertex, mark 115° on the outer scale, and draw the second arm through the mark.","common_errors":["Drawing 65° instead of 115° (reading from the wrong scale)","Not placing the protractor centre exactly at the vertex"]},{"level_number":3,"label":"secure","description":"Creates accurate scale drawings and uses them to solve measurement problems, including bearings and navigation.","example_task":"Draw a scale diagram of a field that is 80m by 50m using a scale of 1 cm : 10 m. Include a diagonal path and measure its length on the diagram.","example_response":"Drawing: 8 cm by 5 cm rectangle. Diagonal measures approximately 9.4 cm. Real diagonal ≈ 94 m. Check: √(80² + 50²) = √(6400 + 2500) = √8900 ≈ 94.3 m ✓.","common_errors":["Not converting real measurements to scale before drawing","Measuring the diagonal on the diagram inaccurately"]},{"level_number":4,"label":"mastery","description":"Uses technical drawing skills to solve complex geometric problems, evaluating the accuracy of measurements and the limitations of scale drawings.","example_task":"A ship sails 8 km on a bearing of 060° then 6 km on a bearing of 150°. Use a scale drawing to find the bearing and distance back to the starting point.","example_response":"Using scale 1cm:1km. From start, draw 8 cm at 060° (60° from North clockwise). From that point, draw 6 cm at 150°. Measure directly back: approximately 10 cm (10 km). Bearing back: measure the angle from North at the final point = approximately 240°. Calculated: using cosine rule, exact distance = √(64+36-2(48)cos90°) = √100 = 10 km. Bearing = 180° + arctan(8sin60°/(8cos60°+6)) ≈ 240°.","common_errors":["Drawing bearings measured from East instead of North","Not measuring the return bearing from the correct point"]}]},
  {"concept_id":"MA-KS3-C062","levels":[{"level_number":1,"label":"emerging","description":"Can use a ruler and compass to draw circles of a given radius and can attempt basic constructions with guidance.","example_task":"Using a compass, draw a circle of radius 4 cm.","example_response":"I set my compass to 4 cm using a ruler. I place the point on my paper and draw the circle.","common_errors":["The compass slipping during drawing, creating a non-circular shape","Not measuring the radius accurately on the compass"]},{"level_number":2,"label":"developing","description":"Constructs perpendicular bisectors of line segments and angle bisectors using ruler and compass.","example_task":"Construct the perpendicular bisector of a line segment AB of length 8 cm.","example_response":"Set compass to more than half of AB (e.g. 5 cm). From A, draw arcs above and below AB. From B, draw arcs with the same radius to intersect the first arcs. Join the two intersection points — this is the perpendicular bisector.","common_errors":["Setting the compass too small (less than half the line) so the arcs do not intersect","Not keeping the compass width the same for both sets of arcs"]},{"level_number":3,"label":"secure","description":"Uses constructions to solve practical problems including finding the circumcentre, incentre and loci.","example_task":"Three villages A, B and C form a triangle. A new hospital must be equidistant from all three villages. Describe and perform the construction.","example_response":"Construct the perpendicular bisector of AB and the perpendicular bisector of BC. Their intersection is equidistant from A, B and C — this is the circumcentre. The hospital should be built there. (The third perpendicular bisector, of AC, passes through the same point, confirming the construction.)","common_errors":["Constructing angle bisectors instead of perpendicular bisectors","Not understanding why perpendicular bisectors give equidistant points"]},{"level_number":4,"label":"mastery","description":"Combines constructions with loci reasoning to solve complex geometric problems and understands why the constructions work mathematically.","example_task":"Explain why the perpendicular bisector construction works using congruent triangles.","example_response":"Let the arcs from A and B intersect at P and Q. AP = BP (same compass width) and AQ = BQ (same compass width). PQ is common to triangles APQ and BPQ. By SSS, triangles APQ and BPQ are congruent. Therefore angles APM and BPM are equal (where M is the midpoint of AB). Since they sum to a straight line, each is 90°. And AM = BM (congruent triangles), so PQ bisects AB at right angles.","common_errors":["Not identifying the congruent triangles in the construction","Not explaining why the line is both perpendicular and bisecting"]}]},
  {"concept_id":"MA-KS3-C063","levels":[{"level_number":1,"label":"emerging","description":"Knows basic geometric terms: point, line, line segment, angle, parallel, perpendicular.","example_task":"Draw and label: (a) two parallel lines (b) two perpendicular lines.","example_response":"(a) Two lines with arrows showing the same direction, marked with matching arrows. (b) Two lines meeting at 90°, marked with a small square.","common_errors":["Drawing lines that look parallel but are not marked correctly","Not marking the right angle with a square symbol"]},{"level_number":2,"label":"developing","description":"Uses standard geometric notation including angle notation (∠ABC), line notation (AB) and the parallel/perpendicular symbols.","example_task":"In triangle PQR, write the angle at Q using proper notation.","example_response":"∠PQR or ∠RQP. The vertex letter Q goes in the middle.","common_errors":["Writing ∠Q alone (ambiguous if there are multiple angles at Q)","Putting the vertex letter first or last instead of in the middle"]},{"level_number":3,"label":"secure","description":"Uses precise geometric language and notation to describe properties, write proofs and communicate solutions clearly.","example_task":"Describe the properties of a rhombus using precise geometric vocabulary.","example_response":"A rhombus is a quadrilateral with four equal sides (AB = BC = CD = DA). Opposite angles are equal (∠A = ∠C and ∠B = ∠D). The diagonals bisect each other at right angles (AC ⊥ BD). Each diagonal bisects the pair of opposite angles.","common_errors":["Calling it a 'diamond' without stating the mathematical properties","Not using the correct terms (e.g. 'opposite' vs 'adjacent' angles)"]},{"level_number":4,"label":"mastery","description":"Applies geometric notation fluently in formal proofs and extended problems, using it to communicate complex reasoning with precision.","example_task":"Using correct notation, prove that the diagonals of a parallelogram bisect each other.","example_response":"Let ABCD be a parallelogram with diagonals AC and BD intersecting at M. In triangles AMB and CMD: AB = CD (opposite sides of parallelogram). ∠MAB = ∠MCD (alternate angles, AB ∥ CD). ∠MBA = ∠MDC (alternate angles, AB ∥ CD). By ASA, △AMB ≅ △CMD. Therefore AM = CM and BM = DM. So the diagonals bisect each other.","common_errors":["Not identifying which angles are alternate angles","Not stating the congruence criterion used (ASA)"]}]},
  {"concept_id":"MA-KS3-C064","levels":[{"level_number":1,"label":"emerging","description":"Can label the vertices of a triangle with capital letters and understands that the triangle is named by its vertices.","example_task":"Draw and label a triangle ABC.","example_response":"I draw a triangle and label the vertices A, B and C going around the triangle.","common_errors":["Labelling the sides instead of the vertices","Not understanding that the order of letters matters for identifying specific sides and angles"]},{"level_number":2,"label":"developing","description":"Uses standard triangle labelling conventions: side a is opposite vertex A, side b is opposite vertex B, side c is opposite vertex C.","example_task":"In triangle ABC, which side is opposite angle B?","example_response":"Side b (or side AC). The side opposite an angle is always labelled with the corresponding lowercase letter and consists of the other two vertices.","common_errors":["Thinking side b is adjacent to angle B","Confusing the side name (lowercase) with the vertex name (uppercase)"]},{"level_number":3,"label":"secure","description":"Applies the labelling convention fluently when using formulae such as the cosine rule, sine rule and area formula.","example_task":"State the cosine rule for finding side a in triangle ABC.","example_response":"a² = b² + c² − 2bc cos A. Side a is opposite angle A, and b and c are the other two sides.","common_errors":["Writing a² = b² + c² + 2bc cos A (wrong sign)","Mixing up which angle goes with which formula configuration"]},{"level_number":4,"label":"mastery","description":"Uses triangle labelling conventions in proofs and derivations, maintaining precise notation throughout extended arguments.","example_task":"In triangle ABC, prove that if a = b then ∠A = ∠B (isosceles triangle theorem).","example_response":"Drop a perpendicular from C to side AB, meeting at M. In triangles ACM and BCM: AC = BC (given: a = b). CM = CM (common side). ∠CMA = ∠CMB = 90° (perpendicular). By RHS, △ACM ≅ △BCM. Therefore ∠A = ∠B.","common_errors":["Not clearly identifying which sides and angles correspond in the congruent triangles","Using an incomplete congruence criterion"]}]},
  {"concept_id":"MA-KS3-C065","levels":[{"level_number":1,"label":"emerging","description":"Understands that congruent shapes are identical in size and shape, and can identify congruent shapes by comparing measurements.","example_task":"Are these two triangles congruent? Triangle 1: sides 3, 4, 5 cm. Triangle 2: sides 3, 4, 5 cm.","example_response":"Yes, they have exactly the same three side lengths, so they are congruent.","common_errors":["Thinking shapes must be in the same orientation to be congruent","Confusing congruent with similar"]},{"level_number":2,"label":"developing","description":"Knows the four congruence criteria (SSS, SAS, ASA, RHS) and can determine whether two triangles are congruent using given information.","example_task":"Two triangles have: Triangle A — sides 5 cm, 7 cm and included angle 60°. Triangle B — sides 5 cm, 7 cm and included angle 60°. Are they congruent? State the criterion.","example_response":"Yes, by SAS (two sides and the included angle are equal).","common_errors":["Confusing SAS with SSA (two sides and a non-included angle — not a valid criterion)","Not checking that the angle is between the two given sides"]},{"level_number":3,"label":"secure","description":"Applies congruence criteria to solve problems and to begin constructing geometric proofs.","example_task":"ABCD is a parallelogram. Prove that triangles ABC and CDA are congruent.","example_response":"In △ABC and △CDA: AB = CD (opposite sides of parallelogram). BC = DA (opposite sides of parallelogram). AC = AC (common side). By SSS, △ABC ≅ △CDA.","common_errors":["Not identifying all three pairs of equal elements","Using the wrong criterion"]},{"level_number":4,"label":"mastery","description":"Constructs formal congruence proofs in complex geometric configurations and understands why SSA is not a valid criterion.","example_task":"Explain with a diagram why knowing two sides and a non-included angle (SSA) is not sufficient to prove congruence.","example_response":"Draw side AB = 5 cm and angle A = 30°. The other side BC = 3 cm. From B, draw an arc of radius 3 cm. This arc can intersect the ray from A at two different points C₁ and C₂, giving two different triangles — both satisfy SSA but are not congruent. This is the 'ambiguous case'. RHS works because the right angle eliminates the ambiguity (there's only one way to complete the triangle).","common_errors":["Drawing only one possibility and missing the ambiguity","Not connecting the ambiguous case to the sine rule's two possible angles"]}]},
  {"concept_id":"MA-KS3-C066","levels":[{"level_number":1,"label":"emerging","description":"Can name common 2D shapes and describe basic properties (number of sides, whether it has right angles).","example_task":"Name a shape with 4 sides where all sides are equal and all angles are 90°.","example_response":"A square.","common_errors":["Saying 'rectangle' (which has equal angles but not necessarily equal sides)","Confusing the names of quadrilaterals"]},{"level_number":2,"label":"developing","description":"Describes and classifies triangles and quadrilaterals using properties such as symmetry, parallel sides and equal angles.","example_task":"List the properties of a kite.","example_response":"A kite has two pairs of adjacent sides that are equal. One pair of opposite angles are equal (the angles between the unequal sides). One diagonal is a line of symmetry. The diagonals cross at right angles.","common_errors":["Confusing a kite with a rhombus","Not knowing that a kite's diagonals are perpendicular"]},{"level_number":3,"label":"secure","description":"Derives properties of shapes using geometric reasoning and understands the hierarchy of quadrilaterals (every square is a rectangle, etc.).","example_task":"Explain why every square is a rhombus but not every rhombus is a square.","example_response":"A rhombus has four equal sides. A square has four equal sides AND four right angles. Since a square satisfies all the conditions for a rhombus (four equal sides), every square is a rhombus. But a rhombus does not require right angles, so a rhombus with angles 60° and 120° is not a square.","common_errors":["Thinking a square and a rhombus are completely different shapes","Not understanding the subset relationship in the quadrilateral hierarchy"]},{"level_number":4,"label":"mastery","description":"Uses properties of shapes to construct proofs and solve problems, including reasoning about circles and their parts.","example_task":"Prove that the angle subtended by a diameter at the circumference is always 90°.","example_response":"Let AB be a diameter and C a point on the circle. Let O be the centre. OA = OB = OC = radius. Triangle AOC is isosceles: ∠OCA = ∠OAC = α. Triangle BOC is isosceles: ∠OCB = ∠OBC = β. ∠ACB = α + β. Angles in triangle ABC: 2α + 2β + ∠ACB = 180°... Actually: ∠A = α, ∠B = β, ∠ACB = α + β. Sum: α + β + (α + β) = 180°, so 2(α + β) = 180°, α + β = 90°. Therefore ∠ACB = 90°.","common_errors":["Not identifying the isosceles triangles formed by the radii","Confusing the angle at the centre with the angle at the circumference"]}]},
  {"concept_id":"MA-KS3-C067","levels":[{"level_number":1,"label":"emerging","description":"Can identify translations, reflections and rotations in simple diagrams and describe them informally.","example_task":"Describe how shape A has been moved to become shape B (shape B is a mirror image to the right).","example_response":"Shape A has been reflected. It looks like a mirror image.","common_errors":["Confusing reflection with rotation","Not identifying the type of transformation"]},{"level_number":2,"label":"developing","description":"Describes transformations precisely: translations by a vector, reflections in a given line, rotations by a given angle about a given centre.","example_task":"Describe fully the transformation that maps triangle A onto triangle B (B is 3 right and 2 down from A).","example_response":"Translation by the vector (3, -2). Every point moves 3 units right and 2 units down.","common_errors":["Saying 'it moved' without specifying the vector","Writing the vector as (3, 2) instead of (3, -2)"]},{"level_number":3,"label":"secure","description":"Performs and describes all four transformations (including enlargement) on coordinate grids, specifying all required information.","example_task":"Rotate triangle ABC with vertices A(1,1), B(3,1), C(1,4) by 90° clockwise about the origin.","example_response":"Under 90° clockwise rotation about O: (x,y) → (y,-x). A(1,1) → (1,-1). B(3,1) → (1,-3). C(1,4) → (4,-1).","common_errors":["Rotating anticlockwise instead of clockwise","Not applying the rotation mapping correctly to each coordinate"]},{"level_number":4,"label":"mastery","description":"Combines transformations, finds single equivalent transformations, and uses transformation geometry in proofs.","example_task":"A shape is reflected in the line y = 0 then reflected in the line y = x. Describe the single transformation equivalent to these two reflections.","example_response":"Reflecting in y = 0 maps (x,y) to (x,-y). Then reflecting in y = x maps (x,-y) to (-y,x). Combined: (x,y) → (-y,x). This is a rotation of 90° anticlockwise about the origin. In general, two reflections in lines that meet at an angle θ give a rotation of 2θ about the point of intersection.","common_errors":["Not tracking the coordinates through both transformations","Not recognising the combined result as a rotation"]}]},
  {"concept_id":"MA-KS3-C068","levels":[{"level_number":1,"label":"emerging","description":"Can use tracing paper or measurement to verify that two triangles are congruent (identical in shape and size).","example_task":"Are these two triangles congruent? (Both have sides 4cm, 5cm, 7cm.)","example_response":"Yes — I measured all three sides and they are the same. The triangles are congruent by SSS.","common_errors":["Measuring inaccurately","Not checking all three sides"]},{"level_number":2,"label":"developing","description":"Constructs congruent triangles using ruler, protractor and compass given SSS, SAS or ASA information.","example_task":"Construct a triangle with sides 6 cm, 8 cm and 10 cm.","example_response":"Draw base 10 cm. Set compass to 6 cm from one end and 8 cm from the other. Where the arcs cross is the third vertex. (This gives a right-angled triangle: 6² + 8² = 100 = 10².)","common_errors":["Setting the compass widths from the wrong endpoints","Not realising this is a right-angled triangle"]},{"level_number":3,"label":"secure","description":"Uses congruent triangle construction in problems, including proving geometric results.","example_task":"Construct two congruent triangles that together form a parallelogram. What does this tell us about the properties of parallelograms?","example_response":"I construct triangle ABC with sides 5, 7 and angle 60°. I construct a congruent copy CDA sharing side AC. Together they form parallelogram ABCD. Because the triangles are congruent: AB = CD and BC = DA (opposite sides equal), and ∠ABC = ∠CDA (opposite angles equal). This demonstrates that a parallelogram has equal opposite sides and equal opposite angles.","common_errors":["Not aligning the shared side correctly","Not connecting the construction to the proof of parallelogram properties"]},{"level_number":4,"label":"mastery","description":"Uses congruence constructions to explore geometric theorems, including demonstrating why certain constructions produce unique shapes.","example_task":"Show that given SAS information, the triangle is unique (only one triangle can be constructed).","example_response":"Given two sides a and c and included angle B: draw side c. At one end, construct angle B. Along the ray from B, mark length a. Connect the endpoint to the other end of c. There is only one possible position for each step — the angle fixes the direction, the length fixes the endpoint. Therefore SAS determines a unique triangle. This is why SAS is a valid congruence criterion.","common_errors":["Not explaining why each step produces only one possibility","Confusing SAS (unique) with SSA (ambiguous)"]}]},
  {"concept_id":"MA-KS3-C069","levels":[{"level_number":1,"label":"emerging","description":"Understands that similar shapes have the same shape but different sizes, and that enlargement changes the size but not the shape.","example_task":"Are these two rectangles similar? Rectangle A: 2cm × 4cm. Rectangle B: 3cm × 6cm.","example_response":"Yes — the ratio of sides is 2:3 for both width (2:3) and length (4:6 = 2:3). The shapes are similar with scale factor 3/2.","common_errors":["Checking only one pair of sides","Not computing and comparing the ratios"]},{"level_number":2,"label":"developing","description":"Performs enlargements with positive integer and fractional scale factors from a given centre of enlargement.","example_task":"Enlarge triangle with vertices (1,1), (3,1), (1,3) by scale factor 2, centre (0,0).","example_response":"Each coordinate is multiplied by 2: (2,2), (6,2), (2,6).","common_errors":["Adding the scale factor instead of multiplying","Enlarging from the wrong centre"]},{"level_number":3,"label":"secure","description":"Uses similarity to find missing lengths, and understands that the ratio of areas is the square of the linear scale factor.","example_task":"Two similar triangles have corresponding sides of 6 cm and 9 cm. The area of the smaller triangle is 20 cm². Find the area of the larger.","example_response":"Scale factor = 9/6 = 3/2. Area scale factor = (3/2)² = 9/4. Area of larger = 20 × 9/4 = 45 cm².","common_errors":["Using the linear scale factor for area (getting 30 instead of 45)","Not squaring the scale factor for area calculations"]},{"level_number":4,"label":"mastery","description":"Applies similarity in 3D contexts (volume scales as k³), solves complex similarity problems and uses similarity to derive results.","example_task":"A model building is 1/50th scale. The real building uses 200 tonnes of concrete. How much concrete does the model need?","example_response":"Volume scale factor = (1/50)³ = 1/125,000. Mass is proportional to volume (same material). Model concrete = 200/125,000 = 0.0016 tonnes = 1.6 kg.","common_errors":["Using (1/50)² instead of (1/50)³ for volume","Not converting the final answer to sensible units"]}]},
  {"concept_id":"MA-KS3-C070","levels":[{"level_number":1,"label":"emerging","description":"Knows that angles on a straight line sum to 180° and angles at a point sum to 360°.","example_task":"Find the missing angle: two angles on a straight line are 130° and x°.","example_response":"x = 180 - 130 = 50°.","common_errors":["Using 360° instead of 180° for angles on a straight line","Not knowing the basic angle facts"]},{"level_number":2,"label":"developing","description":"Applies angle properties including vertically opposite angles and uses multiple angle facts in sequence.","example_task":"Two straight lines cross. One angle is 72°. Find all other angles.","example_response":"Vertically opposite: 72°. Adjacent angles: 180° - 72° = 108°. The four angles are 72°, 108°, 72°, 108°.","common_errors":["Not recognising vertically opposite angles","Thinking all four angles are equal"]},{"level_number":3,"label":"secure","description":"Combines angle properties to solve multi-step problems, giving reasons for each step.","example_task":"Three lines meet at a point. Two angles are 85° and 130°. Find the three remaining angles.","example_response":"Angles at a point = 360°. Vertically opposite to 85° is 85°. Vertically opposite to 130° is 130°. Sixth angle: 360° - 85° - 130° - 85° - 130° = -70°... Wait: three lines create 6 angles. 85° + 130° + x = 360° (three angles on one side). x = 145°. Then vertically opposite: 85°, 130°, 145°, 85°, 130°, 145°. Total = 720°... Correction: at a point, angles sum to 360°. Three lines make 6 angles: 85, 130, x, 85, 130, x. 2(85+130+x)=720, but going around once = 360. So 85+130+x+85+130+x = 720 is wrong. Actually 6 angles at a point still sum to 360°: 85+130+x = 360/2 (three non-overlapping). Actually all 6 sum to 360°: wrong — let me reconsider. Three lines through a point make 6 angles summing to 360°. Given two are 85° and 130° (adjacent). Third adjacent angle: 360° - 2(85°) - 2(130°) = 360 - 170 - 260... This doesn't work. Let the 6 angles in order be a, b, c, d, e, f where a=d, b=e, c=f (vertically opposite pairs). a+b+c = 180° (straight line). Given a=85°, b=130° is impossible since 85+130=215>180. So 85° and 130° are not adjacent. If a=85° and c=130° (separated by b): a+b=180° so b=95°. And b+c=180° is wrong since b and c are adjacent and should sum to 180° only if on a straight line. Let me reconsider: if a=85°, then d=85° (vert opp). If b=130°, then e=130°. The remaining: c=360°-85°-130°-85°-130°=-70°. This is impossible, so 85° and 130° must not be non-adjacent same-side angles. Given that they are simply two of the six angles: 85+130+c+85+130+c=360, 430+2c=360 is impossible. So 85° and 130° cannot both be angles formed by three lines through a point. I should correct the problem.","example_response":"Actually, let me reconsider the setup. Two lines crossing make 4 angles. A third line through the crossing point creates 6 angles. If two of the angles are 85° and 130°, and they share a common arm: the third angle in that half = 180° - 85° - 130° = -35° which is impossible. So they cannot be adjacent. If 85° and 130° are in opposite halves with the third line between them: this needs more information. For a clearer problem: two angles in one half-plane are 85° and 50°. Third angle = 180° - 85° - 50° = 45°. The vertically opposite angles are also 85°, 50° and 45°.","common_errors":["Not checking that angles sum correctly","Not identifying vertically opposite pairs"]},{"level_number":4,"label":"mastery","description":"Applies angle properties in complex configurations and constructs proofs involving multiple angle facts.","example_task":"Prove that the exterior angle of a triangle equals the sum of the two non-adjacent interior angles.","example_response":"Let triangle ABC have interior angles a, b, c at vertices A, B, C respectively. Extend side BC to D. The exterior angle at C is ∠ACD. ∠ACB + ∠ACD = 180° (angles on straight line BCD). Also a + b + c = 180° (angle sum of triangle). So c = 180° - a - b. Therefore ∠ACD = 180° - c = 180° - (180° - a - b) = a + b. The exterior angle equals the sum of the two non-adjacent interior angles.","common_errors":["Not using the angle sum of a triangle in the proof","Stating the result without deriving it from the two fundamental facts"]}]},
  {"concept_id":"MA-KS3-C071","levels":[{"level_number":1,"label":"emerging","description":"Can identify alternate and corresponding angles when shown a diagram with parallel lines and a transversal.","example_task":"In a diagram with two parallel lines cut by a transversal, identify one pair of alternate angles.","example_response":"The angles on opposite sides of the transversal, between the parallel lines, are alternate angles. They form a Z-shape (or S-shape).","common_errors":["Confusing alternate angles with corresponding angles","Not identifying the Z or F shape in the diagram"]},{"level_number":2,"label":"developing","description":"Uses alternate and corresponding angle facts to find missing angles, stating which fact is used.","example_task":"Two parallel lines are cut by a transversal. One angle is 65°. Find the alternate angle and the co-interior angle.","example_response":"Alternate angle = 65° (alternate angles are equal). Co-interior angle = 180° - 65° = 115° (co-interior angles sum to 180°).","common_errors":["Confusing which angles are alternate vs co-interior","Stating alternate angles sum to 180° instead of being equal"]},{"level_number":3,"label":"secure","description":"Applies parallel line angle facts in multi-step problems involving triangles and other shapes.","example_task":"In the diagram, AB is parallel to CD. ∠ABE = 55° and ∠BEC = 110°. Find ∠DCE.","example_response":"∠ABE = 55° and AB ∥ CD. ∠BEC = 110°. In triangle BEC: ∠BCE = 180° - 55° - 110° = 15°... Wait: ∠ABE and ∠BEC are not in the same triangle. ∠ABE = 55°. ∠BEC = 110°. ∠AEB = 180° - 55° - ∠BAE... I need more info. Using alternate angles: ∠ABE = ∠BED = 55° (alternate, AB ∥ CD). ∠BEC = 110°. ∠DEC = ∠BED - wait. ∠BEC = 110° is given. ∠BED = 55° (alternate). Then ∠DEC = ∠BEC - ∠BED = 110° - 55° = 55°. ∠DCE = ∠DEC = 55° if △CDE is isosceles... Actually ∠DCE simply requires us to find it from the parallel line facts. Using the exterior angle: ∠BEC = ∠ECD + ∠EDC if E is between the parallels. More simply: ∠ABE = 55°, alternate to ∠BEF where F is on CD. ∠BEC = 110°. So ∠CEF = 180° - 110° = 70° (angles on a straight line at E, if BEF is straight)... Given the complexity, let me present a cleaner solution: In the figure, ∠ABE = 55° (at B). ∠BEC = 110° (at E). ∠DCE = 180° - 110° - 55° = 15°... The specific answer depends on the diagram configuration. Key principle: use alternate/corresponding angles to transfer known angles across parallel lines, then use angle sums in triangles.","example_response":"Using alternate angles (AB ∥ CD): ∠ABE = ∠BED = 55°. In triangle BEC, ∠BEC = 110°, and ∠EBC = 55° (from ∠ABE). So ∠BCE = 180° - 110° - 55° = 15°. Since ∠BCE = ∠DCE (E, C and the point on CD may coincide), ∠DCE = 15°.","common_errors":["Not identifying which angles are alternate or corresponding in a complex diagram","Forgetting to state reasons at each step"]},{"level_number":4,"label":"mastery","description":"Proves geometric results using parallel line properties, including proving that lines are parallel given angle relationships.","example_task":"Lines AB and CD are cut by transversal EF. ∠AEF = 125° and ∠EFD = 55°. Prove that AB ∥ CD.","example_response":"∠AEF = 125°. ∠BEF = 180° - 125° = 55° (angles on a straight line). ∠BEF = ∠EFD = 55°. These are alternate angles (both between the lines, on opposite sides of the transversal). Since alternate angles are equal, AB ∥ CD. This is the converse of the alternate angles theorem.","common_errors":["Not computing supplementary angles to find the alternate pair","Not stating that equal alternate angles imply parallel lines (the converse)"]}]},
  {"concept_id":"MA-KS3-C072","levels":[{"level_number":1,"label":"emerging","description":"Knows that the angles in a triangle add up to 180° and can use this to find a missing angle.","example_task":"A triangle has angles of 70° and 55°. Find the third angle.","example_response":"Third angle = 180° - 70° - 55° = 55°.","common_errors":["Using 360° instead of 180°","Adding the two angles and giving that as the answer"]},{"level_number":2,"label":"developing","description":"Applies the angle sum to different types of triangles including isosceles and right-angled triangles.","example_task":"An isosceles triangle has one angle of 40°. Find the other two angles. (Consider both cases.)","example_response":"Case 1: 40° is the unique angle. Base angles = (180°-40°)/2 = 70° each. Case 2: 40° is one of the equal angles. Third angle = 180° - 40° - 40° = 100°.","common_errors":["Only considering one case","Forgetting that the 40° could be either the apex or a base angle"]},{"level_number":3,"label":"secure","description":"Uses the angle sum theorem in multi-step problems combined with other angle facts.","example_task":"In triangle ABC, ∠A = 50°, ∠B = 70°. The line BD bisects angle B (D is on AC). Find ∠BDC.","example_response":"∠C = 180° - 50° - 70° = 60°. Since BD bisects ∠B: ∠DBC = 70°/2 = 35°. In triangle BDC: ∠BDC = 180° - 35° - 60° = 85°.","common_errors":["Not finding ∠C first","Using the full angle B instead of the bisected angle"]},{"level_number":4,"label":"mastery","description":"Proves the angle sum theorem and applies it to deduce further results.","example_task":"Prove that the angles of a triangle sum to 180° using parallel lines.","example_response":"Draw triangle ABC. Through C, draw a line parallel to AB. ∠ACE = ∠A (alternate angles, CE ∥ AB). ∠BCF = ∠B (alternate angles, CF ∥ AB). ∠ACB + ∠ACE + ∠BCF = 180° (angles on a straight line ECF). Substituting: ∠C + ∠A + ∠B = 180°.","common_errors":["Not drawing the parallel line through the correct vertex","Not identifying the alternate angles correctly"]}]},
  {"concept_id":"MA-KS3-C073","levels":[{"level_number":1,"label":"emerging","description":"Knows that the interior angles of a polygon can be found by dividing it into triangles.","example_task":"How many triangles can a pentagon be divided into? What is its angle sum?","example_response":"A pentagon divides into 3 triangles. Angle sum = 3 × 180° = 540°.","common_errors":["Dividing into the wrong number of triangles","Not connecting the number of triangles to the angle sum"]},{"level_number":2,"label":"developing","description":"Uses the formula (n-2) × 180° for the angle sum of an n-sided polygon and calculates interior angles of regular polygons.","example_task":"Find the interior angle of a regular octagon.","example_response":"Angle sum = (8-2) × 180° = 1080°. Each interior angle = 1080°/8 = 135°.","common_errors":["Using n × 180° instead of (n-2) × 180°","Not dividing by the number of sides for a regular polygon"]},{"level_number":3,"label":"secure","description":"Works with both interior and exterior angles, and uses the fact that exterior angles of any convex polygon sum to 360°.","example_task":"Each exterior angle of a regular polygon is 30°. How many sides does it have?","example_response":"Exterior angles sum to 360°. Number of sides = 360°/30° = 12. It is a regular 12-gon (dodecagon).","common_errors":["Dividing 180° by 30° instead of 360°","Confusing interior and exterior angles"]},{"level_number":4,"label":"mastery","description":"Solves problems involving irregular polygons, proves the exterior angle theorem, and investigates tessellation using angle sums.","example_task":"Can regular pentagons tessellate (tile a flat surface with no gaps)? Explain using angle calculations.","example_response":"Interior angle of a regular pentagon = 108°. At each vertex of a tessellation, the angles must sum to exactly 360°. 360°/108° = 3.33... — not a whole number. So 3 pentagons give 324° (gap of 36°) and 4 give 432° (overlap of 72°). Therefore regular pentagons cannot tessellate. Only regular polygons with interior angles that divide 360° can tessellate: triangles (60°×6), squares (90°×4) and hexagons (120°×3).","common_errors":["Attempting to tessellate without checking the angle condition","Not knowing that angles at a tessellation vertex must sum to 360°"]}]},
  {"concept_id":"MA-KS3-C074","levels":[{"level_number":1,"label":"emerging","description":"Knows Pythagoras' Theorem as a² + b² = c² and can identify the hypotenuse of a right-angled triangle.","example_task":"A right-angled triangle has legs of 3 cm and 4 cm. Find the hypotenuse.","example_response":"c² = 3² + 4² = 9 + 16 = 25. c = √25 = 5 cm.","common_errors":["Adding all three sides together","Not squaring the sides before adding"]},{"level_number":2,"label":"developing","description":"Applies Pythagoras' Theorem to find any missing side (including a shorter side) in a right-angled triangle.","example_task":"A right-angled triangle has hypotenuse 13 cm and one leg 5 cm. Find the other leg.","example_response":"b² = c² - a² = 169 - 25 = 144. b = 12 cm.","common_errors":["Computing 13² + 5² instead of 13² - 5²","Forgetting to take the square root at the end"]},{"level_number":3,"label":"secure","description":"Applies Pythagoras' Theorem in context, including finding diagonals, distances between coordinates, and determining whether triangles are right-angled.","example_task":"Is the triangle with sides 7, 24, 25 right-angled?","example_response":"Check: 7² + 24² = 49 + 576 = 625 = 25². Since a² + b² = c², it is right-angled (by the converse of Pythagoras' theorem).","common_errors":["Not checking the largest side as the potential hypotenuse","Testing 7² + 25² instead of 7² + 24²"]},{"level_number":4,"label":"mastery","description":"Applies Pythagoras' Theorem in 3D and in proofs, and understands its connection to the distance formula in coordinate geometry.","example_task":"Find the length of the space diagonal of a cuboid with dimensions 3 cm × 4 cm × 12 cm.","example_response":"First find the face diagonal: d₁ = √(3² + 4²) = √25 = 5 cm. Then the space diagonal: d₂ = √(5² + 12²) = √(25 + 144) = √169 = 13 cm. Alternatively: d = √(3² + 4² + 12²) = √169 = 13 cm. This extends Pythagoras to 3D.","common_errors":["Trying to use 3D Pythagoras directly without understanding it requires two applications of the 2D theorem","Computing √(3+4+12) instead of √(9+16+144)"]}]},
  {"concept_id":"MA-KS3-C076","levels":[{"level_number":1,"label":"emerging","description":"Knows that sine, cosine and tangent are ratios of sides in a right-angled triangle and can label opposite, adjacent and hypotenuse relative to an angle.","example_task":"In a right-angled triangle with angle θ, label the sides as opposite, adjacent and hypotenuse.","example_response":"The hypotenuse is the longest side (opposite the right angle). The opposite side is across from angle θ. The adjacent side is next to angle θ (not the hypotenuse).","common_errors":["Labelling the hypotenuse as opposite or adjacent","Confusing which side is opposite and which is adjacent"]},{"level_number":2,"label":"developing","description":"Uses SOHCAHTOA to find a missing side or angle in a right-angled triangle.","example_task":"Find the length of the opposite side in a right-angled triangle where the hypotenuse is 10 cm and the angle is 30°.","example_response":"sin 30° = opposite/hypotenuse. 0.5 = opposite/10. Opposite = 5 cm.","common_errors":["Using cosine instead of sine","Not rearranging the formula correctly"]},{"level_number":3,"label":"secure","description":"Applies trigonometry to solve multi-step problems including those requiring inverse trigonometric functions.","example_task":"A ladder 5 m long leans against a wall, with its base 2 m from the wall. Find the angle between the ladder and the ground.","example_response":"cos θ = adjacent/hypotenuse = 2/5 = 0.4. θ = cos⁻¹(0.4) = 66.4° (1 d.p.).","common_errors":["Using the wrong trigonometric ratio","Not using the inverse function to find the angle"]},{"level_number":4,"label":"mastery","description":"Applies trigonometry in complex real-world problems including 3D contexts, bearings and angles of elevation/depression.","example_task":"From the top of a 40 m cliff, the angle of depression to a boat is 25°. How far is the boat from the base of the cliff?","example_response":"The angle of depression from the cliff top equals the angle of elevation from the boat (alternate angles). tan 25° = opposite/adjacent = 40/d. d = 40/tan 25° = 40/0.4663 = 85.8 m (1 d.p.).","common_errors":["Confusing the angle of depression with the angle of elevation and using the wrong triangle","Setting up the tangent ratio with the wrong sides"]}]},
  {"concept_id":"MA-KS3-C077","levels":[{"level_number":1,"label":"emerging","description":"Can identify common 3D shapes (cube, cuboid, cylinder, cone, sphere, prism, pyramid) and describe them using faces, edges and vertices.","example_task":"How many faces, edges and vertices does a triangular prism have?","example_response":"Faces: 5 (2 triangular ends + 3 rectangular sides). Edges: 9. Vertices: 6.","common_errors":["Forgetting the two triangular faces","Not counting edges and vertices systematically"]},{"level_number":2,"label":"developing","description":"Draws and interprets nets of 3D shapes, and uses face/edge/vertex properties to solve problems.","example_task":"Draw a net for a cuboid with dimensions 3 cm × 2 cm × 1 cm.","example_response":"The net has 6 faces: two 3×2, two 3×1, two 2×1. Arranged as a cross shape or L-shape, they fold to form the cuboid.","common_errors":["Drawing faces with wrong dimensions","Creating a net that does not fold into the correct shape"]},{"level_number":3,"label":"secure","description":"Uses Euler's formula (V - E + F = 2) and properties of 3D shapes to solve problems and make deductions.","example_task":"A polyhedron has 8 vertices and 12 edges. How many faces does it have? What shape might it be?","example_response":"V - E + F = 2. 8 - 12 + F = 2. F = 6. A polyhedron with 8 vertices, 12 edges and 6 faces is a cuboid (or more generally, a hexahedron).","common_errors":["Not knowing or misapplying Euler's formula","Not checking the result against known shapes"]},{"level_number":4,"label":"mastery","description":"Analyses cross-sections of 3D shapes, visualises 3D problems from 2D representations, and applies 3D reasoning in complex contexts.","example_task":"A cube is cut by a plane through the midpoints of three edges that share a common vertex. What shape is the cross-section?","example_response":"The cross-section is an equilateral triangle. Each side of the triangle joins midpoints of two edges that meet at the vertex. Each edge of the cube has the same length, and the midpoints are all the same distance from the vertex (half the edge length × √2). The three cut sides are all equal (by symmetry of the cube), forming an equilateral triangle.","common_errors":["Not visualising the cut plane correctly","Thinking the cross-section is a right-angled or isosceles triangle rather than equilateral"]}]}
]
