[
  {"concept_id":"MA-KS3-C078","levels":[{"level_number":1,"label":"emerging","description":"Can conduct a simple probability experiment (e.g. rolling a dice) and record the results in a tally chart or frequency table.","example_task":"Roll a dice 30 times and record the results. What fraction of the time did you roll a 6?","example_response":"I rolled a 6 five times out of 30 rolls. The experimental probability is 5/30 = 1/6.","common_errors":["Not recording results systematically","Thinking the result should be exactly 1/6 every time"]},{"level_number":2,"label":"developing","description":"Uses the 0-1 probability scale to describe the likelihood of events and calculates experimental probability from data.","example_task":"A spinner lands on red 18 times out of 60 spins. Estimate the probability of landing on red. Place this on the probability scale.","example_response":"P(red) = 18/60 = 3/10 = 0.3. On the probability scale, this is between 0 and 0.5, so red is unlikely but possible.","common_errors":["Not simplifying the fraction","Not connecting the decimal to a position on the probability scale"]},{"level_number":3,"label":"secure","description":"Designs and conducts probability experiments, understands that more trials give better estimates, and compares experimental with theoretical probability.","example_task":"You flip a coin 20 times and get 14 heads. Does this mean the coin is biased? How could you investigate further?","example_response":"14/20 = 0.7, which is higher than the theoretical 0.5, but 20 trials is a small sample. Random variation could explain this result. To investigate further, I would flip the coin 100 or 200 times — a biased coin would consistently show deviation from 0.5, while a fair coin would converge towards 0.5 as trials increase.","common_errors":["Concluding the coin is definitely biased from 20 trials","Not understanding that small samples can deviate significantly from theoretical probability"]},{"level_number":4,"label":"mastery","description":"Evaluates the reliability of probability experiments, understands the Law of Large Numbers, and designs experiments to test hypotheses about probability.","example_task":"Design an experiment to determine whether a four-sided spinner is fair. Include: number of trials, what you would record, and how you would decide.","example_response":"Spin 200 times and record the frequency of each outcome. Expected frequency for a fair spinner: 200/4 = 50 per side. I would compare observed frequencies to expected. If all frequencies are within about 10 of 50, the spinner is likely fair. If one side consistently appears much more (e.g. 70+), it is likely biased. I could calculate the relative frequency for each side — for a fair spinner, all should approach 0.25 as trials increase. For a more rigorous test, I could use a chi-squared test comparing observed and expected frequencies.","common_errors":["Proposing too few trials (e.g. 20) for reliable conclusions","Not specifying a criterion for deciding fair vs biased"]}]},
  {"concept_id":"MA-KS3-C079","levels":[{"level_number":1,"label":"emerging","description":"Knows that something must happen — the probabilities of all possible outcomes must add up to 1.","example_task":"A bag contains only red and blue balls. P(red) = 0.3. What is P(blue)?","example_response":"P(blue) = 1 - 0.3 = 0.7. The probabilities must sum to 1 because one of the two events must happen.","common_errors":["Not knowing that probabilities sum to 1","Giving P(blue) = 0.3 (same as red)"]},{"level_number":2,"label":"developing","description":"Uses the fact that probabilities sum to 1 to find missing probabilities in problems with multiple outcomes.","example_task":"A spinner has sections: P(red) = 0.25, P(blue) = 0.4, P(green) = 0.15, P(yellow) = ?","example_response":"P(yellow) = 1 - (0.25 + 0.4 + 0.15) = 1 - 0.8 = 0.2.","common_errors":["Adding all given probabilities incorrectly","Not subtracting from 1"]},{"level_number":3,"label":"secure","description":"Applies the complementary probability rule P(A') = 1 - P(A) to solve problems efficiently.","example_task":"The probability of rain on any given day in April is 0.35. What is the probability it does NOT rain?","example_response":"P(no rain) = 1 - P(rain) = 1 - 0.35 = 0.65.","common_errors":["Not recognising that 'not rain' is the complement of 'rain'","Trying to calculate P(no rain) from scratch instead of using 1 - P(rain)"]},{"level_number":4,"label":"mastery","description":"Uses complementary probability strategically to simplify complex probability calculations ('at least one' problems).","example_task":"A fair coin is flipped 3 times. Find the probability of getting at least one head.","example_response":"P(at least one head) = 1 - P(no heads) = 1 - P(all tails) = 1 - (1/2)³ = 1 - 1/8 = 7/8. This is much easier than listing all the ways to get 1, 2 or 3 heads separately.","common_errors":["Trying to add P(exactly 1 head) + P(exactly 2 heads) + P(exactly 3 heads) — correct but inefficient","Computing P(no heads) incorrectly"]}]},
  {"concept_id":"MA-KS3-C080","levels":[{"level_number":1,"label":"emerging","description":"Can list all possible outcomes of a simple experiment using an organised list.","example_task":"List all possible outcomes when flipping a coin and rolling a dice.","example_response":"H1, H2, H3, H4, H5, H6, T1, T2, T3, T4, T5, T6. There are 12 outcomes.","common_errors":["Missing some outcomes due to unsystematic listing","Counting repeated outcomes (e.g. listing H3 twice)"]},{"level_number":2,"label":"developing","description":"Uses sample space diagrams (two-way tables) to enumerate all outcomes of combined events.","example_task":"Two dice are rolled and their scores are added. Complete a sample space diagram and find the number of ways to get a total of 7.","example_response":"The 6×6 grid shows 36 equally likely outcomes. Total 7 can be made by: 1+6, 2+5, 3+4, 4+3, 5+2, 6+1 = 6 ways.","common_errors":["Not listing all 36 outcomes in the grid","Treating 1+6 and 6+1 as the same outcome when they are different"]},{"level_number":3,"label":"secure","description":"Uses Venn diagrams and set notation (union, intersection, complement) to represent and enumerate outcomes.","example_task":"In a class of 30: 18 play football, 12 play tennis, 5 play both. Draw a Venn diagram and find how many play neither.","example_response":"Football only: 18 - 5 = 13. Tennis only: 12 - 5 = 7. Both: 5. Neither: 30 - 13 - 7 - 5 = 5.","common_errors":["Putting 18 in the football circle including the overlap (should subtract the overlap)","Not subtracting all three regions from the total to find 'neither'"]},{"level_number":4,"label":"mastery","description":"Applies the product rule for counting, uses tree diagrams and Venn diagrams with three or more sets, and solves complex enumeration problems.","example_task":"A PIN code has 4 digits. Each digit is 0-9. How many PINs are possible? How many have no repeated digits?","example_response":"Total PINs: 10⁴ = 10,000. No repeats: 10 × 9 × 8 × 7 = 5,040. The product rule says: if there are n₁ choices for the first digit, n₂ for the second, etc., then total = n₁ × n₂ × n₃ × n₄.","common_errors":["For no repeats, not reducing the choices at each step","Using addition instead of multiplication for the product rule"]}]},
  {"concept_id":"MA-KS3-C081","levels":[{"level_number":1,"label":"emerging","description":"Can calculate the probability of a single event from equally likely outcomes using P(event) = favourable outcomes / total outcomes.","example_task":"A fair dice is rolled. What is the probability of rolling an even number?","example_response":"Even numbers: 2, 4, 6 — that's 3 out of 6. P(even) = 3/6 = 1/2.","common_errors":["Not simplifying the fraction","Not identifying all favourable outcomes"]},{"level_number":2,"label":"developing","description":"Calculates theoretical probabilities for combined events using sample space diagrams.","example_task":"Two fair coins are flipped. What is the probability of getting exactly one head?","example_response":"Outcomes: HH, HT, TH, TT (4 equally likely). Exactly one head: HT, TH (2 outcomes). P = 2/4 = 1/2.","common_errors":["Listing only 3 outcomes (HH, HT, TT) and treating HT and TH as one","Not recognising that HT and TH are different outcomes"]},{"level_number":3,"label":"secure","description":"Calculates probabilities of combined events using tree diagrams and multiplication rules for independent events.","example_task":"A bag has 3 red and 5 blue balls. Two balls are drawn with replacement. Find P(both red).","example_response":"P(1st red) = 3/8. With replacement, P(2nd red) = 3/8. P(both red) = 3/8 × 3/8 = 9/64.","common_errors":["Not replacing the ball and changing the second probability","Adding probabilities instead of multiplying for 'and'"]},{"level_number":4,"label":"mastery","description":"Calculates probabilities for dependent events (without replacement) and applies the addition rule for mutually exclusive events.","example_task":"A bag has 3 red and 5 blue balls. Two are drawn without replacement. Find P(one of each colour).","example_response":"P(red then blue) = 3/8 × 5/7 = 15/56. P(blue then red) = 5/8 × 3/7 = 15/56. P(one of each) = 15/56 + 15/56 = 30/56 = 15/28. These are mutually exclusive outcomes (either RB or BR), so we add.","common_errors":["Forgetting the 'blue then red' case (finding only 15/56)","Not adjusting the denominator for the second draw (using 8 instead of 7)"]}]}
]
