[
  {"concept_id":"MA-KS3-C082","levels":[{"level_number":1,"label":"emerging","description":"Can read information from a simple chart or table and describe a data set in general terms (e.g. 'most people chose blue').","example_task":"This bar chart shows favourite colours in a class. Which colour was most popular? How many chose red?","example_response":"Blue was most popular (12 students). 7 students chose red.","common_errors":["Reading the wrong bar","Not reading the scale on the y-axis correctly"]},{"level_number":2,"label":"developing","description":"Compares two data sets using basic measures (mean, range) and appropriate graphical representations.","example_task":"Class A's test scores have mean 65 and range 40. Class B has mean 62 and range 15. Compare the two classes.","example_response":"Class A has a slightly higher average (65 vs 62) but much greater spread (range 40 vs 15). Class B is more consistent — most students scored near the average — while Class A has a wider spread of abilities.","common_errors":["Only comparing the means without mentioning the spread","Saying the higher range means Class A did better"]},{"level_number":3,"label":"secure","description":"Selects and constructs appropriate graphical representations for different data types and uses them to compare distributions.","example_task":"You want to compare the heights of Year 7 boys and girls. Which type of graph would you use and why?","example_response":"Dual bar charts or back-to-back stem and leaf diagrams would allow direct comparison. Box plots would be best for comparing the medians, quartiles and ranges of both distributions side by side. Histograms would show the shape of each distribution but are harder to compare directly.","common_errors":["Using pie charts (which show proportions, not actual distributions)","Not choosing a representation that allows direct comparison"]},{"level_number":4,"label":"mastery","description":"Describes, interprets and compares complex distributions using shape (skewness), outliers and multiple summary statistics.","example_task":"Dataset A has median 45, mean 52, IQR 12. Dataset B has median 50, mean 50, IQR 20. Compare and interpret.","example_response":"Dataset A: mean > median suggests positive skew (a few high values pull the mean up). The IQR of 12 indicates relatively consistent data. Dataset B: mean ≈ median suggests a roughly symmetric distribution. The IQR of 20 shows greater variability. Despite B having a higher median, A has less spread. The skew in A suggests a few exceptional high values — the median (45) is more representative of the typical value than the mean (52).","common_errors":["Not interpreting the relationship between mean and median as an indicator of skewness","Not explaining what the statistics mean in context"]}]},
  {"concept_id":"MA-KS3-C083","levels":[{"level_number":1,"label":"emerging","description":"Can calculate the mean of a small data set by adding values and dividing by the number of values.","example_task":"Find the mean of: 4, 7, 3, 8, 3.","example_response":"Sum = 4 + 7 + 3 + 8 + 3 = 25. Number of values = 5. Mean = 25/5 = 5.","common_errors":["Dividing by the wrong number","Adding incorrectly"]},{"level_number":2,"label":"developing","description":"Calculates mean, median and mode from ungrouped data and knows when each is appropriate.","example_task":"Find the mean, median and mode of: 3, 5, 7, 7, 8, 10, 15.","example_response":"Mean = (3+5+7+7+8+10+15)/7 = 55/7 = 7.86 (2 d.p.). Median = 7 (middle value of 7 ordered values). Mode = 7 (appears twice). The median and mode both suggest 7 is typical, while the mean is pulled up by the outlier 15.","common_errors":["Not ordering the data before finding the median","Confusing mode with the highest frequency rather than the most common value"]},{"level_number":3,"label":"secure","description":"Calculates the mean from a frequency table and understands the effect of outliers on different averages.","example_task":"Calculate the mean from this frequency table: Score 1 (freq 3), Score 2 (freq 5), Score 3 (freq 8), Score 4 (freq 4).","example_response":"Total frequency = 3+5+8+4 = 20. Σfx = 1(3)+2(5)+3(8)+4(4) = 3+10+24+16 = 53. Mean = 53/20 = 2.65.","common_errors":["Dividing by the number of different scores (4) instead of the total frequency (20)","Not multiplying each score by its frequency"]},{"level_number":4,"label":"mastery","description":"Uses the mean to solve problems algebraically, including finding missing values and understanding the mean as a balance point.","example_task":"The mean of five numbers is 8. Four of the numbers are 5, 7, 9, 11. Find the fifth number.","example_response":"Sum of all five = 5 × 8 = 40. Sum of known four = 5+7+9+11 = 32. Fifth number = 40 - 32 = 8. The mean acts as a balance point — the total deviation above the mean equals the total deviation below.","common_errors":["Not using total = mean × n to find the sum","Dividing by 4 instead of finding what value is needed to make the sum correct"]}]},
  {"concept_id":"MA-KS3-C084","levels":[{"level_number":1,"label":"emerging","description":"Can calculate the range of a data set (largest minus smallest) and understands it measures how spread out the data is.","example_task":"Find the range of: 3, 7, 2, 11, 5.","example_response":"Range = 11 - 2 = 9.","common_errors":["Adding the largest and smallest instead of subtracting","Not identifying the largest and smallest values correctly"]},{"level_number":2,"label":"developing","description":"Understands that range is sensitive to outliers and can compare data sets using both an average and the range.","example_task":"Data set A: 5, 6, 6, 7, 7, 8. Data set B: 2, 6, 6, 7, 7, 50. Compare using mean and range.","example_response":"A: mean = 6.5, range = 3. B: mean = 13, range = 48. The outlier (50) in B dramatically increases both the mean and range. The median would be a better comparison: both have median 6.5, showing the typical values are similar.","common_errors":["Not noticing the outlier in data set B","Concluding B is 'better' because it has a higher mean"]},{"level_number":3,"label":"secure","description":"Calculates and interprets the interquartile range (IQR) as a measure of spread that is resistant to outliers.","example_task":"Find the IQR of: 2, 3, 5, 7, 8, 9, 11, 13, 15.","example_response":"Q1 = 4 (median of lower half: 2,3,5,7). Q3 = 12 (median of upper half: 9,11,13,15). IQR = Q3 - Q1 = 12 - 4 = 8. The IQR tells us the range of the middle 50% of the data.","common_errors":["Including the median in both halves when finding Q1 and Q3","Confusing IQR with the range"]},{"level_number":4,"label":"mastery","description":"Uses IQR to identify outliers (values more than 1.5 × IQR from the quartiles) and evaluates which measure of spread is most appropriate for a given data set.","example_task":"Data: 2, 5, 7, 8, 9, 10, 11, 12, 35. Identify any outliers using the IQR method.","example_response":"Q1 = 6, Q3 = 11.5. IQR = 5.5. Lower fence: Q1 - 1.5(IQR) = 6 - 8.25 = -2.25. Upper fence: Q3 + 1.5(IQR) = 11.5 + 8.25 = 19.75. Value 35 > 19.75, so 35 is an outlier. Range = 33 (heavily influenced by the outlier). IQR = 5.5 (not affected). For this data, the IQR is a more representative measure of spread.","common_errors":["Using 2 × IQR instead of 1.5 × IQR for the fence","Not computing the fences from Q1 and Q3 (using the min and max instead)"]}]},
  {"concept_id":"MA-KS3-C085","levels":[{"level_number":1,"label":"emerging","description":"Can read information from bar charts, pictograms and simple tables.","example_task":"How many pupils chose chocolate in this pictogram? (Each symbol represents 4 pupils, chocolate has 3.5 symbols.)","example_response":"3.5 × 4 = 14 pupils chose chocolate.","common_errors":["Counting symbols without multiplying by the key value","Misreading half-symbols"]},{"level_number":2,"label":"developing","description":"Constructs bar charts, pie charts and frequency tables from raw data, choosing appropriate scales and labels.","example_task":"Draw a bar chart for: Red 8, Blue 12, Green 5, Yellow 3.","example_response":"I draw a bar chart with the y-axis from 0 to 14 (suitable scale), bars of equal width, gaps between bars, and labels on both axes. The bars have heights 8, 12, 5, 3.","common_errors":["Not starting the y-axis at 0 (which distorts the comparison)","Drawing bars of different widths"]},{"level_number":3,"label":"secure","description":"Constructs and interprets pie charts (calculating sector angles), frequency polygons and dual bar charts.","example_task":"In a survey, 90 people were asked their favourite sport: Football 35, Tennis 20, Swimming 25, Other 10. Draw a pie chart.","example_response":"Total = 90. Football: (35/90) × 360° = 140°. Tennis: (20/90) × 360° = 80°. Swimming: (25/90) × 360° = 100°. Other: (10/90) × 360° = 40°. Check: 140+80+100+40 = 360° ✓.","common_errors":["Not dividing by the total before multiplying by 360°","Sector angles not summing to 360° due to rounding errors"]},{"level_number":4,"label":"mastery","description":"Selects the most appropriate representation for a given data type and purpose, and critically evaluates misleading graphs.","example_task":"A newspaper shows a bar chart where the y-axis starts at 90 instead of 0, making a small difference between two political parties look dramatic. Explain the problem and draw a corrected version.","example_response":"Starting the y-axis at 90 exaggerates the visual difference. If Party A has 95% and Party B has 92%, the truncated chart makes it look like A has roughly double B's support. The corrected chart with y-axis from 0 to 100 shows the bars are nearly the same height. This is a common way to mislead with data — the visual impression contradicts the numerical reality. Always check the axis scales before interpreting a graph.","common_errors":["Not noticing the truncated axis","Not explaining how the truncation distorts the visual comparison"]}]},
  {"concept_id":"MA-KS3-C086","levels":[{"level_number":1,"label":"emerging","description":"Understands the difference between discrete data (counted) and continuous data (measured) and can organise data into simple groups.","example_task":"Classify each as discrete or continuous: (a) number of siblings (b) height in cm (c) shoe size (d) time to run 100m.","example_response":"(a) Discrete (counted, whole numbers). (b) Continuous (measured, any value). (c) Discrete (set sizes: 3, 3.5, 4, ...). (d) Continuous (measured, any positive value).","common_errors":["Thinking shoe size is continuous because it has half sizes","Not understanding that continuous data can take any value in a range"]},{"level_number":2,"label":"developing","description":"Constructs grouped frequency tables with appropriate class intervals, ensuring no gaps or overlaps.","example_task":"Group these test scores into a frequency table: 45, 52, 67, 71, 38, 59, 82, 63, 55, 74. Use groups 30-39, 40-49, etc.","example_response":"30-39: 1, 40-49: 1, 50-59: 3, 60-69: 2, 70-79: 2, 80-89: 1. Total: 10 ✓.","common_errors":["Creating overlapping groups (e.g. 30-40, 40-50 where 40 belongs to two groups)","Using groups of different widths without reason"]},{"level_number":3,"label":"secure","description":"Estimates the mean from grouped frequency tables using midpoints and understands why it is an estimate.","example_task":"Estimate the mean from: 0-10 (freq 4), 10-20 (freq 7), 20-30 (freq 5), 30-40 (freq 2).","example_response":"Midpoints: 5, 15, 25, 35. Σfm = 4(5)+7(15)+5(25)+2(35) = 20+105+125+70 = 320. Σf = 18. Estimated mean = 320/18 = 17.8 (1 d.p.). This is an estimate because we assume all values in each group equal the midpoint, which may not be true.","common_errors":["Using class boundaries instead of midpoints","Not recognising the result is an estimate"]},{"level_number":4,"label":"mastery","description":"Works with grouped continuous data to estimate median, draw and interpret cumulative frequency curves and histograms.","example_task":"From a cumulative frequency graph with total 80, estimate the median, Q1 and Q3.","example_response":"Median at 80/2 = 40th value: read across from 40 on the y-axis to the curve, then down to the x-axis. Q1 at 80/4 = 20th value. Q3 at 3(80)/4 = 60th value. The positions are read from the smooth cumulative frequency curve, giving estimates not exact values.","common_errors":["Reading the median at frequency 40 on the x-axis instead of the y-axis","Not using the correct fractions (n/4 and 3n/4) for the quartiles"]}]},
  {"concept_id":"MA-KS3-C087","levels":[{"level_number":1,"label":"emerging","description":"Can plot points on a scatter graph when given paired data and describe the overall trend informally.","example_task":"Plot these pairs on a scatter graph: (2,3), (4,5), (6,8), (8,9), (10,11). What do you notice?","example_response":"The points roughly form an upward line. As x increases, y tends to increase too.","common_errors":["Joining the dots with a line (scatter graphs should show individual points)","Not using appropriate scales on both axes"]},{"level_number":2,"label":"developing","description":"Describes correlation (positive, negative, none) and draws a line of best fit by eye.","example_task":"A scatter graph shows that as temperature increases, ice cream sales increase. Describe the correlation.","example_response":"There is a positive correlation — as temperature increases, ice cream sales tend to increase.","common_errors":["Saying 'temperature causes ice cream sales' (correlation, not causation)","Drawing the line of best fit through extreme points instead of balancing it through the middle"]},{"level_number":3,"label":"secure","description":"Uses a line of best fit to estimate values (interpolation) and understands the limitations of extrapolation.","example_task":"Using a scatter graph and line of best fit, estimate the ice cream sales when the temperature is 25°C (within the data range) and 45°C (outside the data range). Comment on reliability.","example_response":"At 25°C: reading from the line gives approximately 180 sales (interpolation — reliable, within data range). At 45°C: the line suggests about 320 sales, but this is extrapolation (outside the data range) and unreliable — there may be a ceiling effect or other factors that change the relationship at extreme temperatures.","common_errors":["Treating extrapolated values as equally reliable to interpolated ones","Not understanding why extrapolation is risky"]},{"level_number":4,"label":"mastery","description":"Critically evaluates bivariate data analysis, distinguishes correlation from causation, and identifies lurking variables.","example_task":"A study finds a strong positive correlation between shoe size and reading ability in children aged 5-16. Does having big feet help you read better?","example_response":"No — this is a classic spurious correlation. The lurking variable is age: as children get older, both their feet grow (shoe size increases) and their reading improves (more years of practice). Age causes both variables to increase, creating a correlation between them, but there is no causal link between shoe size and reading ability. To test for a genuine relationship, you would need to control for age (compare children of the same age).","common_errors":["Concluding that shoe size causes better reading","Not identifying the confounding variable (age)"]}]}
]
