[
  {
    "concept_id": "MS-KS4-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Recognises that media products use images, words, and sounds to communicate messages. Can identify basic visual techniques such as camera angles and colour choices.",
        "example_task": "Look at a film poster. Identify two visual techniques used and explain what message they communicate.",
        "example_response": "The poster uses a low-angle shot of the main character, making them look powerful and heroic. The colour scheme is mainly red and black, suggesting danger and darkness. Together these communicate that the film is an action thriller with a strong protagonist facing dark forces.",
        "common_errors": [
          "Describing what is shown in the image without analysing the techniques used to create meaning",
          "Identifying a technique (e.g. 'close-up') without explaining what effect or meaning it creates"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Applies semiotic terminology (denotation, connotation, signifier, signified) to analyse media texts. Explains how codes (technical, symbolic, written) work together to construct meaning.",
        "example_task": "Analyse a magazine front cover using semiotic terminology. Identify at least two codes and explain the connotations they create.",
        "example_response": "The magazine cover denotes a celebrity in a white dress against a bright, minimalist background. Connotations: white connotes purity, freshness, and aspiration. Technical codes: high-key lighting eliminates shadows, creating a flawless, idealised appearance. Symbolic codes: the direct gaze (mode of address) creates a sense of personal connection with the reader. Written codes: the cover line 'Her Best Life' anchors the preferred reading — the celebrity embodies an aspirational lifestyle the magazine promises to share. The codes work together to construct a meaning that links the magazine brand with aspiration, beauty, and accessibility.",
        "common_errors": [
          "Using semiotic terms (denotation, connotation) without demonstrating actual understanding — e.g. confusing denotation (literal description) with connotation (associated meanings)",
          "Analysing codes in isolation rather than explaining how they work together to construct a coherent meaning"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Applies semiotic theory (Barthes' mythologies, Peirce's sign types) to analyse how media products naturalise ideological meanings. Evaluates how different audiences may decode signs differently based on cultural context.",
        "example_task": "Analyse a TV advertisement using Barthes' concept of myth. Explain how the advert naturalises a particular ideology.",
        "example_response": "A car advertisement shows a family driving through a countryside landscape at sunset. First-order signification (denotation): a car, a family, a landscape. Second-order signification (connotation): the countryside connotes freedom and escape; the sunset connotes warmth and golden-age nostalgia; the smiling family connotes togetherness and happiness. Barthes' myth: the advert naturalises the ideology that owning this car leads to family happiness and freedom. The car is mythologised from a manufactured commodity into a symbol of the good life. This myth serves capitalist ideology — it transforms a purchasing decision into an emotional/identity choice, making the audience forget the car's environmental impact, manufacturing conditions, and planned obsolescence. The myth works because it draws on deeply embedded cultural associations (family, nature, sunset) that feel natural rather than constructed.",
        "common_errors": [
          "Stopping at connotation without reaching Barthes' concept of myth — how second-order meaning naturalises ideology",
          "Treating Barthes' theory as merely an analytical tool without recognising its critical function — myth analysis reveals how power structures are maintained through media"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Critically evaluates semiotic theory and its limitations, analyses how digital and interactive media challenge traditional models of signification, and applies advanced semiotic analysis to complex, multimodal media texts.",
        "example_task": "Evaluate whether Barthes' semiotic theory, developed for print media in the 1950s-70s, remains useful for analysing social media content in 2026. Consider how user-generated content, algorithms, and interactivity change the nature of signification.",
        "example_response": "Barthes' framework remains partially useful: myths still circulate on social media — Instagram influencer culture mythologises consumption as self-expression, naturalising the ideology that identity is performed through products. However, several aspects of social media challenge Barthes: (1) Polysemy is amplified — social media texts are shared across diverse contexts, and meanings shift radically through memes, recontextualisation, and remix. Barthes' 'preferred reading' is harder to anchor when the producer cannot control the reception context. (2) The producer-consumer distinction collapses — user-generated content means audiences are also producers (prosumers), creating and circulating signs. Barthes assumed a clear encoder-decoder relationship. (3) Algorithmic mediation — the signs a user encounters are selected by algorithms based on behavioural data, meaning the 'text' is personalised. Two users see different versions of the same platform, making generalised semiotic analysis of 'the text' problematic. (4) Ephemerality — Stories, TikTok videos, and live content exist briefly, challenging Barthes' model of stable texts available for close reading. Despite these limitations, the core insight — that media naturalise ideological meanings through apparently innocent signs — is arguably more relevant than ever, precisely because the algorithmic personalisation of social media makes its ideological operations less visible to users.",
        "common_errors": [
          "Either dismissing Barthes entirely because social media is 'different' or applying his framework uncritically without acknowledging the changed media landscape",
          "Not recognising that algorithmic curation is itself a form of signification — the algorithm selects and arranges signs, functioning as an invisible editor"
        ]
      }
    ]
  },
  {
    "concept_id": "MS-KS4-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Recognises that media products show particular groups of people in particular ways, and that some representations may be positive or negative. Can describe how a character or group is presented in a media text.",
        "example_task": "Describe how teenagers are represented in a TV programme you have watched. Is the representation positive or negative?",
        "example_response": "In the programme, teenagers are shown as rebellious, obsessed with their phones, and rude to adults. This is a negative representation because it suggests all teenagers behave this way, when in reality teenagers have diverse interests, responsibilities, and behaviours. The programme uses the stereotype for comedy but it reinforces a narrow view of young people.",
        "common_errors": [
          "Describing what characters do without analysing how they are represented (the techniques used to construct the representation)",
          "Accepting representations as accurate portrayals of real groups rather than recognising them as constructed and selective"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explains how representations are constructed through selection, combination, and anchorage of signs. Analyses stereotypes and counter-stereotypes, and explains how representations can reinforce or challenge dominant ideologies about gender, ethnicity, age, and class.",
        "example_task": "Analyse how gender is represented in two contrasting advertisements. Explain whether each reinforces or challenges gender stereotypes.",
        "example_response": "Advert 1 (perfume): shows a woman in a flowing dress in a romantic setting, passive, waiting to be noticed. Technical codes: soft focus, pink/gold colour palette, slow motion. This reinforces traditional femininity — women as decorative, passive, defined by attractiveness. It aligns with Laura Mulvey's concept of the male gaze — the woman is positioned as an object of visual pleasure. Advert 2 (sportswear): shows women boxing, sweating, and competing with determined expressions. Technical codes: handheld camera, gritty lighting, fast editing. This challenges the passive femininity stereotype by associating women with strength, agency, and physicality. However, it still operates within a consumer framework — 'empowerment' is linked to purchasing the product, raising questions about whether it is genuine representation or the commodification of feminism.",
        "common_errors": [
          "Analysing representations as purely positive or negative without recognising their complexity and contradictions",
          "Not identifying the technical codes (camera, lighting, editing) that construct the representation — representation is not just about what is shown but how it is shown"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Applies representation theories (Hall's encoding/decoding, Gauntlett's identity theory, feminist media theory, post-colonial theory) to analyse how media constructs and circulates representations that serve particular ideological interests.",
        "example_task": "Apply Stuart Hall's theory of representation to analyse how a news programme represents immigration. Consider how the encoding constructs a preferred reading.",
        "example_response": "Hall argued that representation is not a transparent window onto reality but an active process of meaning construction. The news programme encodes immigration through: language choices ('flood,' 'wave,' 'strain on services' — metaphors that frame immigration as threat), visual codes (aerial shots of boats, crowded border footage — dehumanising groups into masses), source selection (politicians and commentators dominate; migrants' own voices are rare or mediated through translation), and narrative structure (immigration is framed as a 'problem' requiring a 'solution' — presupposing that immigration is inherently problematic). The preferred reading positions the audience to see immigration as threatening. However, Hall's model recognises negotiated readings (accepting the framework but noting exceptions — 'there are problems but most immigrants contribute') and oppositional readings (rejecting the framework entirely — recognising the encoding as ideological and analysing the media's role in constructing anti-immigration sentiment). The encoding serves the interests of dominant groups who benefit from framing immigration as a threat to public services rather than addressing structural underfunding.",
        "common_errors": [
          "Applying Hall's theory superficially — stating that 'the media is biased' without conducting detailed analysis of how encoding constructs meaning",
          "Not recognising that oppositional readings are not simply 'disagreeing' but involve identifying and critiquing the ideological framework itself"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Critically evaluates representation theories and their limitations, analyses how digital media and self-representation complicate traditional representation models, and engages with contemporary debates about diversity, authenticity, and the politics of representation.",
        "example_task": "Evaluate whether increased diversity in mainstream media representation (more women, ethnic minorities, LGBTQ+ characters in prominent roles) constitutes meaningful progress or superficial tokenism. Use theoretical frameworks and specific examples.",
        "example_response": "Increased visibility is necessary but not sufficient for meaningful change. Positive examples: Michaela Coel's I May Destroy You centres a Black woman's experience with creative control retained by the subject — this is self-representation, not representation by dominant groups. The difference between representation (being depicted by others) and self-representation (controlling your own image) is critical. However, much 'diversity' is tokenistic: a single ethnic minority character in an ensemble cast whose storylines still centre white characters; 'strong female characters' who perform masculinised strength rather than challenging the value system that defines strength as the only admirable quality; corporate 'rainbow washing' during Pride month with no structural commitment to LGBTQ+ equality. Theoretical analysis: Hall's work suggests that representation is a site of struggle — increasing diversity shifts the terrain but does not resolve it. Hooks argues that representation within existing frameworks (Hollywood genre conventions, patriarchal narrative structures) can only modify, not transform, dominant ideology. Gauntlett's identity theory suggests that diverse media representations do provide alternative identity resources, particularly for young people — seeing yourself represented expands the sense of what is possible. Evaluation: meaningful progress requires changes in who controls production (ownership, commissioning, creative authority), not just who appears on screen. The test is not 'are more diverse faces visible?' but 'are diverse perspectives shaping the stories being told and how they are told?'",
        "common_errors": [
          "Treating increased visibility as automatically progressive without analysing whether the representations challenge or reinforce existing power structures",
          "Not distinguishing between diversity in casting (who appears) and diversity in production (who has creative control and shapes the narrative)"
        ]
      }
    ]
  },
  {
    "concept_id": "MS-KS4-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Recognises that media products belong to genres (horror, comedy, documentary, etc.) and can identify basic conventions such as typical characters, settings, and storylines.",
        "example_task": "Identify the genre of a film from its poster and trailer. List three genre conventions you can identify.",
        "example_response": "The film is a horror. Conventions: dark, desaturated colour palette suggesting danger; an isolated house in the woods (typical horror setting); a tagline that creates mystery and fear ('They're already inside'). The poster also uses a cracked or distorted font suggesting something breaking or corrupted.",
        "common_errors": [
          "Identifying genre without specifying which conventions signal it — just saying 'it looks scary' is insufficient",
          "Treating genres as fixed categories with rigid rules rather than flexible frameworks with recognisable patterns"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Analyses how genre conventions are used, adapted, and subverted in specific media products. Explains narrative structure using frameworks such as Todorov's equilibrium theory and Propp's character functions.",
        "example_task": "Apply Todorov's narrative theory to the plot of a film you have studied. Identify each stage and explain how the film uses or adapts this structure.",
        "example_response": "Film: Get Out (2017, Jordan Peele). Equilibrium: Chris and Rose are a happy interracial couple preparing to visit Rose's family — everything appears normal. Disruption: at the family gathering, Chris notices disturbing behaviour from the Black servants and other guests (vacant stares, strange comments). Things are wrong but not yet explained. Recognition: Chris discovers the family's secret — they are transplanting white brains into Black bodies, exploiting Black people for their physical attributes. Attempt to restore equilibrium: Chris fights to escape the house, overcoming multiple family members. New equilibrium: Chris escapes, but the new equilibrium is fundamentally different from the old — his trust is shattered, and the horror of systemic racism has been literalised. The film follows Todorov's structure but subverts genre expectations: the 'disruption' is not a supernatural invasion but the revelation of an existing system of exploitation — the horror was always there, concealed by polite appearances.",
        "common_errors": [
          "Forcing a narrative into Todorov's model without acknowledging where the text departs from or complicates the theory",
          "Describing the plot sequentially rather than analysing how the narrative structure creates meaning and audience response"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Applies genre theory (Neale's repetition and difference, Altman's semantic/syntactic approach) to analyse how genres evolve, hybridise, and are shaped by industrial and cultural contexts. Evaluates how narrative conventions construct audience positioning and ideological meaning.",
        "example_task": "Analyse how a contemporary media product uses genre hybridity. Apply Neale's theory of repetition and difference to explain its appeal.",
        "example_response": "Stranger Things (Netflix, 2016-) hybridises science fiction, horror, coming-of-age drama, and 1980s nostalgia. Neale argued that genres succeed through a balance of repetition (familiar conventions that set audience expectations) and difference (enough novelty to maintain interest). Repetition: the show draws heavily on 1980s genre conventions — the Spielbergian suburban setting, the Carpenter-esque synth score, the King-inspired small-town supernatural threat. These familiar elements create nostalgia and generic recognition. Difference: the show hybridises genres that were typically separate — the coming-of-age emotional drama (Stand By Me) is integrated with body horror (The Thing) and government conspiracy thriller (E.T.). The child protagonists navigate both the Upside Down and puberty simultaneously — the monster functions as both literal threat and metaphor for adolescent anxiety. Industrial context: Netflix's algorithm-driven commissioning favours genre hybridity because it appeals to multiple audience segments simultaneously — horror fans, nostalgic Gen-X viewers, and young adult audiences all find entry points. The hybridity is not just creative but commercially strategic.",
        "common_errors": [
          "Describing genre mixing without analysing why specific genres are combined and what meaning the combination creates",
          "Not connecting genre theory to industrial context — genres exist within media industries that shape their production and distribution"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Critically evaluates genre and narrative theory, analyses how digital media, transmedia storytelling, and audience participation challenge traditional models, and engages with debates about the cultural and ideological functions of genre.",
        "example_task": "Evaluate whether traditional genre and narrative theories (Todorov, Propp, Neale) remain useful for analysing contemporary digital media such as interactive narratives, video games, and social media storytelling.",
        "example_response": "Traditional theories face significant challenges: Todorov's linear equilibrium-disruption model assumes a single, fixed narrative arc — interactive media (Bandersnatch, video games) offer branching narratives where the audience determines the path. There is no single 'new equilibrium' but multiple possible outcomes. Propp's character functions assume a clear protagonist-antagonist structure — in open-world games (Skyrim, Breath of the Wild), the player constructs their own narrative from a system of possibilities, and character roles are fluid. However, the theories retain value at a deeper level: even branching narratives typically involve disruptions that require resolution (the player must still 'defeat the boss' or 'solve the mystery'). Game designers use Proppian structures within quest design — each quest has a dispatcher, a villain, a helper. Neale's repetition and difference applies directly to franchise media and serialised content — each Marvel film balances generic familiarity with enough novelty to justify its existence. For social media storytelling (Instagram Stories, TikTok narratives), Todorov's micro-structure operates within individual posts (setup-complication-resolution in 60 seconds), and genre conventions are algorithmically reinforced — TikTok's For You page clusters content by recognisable genre patterns. The theories need updating rather than replacing: the fundamental insight — that narratives create meaning through structured patterns of expectation and surprise, and that genres are cultural frameworks for organising meaning — remains valid even as the delivery mechanisms become interactive and fragmented.",
        "common_errors": [
          "Dismissing traditional theories entirely because digital media 'is different' — the core structures often persist in adapted forms",
          "Not recognising that algorithmic content curation is a new form of genre gatekeeping that shapes what audiences encounter"
        ]
      }
    ]
  },
  {
    "concept_id": "MS-KS4-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Recognises that different people respond to the same media product in different ways, and that media producers create products with a particular audience in mind (target audience).",
        "example_task": "Identify the target audience for a media product of your choice. Explain two ways you can tell who the product is aimed at.",
        "example_response": "The target audience for this gaming magazine is males aged 14-25. Evidence: the cover features a male character from a popular action game (appealing to young male gamers), and the language is informal and uses gaming slang ('epic loot,' 'boss fight'). The colour scheme of dark blue and neon green is associated with gaming culture.",
        "common_errors": [
          "Defining target audience only by age and gender without considering psychographic factors (interests, lifestyle, values)",
          "Assuming they are the target audience because they personally like the product"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Applies audience theories to explain responses to media: uses and gratifications theory (Blumler and Katz — why audiences consume media), Hall's reception theory (preferred, negotiated, oppositional readings). Segments audiences by demographics and psychographics.",
        "example_task": "Apply uses and gratifications theory to explain why different audiences might watch a reality TV programme such as Love Island.",
        "example_response": "Blumler and Katz identified four needs that media fulfils: (1) Information/surveillance — viewers learn about relationships, social dynamics, and current fashion/beauty trends. (2) Personal identity — viewers compare their own relationships and values to those on screen, reinforcing or questioning their identity. (3) Social interaction — Love Island is designed for 'second screen' viewing; audiences watch together, discuss on social media, and participate in voting, creating shared social experiences. (4) Entertainment/escapism — the dramatic situations, attractive setting, and emotional storylines provide diversion from everyday life. Different audience segments prioritise different gratifications: younger viewers may emphasise social interaction (memes, group chats); older viewers may watch ironically for entertainment while critiquing the values displayed.",
        "common_errors": [
          "Applying uses and gratifications theory mechanically (listing all four categories) without considering which gratifications are most relevant for the specific text and audience",
          "Not recognising that the same viewer may watch for multiple gratifications simultaneously, and that these may change over time"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses how media producers construct audience positioning through technical and narrative codes. Evaluates the relationship between media products and their audiences, considering how audiences are targeted, addressed, and measured. Applies reception theory to analyse how audience context shapes interpretation.",
        "example_task": "Analyse how a news website uses audience positioning techniques and explain how Hall's reception theory accounts for different audience responses to the same content.",
        "example_response": "The news website uses multiple positioning techniques: headline framing ('Crisis deepens as...' — encoding urgency and negativity), image selection (a crowded, chaotic photograph anchored by a caption emphasising disorder), pull quotes from authority figures (politicians, experts) that support the article's preferred reading, and comment sections that algorithmically promote engagement (controversial/emotional comments rise to the top). Hall's reception theory: the preferred reading accepts the framing — the situation is a crisis requiring the solution the article implies. A negotiated reading accepts the general framework but questions specific elements — perhaps agreeing there is a problem but disagreeing with the proposed solution or noting that other perspectives are missing. An oppositional reading decodes the text against its intended meaning — recognising the framing as ideologically motivated, questioning why this story is prominent today, and identifying whose interests the preferred reading serves. Audience context shapes decoding: readers with direct experience of the issue may produce oppositional readings because they have information that contradicts the encoding.",
        "common_errors": [
          "Treating Hall's three reading positions as fixed audience types rather than as positions any viewer might adopt depending on the text and context",
          "Not identifying the specific textual mechanisms that construct the preferred reading before discussing how audiences might decode it"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Critically evaluates audience theories and their limitations in the context of digital media, where audiences are simultaneously consumers, producers, and data sources. Analyses how algorithmic personalisation, filter bubbles, and platform economics reshape the audience-media relationship.",
        "example_task": "Evaluate whether traditional audience theories (uses and gratifications, reception theory, effects models) are adequate for understanding audience behaviour in the age of algorithmic media curation.",
        "example_response": "Traditional theories assume a relatively stable text-audience relationship: a media product is produced, distributed, and consumed, with audience agency expressed through interpretation (Hall) or selective consumption (Blumler and Katz). Algorithmic media fundamentally changes this: (1) The 'text' is personalised — two users see different versions of YouTube, TikTok, or Google News, so there is no single 'text' to decode. Reception theory assumes a shared text; algorithmic media fragments this assumption. (2) Uses and gratifications assumed conscious choice — 'I watch this because...' Algorithmic recommendation operates below conscious awareness; users consume content they did not seek, driven by behavioural patterns they may not recognise. The gratification is optimised by the algorithm, not chosen by the user. (3) The effects debate (hypodermic needle vs. active audience) is complicated by scale and repetition — even if each individual text has limited effect (active audience position), algorithmic exposure to thousands of similar texts creates cumulative ideological saturation that resembles the hypodermic model at population level. (4) Audience labour — in digital media, audiences produce value (data, content, engagement metrics) that is extracted by platforms. Audiences are not just consumers but products sold to advertisers. However, the core theoretical insights survive: people still have needs that media fulfils (uses and gratifications), people still decode media differently based on their social position (Hall), and media still constructs reality rather than reflecting it (semiotics). What changes is the scale, speed, personalisation, and invisibility of these processes. New theoretical frameworks (Zuboff's surveillance capitalism, Beer's work on algorithmic culture) supplement rather than replace traditional media theory.",
        "common_errors": [
          "Treating algorithmic curation as neutral technology rather than as a form of editorial control with ideological implications",
          "Abandoning traditional audience theory entirely rather than recognising that its core insights persist in modified forms within the algorithmic environment"
        ]
      }
    ]
  },
  {
    "concept_id": "MS-KS4-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Recognises that media products are made by companies to make money, and that different media industries exist (film, TV, music, publishing, gaming, social media). Knows that advertising is a key source of revenue.",
        "example_task": "Explain two ways a TV channel makes money from a popular programme.",
        "example_response": "The TV channel makes money by selling advertising time during commercial breaks — popular programmes attract large audiences, so advertisers pay more for these slots. The channel can also sell the programme to streaming services or overseas broadcasters for additional revenue (distribution rights).",
        "common_errors": [
          "Not understanding that 'free' media (commercial TV, social media, free newspapers) is funded by advertising revenue",
          "Assuming all media revenue comes from direct consumer payment (subscriptions, ticket sales)"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describes different media ownership models (public service, commercial, independent), explains how ownership affects content, and identifies how media industries generate revenue through multiple streams (advertising, subscription, licensing, merchandising).",
        "example_task": "Compare how the BBC and ITV are funded and explain how their different funding models affect the content they produce.",
        "example_response": "The BBC is funded by the licence fee (£159/year per household, 2024) and is a public service broadcaster with a remit to inform, educate, and entertain. This means it must produce content for all audiences including minority interests, and cannot show adverts during programmes. ITV is commercially funded through advertising revenue, so it must attract large audiences to charge high advertising rates. This encourages ITV to produce popular, mainstream entertainment (soaps, reality TV, talent shows) that maximises ratings. The BBC can take more creative risks (niche documentaries, experimental drama) because its funding is not directly linked to ratings. However, the BBC still faces pressure to justify the licence fee by demonstrating wide reach.",
        "common_errors": [
          "Stating the BBC 'has no commercial pressures' — it must still justify the licence fee through audience reach and perceived value",
          "Not recognising that ITV also has regulatory obligations (Ofcom requires news provision and regional programming)"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses how media ownership concentration, conglomeration, and convergence shape the media landscape. Evaluates the role of regulation (Ofcom, BBFC, ASA, IPSO) in balancing industry freedom with public interest. Applies this understanding to specific case studies.",
        "example_task": "Analyse how media convergence and conglomerate ownership affect the range and diversity of media products available to audiences. Use a specific company as an example.",
        "example_response": "Disney exemplifies media conglomeration: it owns film studios (Walt Disney, Pixar, Marvel, Lucasfilm, 20th Century Studios), streaming (Disney+), TV networks (ABC, ESPN, National Geographic), theme parks, and extensive merchandising operations. Convergence: Disney content flows across all platforms — a Marvel film releases theatrically, then moves to Disney+, generates TV spin-offs, video games, theme park attractions, and merchandise. This cross-platform synergy maximises revenue from each intellectual property. Impact on diversity: positive — Disney's resources fund high-production-value content that smaller companies cannot afford (Pixar's animation quality, Marvel's VFX). Negative — Disney's dominance means it shapes cultural narratives at an unprecedented scale. Independent filmmakers struggle for screen space. Acquisitions reduce competition (buying Fox eliminated a major rival). Content decisions are driven by global franchise potential — films must work in every market, leading to safe, formulaic narratives that avoid culturally specific or politically controversial content. Regulation: Ofcom and competition authorities (CMA) can block mergers but struggle to keep pace with global digital conglomerates that operate across jurisdictions.",
        "common_errors": [
          "Describing conglomeration without analysing its specific effects on the diversity and range of content available to audiences",
          "Not recognising the tension between economies of scale (more resources for production) and concentration of cultural power (fewer distinct voices)"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Critically evaluates how digital platform economics, data monetisation, and global media flows are transforming industry structures. Analyses the political economy of media — who controls production, distribution, and the flow of information, and whose interests this serves.",
        "example_task": "Evaluate the claim that social media platforms are 'neutral technology companies' rather than media companies with editorial power. Consider the regulatory implications.",
        "example_response": "Platforms (Meta, Google/YouTube, TikTok) claim to be neutral intermediaries — they host content but do not create it, and therefore should not bear the editorial responsibility of traditional media companies. This claim is unsustainable for several reasons: (1) Algorithmic curation is editorial — the algorithm decides what appears in feeds, how prominently, and in what order. This is functionally equivalent to an editor deciding what goes on the front page. The algorithm's optimisation for engagement systematically amplifies sensational, emotional, and divisive content. (2) Content moderation is editorial — platforms make daily decisions about what is permitted and what is removed, applying rules that function as editorial guidelines. These decisions shape public discourse. (3) Economic model creates editorial incentives — advertising revenue depends on engagement time, which incentivises the algorithm to maximise attention regardless of content quality or social impact. The 'neutral technology' framing serves platforms' commercial interests: editorial responsibility brings regulation, liability, and content obligations that reduce profitability. Current regulation (Online Safety Act 2023) begins to treat platforms as publishers with duty of care, but enforcement is challenged by scale (Meta moderates billions of posts daily), jurisdictional complexity (global platforms, national regulations), and the opacity of algorithmic decision-making. The fundamental question is democratic: unelected technology companies with greater reach than any traditional media institution are shaping public discourse through opaque algorithmic decisions with no editorial accountability. Whether the regulatory response should be content-specific (banning harmful content) or structural (breaking up monopolies, requiring algorithmic transparency) remains the central debate.",
        "common_errors": [
          "Accepting the 'neutral platform' claim at face value without analysing the editorial function of algorithmic curation",
          "Proposing regulation without considering the practical challenges — scale, global jurisdiction, and the difficulty of defining 'harmful' content without restricting legitimate speech"
        ]
      }
    ]
  },
  {
    "concept_id": "MS-KS4-C006",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Recognises that media products exist within historical, social, and cultural contexts, and that media from different times looks and sounds different because society has changed.",
        "example_task": "Compare a 1960s TV advert with a modern one for the same type of product (e.g. a cleaning product). Describe two differences and explain why they have changed.",
        "example_response": "The 1960s advert shows a housewife in an apron cleaning happily, with a male voiceover telling her the product is the best. The modern advert shows a man and woman sharing cleaning tasks, with a conversational tone. Difference 1: gender representation has changed because attitudes to women's roles have shifted — women are no longer assumed to be solely responsible for housework. Difference 2: the authoritative male voiceover has been replaced by a more casual, peer-to-peer tone, reflecting changes in how audiences respond to advertising — modern audiences are more sceptical of being 'told' what to buy.",
        "common_errors": [
          "Describing differences without explaining the social and cultural reasons behind the changes",
          "Judging historical media by modern standards without understanding the context in which it was produced"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explains how historical context (social attitudes, technology, politics, economics) shapes media production and reception. Analyses how the same media product may be interpreted differently by audiences from different periods or cultures.",
        "example_task": "Explain how the social and political context of the 1970s shaped the content of punk music magazines such as Sniffin' Glue.",
        "example_response": "1970s context: economic recession, high unemployment (especially youth), industrial strikes, and a sense that the establishment had failed young people. Punk culture rejected mainstream values. Sniffin' Glue reflected this: DIY production (photocopied, handwritten, deliberately rough) rejected the professionalism of mainstream music press — anyone could make a zine, democratising media production. The content was confrontational, politically engaged, and anti-establishment. The crude aesthetic was not a limitation but an ideological statement — slick production was associated with the corporate music industry that punk opposed. Technologically, cheap photocopying made self-publication possible for the first time. The magazine could not exist without both the cultural context (youth alienation providing the motivation) and the technological context (affordable reproduction providing the means).",
        "common_errors": [
          "Treating the DIY aesthetic as simply 'low quality' without understanding its ideological significance",
          "Analysing historical media products in isolation from the social, political, and technological conditions of their production"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses how media products both reflect and shape their historical and cultural context. Evaluates how media contributes to social change and how social change transforms media. Compares media products across different cultural contexts.",
        "example_task": "Analyse how British social realist filmmaking (Ken Loach, Andrea Arnold) both reflects and shapes public understanding of poverty and class in the UK.",
        "example_response": "Social realism in British cinema has a tradition from the 1960s kitchen sink dramas to Loach's contemporary work (I, Daniel Blake, 2016; Sorry We Missed You, 2019). These films reflect material conditions: zero-hours contracts, benefits sanctions, food banks, and the gig economy are depicted with documentary-level accuracy. Technical codes reinforce authenticity: handheld camera, natural lighting, non-professional actors, location shooting in working-class communities. However, these films do not merely reflect reality — they shape public discourse. I, Daniel Blake directly influenced parliamentary debates about Universal Credit. The film constructs a narrative that positions the welfare system as cruel and the claimant as dignified, creating audience sympathy through narrative identification. This is an ideological choice — a different filmmaker could construct a narrative that positions benefit claimants differently using different codes. The cultural context shapes reception: in the UK, where audiences share the welfare state context, the film is read as political critique. Internationally, it may be read more as human drama, losing the specific policy critique. The reflexive relationship between media and society means social realist films do not just document social conditions but actively participate in constructing public understanding of them.",
        "common_errors": [
          "Treating social realism as 'just showing reality' without analysing the constructed nature of the representation — all film involves selection and framing",
          "Not recognising that reception varies with cultural context — a film's meaning is not fixed but changes depending on the audience's relationship to the subject matter"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Critically evaluates how media products are embedded in complex webs of historical, social, cultural, political, and economic contexts. Analyses the circulation of media products across cultural boundaries, the politics of cultural production, and how historical media analysis informs understanding of contemporary media landscapes.",
        "example_task": "Evaluate the extent to which understanding the historical development of media industries is essential for analysing contemporary media products. Use specific examples spanning different periods.",
        "example_response": "Historical understanding is not optional background but essential analytical context. Three examples: (1) Understanding contemporary debates about 'fake news' requires knowledge of propaganda history — the techniques used by social media disinformation campaigns (emotional manipulation, repetition, tribal identity reinforcement) directly parallel techniques identified in wartime propaganda analysis (Bernays, Chomsky's propaganda model). Without this history, contemporary media literacy lacks theoretical depth. (2) The current streaming wars (Netflix vs. Disney+ vs. Amazon) repeat the structural dynamics of the Hollywood studio system (1920s-40s) — vertical integration, exclusive content, subscription models, and the tension between creative diversity and corporate control. Understanding how antitrust action broke up the studio system (Paramount decree, 1948) informs analysis of whether similar intervention is needed for streaming monopolies. (3) Social media influencer culture reproduces the dynamics of 1950s-60s celebrity endorsement, but with the crucial difference that the commercial relationship is less visible — influencers present sponsored content as personal recommendation, making the advertising function harder for audiences to identify. Historical analysis reveals that each 'new' media phenomenon typically reconfigures existing power dynamics rather than creating entirely new ones. The continuities are as important as the disruptions. Media studies that focuses only on the contemporary misses the patterns that historical analysis reveals.",
        "common_errors": [
          "Treating historical media as irrelevant to contemporary analysis — 'that was then, this is now'",
          "Making historical comparisons that are too superficial — the parallels must be specific and analytically useful, not just vague similarities"
        ]
      }
    ]
  }
]
