[
  {
    "concept_id": "MU-KS3-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can play simple pieces with basic accuracy in a group setting, but performance lacks fluency, expression or awareness of other players.",
        "example_task": "Perform the melody of 'Ode to Joy' on your instrument. Play it at a steady tempo with correct notes.",
        "example_response": "The melody is played with correct pitches throughout, at a steady tempo maintained from start to finish. The rhythm is accurate, with crotchets and minims given their correct duration. Notes are clearly articulated rather than blurred together.",
        "common_errors": [
          "Rushing through the piece rather than maintaining a steady pulse",
          "Playing correct notes but with no attention to rhythm or note duration"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Performs with reasonable accuracy and fluency, begins to add dynamic variation and phrasing, and shows awareness of other parts in ensemble performance.",
        "example_task": "Perform this 8-bar melody with the following dynamic markings: bars 1-4 piano (quiet), bars 5-6 crescendo, bars 7-8 forte (loud). Explain why the dynamics might change at bar 5.",
        "example_response": "Performance demonstrates clear distinction between piano and forte sections, with a gradual crescendo over bars 5-6 rather than an abrupt change. The dynamics change at bar 5 because the melody rises to its highest pitch and the rhythm becomes more urgent — the crescendo supports the musical tension building towards the climax in bar 7, where the forte arrival feels like a resolution of that tension.",
        "common_errors": [
          "Playing at one volume throughout without dynamic contrast",
          "Making the crescendo as an abrupt jump rather than a gradual increase"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Performs confidently in both solo and ensemble contexts with accuracy, fluency and expression, adapts technique and phrasing to different musical styles, and listens and responds to other performers.",
        "example_task": "Perform the same piece in two different styles: first as a classical piece with legato phrasing, then as a jazz piece with swing rhythm. Explain what you changed and why.",
        "example_response": "Classical version: I played with smooth, connected (legato) phrasing, even dynamics within each phrase with a slight swell towards the peak, and precise rhythmic values as written. The tone was clean and controlled. Jazz version: I swung the quavers (playing them as long-short pairs rather than evenly), added a slight accent on beats 2 and 4 (the backbeat), used a warmer, more relaxed tone, and added a small slide between some notes for a bluesy feel. The classical version communicates through precise control of the written notes; the jazz version communicates through rhythmic feel, tonal colour and subtle departures from the written score.",
        "common_errors": [
          "Playing both versions identically, showing no stylistic differentiation",
          "Swinging the rhythm without also adjusting articulation, tone and accentuation"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Performs with interpretive depth, communicating musical character and structure to an audience, demonstrates sophisticated ensemble musicianship, and can discuss performance choices using musical terminology.",
        "example_task": "You are preparing to perform a piece for an audience. Describe three specific interpretive decisions you have made and how each will affect what the audience hears and feels.",
        "example_response": "Decision 1: I will take a slight ritardando (slowing down) in bar 12 before the return of the main theme in bar 13. This signals to the audience that something important is about to happen — the familiar theme returning after the contrasting middle section. The brief pause creates anticipation. Decision 2: In the minor section (bars 8-12), I will use a thinner, more focused tone with less vibrato than in the major sections. The reduced warmth of tone reinforces the shift from major (bright, open) to minor (darker, more introspective), making the harmonic change audible through timbre as well as pitch. Decision 3: I will make the final phrase slightly softer than the rest of the piece, ending pianissimo rather than forte. This creates a reflective, contemplative ending rather than a triumphant one — which I believe suits the gentle, lyrical character of the piece better than a loud conclusion would.",
        "common_errors": [
          "Describing technical decisions (fingering, breathing) rather than interpretive decisions that affect musical communication",
          "Not explaining how each decision will affect the listener's experience"
        ]
      }
    ]
  },
  {
    "concept_id": "MU-KS3-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can identify whether music sounds 'happy' (major) or 'sad' (minor) and recognise a simple chord change, but cannot name scales, keys or explain harmonic function.",
        "example_task": "Listen to these two short pieces. One is in a major key and one is in a minor key. Which is which, and how can you tell?",
        "example_response": "Piece A is in a major key because it sounds bright and cheerful — the melody uses notes that create a positive, uplifting feeling. Piece B is in a minor key because it sounds darker and more serious — there is a sense of tension or sadness in the intervals between the notes.",
        "common_errors": [
          "Relying only on tempo (fast = happy, slow = sad) rather than listening to the tonality itself",
          "Not being able to distinguish major and minor when both pieces are at the same tempo"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Can play major and minor scales, identify primary chords (I, IV, V), and use simple chord progressions as a framework for composition and improvisation.",
        "example_task": "Play a C major scale and a C minor scale. Then play a I-IV-V-I chord progression in C major. Name the three chords.",
        "example_response": "C major scale: C D E F G A B C. C natural minor scale: C D Eb F G Ab Bb C — the 3rd, 6th and 7th notes are flattened compared to the major scale, which gives the darker sound. The I-IV-V-I progression in C major uses: chord I = C major (C, E, G), chord IV = F major (F, A, C), chord V = G major (G, B, D), returning to chord I = C major. These are called primary chords because they contain all the notes of the scale between them.",
        "common_errors": [
          "Playing the minor scale with incorrect flattened notes",
          "Naming the chords by letter only (C, F, G) without understanding their functional Roman numeral designations"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Understands the harmonic function of chords, uses modal scales in composition, hears and identifies harmonic movement aurally, and explains how tonality creates emotional and structural effects.",
        "example_task": "Compose an 8-bar melody using the Dorian mode. Explain what makes Dorian different from natural minor and describe the character it creates.",
        "example_response": "The Dorian mode on D uses the notes D E F G A B C D. It is similar to D natural minor (D E F G A Bb C D) but with a raised 6th note — B natural instead of Bb. This raised 6th gives Dorian a distinctive character: it has the minor quality of the flattened 3rd (F natural) but the raised 6th adds a hint of brightness that natural minor lacks, creating an ambiguous, bittersweet mood. My melody emphasises the B natural in bar 4, placing it on a strong beat against the F natural to highlight the characteristic Dorian interval. Dorian is common in folk music (Scarborough Fair), jazz and film scores because its neither-fully-major-nor-fully-minor quality creates emotional complexity.",
        "common_errors": [
          "Writing a composition that sounds like natural minor because the characteristic raised 6th is not emphasised",
          "Confusing the Dorian mode with other modes such as Aeolian (natural minor) or Mixolydian"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Analyses sophisticated harmonic language in real music, understands how composers use tonality for structural and expressive purposes, and applies advanced harmonic knowledge in their own composition and improvisation.",
        "example_task": "Listen to this extract from a piece that modulates from the home key to a related key. Identify where the modulation occurs and explain what harmonic device the composer uses to achieve it.",
        "example_response": "The piece begins in G major. At bar 8, I hear a new note — C sharp — which does not belong to G major. This C sharp functions as a leading note to D, signalling a modulation to D major (the dominant key). The composer uses a pivot chord: the chord of D major in bar 7 functions as chord V in G major and simultaneously as chord I in D major. The modulation creates a sense of arriving somewhere new — the music brightens because D major is a fifth higher. Modulating to the dominant is the most common modulation in tonal music because the two keys share all but one note, making the transition smooth. The return to G major later uses an opposite pivot chord technique, with the G chord functioning as IV in D and I in G.",
        "common_errors": [
          "Not identifying the specific note or chord that signals the modulation",
          "Confusing modulation (changing key) with merely using an accidental (a chromatic note within the same key)"
        ]
      }
    ]
  },
  {
    "concept_id": "MU-KS3-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Can create a short musical idea (a melody or rhythm), but does not develop or extend it beyond initial statement — compositions tend to be short, repetitive or structureless.",
        "example_task": "Compose a 4-bar melody using notes from the C major scale. It should have a clear beginning and ending.",
        "example_response": "The melody begins on C (the tonic, establishing the key), rises stepwise through D and E, leaps to G in bar 2 (creating interest), then descends through F, E, D in bar 3 before ending on C in bar 4 (returning home to the tonic, giving a sense of completion). The rhythm uses a mix of crotchets and quavers to create rhythmic variety.",
        "common_errors": [
          "Ending on a note other than the tonic, giving no sense of completion",
          "Using only one rhythmic value throughout (e.g., all crotchets), creating a monotonous rhythm"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Uses compositional devices such as repetition, sequence and contrast to develop musical ideas, and organises compositions into recognisable sections with some structural logic.",
        "example_task": "Take your 4-bar melody and extend it to 8 bars using the technique of sequence (repeating the melody at a different pitch level).",
        "example_response": "Bars 1-4: original melody starting on C (C D E G F E D C). Bars 5-8: the same melodic pattern starting on G, a fifth higher (G A B D C B A G). This is a sequence because the intervals and rhythm are identical but everything is transposed up by a fifth. The sequence creates a sense of development — the musical idea has moved forward rather than simply being repeated. The higher pitch level adds energy and intensity before the piece could return to the original level for a final statement.",
        "common_errors": [
          "Repeating the melody at exactly the same pitch rather than transposing it (this is repetition, not sequence)",
          "Changing the rhythm or intervals when transposing, losing the sequential pattern"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Composes with command of multiple devices, uses form deliberately (binary, ternary, rondo), and makes purposeful choices about texture, dynamics and instrumentation to achieve specific effects.",
        "example_task": "Compose a piece in ternary form (ABA) where section A uses an ostinato and section B uses imitation. Explain how the contrast between sections creates musical interest.",
        "example_response": "Section A: A repeating bass ostinato (C-G-Ab-G, 4 beats) creates a stable, hypnotic foundation. Over this, a melody enters on keyboard, building gradually. The ostinato gives section A a grounded, persistent character. Section B: The ostinato stops. Instead, a new melody is introduced on one instrument and then imitated (echoed) a bar later by a second instrument, a fifth higher. The imitation creates a conversational texture — two voices interacting rather than one voice over a static pattern. This contrasts with A's simplicity. Section A returns: the familiar ostinato reappears, but now I add a countermelody derived from the imitation in section B, so the return is enriched by what happened in the middle section. The contrast works because section A is static and layered while section B is linear and dialogic — the shift in texture and approach gives the listener something genuinely new before the satisfying return of familiar material.",
        "common_errors": [
          "Writing three sections without genuine contrast between A and B",
          "Not connecting the return of section A to what happened in section B"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Composes with sophistication, combining multiple devices fluently, creating pieces with emotional arc and structural coherence, and explaining compositional decisions with reference to the musical effects intended.",
        "example_task": "Analyse a compositional device used by a professional composer in a piece you have studied. Then demonstrate how you have applied a similar technique in your own composition.",
        "example_response": "In Holst's 'Mars' from The Planets, the opening uses a 5/4 ostinato in the strings (col legno — hitting the strings with the wood of the bow) that creates a relentless, mechanical pulse suggesting a military march. Holst builds tension by layering increasingly aggressive melodic fragments over this unchanging rhythmic foundation. The contrast between the static ostinato and the developing upper parts creates extraordinary cumulative intensity. In my own composition, I applied a similar technique: I wrote a 7/8 ostinato on a bass guitar (an irregular metre that creates unease, like Holst's 5/4) and layered three successive melodic entries over it, each higher and louder than the last. I used augmentation in the final entry — stretching the rhythm to twice its original length — so the melody seems to struggle against the relentless bass, creating a sense of conflict between the parts. The technique works because the listener latches onto the ostinato as 'ground' and experiences the melodic additions as 'figure' — the growing complexity creates tension without losing the structural anchor.",
        "common_errors": [
          "Describing the professional technique without demonstrating how it was applied in their own work",
          "Applying the technique mechanically without adapting it to serve their own musical intentions"
        ]
      }
    ]
  },
  {
    "concept_id": "MU-KS3-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Has limited experience of music from different cultures and tends to evaluate unfamiliar music using the standards of familiar Western pop or classical genres.",
        "example_task": "Listen to this piece of West African drumming. Describe two musical features you can hear.",
        "example_response": "I can hear multiple drums playing different rhythmic patterns at the same time — some play fast repeated patterns while others play slower, heavier beats. The rhythms interlock with each other, creating a complex combined pattern that no single drummer is playing alone.",
        "common_errors": [
          "Describing the music as 'just drums' without identifying the complex rhythmic relationships",
          "Judging it as 'simple' because it has no melody or harmony in the Western sense"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Can identify characteristic features of several world music traditions and understands that different traditions use different musical systems and serve different cultural functions.",
        "example_task": "Compare the musical characteristics of Indian classical music (raga) and Western classical music. Identify two similarities and two differences.",
        "example_response": "Similarities: both traditions require years of dedicated study and practice; both use improvisation within a structured framework. Differences: Western classical music uses a 12-note chromatic scale divided into major and minor keys, while Indian classical music uses ragas — melodic frameworks with specific ascending and descending note patterns, characteristic phrases and associated moods, often using microtones not found in Western music. Western classical music uses vertical harmony (chords), while Indian classical music is primarily melodic and rhythmic, using a drone (tambura) rather than chord progressions. Western performances follow a written score; Indian performances are largely improvised within the raga's rules.",
        "common_errors": [
          "Describing Indian music as 'not having structure' because it is improvised, not recognising the raga system as a sophisticated structural framework",
          "Treating Western music as the norm and Indian music as the deviation"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Studies world music traditions in depth, connecting musical features to cultural context and function, and uses diverse musical traditions as creative resources in their own composition and performance.",
        "example_task": "Explain how gamelan music from Indonesia is structured and why the Western concept of 'composer' does not apply to it in the same way.",
        "example_response": "Gamelan is an ensemble of predominantly metallic percussion instruments (metallophones, gongs, drums) playing interlocking patterns in a layered texture. The music is organised in cycles defined by the largest gong — the gong ageng marks the end of each cycle, and all other instruments relate to this cyclic structure. Different instruments play at different densities: the large, low instruments play slowly (marking the structural points), while the smaller, higher instruments play fast, elaborated versions of the core melody. The concept of a single 'composer' does not apply because the music is collectively created within a traditional framework. Individual players elaborate their part according to learned conventions, and the ensemble's collective sound is the composition. There is no score in the Western sense — knowledge is transmitted orally and through practice. The communal nature of gamelan reflects the Javanese cultural value of gotong royong (mutual cooperation), where the group is more important than the individual.",
        "common_errors": [
          "Describing gamelan using Western terms (melody, harmony, rhythm) without explaining the culture-specific structural concepts",
          "Not connecting the musical structure to the cultural values it reflects"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Critically evaluates how world music is presented and consumed in Western contexts, understands issues of cultural appropriation versus appreciation, and engages with diverse traditions on their own terms.",
        "example_task": "A Western pop artist samples a traditional Aboriginal Australian song in their hit single. Discuss the ethical issues this raises, using your knowledge of music and cultural context.",
        "example_response": "Aboriginal Australian music is not entertainment — many songs are sacred, connected to the Dreamtime creation stories, and have specific ceremonial functions. Some songs are restricted: they may only be performed by certain people, at certain times, in certain places. Sampling such music without permission violates Aboriginal cultural law regardless of Western copyright rules. Even if the sample is legally licensed, several ethical issues remain: the original cultural meaning is stripped away when a sacred song becomes part of a dance track; the Aboriginal community may not benefit financially despite the pop artist profiting; and the power dynamic is deeply unequal — a wealthy Western artist extracting value from an indigenous tradition with a history of colonial exploitation. This is different from genuine cross-cultural collaboration, where artists from different traditions work together with mutual respect, understanding and benefit. The key distinction is consent and reciprocity: was the community involved in the decision? Do they share in the financial and creative credit? Does the pop artist acknowledge and respect the cultural significance of what they have used? Without these, sampling becomes extractive — taking the sound while discarding the meaning.",
        "common_errors": [
          "Treating the issue as purely a copyright question rather than a cultural and ethical one",
          "Not distinguishing between cultural appropriation (taking without consent or understanding) and cultural appreciation or collaboration"
        ]
      }
    ]
  }
]