[
  {
    "concept_id": "MU-KS2-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Playing a simple part in a group, keeping in time with others by following a steady pulse.",
        "example_task": "Play this simple rhythm pattern on a drum while the rest of the group play a different pattern. Keep in time together.",
        "example_response": "I played my pattern — ta ta ta rest — over and over while the others played their parts. I listened to the pulse and watched the person leading to stay in time.",
        "common_errors": [
          "Speeding up when nervous or getting louder to hear themselves over the group",
          "Not listening to other parts and playing independently"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Maintaining an independent part within an ensemble, adjusting volume and timing to blend with the group.",
        "example_task": "Play your recorder part in the ensemble piece. You have a different melody from the other group — keep your part steady while listening to theirs.",
        "example_response": "I played my part and heard that the other group had a different melody happening at the same time. I adjusted my volume to match theirs so neither part was too loud. When they played louder, I played a bit louder too to keep the balance.",
        "common_errors": [
          "Switching to the other group's part when they hear it",
          "Playing too loudly or too quietly relative to the ensemble balance"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Performing with awareness of the ensemble, following a conductor or leader, adjusting dynamics and timing, and contributing musically to the overall sound.",
        "example_task": "Perform a two-part piece with your class. Follow the conductor for starts, stops and dynamic changes.",
        "example_response": "I watched the conductor for the opening beat and started exactly together with my group. When the conductor signalled quieter, I reduced my volume smoothly. I maintained my part throughout, listening to how it combined with the other part to create harmony. At the end, we all stopped cleanly on the conductor's signal.",
        "common_errors": [
          "Not watching the conductor and missing entry or dynamic changes",
          "Focusing entirely on their own part without awareness of the overall ensemble sound"
        ]
      }
    ]
  },
  {
    "concept_id": "MU-KS2-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Creating short musical responses spontaneously within a given framework, such as answering a musical question.",
        "example_task": "I will play a short musical phrase (the question). You make up an answer phrase straight away on your instrument.",
        "example_response": "You played four notes going up. I played four notes going down, ending on a low note. It sounded like a conversation.",
        "common_errors": [
          "Freezing and not being able to respond spontaneously",
          "Copying the question exactly instead of creating something new"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Improvising melodic and rhythmic phrases that fit within a given tonality, time signature or mood.",
        "example_task": "Improvise a melody using only the notes C, D, E, G, A (pentatonic scale) while the class plays a steady accompaniment.",
        "example_response": "I played short phrases using the five notes, leaving gaps between phrases so it didn't sound rushed. I repeated some patterns and changed others. I ended on C because it sounded like a natural ending point. The notes all sounded good together because of the pentatonic scale.",
        "common_errors": [
          "Playing too many notes too quickly without musical shape or phrasing",
          "Not listening to the accompaniment while improvising"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Improvising with confidence and musical awareness, varying phrases, using dynamics and phrasing expressively, and responding to other performers in the moment.",
        "example_task": "Improvise a short piece in a group: one person plays a rhythm, another improvises a melody, and a third adds dynamics. Respond to each other as you play.",
        "example_response": "I listened to the rhythm pattern and improvised a melody that fitted with it. When the rhythm got more energetic, I played higher and faster. When it calmed down, I played slower, lower phrases. The dynamics player made us all quieter in the middle, which created a nice contrast. We were listening and responding to each other, making the music together.",
        "common_errors": [
          "Playing without listening to the other performers",
          "Not varying their improvisation — playing the same ideas throughout"
        ]
      }
    ]
  },
  {
    "concept_id": "MU-KS2-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying simple musical structures such as verse-chorus in familiar songs, recognising when sections repeat or contrast.",
        "example_task": "Listen to this song. How many times does the chorus come back? What is different about the verse and the chorus?",
        "example_response": "The chorus comes back three times. The verse has quieter singing with different words each time. The chorus is louder with the same words every time — the catchy bit you remember.",
        "common_errors": [
          "Not distinguishing between verse and chorus sections",
          "Thinking the whole song is one continuous section"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Composing music with a clear structure (binary AB, ternary ABA, rondo ABACA), using repetition and contrast between sections.",
        "example_task": "Compose a piece in ABA structure. Section A and Section B should sound clearly different, then Section A returns.",
        "example_response": "Section A: a gentle melody on the glockenspiel in C major, played twice. Section B: a contrasting rhythmic pattern on drums with a different feel — louder and faster. Section A returns: the same gentle glockenspiel melody. The contrast makes you appreciate the return of Section A.",
        "common_errors": [
          "Making sections too similar so the structure isn't clear",
          "Forgetting to bring Section A back in ternary form"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Composing extended pieces that develop musical ideas through variation, layering and structural organisation, with awareness of how professional composers use structure.",
        "example_task": "Compose a piece in rondo form (ABACADA) for a small group. Each episode (B, C, D) should introduce a new idea while the A section stays recognisable.",
        "example_response": "A: Our main theme — a four-bar melody on recorders. B: A drum-based rhythmic episode, energetic and loud. A returns. C: A quiet section with just glockenspiel playing a variation of the A melody. A returns. D: All instruments play together in a final energetic episode. A returns one last time, played quieter as an ending. The rondo form gives the piece unity through repetition of A, while the episodes provide variety and contrast.",
        "common_errors": [
          "Changing the A section each time instead of keeping it recognisable",
          "Making each episode so different that the piece doesn't feel unified"
        ]
      }
    ]
  },
  {
    "concept_id": "MU-KS2-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that music can be written down and reading simple graphic or rhythm notation.",
        "example_task": "These symbols show short sounds (filled circles) and long sounds (open circles). Clap the pattern.",
        "example_response": "I clapped: short short long short short long. The filled circles are quick claps and the open circles are held for longer.",
        "common_errors": [
          "Ignoring the notation and clapping their own pattern",
          "Not distinguishing between the different note lengths shown"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Reading and writing simple staff notation: note names on the treble clef, crotchets, minims, quavers and rests.",
        "example_task": "Read these notes on the stave and play them on the glockenspiel: C, D, E, rest, E, D, C.",
        "example_response": "I identified C on the ledger line below the stave, D in the first space, and E on the first line. I played them in order and left a silence for the rest. The melody goes up then back down.",
        "common_errors": [
          "Confusing line notes with space notes on the stave",
          "Not giving the rest its full value — skipping straight to the next note"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Reading and performing from staff notation with fluency, writing their own compositions in standard notation, and understanding time signatures.",
        "example_task": "Write out your composition in staff notation so someone else can play it. Include note names, rhythms and dynamics.",
        "example_response": "I wrote my melody in 4/4 time on the treble clef. The first bar has four crotchets: C, D, E, F. The second bar has a minim (E) and two crotchets (D, C). I added 'p' at the start for quiet and 'f' in bar 3 for loud. I checked that each bar has four beats.",
        "common_errors": [
          "Writing bars with the wrong number of beats for the time signature",
          "Not including dynamics or other performance directions in the notation"
        ]
      }
    ]
  },
  {
    "concept_id": "MU-KS2-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Listening to music from different times and places and expressing a personal response, identifying basic features.",
        "example_task": "Listen to this piece of classical music and this piece of African drumming. What do you notice about each?",
        "example_response": "The classical music has violins and a piano — it sounds smooth and gentle. The African drumming is very rhythmic with lots of drums playing different patterns at the same time. It makes me want to move.",
        "common_errors": [
          "Dismissing unfamiliar music without listening carefully",
          "Describing only whether they 'like' it without noting musical features"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing key features of music from different genres, traditions or historical periods using appropriate musical vocabulary.",
        "example_task": "Describe the musical features of a piece of Baroque music. What instruments do you hear? How is it structured?",
        "example_response": "I can hear a harpsichord and strings. The tempo is quite fast and lively. There is a repeating pattern that comes back — it has a structure. The dynamics change between loud sections with all instruments and quiet sections with fewer. Baroque music often uses ornamental decorations on the melody — little extra notes that make it sound elaborate.",
        "common_errors": [
          "Using vague language instead of specific musical vocabulary",
          "Not connecting musical features to the style or period"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Analysing and comparing music from different traditions with understanding of how historical, social and cultural contexts shape musical style and practice.",
        "example_task": "Compare a piece of Western classical music with music from another cultural tradition. How does each tradition's context influence its musical features?",
        "example_response": "The classical symphony uses a large orchestra with written notation — this reflects a European tradition of composed, rehearsed music performed in concert halls. The Indian raga uses fewer instruments but allows extensive improvisation within a framework of scales and rhythmic cycles — this reflects a tradition of oral transmission and individual expression within rules. The classical piece develops through changes of key and orchestration; the raga develops through increasingly complex improvisations. Both are highly skilled but their contexts produce different musical values — composition versus improvisation, large ensemble versus small group.",
        "common_errors": [
          "Treating non-Western music as simpler or less sophisticated",
          "Comparing music without considering the cultural context that shaped it"
        ]
      }
    ]
  }
]
