[
  {
    "concept_id": "MU-KS1-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Feeling and moving to a steady pulse in music, clapping or tapping along with the beat.",
        "example_task": "Listen to this music. Clap along with the steady beat.",
        "example_response": "I clapped in time with the music, keeping a steady, even beat throughout the song.",
        "common_errors": [
          "Clapping the rhythm of the words instead of the underlying steady pulse",
          "Speeding up or slowing down rather than maintaining a consistent beat"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Distinguishing between pulse (steady beat) and rhythm (pattern of long and short sounds), and performing simple rhythmic patterns over a pulse.",
        "example_task": "One person clap the steady beat. Another person clap the rhythm of the words 'Hot Cross Buns'. Can you hear the difference?",
        "example_response": "The pulse is steady: clap, clap, clap, clap. The rhythm follows the words: HOT CROSS BUNS — three sounds with a gap. The rhythm has longer and shorter sounds but the pulse stays the same underneath.",
        "common_errors": [
          "Confusing pulse and rhythm — thinking they are the same thing",
          "Not being able to maintain a steady pulse while someone else plays a rhythm"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Performing rhythmic patterns accurately, including patterns with rests, and explaining the relationship between pulse and rhythm.",
        "example_task": "Clap this rhythm pattern from the notation: ta ta ti-ti ta (rest). Repeat it four times, staying in time with the pulse.",
        "example_response": "I clapped two crotchets, two quavers, one crotchet, then a rest where I showed my hands apart. I repeated it four times without speeding up. The pulse stayed steady underneath and the rhythm pattern fitted over it like words over a heartbeat.",
        "common_errors": [
          "Not leaving a clear silence during the rest",
          "Speeding up during repetitions"
        ]
      }
    ]
  },
  {
    "concept_id": "MU-KS1-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that sounds can be high or low and using the voice to produce high and low sounds.",
        "example_task": "Sing a high sound like a bird. Now sing a low sound like a bear. Can you hear the difference?",
        "example_response": "My bird sound is high up — eeee! My bear sound is low down — grrrr. The bird sound is squeaky and the bear sound is rumbly.",
        "common_errors": [
          "Confusing loud with high and quiet with low",
          "Not being able to physically produce a high or low sound on command"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Singing in tune with a group, matching pitch to a given note, and showing the direction of pitch (going up, going down, staying the same).",
        "example_task": "Listen to these three notes. Are they going up, going down or staying the same? Show with your hand.",
        "example_response": "The notes are going up — each one is higher than the last. I moved my hand upward to show the melody going up.",
        "common_errors": [
          "Not being able to distinguish whether a pitch is going up or down",
          "Singing loudly instead of matching the target pitch"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Singing with accurate pitch in a group performance and playing simple pitched patterns on tuned instruments, controlling pitch deliberately.",
        "example_task": "Play the notes C, D, E on a glockenspiel. Now play them going back down: E, D, C. Can you play a simple tune using just these three notes?",
        "example_response": "I played C, D, E going up and E, D, C going back down. For my tune I played: C, C, D, E, D, C. It sounds like a little question and answer — up then down.",
        "common_errors": [
          "Hitting the wrong bars because of unfamiliarity with the instrument layout",
          "Playing too quickly to control which notes are sounding"
        ]
      }
    ]
  },
  {
    "concept_id": "MU-KS1-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising the difference between loud and quiet sounds and between fast and slow music.",
        "example_task": "Listen to these two pieces of music. Which one is loud and fast? Which one is quiet and slow?",
        "example_response": "The first one is loud and fast — it makes me want to run around. The second one is quiet and slow — it feels calm and sleepy.",
        "common_errors": [
          "Confusing loud with fast (a piece can be loud and slow, or quiet and fast)",
          "Using only 'loud' and 'quiet' without noticing tempo changes"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using changes in dynamics (getting louder/quieter) and tempo (getting faster/slower) expressively when performing.",
        "example_task": "Sing 'Twinkle Twinkle Little Star'. Start quietly and gradually get louder, then get quiet again at the end.",
        "example_response": "I started singing very softly for 'Twinkle twinkle', got a bit louder for 'little star', then the loudest for 'how I wonder what you are'. For the last line I got quiet again. It sounded like the star appearing and then fading.",
        "common_errors": [
          "Jumping suddenly from quiet to loud instead of gradually changing",
          "Getting louder but forgetting to get quieter again"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using dynamics and tempo deliberately in performance and composition to create mood, atmosphere or storytelling effects.",
        "example_task": "Create a short piece of music that tells the story of a thunderstorm arriving, passing overhead and moving away. Use changes in dynamics and tempo.",
        "example_response": "I started with quiet, slow tapping for distant rain. The tapping got faster and louder as the storm came closer. I added a loud crash on the drum for thunder. Then I gradually made everything quieter and slower again as the storm moved away, ending with one last quiet tap. The dynamics and tempo told the story without any words.",
        "common_errors": [
          "Keeping the same dynamic level throughout instead of using contrast",
          "Not connecting the musical changes to the narrative or mood"
        ]
      }
    ]
  },
  {
    "concept_id": "MU-KS1-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that different instruments and voices have different sounds (timbres), and sorting sounds into categories.",
        "example_task": "Listen to these instruments. Can you tell which is a drum, which is a recorder and which is a guitar?",
        "example_response": "The drum makes a deep booming sound. The recorder makes a high, whistling sound. The guitar makes a plucking, twangy sound. They all sound different even when playing the same note.",
        "common_errors": [
          "Not being able to distinguish between instruments by sound alone",
          "Describing all instruments as just 'loud' or 'quiet' without noticing timbre"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing the timbre of sounds using musical vocabulary (bright, dull, warm, harsh, smooth, rough) and identifying thin and thick textures.",
        "example_task": "Listen to this piece. How many different instruments can you hear? Is the texture thin or thick?",
        "example_response": "I can hear a piano, a violin and a flute. The texture starts thin — just the piano playing alone. Then the violin joins in and it gets thicker. When all three play together, the texture is thick and rich.",
        "common_errors": [
          "Confusing timbre (quality of individual sounds) with texture (how sounds combine)",
          "Using only 'nice' or 'good' instead of specific musical vocabulary"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Choosing instruments deliberately for their timbre to achieve a specific musical effect, and creating contrasts in texture within a group performance.",
        "example_task": "Your group needs to create a piece about a forest. Choose instruments for their timbre and plan how the texture will change.",
        "example_response": "We chose the xylophone for birdsong because its bright, clear timbre sounds like birds. We used a rainstick for the gentle rain sound. The drum is a distant rumble of thunder. We start with just the xylophone (thin texture), add the rainstick (getting thicker), then add the drum (full, thick texture). At the end, instruments drop out one by one until only the xylophone remains — back to a thin texture.",
        "common_errors": [
          "Choosing instruments randomly rather than for their timbral qualities",
          "Having all instruments play the whole time instead of creating textural variety"
        ]
      }
    ]
  },
  {
    "concept_id": "MU-KS1-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying individual musical dimensions — whether music is high or low (pitch), loud or quiet (dynamics), fast or slow (tempo) — when listening.",
        "example_task": "Listen to this music. Is it fast or slow? Loud or quiet? High or low?",
        "example_response": "The music is fast and quite loud. The instrument is playing high notes that sound sparkly.",
        "common_errors": [
          "Confusing the dimensions (e.g. calling high notes 'loud')",
          "Only being able to identify one dimension at a time"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using appropriate vocabulary for multiple dimensions when describing music, and beginning to notice how changing one dimension affects how the music sounds.",
        "example_task": "Describe this piece using at least three musical dimensions: pitch, duration, dynamics, tempo, timbre, texture.",
        "example_response": "This piece has a slow tempo and quiet dynamics. The pitch is mainly low. The timbre is warm because it is a cello. The texture is thin — just one instrument. It sounds calm and thoughtful because all these things work together.",
        "common_errors": [
          "Using everyday language instead of musical vocabulary",
          "Describing dimensions in isolation without noticing how they interact"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining how the inter-related dimensions work together to create a particular musical effect, and using this understanding when composing or performing.",
        "example_task": "Explain how the composer of this piece uses the musical dimensions together to create excitement.",
        "example_response": "The tempo is fast, which immediately creates energy. The dynamics get louder and louder, building tension. The pitch rises higher, which adds to the feeling of climbing towards something. The texture gets thicker as more instruments join in. All these dimensions working together — fast, loud, high, thick — create excitement. If the composer only changed one dimension, it wouldn't be as effective.",
        "common_errors": [
          "Treating each dimension separately instead of explaining how they combine",
          "Not recognising that the same piece can use dimensions in contrasting ways at different moments"
        ]
      }
    ]
  },
  {
    "concept_id": "MU-KS1-C006",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Exploring sounds freely using classroom instruments and the voice, discovering what different sounds can be made.",
        "example_task": "Choose an instrument. Find three different ways to make a sound with it.",
        "example_response": "I chose the tambourine. I can shake it, tap it with my hand, and scrape my finger along the skin. Each way makes a different sound.",
        "common_errors": [
          "Only using one technique to play an instrument",
          "Being too rough with instruments and not controlling the sound"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Selecting and ordering sounds to create a short piece with a clear beginning, middle and end.",
        "example_task": "Create a short piece of music with a beginning, a middle and an end. Choose your sounds and put them in order.",
        "example_response": "Beginning: three slow taps on the drum. Middle: fast shaking of the maracas getting louder. End: one quiet ding on the triangle. I chose these because the drum starts the piece, the maracas build excitement in the middle, and the triangle ends it with a clear, clean sound.",
        "common_errors": [
          "Making random sounds without any intentional order or structure",
          "Not creating a clear ending so the piece just stops"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Composing a short piece that uses deliberate musical choices — selecting sounds for their qualities, organising them into a structure, and being able to explain and repeat the composition.",
        "example_task": "Compose a piece of music for three instruments that tells the story of a day at the seaside. Make sure you can perform it the same way twice.",
        "example_response": "Section A (morning): gentle woodblock tapping for footsteps on the sand, with quiet ocean drum underneath. Section B (playing): fast tambourine for splashing in the waves, glockenspiel for seagull calls overhead. Section A again (evening): back to gentle woodblock and ocean drum, getting quieter. I used ABA structure so the day starts and ends the same way. I can repeat it because I remember the pattern.",
        "common_errors": [
          "Creating a piece that cannot be repeated because it was improvised without a plan",
          "Not using musical structure (repetition, contrast, return) to organise the piece"
        ]
      }
    ]
  }
]
