[
  {
    "concept_id": "MU-KS4-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Performs simple pieces with generally correct notes and rhythms, maintaining a steady tempo. Shows basic awareness of dynamics (loud/quiet) and can play or sing with reasonable intonation.",
        "example_task": "Perform a prepared piece on your instrument. Aim for accuracy of notes and rhythm, and include at least two dynamic contrasts.",
        "example_response": "The student plays the melody accurately with no wrong notes, maintains a steady pulse throughout, and includes a clear contrast between the quiet verse and loud chorus sections. Tempo is consistent though there is a slight hesitation at the key change.",
        "common_errors": [
          "Playing all notes at the same dynamic level without any expressive variation",
          "Rushing through technically difficult passages rather than maintaining a steady tempo"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Performs with technical accuracy and musical expression, demonstrating control of dynamics, articulation, and phrasing. Responds to performance directions in the score and maintains stylistic consistency.",
        "example_task": "Perform your chosen piece with attention to dynamics, articulation, and phrasing as marked in the score. Explain two expressive choices you made.",
        "example_response": "The student performs with accurate notes and rhythms, crescendo through the bridge section as marked, staccato articulation in the verse to match the playful character, and a ritardando in the final bars. Expressive choices: (1) I added a slight rubato in the middle section to emphasise the lyrical melody, which is not marked but fits the romantic style. (2) I played the repeated motif quieter the second time to create an echo effect, adding interest to the phrase structure.",
        "common_errors": [
          "Following dynamic markings mechanically without shaping the overall musical phrase",
          "Making expressive choices that are stylistically inappropriate for the genre (e.g. rubato in a baroque piece)"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Performs with technical fluency and mature musical interpretation, making informed expressive decisions that demonstrate understanding of the style, structure, and emotional content of the music. Communicates effectively with an audience and, in ensemble work, responds to other performers.",
        "example_task": "Perform your recital programme (two contrasting pieces). Demonstrate technical control and interpretive maturity, and explain how your interpretation is informed by the style and period of each piece.",
        "example_response": "Piece 1 (Bach Invention in C major): performed at a steady tempo with clear, even semiquaver runs, terraced dynamics (appropriate for baroque keyboard style), and articulated phrasing that highlights the contrapuntal interplay between hands. I chose a moderate tempo to allow the counterpoint to be heard clearly — Bach's inventions are pedagogical pieces designed to demonstrate part-independence. Piece 2 (Debussy Clair de Lune): performed with a flexible tempo (rubato throughout), wide dynamic range from ppp to mf, sustained pedalling to create the impressionist wash of sound, and a singing melodic line that floats above the harmonic accompaniment. The contrast between the structural clarity of Bach and the atmospheric colour of Debussy demonstrates my range.",
        "common_errors": [
          "Performing both pieces with the same interpretive approach rather than adapting style to period and genre",
          "Demonstrating technical ability without communicating the emotional and structural meaning of the music to the audience"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Performs at a high level with exceptional technical control and deeply personal, informed interpretation. Demonstrates the ability to make the music 'their own' while remaining stylistically authentic. Shows outstanding communication, stage presence, and the ability to respond in the moment during performance.",
        "example_task": "Perform your programme and provide a critical self-evaluation. Discuss how your interpretation evolved during the preparation process and how the live performance differed from your rehearsal.",
        "example_response": "My interpretation of the Chopin Nocturne evolved significantly. Initially, I played the ornamentation too precisely, which sounded rigid. After listening to Rubinstein and Zimerman recordings, I understood that Chopin's ornaments should sound spontaneous — like vocal decoration, not mechanical execution. In live performance, the acoustic of the room was drier than my practice room, so I adjusted my pedalling in real time — using less sustain pedal and more finger legato to avoid blurring. I also noticed the audience was very still during the pianissimo coda, which gave me confidence to take more time and play even quieter than rehearsed. The interaction between performer and audience is something I cannot replicate in practice — the live performance had a vulnerability and presence that my rehearsal recordings lack.",
        "common_errors": [
          "Reproducing a rehearsed interpretation mechanically without responding to the live performance environment",
          "Not being able to articulate what makes their interpretation personal and distinctive beyond technical accuracy"
        ]
      }
    ]
  },
  {
    "concept_id": "MU-KS4-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Identifies basic musical elements — tempo (fast/slow), dynamics (loud/quiet), pitch (high/low), duration (long/short), timbre (instrument sounds) — when listening to music.",
        "example_task": "Listen to an orchestral extract. Identify the tempo, dynamics, and two instruments you can hear.",
        "example_response": "The tempo is moderate (andante). The dynamics start quiet with strings and gradually get louder as the brass instruments join. I can hear violins playing the melody and a French horn playing a counter-melody underneath.",
        "common_errors": [
          "Using vague terms ('medium speed') instead of musical terminology (andante, moderato)",
          "Identifying only the most prominent instrument and missing accompanying or counter-melodic instruments"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Analyses musical elements using correct terminology, identifies structural features (verse, chorus, ternary, rondo, sonata form), and describes how elements combine to create mood and character.",
        "example_task": "Analyse the structure of a piece you have studied. Identify the sections and describe how two musical elements change between them.",
        "example_response": "The piece is in ternary form (ABA). Section A: major key, homophonic texture (melody with chordal accompaniment), piano dynamic, legato phrasing — calm, pastoral character. Section B: shifts to the relative minor, polyphonic texture with imitative entries, forte dynamic, staccato articulation — dramatic, urgent character. Section A returns with the original melody ornamented and a coda added. The contrast between sections is created primarily through changes in tonality (major to minor) and texture (homophonic to polyphonic).",
        "common_errors": [
          "Describing sections as 'different' without specifying which musical elements change and how",
          "Confusing texture terms — using 'polyphonic' when the texture is actually homophonic with a prominent melody line"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Provides detailed analytical commentary on how composers use musical elements, structure, and compositional devices to achieve specific effects. Uses technical vocabulary precisely and supports analysis with specific musical references (bar numbers, timestamps).",
        "example_task": "Analyse how Beethoven creates tension and resolution in the first movement of his Fifth Symphony. Reference specific musical devices and moments.",
        "example_response": "The famous four-note motif (bars 1-2, G-G-G-Eb, short-short-short-long rhythm) creates tension through its rhythmic urgency, minor tonality, and the descending minor third. Beethoven builds tension by: fragmenting the motif (bars 6-21, passing it between strings and winds in dialogue), extending sequences that delay resolution (bars 44-57, rising sequences over a dominant pedal), and using dramatic general pauses (bar 21, bar 268) that create uncertainty. The development section (bar 125) explores remote keys and combines the motif in stretto (overlapping entries), increasing density. Resolution comes through the transition to the recapitulation (bar 248-268) where a solo oboe cadenza breaks the rhythmic drive, before the full orchestra restates the opening in C minor. The ultimate resolution is delayed to the fourth movement's shift to C major — Beethoven withholds tonal resolution across the entire symphony.",
        "common_errors": [
          "Making general claims about 'tension' without identifying the specific musical devices that create it",
          "Analysing individual elements without showing how they interact — tension in Beethoven comes from the combination of rhythmic, harmonic, and textural elements working together"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Demonstrates exceptional analytical depth, engaging with complex musical concepts (extended tonality, motivic development, orchestration choices) and evaluating compositional decisions in the context of the composer's wider output and historical period. Compares different interpretive approaches.",
        "example_task": "Compare two recordings of the same set work, evaluating how different interpretive choices affect the listener's experience. Reference specific musical elements and performance decisions.",
        "example_response": "Comparing Karajan (1962) and Harnoncourt (1991) recordings of Beethoven's Fifth: Karajan's Berlin Philharmonic uses a large orchestra with rich, blended string tone. His tempo for the opening Allegro con brio (dotted crotchet ≈ 108) allows weight and grandeur; the famous motif sounds inevitable and monumental. Harnoncourt's Chamber Orchestra of Europe uses historically-informed practice — smaller forces, less vibrato, natural horns. His tempo is faster (≈ 120), creating urgency and aggression. The same passage (bars 44-57, sequential development) sounds like an inexorable build-up in Karajan but like a breathless chase in Harnoncourt. The general pause at bar 268 lasts noticeably longer in Karajan (approximately 3 beats) than Harnoncourt (barely 1 beat) — Karajan uses silence dramatically while Harnoncourt treats it as a structural articulation point. Neither is 'correct' — each reflects a legitimate interpretive tradition. Karajan embodies the Romantic view of Beethoven as heroic and transcendent; Harnoncourt recovers the revolutionary energy of the original performance context.",
        "common_errors": [
          "Preferring one recording without analysing the specific performance decisions that create the different effect",
          "Not recognising that interpretive choices reflect broader aesthetic philosophies and historical performance traditions, not just individual preference"
        ]
      }
    ]
  },
  {
    "concept_id": "MU-KS4-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Creates simple melodies and rhythms, combining notes into phrases with a sense of beginning and ending. Can repeat and vary a musical idea.",
        "example_task": "Compose an 8-bar melody for a chosen instrument using notes from the C major scale. Include a repeated rhythm pattern.",
        "example_response": "The melody uses stepwise movement with occasional leaps of a third, begins on the tonic C, has a rhythmic pattern (crotchet-quaver-quaver) that repeats in bars 1-2 and 5-6, and ends on C to give a sense of completion. The melody has a clear shape — rising in the first four bars and returning to the starting note by bar 8.",
        "common_errors": [
          "Creating a random sequence of notes without any sense of melodic shape or phrase structure",
          "Ending the melody on a note that does not feel resolved (e.g. ending on the seventh degree rather than the tonic)"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Composes music with clear structure (binary, ternary, verse-chorus), uses harmonic foundations (primary chords I, IV, V), and demonstrates awareness of stylistic conventions in the chosen genre.",
        "example_task": "Compose a 16-bar piece in ternary form (ABA) using a chord progression of I, IV, V, I. Include a contrasting B section.",
        "example_response": "Section A (bars 1-8): melody in C major over I-V-IV-I progression, moderate tempo, conjunct melody with a memorable rhythmic motif. Section B (bars 9-12): shifts to A minor (relative minor), uses sequence and a new rhythmic pattern, thinner texture (melody without chordal accompaniment). Section A' (bars 13-16): return of the opening melody with added harmony and a conclusive perfect cadence (V-I).",
        "common_errors": [
          "Writing a B section that is simply the A section transposed rather than providing genuine musical contrast",
          "Using chords that do not follow logical harmonic progressions, creating aimless harmonic movement"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Composes with sophistication, using advanced harmonic vocabulary (secondary dominants, modulation, extended chords), varied textures, and compositional techniques (sequence, inversion, augmentation, diminution, pedal points) appropriate to the style.",
        "example_task": "Compose a piece in a style of your choice that demonstrates modulation, at least two compositional techniques, and effective use of texture. Annotate your score explaining your decisions.",
        "example_response": "My composition is a jazz ballad for piano (32-bar AABA form). Section A: melody over ii-V-I progressions in Bb major, using 7th chords and chromatic approach notes. The melody uses sequence (bars 3-4 repeat the shape of bars 1-2 a step higher). Section B: modulates to the relative minor (G minor) via a pivot chord (Cm7 functions as ii in Bb and iv in Gm), the texture thickens to block chords under a more angular melody. Final A: returns to Bb major with the melody embellished (diminution in bar 27) and a turnaround (I-VI-ii-V) setting up a repeat. The harmonic rhythm accelerates in the last four bars to create momentum towards the ending.",
        "common_errors": [
          "Using compositional techniques mechanically (e.g. inverting every phrase) without considering whether they serve the musical effect",
          "Modulating abruptly without smooth voice-leading or pivot chord connections"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Composes with exceptional creativity and technical command, demonstrating a distinctive personal voice while working within or deliberately challenging stylistic conventions. Shows mastery of large-scale structure, motivic development, orchestration, and the relationship between compositional technique and expressive intent.",
        "example_task": "Compose a substantial piece (2+ minutes) that demonstrates motivic development, structural coherence, and a personal compositional voice. Provide a commentary explaining your compositional process and how it relates to composers you have studied.",
        "example_response": "My piece for string quartet and piano (3 minutes) is built from a single four-note cell (E-F-A-Bb) that generates all melodic and harmonic material — influenced by Bartók's motivic economy. The opening presents the cell as a solo violin melody (sparse texture). Through the piece, the cell is developed: inverted (cello, bar 12), augmented into a slow chorale (bars 20-28), fragmented into rhythmic ostinato (viola/cello, bars 30-42), and stacked vertically as harmony (piano, bars 45-52, producing quartal/tritone sonorities). The structure follows an arch form (ABCBA') — the climax at C uses all instruments in dense polyphony before stripping back to the solo violin. My commentary: the constraint of a single cell forced me to find variety through texture, register, and rhythm rather than new melodic material. This is the opposite of my earlier composing habit of inventing new ideas for each section, which produced fragmented results. The discipline of motivic unity was the most important compositional lesson from this project.",
        "common_errors": [
          "Composing a technically impressive piece that lacks emotional impact or communicative power",
          "Not being able to articulate the relationship between compositional decisions and the musical effect they create"
        ]
      }
    ]
  },
  {
    "concept_id": "MU-KS4-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Places music in broad historical periods (Medieval, Classical, Romantic, Modern) and identifies basic style features of each. Names key composers associated with each period.",
        "example_task": "Place the following composers in the correct period: Mozart, Debussy, Bach, Stravinsky. Give one musical feature of each period.",
        "example_response": "Bach — Baroque (ornate melodies, harpsichord continuo). Mozart — Classical (balanced phrases, clear structures like sonata form). Debussy — Impressionist/early 20th century (whole-tone scales, atmospheric textures). Stravinsky — Modern (irregular rhythms, dissonance, large orchestral forces).",
        "common_errors": [
          "Confusing Baroque and Classical periods — placing Bach in the Classical era",
          "Describing all older music as 'classical' without distinguishing between specific historical periods"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describes the musical characteristics of set works in detail, relating stylistic features to their historical period. Identifies how social and cultural context influenced the music.",
        "example_task": "Explain how the social context of 1960s Britain influenced the musical style of The Beatles' Sgt. Pepper's Lonely Hearts Club Band.",
        "example_response": "The 1960s counterculture valued experimentation and boundary-breaking. Sgt. Pepper reflects this: studio experimentation (tape loops in Being for the Benefit of Mr. Kite, orchestral crescendo in A Day in the Life), Indian classical influence (Within You Without You — sitar, tabla, reflecting the hippie interest in Eastern spirituality), and concept album format (rejecting the singles market). Advances in multi-track recording technology enabled the complex layering. The album's variety of styles within a unified concept mirrored the era's optimism about unlimited creative possibility.",
        "common_errors": [
          "Describing what the music sounds like without connecting its features to the historical and cultural context",
          "Treating set works as isolated pieces rather than products of specific social, technological, and cultural conditions"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses set works with detailed technical knowledge, comparing them within and across periods. Evaluates how composers responded to and influenced the musical traditions of their time. Connects knowledge of music history to wider cultural, technological, and political developments.",
        "example_task": "Compare how two composers from different periods approached the use of dissonance. Discuss how their approaches reflect changing musical values.",
        "example_response": "In Mozart's Symphony No. 40 (1788), dissonance is carefully controlled within tonal harmony — the opening theme uses chromatic lower neighbour notes (F#-G in the melody) that create momentary tension resolved within the phrase. Dissonance serves tonal direction: dominant sevenths resolve to tonics, creating the expectation-resolution cycle that drives Classical form. In Stravinsky's Rite of Spring (1913), dissonance is emancipated: the 'Augurs of Spring' chord (Eb7 superimposed on Fb major) is sustained as a stable sonority, not resolved. Dissonance becomes a timbral and rhythmic element, not a harmonic event requiring resolution. This reflects the broader modernist rejection of 19th-century aesthetic values: Stravinsky sought to shock and disorient, not satisfy. Between these works, the Romantic expansion of chromaticism (Wagner's Tristan chord, Debussy's whole-tone ambiguity) gradually weakened the tonal system that made Mozart's dissonance-resolution model meaningful.",
        "common_errors": [
          "Discussing dissonance in general terms without providing specific musical examples from the works studied",
          "Treating the evolution from tonal to atonal as simple 'progress' rather than a complex cultural shift with multiple causes"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Demonstrates exceptional breadth and depth of music historical knowledge, engaging critically with musicological debates, evaluating the significance of set works within the broader canon, and understanding how historical context shapes both composition and reception.",
        "example_task": "Evaluate the claim that Western classical music is 'universal' and 'the highest form of musical art.' Consider the perspectives of musicologists who challenge this view.",
        "example_response": "The 'universality' claim rests on the idea that Western tonal harmony represents a natural, acoustically grounded system. While the overtone series is physical reality, the specific musical systems built from it are cultural choices — Javanese gamelan, Indian raga, West African polyrhythm, and Arabic maqam are equally sophisticated systems with different aesthetic priorities (colour/texture, melodic nuance, rhythmic complexity, microtonal expression respectively). The hierarchy that places Western classical at the top was constructed during European colonialism — it served to justify cultural superiority. Musicologists like Kofi Agawu and Philip Bohlman have shown that this hierarchy excluded oral traditions, improvisation-based musics, and non-notated practices by defining 'art music' as written, composed, and performed from a score. The Western emphasis on the individual genius composer is itself culturally specific — many traditions prioritise collective creation. However, the Western classical tradition has produced works of extraordinary structural complexity (Bach's Art of Fugue, Beethoven's late quartets) that reward analytical study. The issue is not whether this music is valuable — it is — but whether it should be positioned as the standard against which all other music is measured. A genuinely inclusive music education studies all traditions on their own terms.",
        "common_errors": [
          "Accepting the universality claim without recognising its colonial origins and cultural bias",
          "Dismissing Western classical music entirely in reaction to the universality critique, rather than repositioning it as one tradition among many"
        ]
      }
    ]
  },
  {
    "concept_id": "MU-KS4-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Recognises that different types of music have different styles and can name basic genres (pop, rock, jazz, classical, folk). Identifies obvious stylistic features such as instrumentation and tempo.",
        "example_task": "Listen to two contrasting musical extracts. Identify the genre of each and explain one musical feature that helped you identify it.",
        "example_response": "Extract 1 is jazz — I can hear a saxophone playing an improvised melody over a swing rhythm from the drums and a walking bass line. Extract 2 is classical — it features a string orchestra playing a composed melody with no improvisation, in a moderate tempo with balanced four-bar phrases.",
        "common_errors": [
          "Identifying genre based only on instruments rather than considering rhythm, harmony, structure, and performance style",
          "Using the term 'classical' to describe all orchestral music regardless of period or style"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describes the defining characteristics of multiple genres and styles, including their typical instrumentation, harmonic language, rhythmic features, and performance conventions. Recognises how genres influence and borrow from each other.",
        "example_task": "Describe the key musical characteristics of reggae and explain how it has influenced other genres.",
        "example_response": "Reggae features: offbeat guitar/keyboard chops (skank) on beats 2 and 4, heavy bass lines that are melodic and prominent in the mix, drum patterns emphasising the 'one drop' (bass drum on beat 3, no beat 1), moderate tempo (70-90 BPM), and often minor keys with simple chord progressions (I-IV-V). It developed in Jamaica in the late 1960s from ska and rocksteady. Reggae influenced: punk (The Clash incorporated reggae rhythms), electronic music (dub techniques — echo, reverb, bass emphasis — became foundational to dubstep and drum and bass), and hip-hop (Jamaican sound system culture and toasting influenced MC-ing).",
        "common_errors": [
          "Describing genres in terms of cultural associations alone without identifying the specific musical features that define them",
          "Not recognising that genres are not fixed categories — they constantly evolve and cross-pollinate"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses music from diverse genres and traditions with equal analytical rigour, understanding each on its own terms. Evaluates how cultural context shapes genre conventions and how musicians work within and against genre expectations.",
        "example_task": "Analyse a piece from a non-Western musical tradition, using terminology appropriate to that tradition rather than imposing Western categories.",
        "example_response": "Analysing a North Indian classical raga performance (Raga Yaman, Ravi Shankar): the performance follows the traditional structure — alap (unmetered exploration of the raga's ascending and descending melodic framework, no tabla), jor (introduction of pulse without metric cycle), and gat (metered composition with tabla in teental — 16-beat cycle). The raga Yaman uses a scale roughly equivalent to the Lydian mode (raised fourth) but is defined not just by its scale but by specific melodic phrases (pakad), characteristic ornaments (gamak, meend), and rules about which notes to emphasise or approach from specific directions. The interplay between sitarist and tabla player in the gat section involves improvised responses within the taal framework — a conversational structure fundamentally different from Western orchestral performance but equally sophisticated. Analysing this using Western terms (scale, metre, improvisation) captures only surface features; the aesthetic is based on rasa (emotional essence), not on harmonic development.",
        "common_errors": [
          "Analysing non-Western music exclusively through Western categories (scale, chord, bar) that may not capture the tradition's essential features",
          "Treating non-Western traditions as 'exotic' additions to a Western core curriculum rather than as complete musical systems with their own analytical frameworks"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Demonstrates exceptional breadth of stylistic knowledge and the ability to analyse any music with appropriate analytical tools. Evaluates the politics of genre classification, the dynamics of cultural exchange versus appropriation, and the ways global musical traditions interact in contemporary practice.",
        "example_task": "Evaluate the concept of 'world music' as a genre category. Is it a useful term for understanding global musical diversity, or does it obscure more than it reveals?",
        "example_response": "'World music' emerged as a marketing category in the late 1980s (coined at a London meeting of record labels in 1987) to create shelf space for non-Western music in Western record shops. As an analytical category, it is deeply problematic: it lumps together Malian kora music, Brazilian samba, Indian classical, and Tuvan throat singing — traditions with nothing in common except not being Western pop or classical. It positions Western music as the default and everything else as 'other.' However, the category did increase Western audiences' access to global music (Ali Farka Touré, Nusrat Fateh Ali Khan gained international recognition through 'world music' marketing). The deeper issue is power: when Paul Simon used South African musicians on Graceland (1986), was this cultural exchange or appropriation? The musicians were credited and paid, but Simon received the Grammy and career boost. Authentic engagement requires understanding traditions on their own terms, crediting and compensating fairly, and recognising that 'fusion' is not neutral — it occurs within global power structures. I reject 'world music' as an analytical category but acknowledge its historical role in democratising access. Better approaches study each tradition specifically and examine cross-cultural encounters critically.",
        "common_errors": [
          "Accepting 'world music' as a neutral descriptive category without examining the power dynamics embedded in the classification",
          "Adopting either an uncritical celebratory stance ('all music is one') or an overly restrictive position ('all cross-cultural borrowing is appropriation') without nuanced analysis"
        ]
      }
    ]
  },
  {
    "concept_id": "MU-KS4-C006",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Reads simple musical notation including treble clef note names, basic note values (semibreve to quaver), and simple time signatures (4/4, 3/4). Can follow a score while listening.",
        "example_task": "Read this 4-bar melody in treble clef, 4/4 time. Clap the rhythm, then play the notes on a keyboard.",
        "example_response": "The student correctly identifies the note values (crotchets and quavers), claps the rhythm accurately maintaining a steady beat, and plays the correct pitches in the treble clef on the keyboard without hesitation.",
        "common_errors": [
          "Confusing the duration of note values — playing quavers at the same speed as crotchets",
          "Reading notes on the wrong line or space, particularly around the middle of the stave (B, C, D)"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Reads notation fluently in both clefs, understands key signatures, time signatures including compound time (6/8), rests, ties, dotted notes, and basic performance directions (tempo markings, dynamic markings, articulation).",
        "example_task": "Study a score excerpt in G major, 6/8 time. Identify the key, time signature, and three performance directions. Then perform or play back the melody.",
        "example_response": "The key is G major (one sharp, F#). The time signature is 6/8 (compound duple — two dotted crotchet beats per bar). Performance directions: mf (moderately loud), legato (smooth and connected), and rit. in the final bar (gradually slow down). The student performs the melody accurately, grouping quavers in threes to create the lilting compound feel.",
        "common_errors": [
          "Playing 6/8 as if it were 3/4 — counting six equal beats rather than two groups of three",
          "Ignoring key signatures and playing F natural instead of F# throughout a piece in G major"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Reads complex notation including chromatic passages, ornaments, complex rhythms (syncopation, cross-rhythms), and various clefs as required by their instrument. Writes notation accurately for their own compositions and arrangements. Uses graphic, tab, or other notation systems as appropriate to the genre.",
        "example_task": "Notate a 16-bar composition you have created, using standard notation with appropriate markings for dynamics, articulation, and tempo. Include at least one syncopated rhythm.",
        "example_response": "The handwritten or computer-engraved score shows: correct note placement on staves, appropriate key signature (Bb major, two flats), time signature (4/4), dynamic markings (p at start, crescendo to f in bar 8, mp in bar 9), articulation (staccato dots on quavers in bars 5-6, accent on syncopated notes in bars 10-11), and tempo marking (Allegretto ♩= 112). The syncopation in bars 10-11 is notated with tied notes across the barline, correctly placing the emphasis on the offbeat.",
        "common_errors": [
          "Notating syncopation incorrectly — not showing the beats clearly through appropriate beaming and ties",
          "Writing dynamics and articulation that do not match the intended musical effect (e.g. marking staccato on notes intended to be smooth)"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Demonstrates complete fluency with standard notation and understands its limitations. Can create publication-quality scores, use notation software effectively, and adapt notation approaches to different musical contexts. Critically evaluates the relationship between notation and performance practice.",
        "example_task": "Compare the effectiveness of standard Western notation with other systems (graphic notation, tablature, lead sheets) for representing different types of music. Evaluate what is lost and gained in each system.",
        "example_response": "Standard Western notation excels at representing fixed pitch, rhythm, and polyphonic structure — essential for classical orchestral music where many musicians must coordinate precisely from a score. However, it poorly represents: microtonal inflections (blues bending, maqam quarter-tones), the timbral nuances of electronic music, improvised sections, and groove/feel (a swing quaver is notated as straight quavers with a verbal instruction). Lead sheets (melody + chord symbols) are ideal for jazz — they prescribe the harmonic structure while leaving voicing, rhythm, and embellishment to the performer's style, reflecting jazz's improvisatory aesthetic. Guitar tablature represents physical hand position rather than musical pitch — practical for guitarists but instrument-specific and rhythmically imprecise. Graphic notation (Cage, Cardew) can represent spatial, timbral, and gestural musical ideas that standard notation cannot, but requires performer interpretation that produces different results each performance. No notation system is neutral — each embeds assumptions about what aspects of music are most important. Western notation's dominance reflects the historical power of the European classical tradition, not its universal superiority as a representation system.",
        "common_errors": [
          "Treating standard Western notation as a universal and complete system for representing all music",
          "Not recognising that the choice of notation system shapes what music can be composed and how it is performed"
        ]
      }
    ]
  }
]
