[
  {
    "concept_id": "PE-KS1-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Performing basic locomotor movements (running, jumping, hopping) and manipulative skills (throwing, catching) with developing control.",
        "example_task": "Run across the hall, jump over the low hurdle and throw the beanbag into the hoop.",
        "example_response": "I ran with my arms swinging, jumped over the hurdle with two feet and threw the beanbag underarm. It landed near the hoop.",
        "common_errors": [
          "Running with arms held stiff at the sides instead of coordinating with legs",
          "Throwing with a stiff arm rather than a smooth underarm action"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Performing fundamental movement skills with improved coordination and consistency, beginning to link movements together smoothly.",
        "example_task": "Run, jump, land and immediately roll. Try to link the movements together without stopping.",
        "example_response": "I ran three steps, jumped off one foot, landed on two feet with bent knees and rolled sideways. The movements flowed together without a pause between them.",
        "common_errors": [
          "Stopping between each movement instead of linking them",
          "Landing with straight legs, which makes the transition to the roll difficult"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Demonstrating agility, balance and coordination across a range of movement activities, applying skills in different contexts with control and confidence.",
        "example_task": "Complete this obstacle course: balance along the bench, jump off the end, weave between the cones, catch the ball thrown to you.",
        "example_response": "I balanced along the bench with my arms out for stability, stepped carefully and didn't wobble. I jumped off with a controlled landing. I weaved quickly between the cones, changing direction sharply. I caught the ball cleanly with soft hands.",
        "common_errors": [
          "Rushing the balance section and falling off",
          "Not adjusting body position when changing direction through the cones"
        ]
      }
    ]
  },
  {
    "concept_id": "PE-KS1-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Understanding the basic difference between attacking (trying to score) and defending (trying to stop scoring) in simple games.",
        "example_task": "In this game, your team has the ball. Should you try to move towards the goal or stay where you are?",
        "example_response": "I should move towards the goal because my team is attacking. I need to try to get past the defenders to score.",
        "common_errors": [
          "Not understanding which direction to move when attacking or defending",
          "Standing still instead of moving into space"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using simple tactics in small-sided games: moving into space when attacking, marking an opponent when defending.",
        "example_task": "You are attacking in a 3v3 game. Your teammate has the ball. What should you do?",
        "example_response": "I should move into an open space away from the defender so my teammate can pass the ball to me. I need to call for the ball so they know where I am.",
        "common_errors": [
          "Running towards the teammate with the ball instead of finding space",
          "Not communicating with teammates during the game"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Applying attacking and defending tactics effectively in games, making quick decisions about when to pass, shoot or hold possession.",
        "example_task": "You have the ball near the goal but a defender is blocking your shot. What are your options?",
        "example_response": "I could pass to a teammate in a better position, try to dribble around the defender, or do a fake one way and shoot the other. I chose to pass because my teammate was open and closer to the goal, so they had a better chance of scoring.",
        "common_errors": [
          "Always trying to score individually instead of passing to a better-placed teammate",
          "Making decisions too slowly so the defending team closes down the space"
        ]
      }
    ]
  },
  {
    "concept_id": "PE-KS1-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Performing simple movement actions (jumping, turning, stretching, curling) and beginning to remember a short sequence of two or three movements.",
        "example_task": "Copy these three movements: stretch tall, curl into a ball, jump. Can you do them in order?",
        "example_response": "I stretched up as tall as I could, then curled down into a ball shape, then jumped up. I did them in the right order.",
        "common_errors": [
          "Forgetting the order of movements after seeing them demonstrated",
          "Rushing through movements without clear shapes or control"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Performing a sequence of movements with improving control and expression, using changes in level, speed and direction.",
        "example_task": "Create a four-movement dance sequence that includes a high movement, a low movement, a fast movement and a slow movement.",
        "example_response": "I started with a slow stretch reaching high (slow, high). Then a fast spin (fast). Then a slow sinking movement to the floor (slow, low). Then a fast jump back up (fast, high). I tried to move smoothly between each one.",
        "common_errors": [
          "Performing all movements at the same speed and level",
          "Not linking movements together — pausing between each one"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Creating and performing dance sequences that express ideas, moods or stories, with control, coordination and expressive quality in partnership or group work.",
        "example_task": "With a partner, create a short dance that tells the story of fire — starting small, growing and dying down. Perform it to music.",
        "example_response": "We started curled small on the floor, flickering our fingers (small flame). We gradually stood up, making bigger movements (fire growing). At the peak we moved quickly and expressively with big arm movements (blazing fire). Then we slowly sank back down, smaller and smaller, until we were still (embers dying). We matched our movements to the music and to each other.",
        "common_errors": [
          "Not connecting movements to the theme or story",
          "Working independently instead of with their partner"
        ]
      }
    ]
  },
  {
    "concept_id": "PE-KS1-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Entering the water confidently with support, moving through the water using aids, and putting the face in the water.",
        "example_task": "Climb into the pool using the steps. Hold the float and kick your legs to move across the pool.",
        "example_response": "I climbed in using the steps and held onto the float. I kicked my legs and moved across the pool. I put my face in the water and blew bubbles.",
        "common_errors": [
          "Refusing to put face in water due to fear",
          "Kicking from the knees rather than the hips"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Swimming short distances using a recognisable stroke (front crawl or backstroke) with developing coordination of arms and legs.",
        "example_task": "Swim 10 metres using front crawl. Try to coordinate your arm strokes with your leg kicks.",
        "example_response": "I swam 10 metres with my face in the water, turning my head to breathe. I kept my legs kicking steadily while my arms reached forward and pulled back through the water.",
        "common_errors": [
          "Lifting the head too high to breathe, which makes the legs sink",
          "Stopping kicking when concentrating on arm movements"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Swimming competently and confidently over a distance of at least 25 metres using one or more strokes, and demonstrating basic water safety skills.",
        "example_task": "Swim 25 metres using front crawl or backstroke. Then demonstrate a safe entry, treading water for 30 seconds and floating on your back.",
        "example_response": "I swam 25 metres front crawl with smooth, rhythmic strokes and steady breathing. Then I stepped in safely, trod water for 30 seconds using a gentle breaststroke kick, and floated on my back with my body relaxed and still.",
        "common_errors": [
          "Running out of energy before 25 metres because of inefficient technique",
          "Panicking when treading water instead of staying calm with steady movements"
        ]
      }
    ]
  },
  {
    "concept_id": "PE-KS1-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that physical activity makes the heart beat faster and the body feel warmer, and that it is good for health.",
        "example_task": "After running around the playground, put your hand on your chest. What do you notice?",
        "example_response": "My heart is beating really fast! I feel hot and I am breathing quickly. That's because my body was working hard.",
        "common_errors": [
          "Not connecting the physical feelings to the activity just completed",
          "Thinking that feeling out of breath means something is wrong"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing the short-term effects of exercise on the body and understanding that regular activity helps keep us healthy.",
        "example_task": "What happens to your body when you exercise? Why is it good to exercise regularly?",
        "example_response": "When I exercise, my heart beats faster to pump blood around my body. I breathe faster to get more oxygen. My muscles work harder and I get warm. Regular exercise keeps my heart strong, helps my muscles grow, and makes me feel happier and more energetic.",
        "common_errors": [
          "Knowing exercise is 'good for you' but not being able to explain why",
          "Not understanding the connection between heart rate and exercise"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining the link between physical activity, fitness and health, understanding different types of exercise and their benefits, and setting personal physical activity goals.",
        "example_task": "Describe three different types of exercise and explain what each one is good for. What physical activity goal would you set for yourself?",
        "example_response": "Running improves cardiovascular fitness — it makes the heart and lungs work harder. Climbing and gymnastics build strength — muscles get stronger. Yoga and stretching improve flexibility — you can bend and move more easily. My goal is to be active for at least 60 minutes every day, including running at playtime and cycling after school, because different activities improve different aspects of fitness.",
        "common_errors": [
          "Thinking only sports 'count' as exercise (walking, dancing and active play all count)",
          "Setting unrealistic goals instead of achievable, gradual targets"
        ]
      }
    ]
  }
]
