[
  {
    "concept_id": "RS-KS4-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Identifies basic beliefs of at least two religions using simple vocabulary, with limited awareness of differences between traditions.",
        "example_task": "Name two core beliefs of Christianity and two core beliefs of Islam.",
        "example_response": "Christians believe in the Trinity (God as Father, Son and Holy Spirit) and the Resurrection of Jesus. Muslims believe in Tawhid (the oneness of God) and that Muhammad is the final prophet.",
        "common_errors": [
          "Confuses beliefs from different religions, e.g. attributing the Trinity to Islam or Tawhid to Christianity.",
          "Lists practices (e.g. prayer, fasting) instead of theological beliefs when asked about doctrine."
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describes theological beliefs with some specialist vocabulary and explains their basic significance for believers, with limited reference to diversity within traditions.",
        "example_task": "Explain the significance of the doctrine of the Trinity for Christians.",
        "example_response": "The Trinity is the Christian doctrine that God exists as three persons — Father, Son and Holy Spirit — in one God. This is significant because it means Christians believe God is relational and that Jesus is fully divine, not just a prophet. The Incarnation — God becoming human in Jesus — depends on the Trinity, and it shapes Christian worship, which is directed to the triune God.",
        "common_errors": [
          "Describes the Trinity as three separate gods (tritheism) rather than three persons in one God.",
          "Explains what a doctrine is without explaining why it matters to believers' lives and worship."
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Explains theological concepts with accurate specialist vocabulary, demonstrates understanding of diversity within traditions, and evaluates the significance of beliefs for individuals and communities.",
        "example_task": "Explain how the concept of Tawhid shapes Islamic belief and practice, and evaluate whether it is the most important Islamic doctrine.",
        "example_response": "Tawhid — the absolute oneness of God — is the foundational doctrine of Islam. It means Allah is one, unique and without partners, which makes shirk (associating anything with God) the gravest sin. Tawhid shapes practice directly: the Shahadah declares God's oneness, daily prayer (salah) is directed to Allah alone, and the prohibition on images in mosques reflects Tawhid by preventing anything from becoming an object of worship alongside God. Sunni and Shi'a Muslims agree on Tawhid but differ on religious authority after the Prophet, showing that even shared doctrine leads to different structures of practice. Tawhid is arguably the most important doctrine because all other beliefs and practices flow from it — without the oneness of God, the structure of Islamic ethics, worship and community would be fundamentally different. However, some might argue that belief in the Qur'an as God's direct word is equally foundational, since without scriptural authority the specific content of Islamic teaching would lack its binding force.",
        "common_errors": [
          "Discusses Tawhid without connecting it to specific practices or lived religious experience.",
          "Presents Islam as monolithic, failing to acknowledge that Sunni and Shi'a traditions interpret authority and practice differently despite shared core beliefs."
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Analyses theological concepts with sophisticated precision, critically evaluates coherence and significance from both insider and outsider perspectives, and engages with the hermeneutic diversity within and between traditions.",
        "example_task": "Evaluate the claim that theological diversity within a religion undermines the authority of its core doctrines. Refer to at least two religions in your answer.",
        "example_response": "Theological diversity within a religion could be seen as undermining doctrinal authority if authority depends on unanimity — if Christians cannot agree on the meaning of the Atonement (penal substitution vs. Christus Victor vs. moral exemplar), this might suggest the doctrine lacks a definitive meaning. Similarly, the differences between Orthodox, Conservative and Reform Judaism on the binding nature of halakhah (religious law) might suggest that the authority of Torah is unstable. However, this argument rests on a flawed assumption: that doctrinal authority requires uniform interpretation. In practice, most religious traditions have always contained internal debate, and this diversity can be seen as a sign of intellectual vitality rather than weakness. The Catholic tradition explicitly accommodates development of doctrine (Newman), arguing that understanding deepens over time without the core truth changing. In Islam, the existence of four legitimate schools of jurisprudence (Hanafi, Maliki, Shafi'i, Hanbali) is itself a recognised principle — ikhtilaf (legitimate disagreement) — which strengthens rather than undermines the authority of the sources being interpreted. From an outsider perspective, persistent disagreement might suggest that religious truth claims are culturally constructed rather than divinely revealed. But from an insider perspective, diversity reflects the richness of engaging with transcendent truths that exceed any single human formulation. On balance, theological diversity does not undermine authority but reveals that authority operates through ongoing interpretation rather than fixed, univocal meaning.",
        "common_errors": [
          "Assumes that diversity automatically proves doctrines are wrong, rather than analysing how traditions themselves understand and accommodate internal disagreement.",
          "Fails to distinguish between core doctrines (where diversity is limited) and secondary theological questions (where diversity is expected and even encouraged)."
        ]
      }
    ]
  },
  {
    "concept_id": "RS-KS4-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Identifies basic ethical frameworks by name and gives simple definitions, with limited ability to apply them to specific issues.",
        "example_task": "What is Utilitarianism? Give a simple definition.",
        "example_response": "Utilitarianism is the idea that the right action is the one that produces the greatest happiness for the greatest number of people.",
        "common_errors": [
          "Confuses Utilitarianism with selfishness or personal happiness, rather than understanding it as maximising overall welfare.",
          "Cannot distinguish between different ethical frameworks, treating all non-religious ethics as the same thing."
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explains at least two ethical frameworks with some accuracy and applies them to a moral issue, showing awareness of how religious and secular approaches differ.",
        "example_task": "Explain how a utilitarian and a Natural Law approach would differ on the issue of euthanasia.",
        "example_response": "A utilitarian would assess euthanasia by looking at the consequences — if a terminally ill person is suffering with no hope of recovery, euthanasia might produce the least suffering overall and therefore be the right action. A Natural Law approach, associated with Aquinas and Catholic teaching, would argue that human life has intrinsic value given by God, and that intentionally ending life violates the primary precept of preserving life. Natural Law would say euthanasia is always wrong regardless of the consequences, because certain acts are intrinsically wrong. So the two frameworks disagree because Utilitarianism judges by outcomes while Natural Law judges by the nature of the act itself.",
        "common_errors": [
          "Applies frameworks inconsistently, e.g. using consequentialist reasoning when explaining Natural Law.",
          "Presents religious ethics as simply 'following rules' without acknowledging the reasoned principles behind religious moral positions."
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Applies multiple ethical frameworks accurately and consistently to contemporary issues, compares religious and secular approaches with precision, and evaluates the strengths and weaknesses of each framework.",
        "example_task": "Evaluate the claim that Situation Ethics is the most useful ethical framework for making decisions about medical ethics. Refer to at least one other framework in your answer.",
        "example_response": "Situation Ethics, developed by Joseph Fletcher, argues that the only absolute moral principle is agape (unconditional love) and that every ethical decision should be made by asking which action best serves love in the specific situation. For medical ethics, this has strengths: it allows flexibility in complex cases where rigid rules seem inadequate — for example, allowing a doctor to consider that switching off life support might be the most loving action for a patient in permanent vegetative state and their family. However, Situation Ethics has significant weaknesses: it gives no clear guidance on what 'love' requires in ambiguous cases, and different people could reach opposite conclusions about the same case while both claiming to act from love. By contrast, Natural Law provides clearer boundaries — the principle of double effect, for instance, allows pain relief that may shorten life (because the intention is to relieve suffering, not to kill) while prohibiting direct euthanasia. This specificity makes Natural Law more practically useful for medical professionals who need clear guidance. A utilitarian approach offers a different strength: it provides a method (cost-benefit analysis of consequences) that can be applied systematically, though it struggles with cases where the 'greatest happiness' calculation conflicts with individual patient rights. On balance, Situation Ethics is useful because it keeps the patient's individual circumstances central, but its vagueness means it works best alongside rather than instead of more structured frameworks.",
        "common_errors": [
          "Confuses Situation Ethics (a principled framework based on agape) with moral relativism (the view that there are no moral truths), failing to recognise that Fletcher's approach does have an absolute principle.",
          "Evaluates frameworks only in the abstract without applying them to concrete medical ethics cases, which weakens the analysis."
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Critically analyses the philosophical foundations and internal coherence of ethical frameworks, evaluates their adequacy for complex contemporary issues from multiple perspectives, and constructs sophisticated arguments that synthesise religious and secular reasoning.",
        "example_task": "'Religious ethical frameworks are fundamentally incompatible with secular ethical frameworks.' Evaluate this statement with reference to at least two ethical frameworks.",
        "example_response": "The claim of fundamental incompatibility rests on the assumption that religious ethics derives authority from divine command while secular ethics derives authority from human reason, and that these two sources are irreconcilable. There is some basis for this: divine command theory, in its strongest form, holds that an action is right because God commands it, which makes moral truth dependent on revelation rather than reason. A secular utilitarian would reject this entirely, grounding ethics in observable consequences rather than divine authority. However, the incompatibility thesis is overstated for several reasons. First, Natural Law — the dominant Catholic ethical framework — explicitly grounds moral reasoning in human rationality, arguing that moral truths are accessible to reason independently of revelation. Aquinas held that the natural law is 'nothing other than the rational creature's participation in the eternal law,' which means that a non-believer reasoning well about ethics can reach the same conclusions as a believer. This creates significant overlap with Kantian ethics, which also grounds morality in rational principles. Second, Situation Ethics draws on a principle — agape — that has philosophical parallels in secular care ethics and virtue ethics traditions that emphasise compassion and responsiveness to particular situations. Third, in practice, religious and secular ethicists frequently reach convergent conclusions on specific issues (e.g. the wrongness of torture, the importance of human rights) even when their underlying justifications differ. The philosopher John Rawls argued that overlapping consensus between religious and secular frameworks is both possible and politically necessary in pluralistic societies. What is genuinely different is not the content of ethical conclusions but the meta-ethical question of where moral authority ultimately resides — in a transcendent source or in human rational and social capacities. This is a real philosophical disagreement, but it does not make the frameworks 'fundamentally incompatible' at the level of practical moral reasoning.",
        "common_errors": [
          "Treats the question as a simple yes/no rather than analysing which aspects of religious and secular ethics are compatible and which genuinely diverge.",
          "Fails to engage with specific philosophical arguments (e.g. Natural Law's rationalist foundations, Rawls's overlapping consensus) that complicate the incompatibility thesis."
        ]
      }
    ]
  },
  {
    "concept_id": "RS-KS4-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Identifies key sacred texts for at least two religions and states that they are considered authoritative, with limited understanding of how or why.",
        "example_task": "Name the main sacred text for Christianity and for Islam, and explain one way each is used by believers.",
        "example_response": "The main sacred text for Christianity is the Bible, which is read in church services and used for personal prayer and guidance. The main sacred text for Islam is the Qur'an, which Muslims believe is the direct word of Allah revealed to Muhammad. Muslims recite it in daily prayers (salah).",
        "common_errors": [
          "States that all religious people interpret their scripture literally, ignoring the range of approaches to interpretation within traditions.",
          "Confuses the Qur'an (sacred text) with the Hadith (sayings and actions of the Prophet), or the Torah (first five books) with the Talmud (rabbinic commentary)."
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explains how sacred texts function as sources of authority in at least two religions, with some awareness that traditions differ in how they understand the status of scripture.",
        "example_task": "Explain the difference between how Muslims and Christians typically understand the authority of their sacred texts.",
        "example_response": "Muslims believe the Qur'an is the direct, unchanged word of Allah, revealed in Arabic to the Prophet Muhammad through the angel Jibril. This means the Qur'an has absolute authority — it is not a human text that can be revised or reinterpreted freely. Christians generally believe the Bible is divinely inspired but written by human authors, which means it reflects both God's message and the historical context in which it was written. This difference matters because it affects how the texts are used: Muslims learn to recite the Qur'an in Arabic and treat the physical text with great respect, while Christians are more likely to interpret the Bible in light of its historical context and to accept that some passages reflect the culture of their time rather than timeless commands.",
        "common_errors": [
          "Presents the Christian view of the Bible as uniform, ignoring that evangelical Christians often hold a much higher view of biblical authority than liberal Christians.",
          "Describes the status of texts without explaining why these differences matter for how believers actually use and interpret them."
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses how different sources of authority (scripture, tradition, reason, experience) interact within religious traditions, and evaluates the significance and limitations of scriptural authority with reference to specific examples of interpretive disagreement.",
        "example_task": "Explain why Christians disagree about the authority of the Bible on ethical issues, using a specific example to illustrate your answer.",
        "example_response": "Christians disagree about biblical authority on ethical issues because they hold different views about the nature of scripture and how it should be interpreted. Conservative evangelical Christians tend to hold that the Bible is the inerrant word of God and that its moral teachings are binding and timeless. Liberal Christians tend to see the Bible as divinely inspired but culturally situated, meaning its moral teachings must be interpreted in light of their historical context. The issue of homosexuality illustrates this clearly: Leviticus 18:22 and Romans 1:26-27 appear to prohibit same-sex relationships, and conservative Christians cite these passages as clear divine commands. Liberal Christians argue that these passages must be understood in their ancient cultural context, that the concept of a committed same-sex relationship did not exist in biblical times, and that the overarching biblical principle of love and inclusion should take precedence over specific prohibitions. The Catholic position adds a further dimension: the Magisterium (teaching authority of the Church) interprets scripture authoritatively, so individual Catholics are expected to follow the Church's interpretation rather than their own reading. This disagreement reveals that the Bible's authority is not self-interpreting — it requires a hermeneutic framework, and which framework is used determines what the text is understood to teach.",
        "common_errors": [
          "Presents the disagreement as simply 'some follow the Bible and some don't,' rather than analysing different approaches to interpretation that all claim to take the Bible seriously.",
          "Fails to explain the hermeneutic principle at stake — that the same text can support different conclusions depending on the interpretive framework applied to it."
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Critically evaluates the epistemological basis of scriptural authority, analyses how the four sources of authority (scripture, tradition, reason, experience) generate both convergence and conflict within and between traditions, and engages with the hermeneutic challenges of treating ancient texts as contemporary moral guides.",
        "example_task": "'Sacred texts cannot provide reliable moral guidance because they were written in a very different time and culture.' Evaluate this statement with reference to at least two religious traditions.",
        "example_response": "This statement raises a genuine hermeneutic challenge: if sacred texts reflect the assumptions and norms of their historical context, their moral authority may be limited to that context. The Bible permits slavery (Ephesians 6:5), prescribes the death penalty for adultery (Leviticus 20:10), and assigns women subordinate roles (1 Timothy 2:12) — positions that virtually all contemporary Christians reject. Similarly, some Qur'anic passages on women's testimony and inheritance reflect 7th-century Arabian social structures. If these culturally embedded teachings are no longer binding, the question arises: on what basis do believers decide which teachings are timeless and which are culturally contingent? However, the statement is too sweeping for several reasons. First, religious traditions have always engaged in interpretive development: the Jewish tradition of midrash and Talmudic commentary represents two millennia of reinterpreting Torah for new contexts, and the principle that 'the Torah was not given to angels' (it must be applicable to real human life) has driven continuous reinterpretation. The Qur'anic concept of maqasid al-shariah (the higher objectives of Islamic law — preservation of life, intellect, faith, lineage and property) provides an internal framework for distinguishing between the specific rulings of a historical context and the underlying ethical principles they were intended to serve. Second, the claim that cultural distance makes moral guidance unreliable proves too much: by the same logic, we should dismiss Aristotle's virtue ethics or Kant's categorical imperative, which are also products of specific cultural contexts. The real question is not whether texts are culturally situated — all texts are — but whether they contain principles that transcend their original context. The philosophical hermeneutics of Gadamer suggests that the 'fusion of horizons' between text and reader is precisely where meaning is generated, making cultural distance productive rather than simply problematic. On balance, sacred texts cannot be applied mechanically as moral rulebooks, but they can provide reliable moral guidance when read within a mature interpretive tradition that distinguishes enduring principles from contingent applications.",
        "common_errors": [
          "Treats the question as simply about whether scripture is 'outdated,' rather than engaging with the sophisticated hermeneutic traditions that religious communities have developed to address exactly this challenge.",
          "Fails to recognise that the objection applies equally to all historical texts used as moral guides (Aristotle, Kant, Mill), not only to religious scripture."
        ]
      }
    ]
  },
  {
    "concept_id": "RS-KS4-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Identifies that different religions exist in the same society and recognises basic terms like pluralism and tolerance, with limited understanding of the theological issues involved.",
        "example_task": "What is meant by 'religious pluralism'?",
        "example_response": "Religious pluralism means that many different religions exist together in the same society. In Britain, for example, there are Christians, Muslims, Hindus, Sikhs, Jews, Buddhists and people with no religion all living together.",
        "common_errors": [
          "Defines pluralism only as a social fact (many religions exist) without recognising it as a theological position (whether multiple religions can be equally true).",
          "Confuses pluralism with secularism, thinking that a pluralist society is one where religion has no role in public life."
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explains the three theological positions on religious pluralism (exclusivism, inclusivism, pluralism) with examples, and describes the purpose of interfaith dialogue.",
        "example_task": "Explain the difference between exclusivism, inclusivism and pluralism, giving a religious example of each.",
        "example_response": "Exclusivism is the belief that only one religion has the full truth and is the path to salvation. For example, some evangelical Christians believe that only through faith in Jesus Christ can a person be saved (John 14:6 — 'I am the way, the truth and the life'). Inclusivism is the belief that one religion is the fullest expression of truth but that other religions may contain elements of truth. For example, the Catholic Church (since Vatican II) teaches that while the fullness of truth is in Christianity, other religions can contain 'seeds of the Word' and their followers may be saved through God's grace. Pluralism is the belief that all major religions are different but equally valid paths to the same ultimate reality. The philosopher John Hick argued that different religions are like people looking at the same mountain from different sides — each sees a true but partial view.",
        "common_errors": [
          "Presents pluralism as obviously correct and exclusivism as obviously wrong, rather than analysing the theological reasoning behind each position.",
          "Describes the three positions without using any specific religious examples or thinkers to illustrate them."
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Evaluates the strengths and weaknesses of different positions on religious pluralism, analyses the purpose and challenges of interfaith dialogue, and distinguishes between political tolerance and theological pluralism.",
        "example_task": "Evaluate whether interfaith dialogue requires giving up the belief that your own religion is the truest. Refer to different Christian perspectives in your answer.",
        "example_response": "Interfaith dialogue does not necessarily require abandoning the belief that your own religion is truest. The purpose of dialogue can vary: it may aim at mutual understanding without theological agreement, practical cooperation on shared concerns (poverty, climate change, peace), or deeper theological exchange. An exclusivist Christian might engage in dialogue to bear witness to their faith while learning to understand others' beliefs more accurately — this is dialogue as mission, not compromise. An inclusivist, following the Vatican II document Nostra Aetate, might seek dialogue because they believe God's truth is partially present in other traditions and engagement can deepen everyone's understanding. A pluralist like John Hick would approach dialogue as an encounter between equally valid perspectives, where each participant may be transformed by encountering truth in another tradition. The key distinction is between political tolerance (respecting others' right to hold different beliefs, which all positions can affirm) and theological pluralism (believing all religions are equally true, which only one position affirms). Interfaith dialogue only requires the former, not the latter. The Scriptural Reasoning movement, which brings Jews, Christians and Muslims together to read each other's sacred texts, demonstrates that deep theological engagement is possible without anyone abandoning their own convictions. However, critics argue that meaningful dialogue requires genuine openness to being changed by the encounter, which may be difficult if one enters with the firm conviction that the other is fundamentally wrong.",
        "common_errors": [
          "Conflates political tolerance (respecting others' rights to believe differently) with theological pluralism (believing all religions are equally true), which are fundamentally different commitments.",
          "Presents interfaith dialogue as always harmonious, without acknowledging genuine theological disagreements that participants may find irreconcilable."
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Critically analyses the philosophical assumptions underlying different positions on religious pluralism, evaluates truth claims across traditions with sophistication, and engages with the tension between religious conviction and pluralist commitments in contemporary society.",
        "example_task": "'In a pluralist society, exclusivist religious truth claims are harmful and should not be expressed in public.' Evaluate this statement.",
        "example_response": "This statement reflects a tension at the heart of liberal pluralist societies: how to balance freedom of religious expression with the commitment to equal respect for all citizens. The case for restricting exclusivist truth claims in public rests on several arguments: such claims can marginalise minorities (telling someone their religion is false is inherently disrespectful), they can undermine social cohesion in diverse societies, and they may contribute to discrimination or hostility. From a Rawlsian perspective, public reason in a pluralist democracy should be conducted in terms accessible to all citizens, not in terms that depend on particular religious convictions. However, the statement is problematic for several reasons. First, it is self-contradictory: claiming that exclusivist truth claims should be excluded from public discourse is itself an exclusivist claim about what kinds of speech are legitimate. The philosopher Jurgen Habermas acknowledged this in his later work, arguing that secular citizens must recognise that religious contributions to public discourse may contain important truths that deserve translation rather than exclusion. Second, the historical evidence suggests that suppressing religious expression does not reduce social conflict but drives it underground — France's strict laicite has arguably intensified rather than resolved tensions around Muslim identity. Third, from a religious perspective, the right to proclaim one's faith is fundamental to religious freedom itself; a pluralism that permits only private religious conviction is not genuinely pluralist but covertly secularist. The most defensible position is that exclusivist truth claims are legitimate in public discourse provided they are expressed through reasoned argument rather than coercion, and provided they are accompanied by political tolerance — the recognition that others have the right to hold and express different views. The distinction between 'I believe my religion is true and others are mistaken' (a theological claim) and 'others should not be allowed to practise their religion' (a political claim) is crucial. A mature pluralist society can accommodate the former while firmly rejecting the latter.",
        "common_errors": [
          "Fails to recognise the paradox that excluding exclusivist claims from public discourse is itself an exclusivist move, which undermines the internal coherence of the argument.",
          "Does not distinguish between the right to hold and express exclusivist beliefs and the use of those beliefs to justify discrimination or coercion — these are fundamentally different issues."
        ]
      }
    ]
  },
  {
    "concept_id": "RS-KS4-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Identifies the concept of sanctity of life and states that most religions teach that life is sacred, with limited ability to explain the reasoning or apply the principle.",
        "example_task": "What do Christians mean by the 'sanctity of life'?",
        "example_response": "Christians believe that all human life is sacred and special because humans are created by God in His image (imago Dei). This means that life should be protected and that it is wrong to take a human life.",
        "common_errors": [
          "Presents the sanctity of life as meaning that killing is always wrong in every circumstance, without recognising that most Christian traditions allow exceptions (e.g. just war, self-defence).",
          "Cannot explain why life is considered sacred, stating only that 'it just is' rather than connecting it to theological reasoning about creation or divine purpose."
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explains the sanctity of life principle with reference to its theological foundations in at least two traditions, and applies it to at least one ethical issue with some awareness of different religious perspectives.",
        "example_task": "Explain how the sanctity of life principle is used in religious arguments about abortion. Refer to at least two religious perspectives.",
        "example_response": "The sanctity of life principle teaches that human life has special value given by God and must be protected. Christians who hold a strong sanctity of life position, particularly Catholics, argue that life begins at conception and therefore abortion is always wrong because it destroys a life created by God. The Catholic Church teaches that the embryo has a soul from the moment of conception and that abortion violates the commandment 'thou shalt not kill.' However, some Protestant Christians, such as members of the Church of England, take a more nuanced view: while they affirm the sanctity of life, they accept that in some circumstances (such as risk to the mother's life or pregnancy resulting from rape) abortion may be the lesser of two evils. In Islam, most scholars agree that ensoulment occurs at 120 days after conception (based on a hadith), so abortion before this point may be permitted for serious reasons, though it is generally discouraged. After ensoulment, abortion is haram (forbidden) except to save the mother's life, because her established life takes precedence.",
        "common_errors": [
          "Presents all religious views as identical ('all religions are against abortion'), ignoring significant differences in reasoning and in the circumstances where exceptions are permitted.",
          "Fails to explain the theological reasoning behind different positions, simply listing what each religion 'says' without analysing why."
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses the sanctity of life principle alongside alternative frameworks (quality of life, autonomy), evaluates its application to complex ethical issues from multiple religious and secular perspectives, and considers objections and counter-arguments.",
        "example_task": "Evaluate whether the sanctity of life principle or the quality of life principle should be given more weight in decisions about euthanasia. Refer to religious and non-religious arguments.",
        "example_response": "The sanctity of life principle holds that life has intrinsic value regardless of its condition, which means it is wrong to intentionally end a life even when a person is suffering. The Catholic doctrine of double effect allows pain relief that may shorten life (because the intention is to relieve suffering, not to cause death) but prohibits direct euthanasia. This position has the strength of providing a clear, non-negotiable boundary that protects vulnerable people from pressure to end their lives. However, the quality of life principle argues that the value of life is connected to the experience of living — that a life of unrelievable suffering, with no prospect of improvement, may have lost the qualities that make it worth living. Secular ethicists like Peter Singer argue that respect for personal autonomy means individuals should be able to choose when their suffering becomes unbearable. From a utilitarian perspective, prolonging a life of suffering when the person wishes to die creates unnecessary harm. Some liberal Christians and Reform Jews argue that compassion — a core religious value — may sometimes require helping someone to die peacefully rather than insisting they endure prolonged suffering. The strongest religious counter-argument is that suffering can have redemptive meaning (Catholic theology of suffering) and that God alone has the right to determine when life ends. The practical concern is also significant: if quality of life becomes the criterion, who determines what quality is 'sufficient'? The experience of disabled people who report high life satisfaction despite conditions that others assume make life not worth living shows that quality of life judgements are subjective and potentially discriminatory. On balance, neither principle alone is adequate: the sanctity of life provides essential protections, but in extreme cases where a competent adult faces terminal suffering, the quality of life principle adds a necessary dimension of compassion and respect for autonomy.",
        "common_errors": [
          "Treats sanctity of life and quality of life as simple opposites rather than analysing how they interact and where they might be reconciled.",
          "Ignores the practical safeguarding concerns that religious and secular opponents of euthanasia share — the risk of pressure on vulnerable people to choose death."
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Critically evaluates the philosophical coherence and practical implications of sanctity of life and human dignity frameworks, synthesises religious and secular reasoning with nuance, and engages with edge cases that test the limits of these principles.",
        "example_task": "'The concept of the sanctity of life is incoherent because religious traditions that affirm it also permit killing in certain circumstances.' Evaluate this statement.",
        "example_response": "This statement identifies a genuine tension: if life is sacred and inviolable, how can the same traditions that affirm this also justify killing in war (just war theory in Christianity and Islam), capital punishment (historically affirmed in Judaism, Christianity and Islam), and self-defence? The charge of incoherence has force if the sanctity of life is understood as an absolute prohibition on taking life. However, the major religious traditions have never understood it in this simplistically absolute way. The Catholic tradition distinguishes between the direct, intentional killing of the innocent (which is always prohibited) and other forms of killing that may be justified under specific conditions. The principle of double effect allows actions whose primary intention is good (e.g. defending the innocent in war) even if death results as a foreseen but unintended side effect. Just war theory (developed by Augustine and Aquinas) does not abandon the sanctity of life but argues that sometimes protecting innocent life requires the use of lethal force against aggressors. In Islamic jurisprudence, the concept of darura (necessity) allows exceptions to general prohibitions in extreme circumstances, while the framework of jihad (in its military sense) is governed by strict conditions that aim to minimise harm to non-combatants. The more sophisticated understanding is that the sanctity of life is not a simple rule ('never kill') but a prima facie principle — it creates a strong presumption against taking life that can only be overridden by weighty moral reasons, typically involving the protection of other lives. This is philosophically coherent: medical ethics operates similarly with the principle of non-maleficence (do no harm), which generates a strong presumption against harmful interventions but allows them when the alternative is worse. The real test of coherence is whether the exceptions are principled (governed by clear criteria that preserve the spirit of the original principle) or ad hoc (invoked whenever convenient). The careful development of just war criteria, the principle of double effect, and the conditions for legitimate self-defence suggest principled exception-making rather than incoherence. Where traditions do become vulnerable to the charge of incoherence is when the exceptions expand to undermine the principle — as critics of capital punishment argue has happened in traditions that affirm sanctity of life while permitting the state to execute offenders.",
        "common_errors": [
          "Accepts the 'incoherence' charge at face value without analysing the sophisticated philosophical frameworks (double effect, just war, prima facie principles) that religious traditions have developed to resolve the apparent contradiction.",
          "Fails to distinguish between a principle being absolute (no exceptions ever) and being prima facie (strong presumption that can be overridden by weighty reasons) — this distinction is essential to the coherence question."
        ]
      }
    ]
  },
  {
    "concept_id": "RS-KS4-C006",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Identifies key practices and forms of worship in at least two religions and names basic sources of authority, with limited understanding of the connection between belief and practice.",
        "example_task": "Describe one form of worship in Christianity and one in Islam.",
        "example_response": "In Christianity, a key form of worship is the Eucharist (also called Holy Communion or Mass), where Christians share bread and wine to remember the death of Jesus. In Islam, a key form of worship is salah, the five daily prayers performed facing Makkah, which include physical movements such as standing, bowing and prostrating.",
        "common_errors": [
          "Describes practices without any reference to the beliefs that give them meaning, e.g. describing the Eucharist without mentioning Jesus's Last Supper or the concept of sacrifice.",
          "Presents practices as uniform across a religion, e.g. describing all Christian worship as if it follows the same pattern, ignoring differences between Catholic Mass, Quaker silence and Pentecostal worship."
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explains how specific practices express theological beliefs and describes the role of different sources of authority in governing practice, with some awareness of diversity within traditions.",
        "example_task": "Explain how the practice of salah (daily prayer) in Islam expresses key Islamic beliefs.",
        "example_response": "Salah expresses several core Islamic beliefs. Praying five times a day demonstrates submission to Allah's will, which is the meaning of 'Islam' itself. The requirement to face Makkah (the qiblah) expresses the unity of the Muslim community (ummah) — all Muslims worldwide pray in the same direction. The physical movements of salah — standing, bowing and prostrating — express the relationship between the worshipper and Allah: prostration (sujud) is the ultimate act of humility before God, reflecting the doctrine of Tawhid (God's absolute oneness and supremacy). The words recited during salah are from the Qur'an, particularly Surah Al-Fatihah, which reinforces the authority of scripture in daily life. Wudu (ritual washing) before prayer expresses the importance of spiritual and physical purity. The authority for salah comes from both the Qur'an and the Hadith, which record how the Prophet Muhammad performed the prayers and therefore provide the model that Muslims follow.",
        "common_errors": [
          "Describes the mechanics of salah (times, movements, direction) without explaining how these connect to theological beliefs about God, community and submission.",
          "Treats salah as identical for all Muslims, without acknowledging differences in practice between Sunni and Shi'a traditions (e.g. combining prayers, use of a turbah)."
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analyses the relationship between belief, practice and authority within and between traditions, evaluates the significance of practices for believers and communities, and accounts for diversity of practice within traditions with specific examples.",
        "example_task": "Evaluate the claim that religious practices are more important than beliefs for understanding a religion. Refer to at least two religions in your answer.",
        "example_response": "The claim that practices are more important than beliefs has significant support. In Judaism, orthopraxis (correct practice) is arguably more central than orthodoxy (correct belief): observing Shabbat, keeping kosher and performing mitzvot define Jewish identity more than holding specific theological positions. A Jew who observes the commandments while having private doubts about God's existence may be considered more authentically Jewish than one who believes in God but does not practise. This suggests that for Judaism, practice is primary. Similarly, in Islam, the Five Pillars are all practices (shahada, salah, zakat, sawm, hajj) — the framework of Islamic life is defined by what you do, not just what you believe. However, the countervailing argument is equally strong: practices without understanding of the beliefs behind them become empty rituals. Christian theology emphasises that the Eucharist is meaningful because of the belief in Christ's sacrifice — without that belief, sharing bread and wine is merely a communal meal. Protestant Christianity, particularly since the Reformation, has emphasised personal faith (sola fide) over external observance. Furthermore, religious reform movements (such as Progressive Judaism or liberal Islam) often challenge traditional practices precisely on the basis of theological beliefs about justice, equality and the nature of God's intention. The most accurate conclusion is that belief and practice are interdependent rather than separable: practices express and reinforce beliefs, while beliefs give meaning and motivation to practices. The balance between the two varies significantly between and within traditions, making generalisation unreliable.",
        "common_errors": [
          "Treats the belief-practice relationship as identical across all religions, rather than recognising that different traditions weight this relationship differently.",
          "Discusses practices and beliefs in isolation rather than analysing how they interact — e.g. how performing salah reinforces belief in Tawhid, or how belief in Christ's presence shapes the experience of the Eucharist."
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Critically evaluates how sources of authority operate within traditions, including how authority is contested and negotiated, analyses the significance of practice in both theological and sociological terms, and engages with the question of how traditions maintain continuity while adapting to contemporary contexts.",
        "example_task": "'Religious authority is always contested, never settled.' Evaluate this statement with reference to at least two religious traditions and their sources of authority.",
        "example_response": "This statement captures an important truth about how religious authority functions in practice, though it overstates the case. In Christianity, the question of authority has been contested since the Reformation, when Luther challenged the Pope's authority with the principle of sola scriptura (scripture alone). Yet this 'resolution' created new contests: if scripture alone is authoritative, who interprets it? The result has been centuries of denominational division over exactly this question. The Catholic Church's Magisterium (teaching authority) claims to settle interpretive disputes definitively through papal infallibility (defined at Vatican I, 1870) and conciliar authority, but even this is contested: the reception of Humanae Vitae (1968, prohibiting artificial contraception) shows that magisterial authority does not automatically produce assent, since the majority of Catholic laity in Western countries do not follow this teaching. In Islam, the absence of a centralised clergy means authority is distributed among scholars (ulama), and the existence of multiple schools of jurisprudence (Hanafi, Maliki, Shafi'i, Hanbali in Sunni Islam; Ja'fari in Shi'a Islam) institutionalises legitimate disagreement. Yet certain elements of authority are largely uncontested: the Qur'an's status as the direct word of Allah is accepted by virtually all Muslim traditions, providing a stable foundation even as its interpretation is debated. The Shi'a concept of the Imamate — that religious authority passed through designated descendants of the Prophet — represents a fundamental contestation of Sunni assumptions about authority, demonstrating that even the most basic structural questions can remain unresolved for 1,400 years. However, the statement 'never settled' is too strong: within specific communities, authority is often functionally settled even if theoretically contestable. An Orthodox Jewish community functions on the settled authority of halakhah as interpreted by its posek (decisor); a Sunni Muslim following the Hanafi school operates within a settled framework of jurisprudential authority. The sociological reality is that authority is settled enough for communities to function coherently, while remaining contested enough to generate reform, schism and development. This dynamic tension — between the need for settled authority to sustain communal life and the inevitability of contestation as contexts change — is arguably constitutive of living religious traditions rather than a deficiency in them.",
        "common_errors": [
          "Treats authority as either completely fixed or completely fluid, rather than analysing the dynamic between settled practice and ongoing contestation within specific communities and traditions.",
          "Discusses authority in purely abstract terms without grounding the analysis in specific historical examples of how authority has been challenged, defended and renegotiated."
        ]
      }
    ]
  }
]
