[
  {
    "concept_id": "SC-KS2-C052",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that the Sun is a star and that the Earth and other planets orbit (go around) the Sun.",
        "example_task": "Does the Sun go around the Earth, or does the Earth go around the Sun?",
        "example_response": "The Earth goes around the Sun. The Sun is a star in the centre and the Earth is a planet that orbits it.",
        "common_errors": [
          "Thinking the Sun orbits the Earth because it appears to move across the sky",
          "Not knowing that the Sun is a star"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Naming the eight planets in order from the Sun and understanding that the Sun is at the centre of our solar system (heliocentric model).",
        "example_task": "Name the eight planets in order from the Sun.",
        "example_response": "Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, Neptune. A memory aid is 'My Very Enthusiastic Mother Just Served Us Nachos'. Mercury is closest to the Sun and Neptune is the furthest.",
        "common_errors": [
          "Including Pluto as a planet (reclassified as a dwarf planet in 2006)",
          "Getting the order of the outer planets confused"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Describing the solar system model including relative sizes and distances, and understanding that the heliocentric model replaced the geocentric model through evidence.",
        "example_task": "For hundreds of years, people believed the Sun went around the Earth. What evidence led Copernicus to propose the opposite?",
        "example_response": "The geocentric model (Earth at the centre) was the accepted view for over 1,000 years, based on Ptolemy's work. Copernicus studied the movement of planets and found that their apparent motion — including retrograde movement where planets seem to go backward — could be explained much more simply if all planets, including Earth, orbited the Sun. Later, Galileo's telescope observations supported this: he saw moons orbiting Jupiter (proving not everything orbits Earth) and phases of Venus (only explainable if Venus orbits the Sun). This shows how scientific ideas change when new evidence challenges old models.",
        "common_errors": [
          "Thinking the geocentric model was simply 'wrong' rather than the best explanation available at the time",
          "Not understanding that scientific models change based on evidence"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Understanding the vast scale of the solar system and explaining why human perception makes the heliocentric model counterintuitive.",
        "example_task": "If you shrank the Sun to the size of a football, how far away would the Earth be and how big would it be? Why does the Sun appear to move across our sky if it is really the Earth that moves?",
        "example_response": "If the Sun were a football (22cm), the Earth would be a peppercorn (2mm) about 24 metres away — nearly the length of a swimming pool. Jupiter would be a cherry, 125 metres away. Neptune would be 770 metres away. Space is unimaginably vast. The Sun appears to move across our sky because we are standing on a spinning planet. It is like sitting on a merry-go-round — the landscape appears to move around you, but you are the one rotating. Our senses cannot detect Earth's rotation because everything on Earth rotates with us. This is why the geocentric model seemed so obvious for centuries — our everyday experience is exactly what you would expect if the Sun were moving. Only careful astronomical observations revealed the truth.",
        "common_errors": [
          "Not appreciating how vast the real distances are",
          "Not explaining why our senses are misled about who is moving"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C053",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that the Earth spins and this is what causes day and night.",
        "example_task": "Why does it get dark at night?",
        "example_response": "The Earth spins around once every day. The side facing the Sun has daytime (it is light). The side facing away from the Sun has night-time (it is dark). As the Earth keeps spinning, our part moves from day into night and back again.",
        "common_errors": [
          "Thinking the Sun disappears or goes behind the Moon at night",
          "Not connecting Earth's spinning to the day-night cycle"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explaining that the Earth rotates on its axis once every 24 hours, and using a model (globe and torch) to demonstrate day and night.",
        "example_task": "Use a globe and a torch to show how day and night work. Mark where we live.",
        "example_response": "I shine the torch at the globe — this represents the Sun. The lit side is daytime and the dark side is night-time. I mark our position (UK) on the globe. When I slowly rotate the globe, our position moves from the light side into the dark side and back again. One full rotation takes 24 hours. When it is daytime for us, it is night-time for people on the opposite side of the Earth (like New Zealand).",
        "common_errors": [
          "Rotating the torch instead of the globe",
          "Thinking the Earth only spins when it is night"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining how Earth's rotation causes the Sun to appear to move across the sky from east to west, and understanding time zones as evidence of Earth's rotation.",
        "example_task": "The Sun rises in the east and sets in the west. Does the Sun actually move? What really happens?",
        "example_response": "The Sun does not actually move across our sky — the Earth rotates from west to east, so from our perspective the Sun appears to move from east to west. It is like looking out of a train window — the landscape appears to move backward, but you are the one moving forward. Time zones are evidence for Earth's rotation: when it is noon in London, it is already evening in Tokyo (9 hours ahead) and early morning in New York (5 hours behind). This is because different parts of the Earth face the Sun at different times as it rotates. If the Earth did not rotate, one side would always have daylight and the other would always be dark.",
        "common_errors": [
          "Saying the Sun moves across the sky rather than explaining it is an apparent movement",
          "Not using time zones as evidence for Earth's rotation"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using the rotation model to explain observable phenomena like shadow changes during the day and why sunrise/sunset times change with the seasons.",
        "example_task": "At 9am, your shadow points west. At noon, it points north. At 3pm, it points east. Explain this pattern using your knowledge of Earth's rotation.",
        "example_response": "Shadows always point away from the light source. As the Earth rotates, the Sun appears to move across the sky from east to west. At 9am, the Sun is in the east (low in the sky), so shadows point west and are long. At noon, the Sun is highest in the south (in the UK), so shadows point north and are shortest. At 3pm, the Sun has moved to the west, so shadows point east and are getting longer again. The changing shadow direction through the day traces the Sun's apparent path, which is really caused by our rotating viewpoint on Earth. Ancient civilisations used this principle to build sundials — the shadow's direction tells the time because Earth's rotation is constant and predictable.",
        "common_errors": [
          "Not connecting shadow direction to the Sun's apparent position",
          "Forgetting that shadows are longest when the Sun is lowest (morning and evening)"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C054",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that the Moon goes around the Earth and is not a star or a planet.",
        "example_task": "What is the Moon? Does it go around the Sun or around the Earth?",
        "example_response": "The Moon goes around the Earth. It is not a star and not a planet. It is a moon — a natural satellite that orbits a planet.",
        "common_errors": [
          "Thinking the Moon is a planet or a star",
          "Not knowing that the Moon orbits the Earth"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Understanding that the Moon orbits the Earth approximately once every 28 days, and that it does not produce its own light — it reflects sunlight.",
        "example_task": "The Moon looks bright at night. Does it make its own light?",
        "example_response": "No. The Moon does not produce its own light — it is not a star. It looks bright because it reflects light from the Sun. The Sun's light bounces off the Moon's surface and reaches our eyes. This is why the Moon can sometimes look different — we see different amounts of the sunlit side as it orbits the Earth over about 28 days.",
        "common_errors": [
          "Thinking the Moon produces its own light like a star",
          "Not understanding that the Moon is visible because of reflected sunlight"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining why the Moon appears to change shape (phases) over a month, using a model of the Sun-Earth-Moon system.",
        "example_task": "Why does the Moon look like a full circle some nights and a thin crescent on other nights?",
        "example_response": "The Moon is always a sphere, but we only see the part that is lit by the Sun. As the Moon orbits the Earth over 28 days, we see it from different angles. When the Moon is between the Earth and Sun, the lit side faces away from us — we see a new moon (dark). As it orbits further, we see more of the lit side — crescent, quarter, gibbous. When the Earth is between the Sun and Moon, we see the fully lit side — a full moon. Then the visible lit area decreases again. The Moon does not actually change shape — our viewing angle changes as it orbits.",
        "common_errors": [
          "Thinking the Moon's phases are caused by Earth's shadow (that is a lunar eclipse)",
          "Confusing the Moon's monthly phase cycle with a lunar eclipse"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Comparing Earth's Moon with moons of other planets and explaining the three-body system of Sun, Earth and Moon.",
        "example_task": "Jupiter has at least 95 moons. Earth has one. Mars has two. Why do different planets have different numbers of moons?",
        "example_response": "The number of moons a planet has relates mainly to its size and gravity. Jupiter is the largest planet with enormously strong gravity, so it has captured many moons — some are tiny rocky objects, while others like Ganymede are larger than Mercury. Mars is small with weaker gravity and has only captured two tiny moons (Phobos and Deimos). Earth's Moon is unusual — it is very large relative to Earth and was probably formed when a Mars-sized object collided with early Earth, flinging debris into orbit that coalesced into the Moon. Venus and Mercury have no moons at all, possibly because they are too close to the Sun, whose gravity would pull potential moons away. Each planet's moon system tells us something about its history and gravitational environment.",
        "common_errors": [
          "Thinking all moons formed the same way",
          "Not connecting the number of moons to the planet's gravitational strength"
        ]
      }
    ]
  }
]