[
  {
    "concept_id": "SC-KS2-C011",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Naming the main parts of a plant (roots, stem, leaves, flower) when shown a diagram or real specimen.",
        "example_task": "Label the four main parts of this plant on the diagram: roots, stem, leaves, flower.",
        "example_response": "Labels correctly placed: roots at the bottom in the soil, stem going upward, leaves growing from the stem, flower at the top.",
        "common_errors": [
          "Swapping the position of roots and stem labels",
          "Not recognising that roots are usually underground"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Naming each main part and describing its primary function: roots absorb water, stems support and transport, leaves make food, flowers enable reproduction.",
        "example_task": "What does each part of a plant do? Match each part to its function: roots, stem, leaves, flower.",
        "example_response": "Roots: absorb water and minerals from the soil and anchor the plant. Stem: holds the plant up and carries water from the roots to the leaves. Leaves: use sunlight to make food for the plant (photosynthesis). Flower: produces seeds so the plant can reproduce.",
        "common_errors": [
          "Thinking roots absorb food from the soil (they absorb water and minerals)",
          "Not knowing that leaves make food using light"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining how the structure of each plant part is related to its function, using evidence from investigations (e.g. coloured water experiment for stems).",
        "example_task": "We put a white carnation in blue water and after 24 hours the petals turned blue. What does this tell us about what stems do?",
        "example_response": "The blue colour appeared in the petals because the stem transported the blue water upward from the glass to the flower. This proves that stems contain tubes that carry water up through the plant. The stem is like a set of tiny pipes. If we cut the stem in half, we would see the blue dye in the thin tubes inside. This water transport system connects the roots (which absorb water) to the leaves and flowers (which need water).",
        "common_errors": [
          "Thinking the whole flower turned blue rather than the water travelling through specific tubes",
          "Not connecting the observation to the function of the stem"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining how different plant parts work together as a system, and predicting what would happen if one part were damaged or missing.",
        "example_task": "A gardener accidentally cut through most of the stem of a tomato plant. Predict what will happen to the leaves and fruit above the cut. Explain using what you know about plant part functions.",
        "example_response": "The leaves above the cut will wilt and die because the stem can no longer transport water from the roots up to them. Without water, the leaves cannot carry out photosynthesis to make food. Any developing tomatoes will stop growing because they need both water and the food made by the leaves. The parts below the cut might survive because the roots can still absorb water and the lower leaves can still make food. This shows that all parts of a plant work together as a system — damage to one part affects all the others.",
        "common_errors": [
          "Thinking only the stem would be affected, not the leaves and fruit",
          "Not explaining the chain of consequences (no water → no photosynthesis → no food → no growth)"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C012",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Naming what plants need to grow: water, light and warmth, from prior KS1 knowledge.",
        "example_task": "What three things does a plant need to grow?",
        "example_response": "Water, light and a warm place.",
        "common_errors": [
          "Saying 'soil' without understanding that soil provides water and minerals, not food",
          "Forgetting light"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Listing the full set of plant requirements — air, light, water, nutrients from soil and room to grow — and explaining that plants make their own food.",
        "example_task": "Name five things plants need to survive. How do plants get their food?",
        "example_response": "Plants need air (carbon dioxide), light (from the Sun), water (from rain or watering), nutrients from the soil (minerals) and room to grow. Unlike animals, plants make their own food in their leaves using light — this is called photosynthesis.",
        "common_errors": [
          "Saying plants get their food from the soil (the most persistent misconception in plant biology)",
          "Forgetting that air (carbon dioxide) is essential"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Describing the results of investigations into plant requirements, using evidence to explain why each requirement is necessary.",
        "example_task": "We grew four plants: one with everything, one without light, one without water, one without soil nutrients (grown in washed sand). Describe and explain the results.",
        "example_response": "The plant with everything grew well — tall, green, healthy leaves. Without light, the plant grew tall but was yellow and weak because it could not photosynthesise to make food or the green pigment chlorophyll. Without water, the plant wilted and dried because water is needed for photosynthesis and to keep cells firm. Without nutrients, the plant grew but the leaves turned yellow at the edges because it lacked minerals like nitrogen for making chlorophyll. Each requirement plays a different role in keeping the plant healthy.",
        "common_errors": [
          "Describing the results without explaining why each deficiency caused the specific symptoms",
          "Confusing the effect of no light (yellow, tall) with no water (wilted, dry)"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining how plants make their own food using light energy (photosynthesis concept, without chemical detail), and why this makes them fundamentally different from animals.",
        "example_task": "A pupil says 'Plants eat food from the soil just like we eat food from our plates.' Explain what is wrong with this comparison. Where does a plant's food actually come from?",
        "example_response": "This is a common misunderstanding. Plants do not eat food from the soil — they make their own food inside their leaves using photosynthesis. The plant takes in carbon dioxide from the air through its leaves and water from the soil through its roots. Using energy from sunlight, it converts these into glucose (sugar), which is its food. Soil provides water and dissolved minerals (like fertiliser), but these are raw materials, not food. Animals must eat other organisms for food, but plants are producers — they create food from simple substances using light energy. This is why food chains always start with a plant.",
        "common_errors": [
          "Accepting the 'plants eat from the soil' misconception",
          "Not explaining the difference between raw materials (water, minerals) and food (glucose)"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C013",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that water travels up through a plant from the roots to the leaves and flowers.",
        "example_task": "Where does the water go after the roots absorb it?",
        "example_response": "The water goes up through the stem to the leaves and flowers.",
        "common_errors": [
          "Thinking water stays in the roots",
          "Not knowing water moves upward against gravity"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing the journey of water through a plant — roots absorb it, stem transports it upward, leaves use it — and describing the coloured water investigation as evidence.",
        "example_task": "Describe how water moves through a plant. What evidence do we have?",
        "example_response": "Water is absorbed by the roots from the soil. It travels upward through tubes inside the stem. It reaches the leaves where it is used for photosynthesis, and the flowers where we can see it. The evidence is the coloured carnation experiment — when we put a white flower in blue water, the petals turned blue after 24 hours, proving water travels up the stem to the flower.",
        "common_errors": [
          "Not mentioning the evidence from the coloured water experiment",
          "Saying the plant 'sucks' water up without mentioning the transport tubes"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining water transport in plants with reference to specialised tubes in the stem, linking root function to water availability and leaf function to water loss.",
        "example_task": "Cut a celery stalk that has been sitting in red food colouring for 24 hours. Describe what you see and explain what it tells us about water transport.",
        "example_response": "When I cut across the celery, I can see small red dots in a ring — these are the transport tubes (xylem vessels) that carry water upward. The red dye shows exactly where the water travels inside the stem. The tubes are narrow and run the whole length of the stem. Water enters through the roots, travels up through these tubes, and reaches the leaves where some evaporates into the air. This evaporation from the leaves actually helps pull more water up — like sucking through a very thin straw.",
        "common_errors": [
          "Thinking water travels through the whole stem rather than through specific tubes",
          "Not connecting what they see in the cross-section to the function of the stem"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining the mechanism that drives water upward (evaporation from leaves creates a pull) and predicting how environmental conditions affect water transport rate.",
        "example_task": "On a hot, windy day, plants wilt more quickly than on a cool, still day. Use your knowledge of water transport to explain why.",
        "example_response": "On a hot, windy day, water evaporates from the leaves much faster than on a cool, still day. The heat increases evaporation rate and the wind carries the water vapour away quickly, encouraging even more evaporation. This means the plant loses water from its leaves faster than the roots can absorb and the stem can transport it. The result is the plant wilts because the cells lose their water pressure. On a cool, still day, evaporation is slower, so the roots and stem can keep up with the water loss. This is why gardeners water plants more in hot weather — the plant needs more water because it is losing it faster.",
        "common_errors": [
          "Not connecting leaf evaporation rate to the wilting",
          "Thinking the heat directly damages the plant rather than causing faster water loss"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C014",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Naming two or three stages of a flowering plant's life cycle in the correct order.",
        "example_task": "Put these stages in order: flower, seed, seedling, adult plant.",
        "example_response": "Seed → seedling → adult plant → flower.",
        "common_errors": [
          "Putting the flower before the adult plant",
          "Not recognising that the cycle starts again when flowers produce seeds"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing the main stages of the flowering plant life cycle — germination, growth, pollination, seed formation, seed dispersal — in a circular diagram.",
        "example_task": "Draw a circular life cycle diagram for a flowering plant. Label each stage.",
        "example_response": "Circular diagram: Seed → Germination (root and shoot emerge) → Growth (stem, leaves develop) → Flowering (flowers form) → Pollination (pollen transferred) → Seed formation (seeds develop inside fruit) → Seed dispersal (seeds spread away from parent) → back to Seed. Arrows show the continuous cycle.",
        "common_errors": [
          "Drawing a linear diagram instead of a circular one",
          "Missing pollination or seed dispersal stages"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining the function of each stage in the life cycle, including the role of flowers in reproduction, and describing how pollination and seed dispersal occur.",
        "example_task": "Explain what happens during pollination and why it is important for the plant's life cycle.",
        "example_response": "Pollination is the transfer of pollen from the stamen (male part) of a flower to the stigma (female part) of a flower of the same species. This can happen by insects (they carry pollen on their bodies as they visit flowers for nectar) or by wind (which blows light pollen from one flower to another). Pollination is essential because it leads to fertilisation — when pollen reaches the ovule, a seed begins to form. Without pollination, the plant cannot make seeds, so it cannot reproduce. This is why flowers have bright colours and nectar — to attract pollinating insects.",
        "common_errors": [
          "Confusing pollination with seed dispersal",
          "Not distinguishing between insect and wind pollination"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Comparing the life cycles of different flowering plants, explaining variations in pollination and dispersal strategies, and evaluating why some strategies are more successful in certain environments.",
        "example_task": "Compare how a dandelion and a cherry tree disperse their seeds. Which strategy is better? Can you say one is 'better' than the other?",
        "example_response": "A dandelion disperses seeds by wind — each seed has a tiny parachute that carries it far away. A cherry tree disperses seeds by animals — birds eat the fruit and drop or excrete the seed far from the parent tree. Neither is 'better' — they are suited to different conditions. Wind dispersal lets dandelions spread rapidly across open fields with no animals needed. Animal dispersal lets cherry trees reach new habitats and provides fertiliser (droppings) with the seed. Each strategy is successful in the right environment. The fact that both species are common shows both work well. Evolution does not produce one 'best' solution — it produces many solutions adapted to different conditions.",
        "common_errors": [
          "Saying one strategy is 'better' without considering context",
          "Not linking dispersal method to the structure of the seed or fruit"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C015",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that pollen needs to get from one flower to another for seeds to form, with visual support.",
        "example_task": "Look at this picture of a bee on a flower. What is the bee doing? What is the yellow powder on its legs?",
        "example_response": "The bee is drinking nectar from the flower. The yellow powder is pollen that stuck to its legs.",
        "common_errors": [
          "Thinking bees collect pollen on purpose to help plants",
          "Not knowing the word 'pollen'"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing pollination as the transfer of pollen between flowers, naming insects and wind as the two main methods.",
        "example_task": "What is pollination? How does pollen get from one flower to another?",
        "example_response": "Pollination is when pollen is moved from one flower to another. It can happen by insects — bees and butterflies carry pollen on their bodies when they visit flowers. It can also happen by wind — the wind blows pollen through the air from one plant to another.",
        "common_errors": [
          "Confusing pollination with fertilisation",
          "Thinking only bees pollinate (butterflies, moths, flies and beetles also do)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Comparing insect-pollinated and wind-pollinated flowers, linking their different structures to their pollination method.",
        "example_task": "Compare the features of a buttercup (insect-pollinated) and a grass flower (wind-pollinated). Why do they look so different?",
        "example_response": "The buttercup has bright yellow petals to attract insects, a sweet smell and nectar to reward visiting bees. Its pollen is sticky so it attaches to insect bodies. The grass flower has no colourful petals — it does not need to attract insects. It produces huge amounts of light, dusty pollen that blows easily in the wind. Its stigmas are large and feathery to catch drifting pollen. They look different because they use different pollination strategies — one relies on attracting animals, the other on air currents.",
        "common_errors": [
          "Not linking the flower features to the pollination method",
          "Thinking all flowers are insect-pollinated"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining the ecological importance of pollination and predicting consequences if pollinators declined.",
        "example_task": "Scientists report that bee populations are declining worldwide. What effect could this have on flowering plants and on humans?",
        "example_response": "If bee populations decline, many insect-pollinated plants would produce fewer seeds because less pollen would be transferred. This would affect wildflowers and also crops — about a third of the food we eat depends on insect pollination, including apples, strawberries, tomatoes and almonds. Fewer crops would mean food shortages and higher prices. Other animals that depend on seeds and fruits would also be affected. Wind-pollinated plants like wheat and grass would not be directly affected. This shows how one species (bees) connects to many others — it is an example of interdependence. Scientists are working to understand why bees are declining and how to protect them.",
        "common_errors": [
          "Thinking only honey would be affected if bees decline",
          "Not connecting bee decline to food crops and the wider ecosystem"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C016",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that seeds need to spread away from the parent plant, and naming one way seeds travel.",
        "example_task": "Why do seeds need to move away from the parent plant? Name one way seeds can travel.",
        "example_response": "Seeds need to move away so they have space to grow without competing with the parent plant. Seeds can be blown by the wind.",
        "common_errors": [
          "Not understanding why seeds need to spread (competition for light, water, space)",
          "Thinking seeds can only travel by wind"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Naming the four main seed dispersal methods — wind, water, animal (internal and external) and explosive — and giving an example of each.",
        "example_task": "Name four ways seeds can be dispersed. Give an example plant for each.",
        "example_response": "Wind: dandelion seeds have parachutes. Water: coconuts float to new islands. Animal (eaten): birds eat berries and drop the seeds in their droppings. Animal (carried): burdock seeds have hooks that stick to animal fur. Explosive: pea pods burst open and fling seeds out.",
        "common_errors": [
          "Forgetting explosive dispersal",
          "Not distinguishing between seeds carried inside animals (eaten) and outside (hooks)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Linking the structure of seeds and fruits to their dispersal method, and explaining how the structure helps the seed travel.",
        "example_task": "Look at these seeds: sycamore wing, cherry fruit, burdock head, poppy capsule. Explain how the shape of each one is related to how it travels.",
        "example_response": "Sycamore wing: the wing shape makes it spin like a helicopter, which slows it down and lets the wind carry it further. Cherry: the sweet, colourful flesh attracts birds who eat it — the hard seed inside passes through the bird and is deposited far away. Burdock: the tiny hooks catch on animal fur or human clothing, carrying the seed to a new location. Poppy capsule: it has small holes at the top — when the wind shakes the dried stem, seeds are scattered like a pepper pot. Each seed's structure is an adaptation for its specific dispersal method.",
        "common_errors": [
          "Describing the seeds without linking structure to function",
          "Calling all seed-containing structures 'fruits' only when they look like supermarket fruit"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating the advantages and disadvantages of different dispersal methods and explaining why plants have evolved specific dispersal strategies.",
        "example_task": "Wind dispersal spreads seeds far but most seeds land in unsuitable places. Animal dispersal is more targeted — seeds end up in areas with soil and nutrients (in droppings). Why do both strategies exist? Why has evolution not settled on one 'best' method?",
        "example_response": "Both strategies exist because they work well in different environments. Wind dispersal is good for open habitats like grasslands — plants do not need animals to be present. It spreads many seeds widely, so even if most fail, some will land in good spots. Animal dispersal is effective in forests where wind is blocked by trees — animals carry seeds beyond the canopy. Seeds in droppings get a dose of fertiliser. Different plants evolved in different habitats where different strategies gave the best chance of success. Evolution does not find one perfect solution — it finds many solutions adapted to local conditions. Having multiple strategies across plant species also increases overall biodiversity.",
        "common_errors": [
          "Arguing that one method is universally better",
          "Not connecting dispersal strategy to the plant's habitat and ecology"
        ]
      }
    ]
  }
]