[
  {
    "concept_id": "SC-KS3-C051",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that plants make their own food using sunlight, water, and carbon dioxide, and that oxygen is produced.",
        "example_task": "What do plants need to make food? What do they produce?",
        "example_response": "Plants need sunlight, water, and carbon dioxide to make food. They produce glucose (a type of sugar) for energy and oxygen, which is released into the air.",
        "common_errors": [
          "Thinking plants get their food from the soil through their roots rather than making it themselves",
          "Not identifying all three requirements (sunlight, water, carbon dioxide) for photosynthesis"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writing the word equation for photosynthesis and identifying the role of chlorophyll and chloroplasts.",
        "example_task": "Write the word equation for photosynthesis and explain where in the plant cell it takes place.",
        "example_response": "Carbon dioxide + water → glucose + oxygen (light energy is needed). Photosynthesis takes place in the chloroplasts, which are found mainly in leaf cells. Chloroplasts contain chlorophyll, the green pigment that absorbs light energy. This is why leaves are green — chlorophyll reflects green light and absorbs red and blue light.",
        "common_errors": [
          "Confusing the reactants and products — writing oxygen as a reactant instead of a product",
          "Thinking chlorophyll is the same as chloroplast rather than understanding that chlorophyll is a pigment inside the chloroplast"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Explaining the photosynthesis equation with correct identification of reactants, products, and energy transfer, and understanding how to test for the products.",
        "example_task": "A student places pondweed (Elodea) in water under a bright lamp. Bubbles appear. Explain what is happening and how the student could confirm the gas being produced.",
        "example_response": "The pondweed is photosynthesising. It is using light energy absorbed by chlorophyll to convert carbon dioxide and water into glucose and oxygen. The bubbles are oxygen gas, a product of photosynthesis. To confirm it is oxygen, the student could collect the gas in an inverted test tube over water and test it with a glowing splint — if it relights, the gas is oxygen. The student could also test a leaf for starch (the storage form of glucose) using the iodine test: decolorise the leaf in boiling ethanol, then add iodine solution — a blue-black colour confirms starch is present, showing photosynthesis has occurred.",
        "common_errors": [
          "Not recognising that photosynthesis is an endothermic reaction that requires light energy input",
          "Confusing the test for oxygen (relights a glowing splint) with the test for hydrogen (squeaky pop with a burning splint)"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Analysing factors that affect the rate of photosynthesis and explaining how the equation relates to energy transfer and the global carbon cycle.",
        "example_task": "A greenhouse grower increases the CO₂ concentration, temperature, and light intensity in their greenhouse. Explain why this increases crop yield, and identify which factor would become limiting first at very high levels.",
        "example_response": "Increasing CO₂ concentration, light intensity, and temperature each increase the rate of photosynthesis up to a point, meaning more glucose is produced for plant growth and crop yield increases. However, each can become a limiting factor. If light intensity is very high but CO₂ is low, adding more light has no effect — CO₂ is limiting. At very high temperatures (above approximately 40°C), enzymes involved in photosynthesis denature, so the rate drops sharply despite abundant light and CO₂ — temperature becomes limiting in a destructive way. The grower must balance all three factors. This connects to the carbon cycle: photosynthesis removes CO₂ from the atmosphere and converts it into organic compounds, making plants the primary entry point for carbon into food chains. Without photosynthesis, almost no energy would enter living systems.",
        "common_errors": [
          "Not understanding that limiting factors interact — increasing one factor only helps if it is currently the limiting one",
          "Thinking higher temperature always increases the rate, without recognising enzyme denaturation at high temperatures"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS3-C052",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that plants are the starting point of most food chains because they make food from sunlight.",
        "example_task": "Why are plants important for animals that do not eat plants?",
        "example_response": "Even animals that do not eat plants depend on them. A fox eats a rabbit, and the rabbit eats grass. Without the grass making food from sunlight, the rabbit would have no food, and then the fox would have no food either. Plants are the start of almost all food chains.",
        "common_errors": [
          "Thinking only herbivores depend on plants, without recognising that carnivores depend on them indirectly",
          "Not connecting plant food production to the idea of energy entering food chains"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Understanding that photosynthesis is the process that captures light energy and converts it into chemical energy, forming the basis of almost all ecosystems.",
        "example_task": "Explain why photosynthesis is described as the basis of almost all life on Earth.",
        "example_response": "Photosynthesis converts light energy from the Sun into chemical energy stored in glucose. Plants (producers) use this glucose for growth and energy. When animals (consumers) eat plants, they obtain this stored chemical energy. This energy passes through the food chain from herbivores to carnivores. Photosynthesis also produces the oxygen that most organisms need for aerobic respiration. Without photosynthesis, there would be almost no food and very little oxygen — most life on Earth depends on it.",
        "common_errors": [
          "Forgetting that photosynthesis produces oxygen as well as glucose, and that this oxygen sustains aerobic organisms",
          "Thinking photosynthesis only benefits the plant that carries it out"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Explaining the role of photosynthesis in energy flow through ecosystems and its contribution to atmospheric oxygen, including the role of marine phytoplankton.",
        "example_task": "A student says 'Trees are the lungs of the Earth — they produce all our oxygen.' Evaluate this statement.",
        "example_response": "The statement is partially correct but oversimplified. Trees do produce oxygen through photosynthesis, and forests are important carbon sinks. However, the majority of Earth's oxygen (estimated at 50-80%) is produced by marine phytoplankton — microscopic photosynthetic organisms in the oceans. So it is more accurate to say the oceans are the lungs of the Earth. Additionally, photosynthesis does more than produce oxygen: it captures light energy and converts it into chemical energy in glucose, which is the energy source for almost all food chains on Earth. Both terrestrial plants and marine phytoplankton are crucial producers (autotrophs) that form the base of their respective food webs.",
        "common_errors": [
          "Thinking all oxygen comes from trees and forests, not recognising the major contribution of marine phytoplankton",
          "Not distinguishing between a producer's role in oxygen production and its role in energy capture for food chains"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Analysing exceptions to photosynthesis as the basis of life and evaluating the global consequences of disrupting photosynthesis.",
        "example_task": "Deep-sea hydrothermal vents support thriving communities of organisms, yet no sunlight reaches them. How is this possible, and what does it tell us about the role of photosynthesis?",
        "example_response": "Hydrothermal vent communities are based on chemosynthesis, not photosynthesis. Chemosynthetic bacteria use chemical energy from hydrogen sulfide and other chemicals released by the vents to produce organic molecules — they are the producers in these ecosystems. This shows that while photosynthesis is the basis of almost all life on Earth, it is not the only way to capture energy for living systems. However, vent communities are rare exceptions. If photosynthesis were disrupted globally (for example, by volcanic ash blocking sunlight), food chains on land and in the upper oceans would collapse, atmospheric CO₂ would rise because it was no longer being absorbed, oxygen levels would gradually fall, and a mass extinction would follow. The vent communities would be among the few survivors, demonstrating the overwhelming importance of photosynthesis for the vast majority of life.",
        "common_errors": [
          "Not knowing that chemosynthesis exists as an alternative energy-capture process",
          "Thinking that disrupting photosynthesis would only affect plants, without recognising the cascading effect on all dependent organisms and atmospheric composition"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS3-C053",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that leaves are green and flat, and that this helps them catch sunlight for photosynthesis.",
        "example_task": "Why are most leaves broad and flat?",
        "example_response": "Leaves are broad and flat to give them a large surface area. This helps them absorb as much sunlight as possible for photosynthesis. The more light a leaf can catch, the more food the plant can make.",
        "common_errors": [
          "Not linking the shape of the leaf to the function of absorbing light",
          "Thinking leaves are flat just because that is how they grow, with no functional reason"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying key structural features of leaves and explaining how each adaptation supports photosynthesis.",
        "example_task": "Name three features of a leaf that make it well adapted for photosynthesis.",
        "example_response": "1. Broad, flat shape — provides a large surface area to absorb maximum sunlight. 2. Thin structure — keeps the diffusion distance short so carbon dioxide can reach the photosynthesising cells quickly. 3. Stomata (small pores) on the underside — allow carbon dioxide to enter the leaf and oxygen to leave. These adaptations work together to maximise the rate of photosynthesis.",
        "common_errors": [
          "Listing features without explaining how each one helps photosynthesis",
          "Not mentioning stomata or confusing them with other leaf structures"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Explaining the internal structure of a leaf cross-section and how each tissue layer contributes to efficient photosynthesis.",
        "example_task": "Draw and label a cross-section of a leaf. Explain why the palisade mesophyll layer is near the top surface.",
        "example_response": "A leaf cross-section shows several layers: the upper epidermis (transparent, lets light through), the palisade mesophyll (tall, tightly packed cells full of chloroplasts), the spongy mesophyll (loosely packed cells with air spaces for gas exchange), the lower epidermis (with stomata for gas entry and exit), and veins containing xylem (brings water) and phloem (transports glucose away). The palisade mesophyll is near the top surface because it receives the most sunlight — its cells are packed with chloroplasts to maximise light absorption. The tall, columnar shape of palisade cells means many chloroplasts can be stacked in a small area. The spongy mesophyll has air spaces that allow CO₂ to diffuse from the stomata to the palisade cells efficiently.",
        "common_errors": [
          "Confusing xylem (transports water up) with phloem (transports sugars away from the leaf)",
          "Not explaining why the palisade layer is positioned near the top rather than at the bottom of the leaf"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluating how leaf adaptations vary in different environments and explaining trade-offs between photosynthesis efficiency and water conservation.",
        "example_task": "Cactus plants have leaves reduced to spines, while water lilies have broad flat leaves on the water surface. Explain how each leaf adaptation suits its environment.",
        "example_response": "Cacti live in hot, dry deserts where water loss is the main survival challenge. Their leaves are reduced to spines, which have a tiny surface area — this drastically reduces water loss through transpiration. Photosynthesis occurs in the thick, green stem instead. The trade-off is a lower rate of photosynthesis compared to a broad-leaved plant, but this is outweighed by the survival advantage of conserving water. Water lilies live in freshwater where water is abundant but competition for light is intense. Their leaves are broad and flat, floating on the water surface to maximise light absorption. Stomata are on the upper surface (unlike most land plants) because the underside is in contact with water. Air spaces in the leaves provide buoyancy. The trade-off here is vulnerability to shading by other floating plants. These examples show that leaf adaptations are a balance between maximising photosynthesis and coping with environmental constraints — there is no single 'best' leaf design.",
        "common_errors": [
          "Not identifying the trade-off in each adaptation (e.g., cacti sacrifice photosynthetic rate for water conservation)",
          "Thinking all plants photosynthesise in their leaves, without recognising that some (like cacti) use stems"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS3-C054",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that all living things need energy and that they get it by breaking down food (glucose) inside their cells.",
        "example_task": "Why do you need to eat food?",
        "example_response": "You need to eat food because your body breaks down the food to release energy. This energy is used for everything your body does — moving, growing, keeping warm, and even thinking. This process of releasing energy from food happens inside every cell in your body, all the time.",
        "common_errors": [
          "Thinking energy comes from breathing rather than from breaking down food in cells",
          "Confusing eating (taking in food) with respiration (releasing energy from food in cells)"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writing the word equation for aerobic respiration and understanding that it occurs in all living cells continuously.",
        "example_task": "Write the word equation for aerobic respiration. Where does it take place in the cell?",
        "example_response": "Glucose + oxygen → carbon dioxide + water (+ energy released). Aerobic respiration takes place mainly in the mitochondria of cells. It is an exothermic reaction — it releases energy. This happens in every living cell (plants, animals, fungi, bacteria) all the time, not just during exercise. The energy released is used for muscle contraction, maintaining body temperature, growth, nerve impulses, and active transport.",
        "common_errors": [
          "Confusing respiration with breathing — respiration is the chemical process in cells, breathing is the mechanical process of ventilating the lungs",
          "Thinking only animals respire — all living organisms, including plants, respire continuously"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Explaining aerobic respiration as an exothermic reaction, identifying the role of mitochondria, and comparing it with photosynthesis.",
        "example_task": "A student says 'Respiration is the opposite of photosynthesis.' Evaluate this statement.",
        "example_response": "This statement is a useful simplification but is not entirely accurate. Looking at the equations, they are indeed the reverse of each other: photosynthesis uses CO₂ and water to make glucose and oxygen, while aerobic respiration uses glucose and oxygen to produce CO₂ and water. However, they are not simply 'opposite' processes. Photosynthesis occurs only in cells with chloroplasts and only when light is available; respiration occurs in all living cells continuously (in the mitochondria). Photosynthesis is endothermic (absorbs light energy); respiration is exothermic (releases energy). Plants carry out both processes — they photosynthesise and respire. During the day, the rate of photosynthesis typically exceeds the rate of respiration, so there is a net uptake of CO₂. At night, only respiration occurs, so there is a net release of CO₂.",
        "common_errors": [
          "Thinking photosynthesis and respiration cannot occur in the same organism at the same time",
          "Not recognising that plants respire continuously but only photosynthesise when light is available"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Explaining how the rate of aerobic respiration is affected by different factors and connecting respiration to metabolic processes across the organism.",
        "example_task": "During intense exercise, a runner's breathing rate and heart rate both increase dramatically. Explain why, linking your answer to aerobic respiration at the cellular level.",
        "example_response": "During intense exercise, muscle cells contract more frequently and require much more energy. This energy comes from aerobic respiration, which uses glucose and oxygen and produces carbon dioxide and water. To sustain the increased rate of respiration, the body must deliver more oxygen and glucose to the muscle cells and remove more carbon dioxide. The heart rate increases to pump blood faster, delivering oxygen (carried by haemoglobin in red blood cells) and glucose to the muscles and carrying away CO₂. The breathing rate increases to take in more oxygen from the air into the blood (at the alveoli in the lungs) and to expel the excess CO₂. If oxygen delivery cannot keep up with demand, the muscles begin to respire anaerobically as well (producing lactic acid). The increased CO₂ in the blood is detected by chemoreceptors, which signal the brain to further increase breathing rate. This is a coordinated whole-body response to meet the cellular demand for aerobic respiration.",
        "common_errors": [
          "Describing the response (breathing faster, heart beating faster) without explaining why at the cellular level (increased demand for oxygen and glucose for respiration)",
          "Not connecting the removal of CO₂ to the need to prevent build-up, which would lower blood pH"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS3-C055",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that the body can release energy from food without oxygen, but this is less efficient and can cause tiredness.",
        "example_task": "What happens in your muscles when you sprint very fast and cannot get enough oxygen?",
        "example_response": "When you sprint very fast, your muscles need more energy than aerobic respiration can provide because there is not enough oxygen. Your body can still release some energy from glucose without oxygen — this is called anaerobic respiration. It produces lactic acid, which builds up in the muscles and makes them ache and feel tired.",
        "common_errors": [
          "Thinking the body stops producing energy entirely when there is not enough oxygen",
          "Not knowing that lactic acid is the product that causes muscle fatigue"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writing the word equation for anaerobic respiration in animals and in yeast, and distinguishing fermentation from aerobic respiration.",
        "example_task": "Write the word equations for anaerobic respiration in (a) animals and (b) yeast. How is fermentation used by humans?",
        "example_response": "In animals: glucose → lactic acid (+ some energy released). In yeast: glucose → ethanol + carbon dioxide (+ some energy released). This process in yeast is called fermentation. Humans use fermentation in brewing (yeast produces ethanol in beer and wine) and baking (yeast produces CO₂ gas, which makes bread dough rise; the ethanol evaporates during baking). Both types of anaerobic respiration release much less energy than aerobic respiration because glucose is only partially broken down.",
        "common_errors": [
          "Confusing the products in animals (lactic acid) with the products in yeast (ethanol and carbon dioxide)",
          "Thinking anaerobic respiration produces no energy at all, rather than less energy than aerobic respiration"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Explaining the incomplete breakdown of glucose in anaerobic respiration, the concept of oxygen debt, and the biological and industrial significance of fermentation.",
        "example_task": "After a 100m sprint, a runner continues to breathe heavily for several minutes even though they have stopped running. Explain why.",
        "example_response": "During the sprint, the muscles could not get enough oxygen for aerobic respiration alone, so they also used anaerobic respiration. This produced lactic acid, which accumulated in the muscles. After the sprint, the runner has an 'oxygen debt' — they need extra oxygen to break down the lactic acid. The lactic acid is transported in the blood to the liver, where it is converted back to glucose using oxygen. The heavy breathing after exercise provides the extra oxygen needed to repay this oxygen debt. The heart rate also stays elevated to transport lactic acid to the liver and deliver oxygen. This is why recovery takes several minutes — the body must process all the accumulated lactic acid.",
        "common_errors": [
          "Not explaining that oxygen debt is the extra oxygen needed to break down lactic acid after exercise",
          "Thinking lactic acid is broken down in the muscles rather than being transported to the liver"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Comparing the energy yields and evolutionary advantages of aerobic and anaerobic respiration, and evaluating industrial applications of fermentation.",
        "example_task": "Some organisms, such as certain bacteria, are obligate anaerobes — they can only respire anaerobically and are actually killed by oxygen. What advantage might anaerobic respiration have had for early life on Earth?",
        "example_response": "Earth's early atmosphere contained virtually no free oxygen — it was rich in methane, ammonia, and CO₂. The earliest life forms must have been anaerobic, using anaerobic respiration to release energy from organic molecules without oxygen. This was the only option available. When photosynthetic organisms evolved and began producing oxygen (the Great Oxygenation Event, about 2.4 billion years ago), oxygen was actually toxic to many existing anaerobes. Some anaerobic organisms survived in oxygen-free environments (deep sediments, marshes, the gut) and remain obligate anaerobes today. Other organisms evolved to tolerate and then exploit oxygen — aerobic respiration releases approximately 19 times more energy per glucose molecule than anaerobic respiration, providing a significant selective advantage. Today, most complex multicellular life depends on aerobic respiration because the higher energy yield supports the greater energy demands of larger, more complex bodies. Facultative anaerobes (like yeast and human muscle cells) can switch between both pathways, giving them flexibility.",
        "common_errors": [
          "Not connecting the evolution of anaerobic respiration to the oxygen-free early atmosphere",
          "Failing to quantify the energy difference — aerobic respiration releases approximately 19 times more energy per glucose molecule than anaerobic respiration"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS3-C056",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that there are two types of respiration — one that uses oxygen and one that does not — and that the one using oxygen releases more energy.",
        "example_task": "What is the main difference between aerobic and anaerobic respiration?",
        "example_response": "Aerobic respiration uses oxygen and releases a lot of energy from glucose. Anaerobic respiration does not use oxygen and releases much less energy. Aerobic respiration is used most of the time; anaerobic respiration is used when there is not enough oxygen, like during very intense exercise.",
        "common_errors": [
          "Thinking aerobic and anaerobic respiration are completely separate processes rather than two ways of releasing energy from glucose",
          "Not recognising that the key difference is whether or not oxygen is used"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Comparing aerobic and anaerobic respiration in terms of reactants, products, and energy yield using a structured comparison.",
        "example_task": "Complete a comparison table for aerobic and anaerobic respiration, including reactants, products, energy released, and where each occurs.",
        "example_response": "Aerobic: reactants are glucose and oxygen; products are carbon dioxide and water; releases a large amount of energy; occurs in the mitochondria. Anaerobic (in animals): reactant is glucose; product is lactic acid; releases a small amount of energy; occurs in the cytoplasm. Anaerobic (in yeast): reactant is glucose; products are ethanol and carbon dioxide; releases a small amount of energy; occurs in the cytoplasm. Both types break down glucose to release energy, but aerobic respiration fully breaks down glucose while anaerobic respiration only partially breaks it down, which is why less energy is released.",
        "common_errors": [
          "Not distinguishing between anaerobic respiration in animals (lactic acid) and in yeast (ethanol + CO₂)",
          "Forgetting that anaerobic respiration occurs in the cytoplasm, not in the mitochondria"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Explaining why both types of respiration can occur simultaneously and how the balance shifts depending on oxygen availability and exercise intensity.",
        "example_task": "During a long-distance race, at what point does a runner switch from aerobic to anaerobic respiration? Explain the energy implications.",
        "example_response": "The runner does not simply 'switch' — both aerobic and anaerobic respiration can occur simultaneously. At a steady pace, aerobic respiration provides most of the energy because sufficient oxygen is delivered to the muscles. As the runner increases pace or nears the end of the race, the muscles demand more energy than aerobic respiration alone can supply. Anaerobic respiration supplements the energy supply by partially breaking down glucose without oxygen, producing lactic acid. The balance shifts — more anaerobic, less purely aerobic — as intensity increases. The trade-off is that lactic acid accumulates, causing muscle fatigue and pain, and the energy yield per glucose molecule is much lower. This is why a sprinter cannot maintain maximum speed for long — lactic acid builds up too quickly. A marathon runner maintains a pace where aerobic respiration dominates, conserving glucose and avoiding excessive lactic acid build-up.",
        "common_errors": [
          "Describing it as a simple switch from aerobic to anaerobic rather than a shifting balance where both occur simultaneously",
          "Not explaining the trade-off between energy yield and lactic acid accumulation"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluating the biochemical reasons for the difference in energy yield and applying the comparison to real-world contexts including training, medicine, and industry.",
        "example_task": "Explain why aerobic respiration releases approximately 19 times more energy per glucose molecule than anaerobic respiration. How does understanding this help athletes train more effectively?",
        "example_response": "In aerobic respiration, glucose is completely broken down into carbon dioxide and water — all the chemical energy stored in the glucose molecule is released. In anaerobic respiration, glucose is only partially broken down — the products (lactic acid or ethanol) still contain significant chemical energy that has not been released. This is why fermentation products like ethanol are flammable — they still have stored energy. The approximately 19-fold difference in energy yield means the body strongly favours aerobic respiration for sustained activity. For athletes, understanding this has practical implications: endurance training improves the cardiovascular system (more oxygen delivery), increases mitochondria density in muscle cells (more aerobic capacity), and raises the anaerobic threshold — the exercise intensity at which lactic acid begins to accumulate faster than it can be removed. By training just below this threshold, athletes can maintain high performance for longer. In medicine, understanding respiration types helps explain conditions like heart attacks (oxygen-deprived heart muscle respires anaerobically, producing lactic acid that damages tissue) and why cancer cells often rely heavily on anaerobic respiration even when oxygen is available (the Warburg effect).",
        "common_errors": [
          "Not explaining that the products of anaerobic respiration still contain chemical energy, which is why the yield is lower",
          "Discussing training effects without connecting them to the cellular-level shift between respiration types"
        ]
      }
    ]
  }
]
