[
  {
    "concept_id": "SC-KS2-C034",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Naming the three states of matter — solid, liquid and gas — and giving a familiar example of each.",
        "example_task": "Name the three states of matter. Give one example of each.",
        "example_response": "Solid: ice. Liquid: water. Gas: steam.",
        "common_errors": [
          "Not knowing the term 'states of matter'",
          "Thinking steam (visible mist) is the gas — actually water vapour (invisible) is the gas"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing the observable properties that define each state: solids hold their shape, liquids take the shape of their container but have a fixed volume, gases fill any container and are often invisible.",
        "example_task": "How can you tell if something is a solid, liquid or gas? Describe the properties of each.",
        "example_response": "Solids: keep their own shape, can be held, do not flow. Liquids: flow and take the shape of their container, have a flat surface, can be poured. Gases: spread out to fill any space, often invisible, can be compressed (squashed into a smaller space).",
        "common_errors": [
          "Thinking powders (flour, sand) are liquids because they pour",
          "Thinking gases do not exist because they are invisible"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Classifying a range of materials into solids, liquids and gases, handling tricky cases (sand, jelly, foam), and beginning to explain states using the particle model.",
        "example_task": "Is sand a solid or a liquid? It pours like a liquid. Is toothpaste a solid or a liquid? Explain your reasoning.",
        "example_response": "Sand is a solid — each grain of sand is a tiny solid that keeps its shape. Sand pours because the grains are small and loose, but the material itself is solid. If you look at one grain under a magnifying glass, it does not flow or take the shape of a container. Toothpaste is trickier — it behaves like a solid when still (it holds its shape on the brush) but flows like a thick liquid when squeezed. It is actually a mixture that has properties of both states. Using the particle model: in solids, particles are tightly packed and vibrate in fixed positions. In liquids, particles are close but can slide past each other. In gases, particles are spread far apart and move freely.",
        "common_errors": [
          "Classifying sand as a liquid because it pours",
          "Not using the particle model to explain their reasoning"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using the particle model to explain why each state has its characteristic properties and predicting behaviour in new situations.",
        "example_task": "Using the particle model, explain why you can walk through air (a gas) but not through a wall (a solid). Why can you push your hand through water (a liquid)?",
        "example_response": "In air (gas), particles are spread far apart with large gaps between them. Your body can push through because the particles move aside easily — they have lots of space and energy to move. In a solid wall, particles are tightly packed in a fixed arrangement with strong forces holding them together. You cannot push through because there are no gaps and the particles cannot be displaced. In water (liquid), particles are close together but can slide over each other — your hand pushes particles aside and they flow around it, then close up behind. This is why liquids flow and take the shape of their container — the particles are not fixed in position like solids, but are closer together than in a gas. The particle model explains all three states with one simple idea: how close the particles are and how much they can move.",
        "common_errors": [
          "Describing particles as changing size between states (they change spacing, not size)",
          "Not connecting particle arrangement to observable properties"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C035",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that ice turns into water when it gets warm and water turns into ice when it gets cold.",
        "example_task": "What happens to ice when you leave it in a warm room?",
        "example_response": "The ice melts and turns into water because the room is warm.",
        "common_errors": [
          "Not using the word 'melts'",
          "Thinking the ice disappears rather than becoming water"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Naming the changes of state — melting, freezing, evaporating, condensing — and identifying that heating and cooling cause these changes.",
        "example_task": "Match each change of state to its correct name: solid to liquid, liquid to solid, liquid to gas, gas to liquid.",
        "example_response": "Solid to liquid: melting. Liquid to solid: freezing. Liquid to gas: evaporation (or boiling). Gas to liquid: condensation.",
        "common_errors": [
          "Confusing evaporation with condensation",
          "Not knowing the word 'condensation'"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining changes of state using the particle model, identifying the temperature at which state changes occur, and distinguishing evaporation from boiling.",
        "example_task": "What is the difference between evaporation and boiling? Both change liquid water into water vapour.",
        "example_response": "Evaporation happens at any temperature from the surface of a liquid — particles at the surface gain enough energy to escape into the air. It is a slow process. Boiling happens throughout the liquid at a specific temperature (100°C for water) — bubbles of gas form inside the liquid and rise to the surface. It is a fast process. Both produce water vapour (an invisible gas), but evaporation can happen at room temperature while boiling requires the liquid to reach its boiling point. Using the particle model: during evaporation, only the fastest particles at the surface escape; during boiling, particles throughout the liquid have enough energy to become gas.",
        "common_errors": [
          "Thinking evaporation only happens when it is hot",
          "Confusing steam (visible mist of tiny water droplets) with water vapour (invisible gas)"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Applying understanding of changes of state to explain everyday phenomena and predict the effects of changing conditions.",
        "example_task": "On a cold morning, you can see your breath as a cloud when you breathe out, but on a warm day you cannot. Explain why.",
        "example_response": "When you breathe out, your breath contains warm water vapour (invisible gas) from your lungs. On a cold morning, this warm water vapour meets the cold air and rapidly cools down. The cooling causes the water vapour to condense — it changes from an invisible gas into tiny liquid water droplets suspended in the air, which we see as a cloud. On a warm day, the outside air is warm enough that the water vapour stays as an invisible gas — it does not cool down enough to condense. This is the same process that forms clouds in the sky — warm air containing water vapour rises, cools at higher altitudes, and the water vapour condenses into tiny droplets. Condensation happens whenever warm, moist air is cooled below a certain temperature (the dew point).",
        "common_errors": [
          "Thinking the visible cloud is steam or smoke",
          "Not identifying condensation as the process (gas to liquid)"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C036",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that rain falls from clouds, puddles dry up in the sun, and this happens over and over again.",
        "example_task": "Where do puddles go when the sun comes out?",
        "example_response": "The water in the puddle dries up — it goes into the air.",
        "common_errors": [
          "Thinking the water disappears completely",
          "Not knowing where the water goes"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing the water cycle using the terms evaporation, condensation and precipitation in the correct sequence.",
        "example_task": "Describe how water moves in a cycle. Use the words evaporation, condensation and precipitation.",
        "example_response": "Water from oceans, lakes and rivers is heated by the Sun and evaporates — it changes from liquid water into invisible water vapour that rises into the air. High up, the air is cooler, and the water vapour condenses into tiny water droplets that form clouds. When the droplets join together and get heavy enough, they fall as precipitation — rain, snow, sleet or hail — back down to the ground, rivers and oceans. Then the cycle starts again.",
        "common_errors": [
          "Not explaining that water vapour is invisible (clouds are already condensed droplets)",
          "Missing one of the three key processes"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining the water cycle with reference to temperature driving evaporation and cooling driving condensation, and investigating factors that affect evaporation rate.",
        "example_task": "We placed saucers of water in four locations: sunny windowsill, shady corner, next to a fan, in a cupboard. After two days, the sunny and fan saucers were empty. Why does temperature and air movement affect evaporation?",
        "example_response": "Heat gives water particles more energy, so more particles escape from the surface as water vapour — that is why the sunny saucer evaporated fastest. Moving air (fan) carries water vapour away from the surface, which means more water can evaporate into the space above — the fan saucer evaporated quickly even without extra heat. The shady corner was cooler with still air, so evaporation was slower. The cupboard was enclosed, so the air around the water became saturated with vapour and evaporation slowed. In the water cycle, the Sun provides the heat and wind moves the moist air, driving the global evaporation process.",
        "common_errors": [
          "Not explaining the mechanism — just saying 'heat makes it evaporate faster'",
          "Not connecting the classroom investigation to the global water cycle"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining the water cycle as a closed system where no water is created or destroyed, and applying this to environmental issues.",
        "example_task": "If the same water has been cycling around the Earth for billions of years, why do some places have water shortages?",
        "example_response": "The total amount of water on Earth stays the same — it just changes state and location. Water shortages happen because the water cycle does not distribute water evenly. Some regions receive very little precipitation because of their geography and climate patterns. Additionally, much of Earth's water is in the oceans (salty, not drinkable) or locked in ice caps. Only a tiny fraction is accessible fresh water. Human activities also contribute to shortages: over-extraction of groundwater, pollution making water unusable, and climate change altering rainfall patterns. The water cycle ensures water is continuously recycled, but it does not guarantee it arrives where and when humans need it. This is why water conservation and management are so important.",
        "common_errors": [
          "Thinking water can be used up or destroyed",
          "Not explaining why a closed cycle can still lead to shortages"
        ]
      }
    ]
  }
]