[
  {
    "concept_id": "SC-KS1-C015",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Naming two or three of the five vertebrate groups (fish, birds, mammals) and giving one example animal for each.",
        "example_task": "Can you name a type of animal group? Give me an example animal from that group.",
        "example_response": "Fish — goldfish. Birds — robin. Mammals — dog.",
        "common_errors": [
          "Naming individual animals rather than groups (saying 'dog' is a group rather than 'mammal')",
          "Confusing animal groups with habitats ('sea animals' instead of 'fish')"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Naming all five vertebrate groups and describing one key feature of each group.",
        "example_task": "Name the five groups of vertebrate animals. What is special about each group?",
        "example_response": "Fish live in water and have scales and fins. Amphibians live in water and on land and have smooth wet skin. Reptiles have dry scaly skin. Birds have feathers and beaks. Mammals have fur or hair and feed their babies milk.",
        "common_errors": [
          "Forgetting amphibians or mixing them up with reptiles",
          "Describing where animals live rather than their physical features"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Correctly classifying common animals into their vertebrate group using distinguishing features, including less obvious examples.",
        "example_task": "Which group does each of these animals belong to: whale, frog, penguin, tortoise, shark? Explain how you know.",
        "example_response": "Whale — mammal, because it breathes air, has warm blood and feeds its baby milk. Frog — amphibian, because it starts life in water as a tadpole and lives on land as an adult with moist skin. Penguin — bird, because it has feathers and a beak even though it cannot fly. Tortoise — reptile, because it has dry scaly skin and lays eggs on land. Shark — fish, because it lives in water and has gills and fins.",
        "common_errors": [
          "Classifying whales or dolphins as fish because they live in water",
          "Classifying penguins as fish because they swim"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Classifying unfamiliar animals by reasoning from the distinguishing features of each group, and explaining tricky cases.",
        "example_task": "A platypus has fur, lays eggs and feeds its babies milk. Which vertebrate group does it belong to? Explain why this is tricky.",
        "example_response": "A platypus is a mammal because it has fur and feeds its babies milk. It is tricky because it also lays eggs, which is unusual for mammals — most mammals give birth to live young. But the key feature of mammals is that they feed babies milk, and the platypus does this. This shows that classification rules usually work but there can be unusual exceptions.",
        "common_errors": [
          "Saying it must be a reptile because it lays eggs",
          "Thinking an animal must fit every single feature perfectly to belong to a group"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS1-C016",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that some animals eat plants and some eat other animals, with familiar examples.",
        "example_task": "A rabbit eats grass and a fox eats rabbits. Which one eats plants? Which one eats animals?",
        "example_response": "The rabbit eats plants. The fox eats animals.",
        "common_errors": [
          "Thinking all animals eat the same kinds of food",
          "Not distinguishing between the two ideas without visual support"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using the terms herbivore, carnivore and omnivore correctly and giving examples of each.",
        "example_task": "What do these words mean: herbivore, carnivore, omnivore? Give an example of each.",
        "example_response": "Herbivore means an animal that eats only plants — like a cow or a rabbit. Carnivore means an animal that eats only other animals — like a lion or an eagle. Omnivore means an animal that eats both plants and animals — like a bear or a human.",
        "common_errors": [
          "Mixing up herbivore and carnivore",
          "Not knowing that humans are omnivores"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Classifying a range of familiar and less familiar animals as herbivore, carnivore or omnivore, using evidence from their diet or physical features.",
        "example_task": "Classify these animals as herbivore, carnivore or omnivore: cow, owl, badger, caterpillar, shark, pig. Explain one of your choices using evidence.",
        "example_response": "Herbivore: cow, caterpillar. Carnivore: owl, shark. Omnivore: badger, pig. I know the owl is a carnivore because it has sharp talons for catching mice and a hooked beak for tearing meat. Herbivores like cows have flat teeth for grinding plants.",
        "common_errors": [
          "Thinking caterpillars are too small to classify, or not recognising them as herbivores",
          "Classifying badgers as carnivores when they actually eat plants and animals (omnivores)"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Linking diet classification to body features (teeth, claws) and to the animal's position in a food chain.",
        "example_task": "Look at pictures of these animal skulls: a sheep skull with flat teeth, a fox skull with sharp pointed teeth, and a human skull. What does each skull tell us about the animal's diet?",
        "example_response": "The sheep has flat, wide teeth for grinding grass — it is a herbivore. The fox has sharp, pointed teeth for catching and tearing prey — it is a carnivore. The human skull has a mix of flat teeth at the back for grinding and sharper teeth at the front for biting — we are omnivores. You can tell what an animal eats by looking at its teeth because different teeth are shaped for different types of food.",
        "common_errors": [
          "Thinking all pointed teeth mean carnivore without considering the whole set",
          "Not recognising that tooth shape is evidence of diet rather than just appearance"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS1-C017",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying one or two visible differences between two familiar animals when shown pictures or specimens side by side.",
        "example_task": "Look at a picture of a fish and a bird. Tell me one way they are different.",
        "example_response": "The fish has fins and the bird has wings.",
        "common_errors": [
          "Describing differences in colour or size rather than body structure",
          "Saying 'the fish lives in water' (habitat) rather than describing body parts"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Comparing two animals by describing both similarities and differences in their body parts, using vocabulary such as limbs, body covering and tail.",
        "example_task": "Compare a dog and a lizard. How are their bodies similar? How are they different?",
        "example_response": "They both have four legs, a head and a tail. The dog has fur but the lizard has scales. The dog has floppy ears but the lizard does not have ear flaps. The dog is warm to touch and the lizard feels cold.",
        "common_errors": [
          "Listing only differences without noting any similarities",
          "Describing behaviour (the dog barks) rather than body structure"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Comparing body structures across different vertebrate groups, linking structural features to the animal's way of life.",
        "example_task": "Compare how a fish, a frog and a duck each move through water. What body parts help each one?",
        "example_response": "A fish has fins and a streamlined body to swim through water easily. A frog has webbed back feet that push against the water like paddles. A duck has webbed feet for paddling on top of the water and waterproof feathers to stay dry. All three have body parts that help them move in water, but each one is different.",
        "common_errors": [
          "Describing only one animal without comparing to the others",
          "Not linking the body feature to its function in water"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using comparative body features as evidence for classifying animals, explaining why certain features are more useful for classification than others.",
        "example_task": "A bat has wings and can fly. A bird also has wings and can fly. Are they in the same group? What body features tell you which group each belongs to?",
        "example_response": "No, they are in different groups. A bat is a mammal because it has fur, feeds its babies milk and has wings made of stretched skin. A bird has feathers, a beak and wings made of feathers. Having wings does not make them the same group — you have to look at body covering and how they feed their young. Fur and milk mean mammal; feathers and a beak mean bird.",
        "common_errors": [
          "Grouping bats with birds because both fly",
          "Using only one feature (wings) to classify rather than looking at multiple features"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS1-C018",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Pointing to and naming basic body parts (head, arms, legs, eyes, mouth) on themselves or a picture, with support.",
        "example_task": "Point to your elbow. Point to your knee. Where is your neck?",
        "example_response": "Child correctly points to elbow, knee and neck on their own body.",
        "common_errors": [
          "Confusing elbow with shoulder",
          "Pointing to the ankle when asked for the knee"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Naming and locating a wider range of body parts including elbows, knees, neck, wrists and ankles, and drawing a body outline with labels.",
        "example_task": "Draw a picture of yourself and label these body parts: head, neck, arm, elbow, hand, leg, knee, foot.",
        "example_response": "Drawing of a person with labels correctly placed: head at the top, neck between head and body, arms at the sides, elbows in the middle of each arm, hands at the end, legs at the bottom, knees in the middle, feet at the bottom.",
        "common_errors": [
          "Drawing arms directly from the head rather than from the body",
          "Labelling the wrist as the elbow"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Naming all main external body parts including those on the face (ears, eyes, nose, mouth, teeth, hair) and explaining what some parts are used for.",
        "example_task": "Name the body parts on this diagram. Choose three and explain what they are for.",
        "example_response": "Head, neck, shoulders, arms, elbows, wrists, hands, fingers, legs, knees, ankles, feet, toes, eyes, ears, nose, mouth, teeth. Eyes are for seeing — they detect light. Ears are for hearing sounds. Knees are joints that let our legs bend so we can walk and sit down.",
        "common_errors": [
          "Forgetting less obvious parts like wrists and ankles",
          "Saying 'arms are for holding things' without mentioning the hand's role"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Comparing human body parts with those of other animals, explaining similarities and differences in structure and function.",
        "example_task": "Humans have arms with hands and fingers. A bird has wings. How are arms and wings similar and different?",
        "example_response": "Both arms and wings are attached to the body at the shoulder and both have joints like elbows. But human arms end in hands with fingers that can grip and pick things up. Bird wings have feathers and are shaped for flying — they cannot grip things. Both are limbs but they are used for different things: our arms for carrying and using tools, wings for flying.",
        "common_errors": [
          "Saying arms and wings have nothing in common",
          "Not recognising that both are upper limbs with a similar bone structure"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS1-C019",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Naming at least three of the five senses and pointing to the body part associated with each.",
        "example_task": "Name three of your senses. Which part of your body do you use for each one?",
        "example_response": "I see with my eyes. I hear with my ears. I touch with my hands (skin).",
        "common_errors": [
          "Naming only two senses",
          "Saying 'I smell with my mouth' instead of nose"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Naming all five senses and correctly matching each to its sense organ.",
        "example_task": "Complete this table by matching each sense to the correct body part: sight, hearing, smell, taste, touch.",
        "example_response": "Sight — eyes. Hearing — ears. Smell — nose. Taste — tongue. Touch — skin.",
        "common_errors": [
          "Swapping smell and taste (nose and tongue)",
          "Saying touch is only in the hands rather than in all skin"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Describing what each sense detects and using appropriate senses to make observations during an investigation.",
        "example_task": "We have five mystery bags. Use your senses (not sight) to work out what is inside each bag. Which senses did you use?",
        "example_response": "Bag 1: I could feel something smooth and round and it smells like an orange — I used touch and smell. Bag 2: I could hear something rattling when I shook it and it felt like small hard things — I used hearing and touch, it might be dried pasta. Bag 3: It feels soft and fluffy — I used touch, it is cotton wool.",
        "common_errors": [
          "Relying only on touch and not using hearing or smell",
          "Guessing without describing which sense gave the clue"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining why different senses are useful in different situations, and describing how some animals rely on senses differently from humans.",
        "example_task": "Why is hearing an important sense for a rabbit? Which sense is most important for an owl hunting at night? Explain your answers.",
        "example_response": "A rabbit needs good hearing to listen for predators like foxes, so it can run away quickly — that is why rabbits have such large ears. An owl hunting at night relies on its incredible hearing to find mice in the dark, but it also has very large eyes to see in dim light. Different animals depend on different senses depending on how they live and what dangers they face.",
        "common_errors": [
          "Thinking owls can see in complete darkness (they need some light)",
          "Not connecting the animal's sense to a survival purpose"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS1-C020",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that animals produce young that grow into adults, giving one familiar example.",
        "example_task": "What does a baby chick grow into?",
        "example_response": "A chick grows into a chicken (hen or cockerel).",
        "common_errors": [
          "Thinking a chick and a chicken are different animals",
          "Not knowing where chicks come from (eggs)"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing the main stages of a familiar animal life cycle in the correct order, such as egg → caterpillar → pupa → butterfly.",
        "example_task": "Put these pictures of a butterfly's life cycle in the correct order: butterfly, egg, caterpillar, chrysalis.",
        "example_response": "Egg → caterpillar → chrysalis → butterfly. The egg hatches into a caterpillar, the caterpillar makes a chrysalis, and the butterfly comes out.",
        "common_errors": [
          "Putting the chrysalis before the caterpillar",
          "Thinking the butterfly comes directly from the egg"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Describing and comparing the life cycles of two or three different animals, recognising that different animals go through different stages.",
        "example_task": "Compare the life cycles of a frog and a chicken. How are they similar and different?",
        "example_response": "Both start as eggs. A frog egg (frogspawn) hatches into a tadpole that lives in water, then grows legs and loses its tail to become a frog — this big change is called metamorphosis. A chicken egg hatches into a chick that already looks like a small chicken and grows bigger without changing shape much. Both eventually become adults that can lay eggs of their own.",
        "common_errors": [
          "Not recognising that frogs go through metamorphosis while chickens do not",
          "Forgetting that both life cycles begin with eggs"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining why life cycles are shown as circles rather than lines, and describing how an animal at each stage is suited to its environment.",
        "example_task": "Why do we draw a life cycle as a circle and not a straight line? Use the frog's life cycle to explain.",
        "example_response": "We draw it as a circle because the cycle repeats — the adult frog lays eggs, and those eggs grow into tadpoles, then froglets, then adult frogs that lay more eggs. It never stops. A tadpole is suited to living in water with its tail for swimming and gills for breathing. An adult frog is suited to living on land with legs for jumping and lungs for breathing. Each stage is adapted to a different way of life.",
        "common_errors": [
          "Thinking the life cycle ends when the animal becomes an adult",
          "Not explaining why the circular diagram works better than a line"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS1-C021",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that people start as babies and grow into adults, naming at least two stages.",
        "example_task": "Look at these pictures: a baby, a child and a grown-up. Put them in order from youngest to oldest.",
        "example_response": "Baby first, then child, then grown-up.",
        "common_errors": [
          "Not recognising the baby as the youngest because the picture shows a toddler",
          "Placing themselves as an adult rather than a child"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Naming the main stages of human growth in order — baby, toddler, child, teenager, adult — and describing one change at each stage.",
        "example_task": "Name the stages of human growth from baby to adult. What changes at each stage?",
        "example_response": "Baby — very small, cannot walk or talk. Toddler — learns to walk and say first words. Child — goes to school, grows taller, loses baby teeth. Teenager — grows much taller, body changes. Adult — fully grown, can have babies of their own.",
        "common_errors": [
          "Skipping the toddler or teenager stage",
          "Describing what people do at each stage rather than how they change"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Ordering photographs of people at different growth stages, describing physical and developmental changes, and placing themselves on the timeline.",
        "example_task": "Put these photographs of the same person in age order. Describe three changes you can see from the baby photo to the adult photo.",
        "example_response": "Baby → toddler → school child → teenager → adult. The person got much taller. Their face changed shape — the baby has a round face and the adult has a longer face. In the baby photo they have no teeth visible, but the child has teeth. The adult is fully grown and has the same height as the teenager.",
        "common_errors": [
          "Not noticing subtle changes between adjacent stages (toddler vs. young child)",
          "Describing clothing differences rather than physical changes"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Comparing human growth stages with those of another animal, explaining how the human life cycle is both similar to and different from other mammals.",
        "example_task": "Compare how a human baby grows up with how a kitten grows up. What is similar and what is different?",
        "example_response": "Both are mammals — they are born alive and feed on their mother's milk as babies. Both grow bigger and learn to move around. But a kitten grows up much faster — it can walk within a few weeks, while a human baby takes about a year. A cat is fully grown in about one year, but a human takes about 18 years. Humans have a much longer childhood because we have more to learn. Both eventually become adults that can have young of their own.",
        "common_errors": [
          "Focusing only on differences without noting that both are mammals with similar early stages",
          "Not recognising that the different growth rates are significant"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS1-C022",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that animals need food and water to stay alive, from everyday experience.",
        "example_task": "What does your pet (or a pet you know) need every day to stay alive?",
        "example_response": "My dog needs food and water every day.",
        "common_errors": [
          "Listing wants (toys, walks) alongside needs",
          "Forgetting water and only mentioning food"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Naming the three basic survival needs of all animals — water, food and air — and explaining simply why each is essential.",
        "example_task": "Name the three things all animals must have to survive. Why does an animal need each one?",
        "example_response": "Water — to drink and stay hydrated. Food — to give them energy to move and grow. Air — to breathe. Without any one of these, the animal would die.",
        "common_errors": [
          "Adding shelter or warmth as a survival essential (important but not one of the three basics)",
          "Forgetting air because breathing feels automatic"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining that all animals, including humans, share the same three basic needs, and giving examples of how different animals meet these needs.",
        "example_task": "All animals need water, food and air. Explain how a fish gets each of these needs met, even though it lives in water.",
        "example_response": "A fish gets water by absorbing it through its body as it swims. It eats smaller fish, insects or plants in the water for food. It gets air (oxygen) from the water through its gills — the gills take dissolved oxygen out of the water. Even though a fish lives in water, it still needs the same three things as a dog or a human.",
        "common_errors": [
          "Thinking fish do not need air because they live in water",
          "Thinking fish drink water the same way humans do"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Applying the concept of basic survival needs to evaluate whether an environment can support animal life, and predicting consequences when a need is not met.",
        "example_task": "A pond has dried up during a hot summer. What will happen to the animals that lived there? Think about their three basic needs.",
        "example_response": "The frogs and newts can move to find another pond because they can breathe air and walk on land, but they need water to keep their skin moist and to lay eggs. The fish will die because they need water to breathe through their gills — without water they cannot get oxygen. Insects like dragonfly larvae need the water too. The pond plants will die without water. Some animals might survive if they find a new water source quickly, but the environment can no longer meet their basic needs.",
        "common_errors": [
          "Thinking all pond animals will simply move to a new pond",
          "Not distinguishing between animals that can leave (amphibians) and those that cannot (fish)"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS1-C023",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that eating healthy food, exercising and washing hands are good for you, from personal experience.",
        "example_task": "Name two things you do to keep healthy.",
        "example_response": "I eat fruit and vegetables. I wash my hands before eating.",
        "common_errors": [
          "Thinking 'healthy' means only eating salad and never having treats",
          "Not connecting exercise to health"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing how exercise, a varied diet and good hygiene each help keep us healthy.",
        "example_task": "Explain how exercise, eating well and keeping clean each help your body.",
        "example_response": "Exercise makes our muscles and heart strong. Eating different types of food gives our body energy and helps us grow. Washing our hands gets rid of germs that could make us ill.",
        "common_errors": [
          "Thinking exercise is only needed to lose weight",
          "Not understanding why we need to eat different types of food rather than just our favourite food"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining the importance of a balanced diet (different types of food for different purposes), regular exercise, and hygiene practices, linking each to a specific health benefit.",
        "example_task": "Why do we need to eat different types of food? Why is it not enough to eat just bread every day?",
        "example_response": "Different foods do different jobs in our body. Bread gives us energy from carbohydrates, but we also need protein from foods like meat, fish or beans to help our muscles grow and repair. We need vitamins from fruit and vegetables to keep us from getting ill. We need calcium from milk and cheese for strong bones. If we only ate bread, we would have energy but our body would not get everything it needs to grow, repair and fight illness.",
        "common_errors": [
          "Thinking all 'healthy' foods are the same and do the same job",
          "Believing that certain foods are always bad rather than understanding balance"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating a daily routine and suggesting improvements based on the principles of exercise, balanced diet and hygiene, explaining the consequences of poor choices.",
        "example_task": "Sam eats crisps and biscuits for every meal, never plays outside, and sometimes forgets to brush their teeth. What advice would you give Sam, and what might happen if Sam does not change?",
        "example_response": "Sam needs to eat a variety of foods — add fruit, vegetables, and protein like chicken or beans to get the nutrients needed for growth and energy. Playing outside every day would strengthen Sam's muscles and heart, and help Sam feel more energetic. Brushing teeth twice a day prevents tooth decay. If Sam does not change, they might get tired easily from lack of nutrients, become unfit from no exercise, and get painful cavities in their teeth from the sugar.",
        "common_errors": [
          "Saying Sam should never eat crisps or biscuits rather than adding variety",
          "Not linking specific health problems to specific poor habits"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS1-C047",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Handling a living thing gently when shown how by the teacher, understanding that living things can be hurt.",
        "example_task": "We are going to look at some woodlice from the garden. How should we pick them up?",
        "example_response": "Very gently. Use a paintbrush to move them into the tray. Do not squeeze them.",
        "common_errors": [
          "Trying to grab the woodlouse with fingers",
          "Being too rough and accidentally harming the organism"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explaining why we must handle living things carefully and return them to their habitat after observation.",
        "example_task": "Why do we need to put the minibeasts back where we found them after we have looked at them?",
        "example_response": "Because that is their home — it has the food, water and shelter they need. If we keep them too long they might get stressed or die. We should put them back under the log where it is dark and damp, which is the conditions they need.",
        "common_errors": [
          "Thinking it is fine to keep them because they are small and 'do not mind'",
          "Not connecting the return to the animal's habitat needs"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Following and explaining care procedures for living things during investigations, understanding that careless handling can affect both the animal and the results.",
        "example_task": "We are observing snails to see which surface they move fastest on. Why is it important to handle the snails carefully during this investigation?",
        "example_response": "We need to handle them carefully because they are living things that feel stress. If we are rough, the snail might go into its shell and not move at all, which would ruin our results. We should place them gently on each surface, give them time to come out of their shell, and put them back in the garden after. Looking after the snails means we get better results and we treat living things with respect.",
        "common_errors": [
          "Thinking careful handling is only about being kind, not also about getting reliable results",
          "Not waiting for the snail to recover between tests"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining why scientists have a responsibility to care for living things they study, and suggesting how to minimise disturbance during investigations.",
        "example_task": "We want to study the minibeasts living under logs in our school garden. How could we investigate this while causing as little disturbance as possible?",
        "example_response": "We should lift the log carefully and slowly rather than flipping it over quickly. We should observe the animals quickly and make notes or take photographs rather than handling them all. We should only pick up a few using paintbrushes and plastic spoons, look at them in a tray with some damp soil, and return them quickly. We should put the log back exactly where it was so the micro-habitat is restored. Scientists have a responsibility not to harm the things they study — if we damage the habitat, the animals might not survive.",
        "common_errors": [
          "Not thinking about how to minimise handling time",
          "Forgetting to return the habitat to its original state (replacing the log)"
        ]
      }
    ]
  }
]