[
  {
    "concept_id": "SC-KS2-C055",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that things fall down when you let go of them, and that this is because of gravity.",
        "example_task": "What happens when you drop a ball? Why does it fall down and not up?",
        "example_response": "The ball falls down to the ground. It falls because of gravity. Gravity is a force that pulls everything down towards the Earth.",
        "common_errors": [
          "Not using the word 'gravity' to explain falling",
          "Thinking heavy things fall but light things float up (a balloon full of air still has gravity acting on it)"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Understanding that gravity is a pulling force that acts between the Earth and all objects, and that it works without physical contact (non-contact force).",
        "example_task": "How is gravity different from pushing something? You do not have to touch the ball to make it fall.",
        "example_response": "When you push something, your hand touches it — that is a contact force. But gravity pulls the ball down without anything touching it — the Earth pulls the ball through empty space. That makes gravity a non-contact force, like magnetism. Gravity acts on everything — heavy objects, light objects, you, the air, water. Everything on Earth is being pulled towards the ground by gravity all the time.",
        "common_errors": [
          "Thinking gravity only works on heavy objects",
          "Confusing gravity (non-contact force) with contact forces like pushing"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining that gravity acts on all objects regardless of mass, and distinguishing between the effect of gravity and air resistance when objects fall at different rates.",
        "example_task": "A stone and a feather are dropped at the same time. The stone hits the ground first. Does gravity pull harder on the stone?",
        "example_response": "Gravity pulls on both objects. The feather falls more slowly not because gravity is weaker, but because air resistance has a greater effect on the feather. The feather has a large surface area relative to its weight, so air pushes against it more effectively, slowing it down. In a vacuum (no air), they would fall at exactly the same rate — this was demonstrated on the Moon by Apollo 15 astronaut David Scott, who dropped a hammer and a feather and they hit the ground together. The difference we see in everyday life is caused by air resistance, not by different amounts of gravity.",
        "common_errors": [
          "Believing heavier objects experience more gravity and that is why they fall faster",
          "Not distinguishing between the effects of gravity and air resistance"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining gravity's role in the solar system — keeping planets in orbit around the Sun and moons in orbit around planets — and understanding that gravity acts between all objects with mass.",
        "example_task": "What stops the Moon from flying off into space? What stops it from crashing into Earth?",
        "example_response": "The Moon is constantly being pulled towards Earth by gravity — this pull stops it flying off into space. But the Moon is also moving sideways at just the right speed. The combination of gravity pulling inward and the Moon's sideways motion means it continuously falls towards Earth but keeps missing — this curved path is an orbit. If the Moon were slower, it would spiral in. If faster, it would fly away. The same principle keeps planets orbiting the Sun and satellites orbiting Earth. Gravity is the force that holds the entire solar system together. It acts between all objects with mass — the Earth pulls the Moon, and the Moon pulls the Earth (causing tides). Even you and your desk pull on each other with gravity, but the force is far too weak to notice because your masses are so small compared to the Earth.",
        "common_errors": [
          "Thinking an orbit means the Moon is not being pulled by gravity",
          "Not understanding that an orbit is a balance between gravity and sideways motion"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C056",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that some things slow you down — it is harder to run through water than through air, and rough surfaces slow you down more than smooth ones.",
        "example_task": "Is it easier to slide across a smooth floor or across carpet? Why?",
        "example_response": "It is easier to slide across a smooth floor. Carpet is rough and it slows you down more. The roughness creates a force that rubs against you.",
        "common_errors": [
          "Not recognising that the roughness of the surface is what creates the slowing force",
          "Thinking smooth surfaces have no slowing effect at all"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Naming air resistance, water resistance and friction as forces that oppose motion, and giving examples of each.",
        "example_task": "Name three forces that slow objects down and give an example of each.",
        "example_response": "1. Friction — when you slide a book across a desk, friction between the book and desk surface slows it down. 2. Air resistance — a parachute opens and air resistance slows the person's fall. 3. Water resistance — swimming is harder than walking because water pushes against you as you move through it. All three are contact forces that act against the direction of movement.",
        "common_errors": [
          "Confusing air resistance with wind",
          "Not knowing that water resistance is a separate force from friction"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Investigating factors that affect resistance forces and explaining how these forces are used practically, including designing investigations.",
        "example_task": "Design a fair test to investigate how the size of a parachute affects the time it takes to fall. What results do you predict?",
        "example_response": "I will make parachutes of 3 different sizes (20cm, 40cm, 60cm across) using the same material (plastic bag) and attach the same weight to each. I will drop each from the same height (2 metres) and time how long it takes to reach the ground. I will keep the same: weight, material, drop height, and method of release. I predict the largest parachute will take the longest to fall because it has the biggest surface area, which catches more air and creates more air resistance. I will repeat each test 3 times and calculate the mean for reliability. This is why real parachutes are very large — more surface area means more air resistance and a slower, safer descent.",
        "common_errors": [
          "Not keeping the weight the same across all parachute sizes",
          "Not explaining that larger surface area creates more air resistance"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining how resistance forces are both useful and problematic in real-world engineering, and understanding the concept of streamlining.",
        "example_task": "Cars, fish, aeroplanes and submarines all have similar streamlined shapes. Explain why, using your knowledge of resistance forces.",
        "example_response": "All four move through a fluid (air or water) and experience resistance that opposes their motion. A streamlined shape — pointed at the front, smooth, tapering at the back — allows the fluid to flow smoothly around the object rather than pushing against a flat surface. This reduces resistance and allows faster, more efficient movement. A flat-fronted bus uses more fuel than a streamlined car at the same speed because it has to push against more air resistance. Fish evolved streamlined bodies over millions of years because individuals with less water resistance could swim faster (escape predators, catch food). Engineers copied this principle from nature — called biomimicry. The trade-off is that streamlined shapes are harder to manufacture and offer less internal space than boxy designs. This is why lorries (prioritising cargo space) are less streamlined than sports cars (prioritising speed).",
        "common_errors": [
          "Not explaining why streamlined shapes reduce resistance (fluid flows smoothly rather than pushing against a flat surface)",
          "Not recognising the trade-off between streamlining and practical design needs"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C057",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that some tools make it easier to lift or move heavy things — for example, a see-saw, a wheelbarrow, or a ramp.",
        "example_task": "Which is easier: lifting a heavy box straight up, or pushing it up a ramp? Try both.",
        "example_response": "Pushing it up the ramp is easier. The ramp lets me use less force because I push over a longer distance.",
        "common_errors": [
          "Not noticing the difference in effort between the two methods",
          "Thinking the ramp removes the need for force entirely"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Understanding that levers, pulleys and gears are simple mechanisms that allow a smaller force to have a greater effect, and identifying examples in everyday life.",
        "example_task": "How does a lever help you lift something heavy? Give an everyday example.",
        "example_response": "A lever is a rigid bar that pivots on a fixed point (fulcrum). When you push down on the long end, the short end lifts with more force than you applied. A crowbar is a lever — you push the long handle and the short end lifts a heavy nail. A see-saw is also a lever. A wheelbarrow uses the wheel as a fulcrum and the long handles let you lift a heavy load in the bucket.",
        "common_errors": [
          "Thinking levers create extra force from nowhere",
          "Not identifying the fulcrum in everyday lever examples"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Investigating how levers, pulleys and gears work, understanding that they trade force for distance, and explaining the effect of changing the position of the fulcrum.",
        "example_task": "You are trying to prize open a paint tin lid. Where should you place the fulcrum (the rim of the tin) relative to the lid — close to the lid or far from the lid? Explain using your knowledge of levers.",
        "example_response": "Place the fulcrum (rim) close to the lid you are trying to lift. This makes the effort arm (where you push) long and the load arm (where the lid is) short. A longer effort arm means less force is needed to lift the lid. If the fulcrum were far from the lid, you would have a short effort arm and would need much more force. This is the same principle as a see-saw: a heavy child can be lifted by a lighter child if the heavy child sits close to the pivot and the lighter child sits far from it. In all mechanisms, you trade distance for force — less effort but more movement.",
        "common_errors": [
          "Thinking moving the fulcrum does not matter",
          "Not explaining the trade-off between force and distance"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining that mechanisms do not create energy — they redistribute force and distance — and combining mechanisms to solve engineering problems.",
        "example_task": "A bicycle uses gears, levers and pulleys (chain on sprockets). How do these mechanisms work together to make cycling efficient?",
        "example_response": "The pedals and cranks are levers — your feet push on a long crank arm, which turns the front sprocket with less force but more effectively. The chain and sprockets are a pulley system — transferring force from the front cog to the rear cog. The gears allow you to change the ratio — a small front cog with a large rear cog gives less speed but more force (good for hills); a large front cog with a small rear cog gives more speed but needs more force (good for flat roads). Crucially, none of these mechanisms create energy. They redistribute the force your legs produce. Low gear: less force per pedal push but more pushes needed. High gear: more force needed per push but fewer pushes. The total work (energy) is the same — the mechanisms simply let you choose how to apply your effort. This is why 'perpetual motion machines' are impossible — mechanisms cannot produce more energy than you put in.",
        "common_errors": [
          "Thinking gears create extra energy or force from nothing",
          "Not explaining the force-distance trade-off in the gear system"
        ]
      }
    ]
  }
]