[
  {
    "concept_id": "SC-KS2-C001",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Asking simple questions about a scientific topic and suggesting one way to find the answer, with teacher support.",
        "example_task": "We are learning about magnets. Think of a question we could investigate. How could we find the answer?",
        "example_response": "Which materials are magnetic? We could test different materials with a magnet and see which ones stick.",
        "common_errors": [
          "Asking a question that cannot be investigated ('Why do magnets exist?')",
          "Suggesting 'look it up' for every question rather than considering practical investigation"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Asking relevant scientific questions and beginning to identify which type of enquiry (fair test, observation, classification, research) would best answer them.",
        "example_task": "Here are three questions: 'Which material is the best insulator?', 'How does a tadpole change into a frog?', 'How can we group these rocks?' Which type of enquiry would you use for each?",
        "example_response": "Best insulator — fair test (change the material, measure the temperature). Tadpole to frog — observation over time (watch and record changes over weeks). Grouping rocks — classifying and grouping (look at properties and sort them).",
        "common_errors": [
          "Thinking all questions require a fair test",
          "Confusing observation over time with fair testing"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Independently asking relevant scientific questions and selecting the most appropriate type of enquiry from the five types (observation over time, pattern seeking, classifying, fair testing, secondary research).",
        "example_task": "We are studying sound. Write three different questions about sound and for each one explain which type of enquiry you would use and why.",
        "example_response": "1. 'Does the length of a ruler hanging over a desk affect the pitch of the sound it makes?' — Fair test, because I can change one variable (length) and measure the pitch. 2. 'Is there a pattern between the size of an instrument and the pitch of its sound?' — Pattern seeking, because I am looking for a relationship. 3. 'How do different animals hear sound?' — Secondary research, because I cannot investigate this practically.",
        "common_errors": [
          "Choosing fair testing for every question",
          "Writing questions that are too vague to investigate ('What is sound?')"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating questions for investigability, refining vague questions into precise testable ones, and justifying enquiry type selection with reference to the nature of the question.",
        "example_task": "A pupil asks 'Is exercise good for you?' Explain why this question is hard to investigate as written. Rewrite it as a question that could be answered by a specific type of enquiry.",
        "example_response": "The question is too vague — 'good for you' is not measurable and 'exercise' is not specific. A better question: 'Does 5 minutes of star jumps increase a person's heart rate?' This can be answered by a fair test — measure heart rate before and after, keeping the person, time of day and number of jumps the same. Or 'Is there a pattern between the number of minutes of exercise and heart rate increase?' for pattern seeking. Good scientific questions need a measurable outcome and a clearly defined variable.",
        "common_errors": [
          "Accepting the original vague question without recognising its problems",
          "Rewriting the question but still leaving it too vague to investigate"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C002",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Carrying out a simple comparison of two options to find which is better for a purpose, keeping one condition the same with teacher support.",
        "example_task": "Test which of these two surfaces a toy car rolls furthest on. Make sure you start the car from the same place each time.",
        "example_response": "I pushed the car from the top of the ramp each time. On the smooth floor it went 95cm, on the carpet it went 42cm. The smooth floor let the car go further.",
        "common_errors": [
          "Starting the car from different points on the ramp",
          "Pushing the car instead of letting it roll from the same start point"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Setting up a fair test by identifying what to change, what to measure and what to keep the same, with some independence.",
        "example_task": "Plan a fair test to find out which paper towel is the most absorbent. Name your variables.",
        "example_response": "I will change: the brand of paper towel. I will measure: how much water each towel absorbs (by weighing it wet). I will keep the same: the size of each piece, the amount of water, and the soaking time. This makes it fair because the only thing different is the towel brand.",
        "common_errors": [
          "Forgetting to keep important variables the same (piece size, water amount)",
          "Not identifying a clear way to measure the outcome"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Planning and carrying out a fair test with controlled variables, making repeat measurements, and drawing conclusions from the results.",
        "example_task": "Plan and carry out a fair test to find out which material is the best thermal insulator. Wrap cups of warm water in different materials and measure the temperature over 20 minutes.",
        "example_response": "Independent variable: insulating material (wool, foil, bubble wrap, no insulation). Dependent variable: temperature after 20 minutes. Control variables: same volume of water, same starting temperature, same cup type, same room conditions. I tested each one three times and calculated the mean. Wool kept the water warmest (52°C mean), then bubble wrap (48°C), then foil (44°C), then no insulation (38°C). Wool is the best insulator because it trapped the most heat.",
        "common_errors": [
          "Not taking repeat measurements",
          "Using different starting temperatures for different materials"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Designing a fair test for a complex question, evaluating the reliability of results, identifying anomalies, and suggesting improvements.",
        "example_task": "You tested which material was the best insulator but one of your results seemed very different from the others. What should you do? How could you improve the investigation?",
        "example_response": "The anomalous result could be due to an error — maybe the thermometer was not read at the right time, or the material was not wrapped the same way. I should check if the result is truly anomalous by comparing it with my other repeat measurements. If it is very different, I should discard it and use the remaining results to calculate the mean. To improve: I could use data loggers for more precise temperature readings, ensure all materials have the same thickness, and increase from three to five repeats for more reliable averages.",
        "common_errors": [
          "Including the anomalous result in the mean without question",
          "Not suggesting practical improvements to the method"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C003",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Making simple measurements using standard units with teacher support, such as reading a ruler in centimetres.",
        "example_task": "Measure the length of this leaf using a ruler. Give your answer in centimetres.",
        "example_response": "The leaf is 8cm long.",
        "common_errors": [
          "Not starting from zero on the ruler",
          "Reading the wrong scale line (e.g. saying 7cm when it is 8cm)"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using appropriate equipment (rulers, thermometers, measuring cylinders) to take measurements in standard units with increasing accuracy.",
        "example_task": "Measure the temperature of this cup of water using a thermometer. Wait until the reading is steady before you record it.",
        "example_response": "I placed the thermometer in the water and waited for the red liquid to stop moving. The temperature is 42°C.",
        "common_errors": [
          "Reading the thermometer before the liquid has settled",
          "Reading at eye level but from the wrong scale (some thermometers have two scales)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Selecting the most appropriate equipment for different measurements, reading scales accurately including those with intervals of 2, 5 or 10, and recording with correct units.",
        "example_task": "You need to measure the mass of a rock, the temperature of water and the volume of liquid in a beaker. Which equipment would you use for each? Take the measurements.",
        "example_response": "Mass: balance scales — the rock is 145g. Temperature: thermometer — the water is 23°C. Volume: measuring cylinder — there is 75ml of liquid (I read it at the bottom of the curved surface at eye level). I chose each piece of equipment because it measures the right quantity in standard units.",
        "common_errors": [
          "Reading the measuring cylinder from above rather than at the meniscus at eye level",
          "Confusing mass (grams) with volume (millilitres)"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining the importance of measurement precision, choosing equipment with appropriate sensitivity, and using data loggers for continuous measurements.",
        "example_task": "We want to measure how quickly a cup of water cools over one hour. Should we use a thermometer or a data logger? Why? What would a data logger show that a thermometer cannot?",
        "example_response": "A data logger would be better because it takes readings automatically at regular intervals (every 30 seconds, for example) without anyone needing to be there. It records every measurement precisely and we can download the data as a table or graph. A thermometer would only give us readings when someone looks at it, and humans might read it slightly differently each time. The data logger would show the exact pattern of cooling — whether it cools at a steady rate or faster at first and slower later. A thermometer could miss that detail if we only read it every 5 minutes.",
        "common_errors": [
          "Thinking a thermometer and data logger give the same quality of data",
          "Not recognising that continuous logging captures patterns manual readings might miss"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C004",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recording results in a simple table with given headings, using scientific vocabulary with support.",
        "example_task": "Fill in this table to show which materials are magnetic and which are not. The headings are: Material | Magnetic? (yes/no)",
        "example_response": "Iron nail: yes. Wooden block: no. Copper coin: no. Steel paper clip: yes. Plastic ruler: no.",
        "common_errors": [
          "Writing results in random order rather than following the table structure",
          "Forgetting to test all materials before recording"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Creating simple tables with own headings, recording results accurately, and presenting data as a bar chart with labelled axes.",
        "example_task": "We measured how far a toy car rolled on four different surfaces. Design a table for the results and draw a bar chart.",
        "example_response": "Table with headings: Surface | Distance rolled (cm). Rows: carpet — 32cm, sandpaper — 28cm, wood — 78cm, tile — 85cm. Bar chart with title, labelled axes (Surface on x-axis, Distance in cm on y-axis), correct scale and four bars drawn accurately.",
        "common_errors": [
          "Forgetting to include units in the table headings",
          "Drawing bars that do not start from the baseline on the bar chart"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Choosing the most appropriate way to present data (table, bar chart, classification key, labelled diagram) depending on the data type, and using the presentation to identify patterns.",
        "example_task": "We tested how temperature affects the time for sugar to dissolve. Our data is: 20°C — 180s, 40°C — 95s, 60°C — 52s, 80°C — 28s. Choose the best way to present this data. What pattern does it show?",
        "example_response": "A line graph is best because both variables are continuous numbers. X-axis: temperature (°C), Y-axis: time to dissolve (seconds). The graph shows a clear pattern: as temperature increases, the dissolving time decreases. Sugar dissolves faster in hotter water. The decrease is steeper between 20°C and 40°C than between 60°C and 80°C.",
        "common_errors": [
          "Using a bar chart for continuous data instead of a line graph",
          "Describing the results without identifying the pattern or trend"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Selecting and creating the most effective data presentation for the audience and purpose, interpreting graphs to draw conclusions and identify anomalies.",
        "example_task": "Two groups investigated the same question about dissolving rate and temperature but got slightly different results. How would you present both sets of data to compare them? How would you decide which is more reliable?",
        "example_response": "I would plot both sets of results on the same line graph using different colours, so we can see where they agree and where they differ. Points that are close together show the results are reliable. If one point is far from the general pattern and the other group's results, it is likely an anomaly caused by measurement error. The group with more consistent results (closer to a smooth curve) probably has more reliable data. We could also calculate the mean of both sets for each temperature to get an even more reliable picture.",
        "common_errors": [
          "Presenting the two datasets separately, making comparison difficult",
          "Not recognising anomalous data points when they exist"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C005",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Describing what happened in an investigation using simple language, stating whether the prediction was correct.",
        "example_task": "We predicted that the red car would roll furthest. It actually rolled the shortest distance. What happened?",
        "example_response": "My prediction was wrong. The blue car rolled the furthest, not the red one.",
        "common_errors": [
          "Insisting the prediction was correct despite the evidence",
          "Not accepting that a wrong prediction is fine — it is still a useful result"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Drawing a simple conclusion from results, using evidence to answer the original question, and making a simple prediction for an untested value.",
        "example_task": "We tested how the number of elastic bands on a ball launcher affected the distance it fired a ball: 1 band — 30cm, 2 bands — 55cm, 3 bands — 78cm. What is your conclusion? Predict the distance for 4 bands.",
        "example_response": "More elastic bands make the ball go further because there is more force. I predict 4 bands would fire the ball about 100cm because the distance goes up by about 25cm each time.",
        "common_errors": [
          "Making a prediction without looking at the pattern in the data",
          "Not using the results as evidence for the conclusion"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Drawing evidence-based conclusions, identifying patterns in results, making predictions for new values, and suggesting improvements to the investigation.",
        "example_task": "We investigated how the height a ball is dropped from affects how high it bounces. Results: 50cm drop — 28cm bounce, 100cm — 54cm, 150cm — 80cm. Draw a conclusion, predict the bounce height from 200cm, and suggest how we could improve.",
        "example_response": "The higher the drop height, the higher the bounce. The bounce height is approximately 54% of the drop height. I predict a 200cm drop would give about 108cm bounce. To improve: we could use a slow-motion camera for more accurate bounce measurements, do more repeats for each height, and test more drop heights to confirm the pattern. We could also try different surfaces to see if the relationship changes.",
        "common_errors": [
          "Stating the conclusion without supporting evidence from the data",
          "Making a prediction that does not follow the pattern shown by the data"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating conclusions critically, distinguishing between what the data shows and what it does not, recognising the limits of the investigation, and raising further questions.",
        "example_task": "Our investigation showed that sugar dissolves faster in hotter water. Can we conclude that all solids dissolve faster in hotter water? Why or why not?",
        "example_response": "No, we can only conclude that sugar dissolves faster in hotter water because that is the only solid we tested. Other solids might behave differently — some substances actually become less soluble at higher temperatures. To make a broader conclusion, we would need to test many different solids (salt, bicarbonate of soda, chalk) at different temperatures. Scientific conclusions should not go beyond what the evidence supports. A good follow-up question would be: 'Do all soluble substances dissolve faster in hotter water, or only some?'",
        "common_errors": [
          "Over-generalising from limited data",
          "Not recognising the difference between what was tested and a general rule"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C006",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Telling the class or a partner what they found out in a simple investigation, using some scientific words.",
        "example_task": "Tell your partner what we found out about which material was the most waterproof.",
        "example_response": "We tested four materials by pouring water on them. Plastic was the most waterproof because no water went through. Paper was the worst because it soaked up the water.",
        "common_errors": [
          "Describing what they did without saying what they found out",
          "Using no scientific vocabulary"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writing a simple scientific report with sections for question, method, results and conclusion, using scientific vocabulary.",
        "example_task": "Write a report about our investigation into which ball bounces highest. Include: question, what we did, results and conclusion.",
        "example_response": "Question: Which type of ball bounces highest from 1 metre? Method: We dropped each ball from 1m and measured the bounce height. We did three drops for each. Results: Table showing tennis ball — 58cm average, rubber ball — 72cm, ping pong ball — 65cm. Conclusion: The rubber ball bounced highest because rubber is very elastic and returns to its shape quickly.",
        "common_errors": [
          "Missing one of the four sections",
          "Writing a conclusion that does not match the results"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Reporting findings using appropriate scientific language, illustrations and data displays, presenting to different audiences through oral and written formats.",
        "example_task": "Prepare a presentation of our electricity investigation for a school assembly. You need to explain what we discovered about conductors and insulators so younger children can understand.",
        "example_response": "We wanted to find out which materials let electricity flow through them. We built a test circuit with a gap and tested different materials. Materials that completed the circuit and lit the bulb are called conductors — metals like copper, iron and aluminium. Materials that did not complete the circuit are called insulators — plastic, wood and rubber. That is why electrical wires have metal inside (conductor) covered in plastic outside (insulator to keep us safe). Diagram showing the test circuit with labelled parts.",
        "common_errors": [
          "Using vocabulary too complex for the audience",
          "Presenting only results without explaining what they mean"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Producing a comprehensive scientific report that includes method evaluation, discusses reliability, and suggests further questions, using precise scientific language throughout.",
        "example_task": "Write a full scientific report on our parachute investigation. Include an evaluation of our method and suggestions for further work.",
        "example_response": "Title: Does canopy size affect parachute fall time? Hypothesis: Larger canopies will fall more slowly due to greater air resistance. Method: Made parachutes from plastic bags (25cm², 50cm², 75cm², 100cm²), same string length and mass. Dropped from 2m, timed with stopwatch, 3 repeats each. Results: Table and line graph showing fall time increases with canopy size. Conclusion: Larger canopies create more air resistance, slowing the fall. Evaluation: Timing with stopwatches introduced human error (reaction time ~0.3s). Could improve with light gates. The parachutes sometimes drifted sideways, affecting consistency. Further work: test different canopy shapes (circle vs square), different materials, or different masses to see if the pattern still holds.",
        "common_errors": [
          "Not including an evaluation of the method",
          "Not suggesting specific improvements or further questions"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C007",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying what was changed and what was measured in a given investigation, with teacher support.",
        "example_task": "We changed the height of the ramp and measured how far the car rolled. What was the thing we changed? What did we measure?",
        "example_response": "We changed the height of the ramp. We measured how far the car rolled.",
        "common_errors": [
          "Confusing what was changed with what was measured",
          "Not using the vocabulary 'changed' and 'measured'"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Naming the independent variable (what to change), dependent variable (what to measure) and control variables (what to keep the same) for a given investigation.",
        "example_task": "We are testing whether the type of surface affects how quickly an ice cube melts. Name the three types of variables.",
        "example_response": "Independent variable (what I change): the type of surface (metal, wood, plastic). Dependent variable (what I measure): the time it takes for the ice cube to melt. Control variables (what I keep the same): the size of ice cube, the room temperature, the starting temperature of each surface.",
        "common_errors": [
          "Mixing up independent and dependent variables",
          "Not identifying enough control variables"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Planning an investigation by explicitly identifying and controlling all relevant variables, explaining why each control variable matters for the validity of results.",
        "example_task": "Plan a fair test to find out whether the thickness of insulation affects how quickly a cup of hot water cools. Identify all variables and explain why each control variable must be kept the same.",
        "example_response": "Independent: thickness of insulation (1 layer, 2 layers, 3 layers, no insulation). Dependent: temperature of water after 15 minutes. Controls: same volume of water (keeps heat capacity the same), same starting temperature (so all start equal), same material for insulation (so we only test thickness, not material), same cup type (different cups might retain heat differently), same room temperature. Each control matters because if any were different, I could not be sure whether the thickness or the other factor caused the change.",
        "common_errors": [
          "Listing control variables without explaining why they matter",
          "Forgetting to control the insulation material (changing material and thickness at once)"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating the variable control in an investigation design, identifying uncontrolled variables that could affect results, and explaining how this limits the conclusions.",
        "example_task": "A group tested whether exercise increases heart rate. They had five pupils do star jumps — but each pupil did a different number, some were already tired from PE, and they measured heart rate at different times after stopping. What problems can you identify?",
        "example_response": "There are several uncontrolled variables. Different numbers of star jumps means the exercise intensity was not the same — this should have been standardised. Some pupils being tired from PE means their resting heart rate was already elevated — they should all have rested first. Measuring at different times after stopping means some hearts had longer to recover. To fix this: all pupils should do the same number of jumps, all should rest for 5 minutes before starting, and heart rate should be measured at the same time after stopping (e.g. immediately and then at 1 minute). Without controlling these variables, we cannot be sure the results are valid.",
        "common_errors": [
          "Identifying only one problem rather than all of them",
          "Not suggesting how to fix each uncontrolled variable"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C008",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Making a measurement carefully and recording it, understanding that taking care leads to better results.",
        "example_task": "Measure the length of this pencil. Make sure you read the ruler carefully and start from zero.",
        "example_response": "The pencil is 17.5cm long. I made sure to line up the end with the zero mark and read the ruler at eye level.",
        "common_errors": [
          "Not starting from zero (measuring from 1cm)",
          "Rounding to the nearest whole number when a more precise answer is possible"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Taking the same measurement more than once and understanding that repeat measurements can improve reliability.",
        "example_task": "Measure how long it takes for a marble to roll down this ramp. Do it three times. Why might you get slightly different results each time?",
        "example_response": "Attempt 1: 2.3 seconds. Attempt 2: 2.5 seconds. Attempt 3: 2.4 seconds. The results are slightly different each time because of small differences in when I start and stop the stopwatch (reaction time) and small differences in exactly where I release the marble.",
        "common_errors": [
          "Thinking all three measurements should be identical",
          "Not understanding that the differences come from measurement limitations, not real changes"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Taking repeat measurements, calculating the mean, identifying anomalous results, and explaining why repeat readings improve reliability.",
        "example_task": "You measured the time for a pendulum to make 10 swings. Your results: 12.3s, 12.5s, 12.4s, 15.1s, 12.3s. Calculate the mean. Is there an anomaly?",
        "example_response": "The fourth result (15.1s) is an anomaly — it is much higher than the others, probably because of a timing error. I should discard it and calculate the mean from the remaining four: (12.3 + 12.5 + 12.4 + 12.3) ÷ 4 = 12.375s, which rounds to 12.4s. Repeat measurements improve reliability because random errors tend to cancel out when averaged, giving a result closer to the true value.",
        "common_errors": [
          "Including the anomaly in the mean calculation",
          "Not being able to identify which result is anomalous"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining the difference between accuracy and precision, selecting equipment to match the required precision, and evaluating whether results are reliable enough to support a conclusion.",
        "example_task": "Two groups tested how temperature affects dissolving time. Group A got: 180s, 95s, 52s, 28s (one test each). Group B got: 178s, 182s, 176s (three tests at 20°C only) with a mean of 178.7s. Which group has more reliable data for 20°C? Which has more useful data overall?",
        "example_response": "Group B is more reliable for 20°C because they repeated the measurement three times and the results are consistent (within 6 seconds of each other), which shows good precision. Group A tested more temperatures but only once each, so any single measurement could be inaccurate without repeats to check. However, Group A's data is more useful overall because it shows the pattern across temperatures. Ideally, you would combine both approaches — test at multiple temperatures with repeat measurements at each. Precision means consistent results; accuracy means close to the true value.",
        "common_errors": [
          "Thinking more data points always means better reliability, regardless of whether they are repeated",
          "Confusing accuracy (close to true value) with precision (consistent results)"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C009",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recording data in a simple table or drawing with teacher-provided headings, using standard formats.",
        "example_task": "Record the results of our magnet test in this table. For each material, write whether it was magnetic or non-magnetic.",
        "example_response": "Table completed with correct results for each material tested, with consistent formatting (yes/no or magnetic/non-magnetic).",
        "common_errors": [
          "Writing results inconsistently (some as yes/no, some as description)",
          "Leaving some cells empty"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Choosing between a table, bar chart or classification key to record data, and constructing the chosen format with appropriate labels.",
        "example_task": "We surveyed the minibeasts in two habitats. Record our findings using the most appropriate format.",
        "example_response": "A table with habitats as columns and minibeast types as rows, showing tallied counts. Or a paired bar chart comparing counts in each habitat. Axes labelled, title included, scale appropriate.",
        "common_errors": [
          "Choosing a format that does not suit the data type",
          "Not including a title or labelling axes"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Selecting the most appropriate data recording method for different data types (categorical vs continuous), constructing scatter graphs and line graphs for continuous data, and interpreting the patterns shown.",
        "example_task": "We measured the height of a plant every 3 days for a month. What type of graph should you draw? Create it and describe the pattern.",
        "example_response": "A line graph because both variables are continuous (time in days, height in cm). Points plotted accurately with a smooth curve or line of best fit. The graph shows rapid growth in the first two weeks, then the growth rate slowed down. By day 27, the plant was hardly growing at all. The pattern shows growth that starts fast then levels off.",
        "common_errors": [
          "Joining points dot-to-dot instead of drawing a smooth line of best fit",
          "Using a bar chart for continuous data"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using multiple data representations to communicate complex findings, drawing and interpreting lines of best fit on scatter graphs, and using ICT tools alongside hand-drawn methods.",
        "example_task": "Present the results of our investigation into how arm span relates to height. We measured 25 pupils. Choose the best graph type and explain what the data shows.",
        "example_response": "A scatter graph is best because we are looking for a relationship between two continuous measurements. Each pupil is a point (x = arm span, y = height). The line of best fit shows a positive correlation — as arm span increases, height tends to increase too. But the points do not all sit exactly on the line, showing natural variation. I could use a spreadsheet to plot this and calculate the correlation. This tells us arm span and height are related but not identical — some people have proportionally longer arms or legs.",
        "common_errors": [
          "Joining dots in order rather than drawing a line of best fit",
          "Not recognising that scatter means relationship, not exact match"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C010",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Identifying a simple cause and effect in an investigation — 'this happened because of that' — with teacher support.",
        "example_task": "The ice melted faster in the warm room than in the cold room. What caused the ice to melt faster?",
        "example_response": "The warm room made the ice melt faster because it was hotter.",
        "common_errors": [
          "Stating what happened without identifying the cause",
          "Confusing the cause with the effect"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying a causal relationship in results and beginning to evaluate whether evidence is strong enough to support a claim.",
        "example_task": "We found that plants near the window grew taller than plants far from the window. Can we say that light caused the difference? What else might have caused it?",
        "example_response": "Light probably caused the difference because the plant near the window got more light. But the window might also be warmer because of the sun, or there might be a radiator nearby. So it could be the temperature, not just the light. We would need to control temperature to be sure it was the light that made the difference.",
        "common_errors": [
          "Assuming the first explanation is correct without considering alternatives",
          "Not recognising that correlation (near window = taller) does not prove causation"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Identifying causal relationships in investigation data, distinguishing between correlation and causation, and evaluating the trustworthiness of results.",
        "example_task": "A news article says 'Children who eat breakfast do better in school tests.' Does this mean breakfast causes better test results? What other explanations could there be?",
        "example_response": "It shows a correlation — children who eat breakfast tend to do better — but it does not prove causation. Other factors could explain it: families that provide breakfast might also provide more support with homework, have a calmer morning routine, or have higher incomes (which are linked to academic outcomes). The breakfast itself might help (providing energy for concentration), but we cannot be certain from this data alone. To prove causation, you would need a controlled experiment where the only difference is whether children eat breakfast.",
        "common_errors": [
          "Assuming correlation means causation",
          "Not suggesting any alternative explanations"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating scientific evidence critically, distinguishing between fact and opinion in secondary sources, and assessing the degree of trust in results based on methodology.",
        "example_task": "Two websites make claims about magnets: Site A says 'Magnets can cure headaches' and cites one person's experience. Site B says 'A study of 200 people found no evidence that magnets reduce headache pain compared to a placebo.' Which should you trust more? Why?",
        "example_response": "Site B is more trustworthy because it is based on a study with 200 people (large sample size) and used a placebo (control), which is how scientists test whether something really works. Site A is based on one person's experience — this is anecdotal evidence. One person might have felt better for many reasons (the headache was going away anyway, the placebo effect). Scientific claims need to be tested with controlled studies and large samples before we can trust them. I would look at who conducted the study and whether it was published in a scientific journal.",
        "common_errors": [
          "Trusting the personal story because it seems more relatable",
          "Not understanding why sample size and controls matter for trustworthy evidence"
        ]
      }
    ]
  }
]