[
  {
    "concept_id": "SC-KS3-C091",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that different elements have different properties — some are metals, some are non-metals, and they behave differently.",
        "example_task": "How are iron and sulfur different?",
        "example_response": "Iron is a metal — it is shiny, hard, conducts electricity, and is magnetic. Sulfur is a non-metal — it is a dull yellow powder, brittle, and does not conduct electricity. Different elements have different physical and chemical properties.",
        "common_errors": [
          "Thinking all metals look and behave the same",
          "Not knowing that properties like conductivity and hardness are used to classify elements"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Comparing physical and chemical properties of different elements and understanding how properties relate to classification as metals or non-metals.",
        "example_task": "List four physical properties that distinguish metals from non-metals.",
        "example_response": "Metals: (1) good conductors of electricity and heat, (2) shiny/lustrous when polished, (3) malleable — can be hammered into shape without breaking, (4) ductile — can be drawn into wires. Non-metals: (1) poor conductors (insulators), (2) dull appearance, (3) brittle — shatter when hit, (4) cannot be drawn into wires. However, there are exceptions: carbon (graphite) conducts electricity despite being a non-metal, and mercury is a liquid metal at room temperature.",
        "common_errors": [
          "Not mentioning exceptions — graphite conducts electricity, mercury is liquid",
          "Confusing malleable (can be shaped) with ductile (can be drawn into wire)"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Investigating and comparing the properties of specific elements, explaining properties in terms of structure, and identifying patterns.",
        "example_task": "Group 1 metals (lithium, sodium, potassium) are soft enough to cut with a knife and have low density. How are these properties different from typical metals like iron, and why?",
        "example_response": "Most metals are hard, dense, and have high melting points because their atoms form strong metallic bonds in a closely packed structure. Group 1 metals are unusual: they are soft, have low densities (lithium, sodium, and potassium all float on water), and have low melting points. This is because Group 1 atoms are large with only one outer electron contributing to metallic bonding. With only one bonding electron per atom, the metallic bonds are relatively weak compared to transition metals (like iron, which has multiple bonding electrons). The larger the atom (going down Group 1), the weaker the bonding and the softer and lower-melting the metal becomes. Potassium is softer than sodium, which is softer than lithium. This demonstrates that the periodic table reveals patterns — properties are not random but follow predictable trends related to atomic structure.",
        "common_errors": [
          "Assuming all metals are hard and dense — Group 1 metals break this generalisation",
          "Not explaining the structural reason for the unusual softness (weak metallic bonding due to only one outer electron)"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluating how element properties determine their applications, understanding that properties arise from atomic structure, and analysing the concept of metalloids.",
        "example_task": "Silicon is classified as a metalloid (semi-metal). Explain what this means and why silicon is essential for modern technology.",
        "example_response": "A metalloid has properties intermediate between metals and non-metals. Silicon: has a shiny appearance (metallic) but is brittle (non-metallic), is a semiconductor — it conducts electricity, but much less effectively than a metal and much better than an insulator. Its conductivity increases with temperature (opposite to metals) and can be precisely controlled by adding tiny amounts of other elements (doping). This tuneable conductivity is why silicon is the foundation of the electronics industry. By doping silicon with elements like phosphorus (which adds extra electrons, creating n-type silicon) or boron (which creates 'holes' for electrons, creating p-type silicon), engineers create transistors — the fundamental switches in every computer chip. A modern processor contains billions of transistors on a silicon chip. Silicon's position in the periodic table (Group 14, Period 3) gives it exactly four outer electrons — enough to form a covalent crystal structure similar to diamond but with a smaller band gap, making it a semiconductor rather than an insulator. This example powerfully illustrates how an element's position in the periodic table (determining its electron configuration) directly determines its properties and applications.",
        "common_errors": [
          "Thinking metalloids are simply a mixture of metal and non-metal properties rather than having intermediate properties",
          "Not connecting silicon's semiconductor behaviour to its atomic structure and position in the periodic table"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS3-C092",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that Mendeleev arranged elements in a table and left gaps for elements that had not yet been discovered.",
        "example_task": "Who created the periodic table and what was clever about it?",
        "example_response": "Dmitri Mendeleev created the periodic table in 1869. He arranged the known elements in order of atomic mass and grouped those with similar properties together. The clever part was that he left gaps in the table where he predicted undiscovered elements would fit, and he even predicted what their properties would be.",
        "common_errors": [
          "Thinking Mendeleev discovered the elements — he organised and arranged the known elements",
          "Not mentioning the predictions — the gaps and predicted properties were the most impressive aspect"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Understanding that Mendeleev arranged elements by atomic mass, grouped similar properties, and that his predictions were later confirmed.",
        "example_task": "Mendeleev predicted an element he called 'eka-silicon' would be discovered. When germanium was found in 1886, its properties closely matched his predictions. Why was this important?",
        "example_response": "Mendeleev predicted eka-silicon would have an atomic mass of about 72, a density of 5.5 g/cm³, and would form an oxide with the formula XO₂. When germanium was discovered, it had an atomic mass of 72.6, a density of 5.3 g/cm³, and formed GeO₂. The close match between prediction and observation was powerful evidence that Mendeleev's periodic table was correct — it was not just a convenient arrangement but reflected a genuine pattern in nature. This is how science works: a model's value is judged by its ability to make accurate predictions that are later confirmed. Mendeleev also had to swap the positions of some elements (like tellurium and iodine) to keep similar properties in the same group, even though this violated the strict order of atomic mass — he trusted the pattern of properties over the mass ordering.",
        "common_errors": [
          "Not explaining why the confirmed predictions were significant — they validated the periodic table as a model",
          "Not knowing that Mendeleev had to swap some elements to maintain the property groupings"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Explaining how the modern periodic table differs from Mendeleev's original (arranged by atomic number, not mass) and why this resolved the anomalies.",
        "example_task": "The modern periodic table is arranged by atomic number rather than atomic mass. Explain why this change was necessary.",
        "example_response": "Mendeleev arranged elements by increasing atomic mass, but this created anomalies. For example, tellurium (atomic mass 127.6) has a higher mass than iodine (atomic mass 126.9), but Mendeleev placed tellurium before iodine because tellurium's properties matched Group 6 and iodine's matched Group 7. He could not explain why mass ordering was occasionally wrong. The solution came when Henry Moseley determined atomic numbers (the number of protons in the nucleus) using X-ray spectroscopy in 1913. When elements are arranged by atomic number, tellurium (52) correctly comes before iodine (53) with no need to swap positions. Arranging by atomic number resolves all the anomalies because chemical properties depend on electron configuration, which is determined by the number of protons (atomic number), not the total mass (which is affected by neutron number). Elements in the same group have the same number of outer electrons, which is why they have similar chemical properties. The periodic table is now understood as a reflection of electronic structure.",
        "common_errors": [
          "Not understanding why atomic number is more fundamental than atomic mass for determining chemical properties",
          "Not knowing who Moseley was or how atomic numbers were determined"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluating the periodic table as one of the most successful scientific models in history, understanding periodicity, and analysing how the table continues to evolve.",
        "example_task": "New elements (113-118) were added to the periodic table in 2016. These are synthetic, lasting only fractions of a second. Evaluate whether extending the periodic table to these superheavy elements is scientifically worthwhile.",
        "example_response": "Creating superheavy elements is scientifically worthwhile for several reasons. First, it tests our understanding of nuclear physics — these elements are created by smashing lighter atoms together in particle accelerators, and their existence (however brief) confirms theoretical predictions about nuclear stability. The 'island of stability' hypothesis predicts that certain superheavy elements may have significantly longer half-lives, potentially useful — discovering these would validate quantum mechanical models of the nucleus. Second, each new element confirms the periodic table's predictive power — element 117 (tennessine) belongs to Group 17 (halogens), and even with a half-life of milliseconds, its chemical behaviour shows periodicity consistent with its position. Third, the techniques developed to create and detect these elements advance technology used in medical isotope production, nuclear energy, and materials science. Critics argue the enormous cost and effort for elements that exist for fractions of a second has limited practical value. However, fundamental research often yields unexpected applications — the periodic table itself was once purely academic but now underpins all of chemistry, materials science, and chemical engineering. The periodic table is arguably the most successful classification system in science: it organises over 100 elements, predicts properties, guides chemical research, and has been continuously validated for over 150 years. Its ongoing extension demonstrates that it remains a living, evolving model.",
        "common_errors": [
          "Dismissing superheavy element research as having no value without considering its contribution to fundamental physics",
          "Not recognising that the periodic table is still a predictive model being tested and extended"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS3-C093",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that the periodic table organises elements in rows (periods) and columns (groups), with metals on the left and non-metals on the right.",
        "example_task": "Where are metals found on the periodic table? Where are non-metals?",
        "example_response": "Metals are found on the left side and in the centre of the periodic table — they make up most of the elements. Non-metals are found on the right side. There is a dividing line (a staircase shape) between metals and non-metals. Elements near this line have properties of both and are called metalloids.",
        "common_errors": [
          "Thinking metals and non-metals are evenly split — most elements are metals",
          "Not knowing that the table has rows (periods) and columns (groups)"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Understanding that elements in the same group have similar chemical properties and that periods represent increasing atomic number.",
        "example_task": "Why do lithium, sodium, and potassium (Group 1) all react vigorously with water?",
        "example_response": "Lithium, sodium, and potassium are all in Group 1 of the periodic table. Elements in the same group have the same number of outer electrons — Group 1 elements all have one outer electron. This single outer electron is easily lost in chemical reactions, making them all very reactive metals. They all react with water in the same way: metal + water → metal hydroxide + hydrogen. The reaction gets more vigorous going down the group (potassium more than sodium more than lithium) because the outer electron is further from the nucleus and more easily lost in larger atoms.",
        "common_errors": [
          "Not linking group number to the number of outer electrons",
          "Thinking all Group 1 metals react with equal vigour — reactivity increases down the group"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Explaining trends within groups and across periods in terms of electronic structure, and identifying the key groups (1, 7, 0) and their characteristics.",
        "example_task": "Compare the properties of Group 1 (alkali metals) with Group 7 (halogens). How do reactivity trends differ and why?",
        "example_response": "Group 1 (alkali metals) reactivity increases going down the group: lithium is the least reactive, francium the most. This is because they react by losing their one outer electron — as atoms get larger down the group, the outer electron is further from the nucleus, less tightly held, and easier to lose. Group 7 (halogens) reactivity decreases going down the group: fluorine is the most reactive, iodine the least. This is because they react by gaining one electron to fill their outer shell — as atoms get larger, the outer shell is further from the nucleus and the nuclear attraction on incoming electrons is weaker, making it harder to gain an electron. The opposite trends are explained by the opposite mechanisms: Group 1 loses electrons (easier for larger atoms), Group 7 gains electrons (easier for smaller atoms). Group 0 (noble gases) are unreactive because they have full outer electron shells — they do not need to gain or lose electrons.",
        "common_errors": [
          "Not explaining why the reactivity trends are opposite for Group 1 (increases down) and Group 7 (decreases down)",
          "Forgetting Group 0 (noble gases) and their full outer shells"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Explaining periodicity across a period in terms of electronic structure, understanding transition metals as a distinct block, and using the table to predict unfamiliar element properties.",
        "example_task": "Element 119 has not yet been synthesised. Using the periodic table, predict its group, properties, and likely reactivity.",
        "example_response": "Element 119 would be placed in Group 1, Period 8 — below francium. Predicted properties: it would be an alkali metal with one outer electron (in the 8s orbital). It would be the most reactive metal ever observed, reacting explosively with water and air. It would be a soft, low-melting-point metal with very low ionisation energy (the outer electron is extremely far from the nucleus in the 8th shell). Its density would be very high due to relativistic effects (inner electrons move at a significant fraction of the speed of light, contracting the inner shells and affecting the outer electron). However, relativistic effects at this atomic number may cause deviations from simple periodic trends — some theoretical predictions suggest element 119 might not behave as a typical Group 1 metal because relativistic contraction of the s orbital could make the outer electron harder to remove than expected. This illustrates both the power and limitations of the periodic table: it makes strong predictions based on periodicity, but at the extremes of the table, the simple model (based on non-relativistic electron behaviour) may break down. Testing whether element 119 follows or deviates from periodic trends would be a significant test of our quantum mechanical models.",
        "common_errors": [
          "Predicting properties without considering that relativistic effects may cause deviations at very high atomic numbers",
          "Not placing the element correctly in Period 8, Group 1"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS3-C094",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that elements in the same column of the periodic table react in similar ways.",
        "example_task": "If sodium reacts with water to produce hydrogen gas and a hydroxide, what would you expect potassium to do with water?",
        "example_response": "Potassium would also react with water to produce hydrogen gas and a hydroxide (potassium hydroxide). This is because potassium and sodium are in the same group (Group 1) of the periodic table, so they react in similar ways. Potassium would react more vigorously than sodium because it is further down the group.",
        "common_errors": [
          "Not predicting a more vigorous reaction for potassium (it is below sodium, so more reactive)",
          "Thinking elements in the same group react completely differently"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using group position to predict reaction patterns and products for unfamiliar elements.",
        "example_task": "Bromine (Group 7) reacts with iron to form iron bromide. Predict what happens when chlorine reacts with iron, and explain your reasoning.",
        "example_response": "Chlorine would also react with iron to form iron chloride, because chlorine is in the same group (Group 7) as bromine, so it undergoes similar reactions. Chlorine is above bromine in Group 7, so it is more reactive — the reaction would be more vigorous. The product would be iron chloride (FeCl₃) rather than iron bromide (FeBr₃), following the same pattern but with chlorine replacing bromine. This prediction works because elements in the same group have the same number of outer electrons and therefore react by the same mechanism.",
        "common_errors": [
          "Not adjusting the product name to reflect the different halogen (chloride not bromide)",
          "Failing to predict that chlorine reacts more vigorously because it is higher in Group 7 (more reactive)"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Predicting displacement reactions between halogens based on reactivity, and using the periodic table to explain why predictions work.",
        "example_task": "Chlorine water is added to potassium bromide solution. Predict what will happen and explain using the reactivity of halogens.",
        "example_response": "A displacement reaction will occur: chlorine will displace bromine from the potassium bromide solution. Cl₂(aq) + 2KBr(aq) → 2KCl(aq) + Br₂(aq). The solution will change from colourless to orange-brown as bromine is released. This happens because chlorine is above bromine in Group 7, making it more reactive — chlorine atoms gain electrons more readily than bromine atoms because chlorine's outer shell is closer to the nucleus. A more reactive halogen always displaces a less reactive one from a solution of its salt. If you reversed the experiment (adding bromine water to potassium chloride), nothing would happen because bromine cannot displace the more reactive chlorine.",
        "common_errors": [
          "Predicting a reaction when the added halogen is less reactive than the one in solution — less reactive halogens cannot displace more reactive ones",
          "Not explaining the colour change as evidence of the displacement occurring"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluating the predictive power of the periodic table for complex scenarios, understanding exceptions to trends, and applying predictions to real-world chemistry.",
        "example_task": "Astatine is at the bottom of Group 7 but is extremely rare and radioactive. Using the periodic table, predict its properties and explain what challenges scientists face in studying it.",
        "example_response": "Predictions from periodic trends: astatine would be a solid at room temperature (melting points increase down Group 7: F₂ gas → Cl₂ gas → Br₂ liquid → I₂ solid → At solid). It would be the least reactive halogen, forming astatide (At⁻) ions less readily because its outer shell is very far from the nucleus. It would be dark in colour (following the trend: pale yellow → green-yellow → red-brown → dark purple → black/very dark). It would form compounds like NaAt and HAt, similar to other halides. Challenges: astatine's most stable isotope (At-210) has a half-life of only 8.1 hours — it decays radioactively so quickly that only tiny amounts can ever exist at once (the total amount of astatine in Earth's crust at any time is estimated at less than 30 grams). This means bulk properties (melting point, colour, density) have never been directly measured — all 'known' properties are extrapolated from periodic trends and theoretical calculations, with only limited experimental confirmation from tracer-level chemistry. This makes astatine a fascinating test case: if measured properties match predictions, it validates the periodic table's extrapolative power. If they deviate (as some theoretical models suggest due to relativistic effects and the influence of radioactive decay), it reveals the limits of simple periodic trends. Currently, astatine-211 is being investigated for targeted cancer therapy — its alpha particle emission can destroy cancer cells while its short half-life limits damage to healthy tissue.",
        "common_errors": [
          "Stating predictions as facts without acknowledging that bulk properties of astatine have not been experimentally measured",
          "Not considering that radioactivity and relativistic effects may cause deviations from simple periodic trends"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS3-C095",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that metals are generally shiny, conduct electricity, and can be bent, while non-metals are dull, do not conduct, and break easily.",
        "example_task": "Why are electrical wires made of copper (a metal) and coated in plastic (a non-metal)?",
        "example_response": "Copper is a metal, so it is an excellent conductor of electricity — this allows the electric current to flow through the wire. Plastic is a non-metal and an insulator — it does not conduct electricity. The plastic coating stops the current leaking out and prevents electric shocks. The wire uses each material for its best property.",
        "common_errors": [
          "Not explaining why each material is chosen in terms of its specific property",
          "Thinking all metals conduct equally well — copper is chosen specifically because it is one of the best conductors"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Comparing metals and non-metals systematically across multiple properties and identifying exceptions.",
        "example_task": "Create a comparison of metal and non-metal properties. Include at least one exception to the general rules.",
        "example_response": "General metals: high melting points, dense, conduct heat and electricity, shiny, malleable, ductile, usually solid at room temperature. General non-metals: low melting points, low density, poor conductors (insulators), dull, brittle (solids), often gases at room temperature. Exceptions: mercury is a metal but is liquid at room temperature. Carbon (graphite) is a non-metal but conducts electricity because it has delocalised electrons that can move. Diamond (also carbon) is the hardest known natural material despite being a non-metal. Sodium is a metal but is soft enough to cut with a knife and floats on water. These exceptions show that the metal/non-metal classification is based on general trends, not absolute rules.",
        "common_errors": [
          "Presenting the metal/non-metal distinction as absolute with no exceptions",
          "Not knowing that graphite conducts electricity — it is the most important exception among non-metals"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Explaining the properties of metals and non-metals in terms of their bonding and structure.",
        "example_task": "Explain why metals conduct electricity but most non-metals do not, using your knowledge of atomic structure.",
        "example_response": "In metals, the outer electrons are delocalised — they are not attached to any one atom but are free to move throughout the metal structure. These free electrons can carry electric charge through the metal when a voltage is applied, creating an electric current. This is metallic bonding: positive metal ions are arranged in a regular lattice, held together by a 'sea' of delocalised electrons. In most non-metals, all electrons are localised — they are held in covalent bonds between specific atoms and are not free to move. With no mobile charge carriers, most non-metals cannot conduct electricity. Graphite is the exception: carbon atoms in graphite are arranged in layers, and within each layer, each carbon atom forms three covalent bonds, leaving one electron per atom delocalised within the layer. These delocalised electrons allow graphite to conduct electricity along the layers (but not between them). This structural explanation shows that conductivity is not a random property but a direct consequence of how electrons are arranged in the material.",
        "common_errors": [
          "Not mentioning delocalised electrons as the key to metallic conductivity",
          "Explaining graphite's conductivity without specifying that conduction occurs along layers, not between them"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Analysing how metal and non-metal properties determine their applications in engineering and technology, including alloys and advanced materials.",
        "example_task": "Pure iron is too soft for most structural applications. Explain how alloying improves its properties, using your knowledge of metallic structure.",
        "example_response": "In pure iron, atoms are arranged in regular layers of identical size. These layers can slide over each other relatively easily when force is applied, making pure iron soft and malleable. When carbon atoms (much smaller than iron atoms) are added to make steel, they sit in the gaps between iron atoms, disrupting the regular arrangement. The irregularity prevents layers from sliding smoothly, making the alloy harder and stronger. Different amounts of carbon produce different properties: low-carbon steel (0.05-0.25% C) is relatively soft and ductile (used for car bodies); high-carbon steel (0.6-1.5% C) is very hard but brittle (used for cutting tools). Adding other elements creates specialised alloys: chromium produces stainless steel (corrosion-resistant), tungsten creates high-speed steel (maintains hardness at high temperatures for machining). The principle extends beyond steel: brass (copper + zinc) is harder than pure copper, bronze (copper + tin) is harder still, and titanium alloys (used in aircraft and medical implants) combine low density with high strength. In all cases, the alloying atoms disrupt the regular lattice, preventing easy layer sliding. This is why alloys are used in virtually all structural applications rather than pure metals — the ability to 'tune' properties by varying composition is one of the most important principles in materials engineering.",
        "common_errors": [
          "Explaining alloy hardness without the mechanism — different-sized atoms disrupt the regular lattice, preventing layer sliding",
          "Thinking alloys are compounds — alloys are mixtures of metals (or metals with non-metals like carbon)"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS3-C096",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that when metals react with oxygen, they form metal oxides, and when non-metals react with oxygen, they form non-metal oxides.",
        "example_task": "What is formed when magnesium burns in air?",
        "example_response": "When magnesium burns in air, it reacts with oxygen to form magnesium oxide. This is a white powder. The bright white flame shows a lot of energy is released. Metal + oxygen → metal oxide is the general pattern for metals burning.",
        "common_errors": [
          "Not identifying the product as a metal oxide",
          "Thinking the bright light means the metal is just glowing rather than undergoing a chemical reaction"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Understanding that metal oxides are generally basic or alkaline, while non-metal oxides are generally acidic.",
        "example_task": "Carbon dioxide dissolves in water to form carbonic acid (an acidic solution). Sodium oxide dissolves in water to form sodium hydroxide (an alkaline solution). What pattern does this show?",
        "example_response": "The pattern is: non-metal oxides (like CO₂) dissolve in water to form acidic solutions. Metal oxides (like Na₂O) dissolve in water to form alkaline solutions. CO₂ + H₂O → H₂CO₃ (carbonic acid, pH below 7). Na₂O + H₂O → 2NaOH (sodium hydroxide, pH above 7). This is a general rule that helps predict the behaviour of oxides. It also explains acid rain: sulfur dioxide (SO₂, a non-metal oxide from burning fossil fuels) dissolves in rainwater to form sulfuric acid.",
        "common_errors": [
          "Getting the pattern the wrong way round — metal oxides are basic/alkaline, non-metal oxides are acidic",
          "Not connecting the pattern to real-world phenomena like acid rain"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Explaining oxide acidity in terms of bonding type and using this to predict the behaviour of unfamiliar oxides.",
        "example_task": "Predict whether aluminium oxide (Al₂O₃) is acidic, basic, or neutral. Explain your reasoning.",
        "example_response": "Aluminium is a metal, so you might predict aluminium oxide would be basic. However, aluminium is near the boundary between metals and non-metals in the periodic table. Aluminium oxide is actually amphoteric — it can act as both an acid and a base depending on what it reacts with. It reacts with acids (acting as a base): Al₂O₃ + 6HCl → 2AlCl₃ + 3H₂O. It also reacts with alkalis (acting as an acid): Al₂O₃ + 2NaOH → 2NaAlO₂ + H₂O. This amphoteric behaviour is characteristic of elements near the metal/non-metal boundary. The general trend is: strongly metallic elements (left of periodic table) form strongly basic oxides; strongly non-metallic elements (right) form strongly acidic oxides; elements near the boundary form amphoteric oxides. This trend reflects the change from ionic bonding (metals) to covalent bonding (non-metals) across a period.",
        "common_errors": [
          "Predicting aluminium oxide is simply basic because aluminium is a metal — it is amphoteric",
          "Not knowing that amphoteric means it can react with both acids and bases"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Analysing the environmental significance of oxide acidity, evaluating solutions to acid rain, and understanding how oxide chemistry relates to industrial processes.",
        "example_task": "Limestone (calcium carbonate, CaCO₃) is used to neutralise acidic lakes and to remove sulfur dioxide from power station emissions. Explain the chemistry behind both applications.",
        "example_response": "Both applications exploit the basic nature of calcium compounds. In acidified lakes: CaCO₃ is a base that neutralises the acid. CaCO₃ + H₂SO₄ → CaSO₄ + H₂O + CO₂. The crushed limestone is added to the lake, reacting with the sulfuric acid from acid rain to form neutral calcium sulfate, water, and carbon dioxide. This raises the pH towards neutral, allowing aquatic life to recover. In power stations (flue gas desulfurisation): crushed limestone or calcium hydroxide (slaked lime) is sprayed into the flue gases. CaCO₃ + SO₂ → CaSO₃ + CO₂, or Ca(OH)₂ + SO₂ → CaSO₃ + H₂O. The calcium sulfite can be further oxidised to calcium sulfate (gypsum), which is sold for making plasterboard — turning a waste product into a useful material. This is a large-scale application of the basic oxide pattern: the basic calcium compound neutralises the acidic non-metal oxide (SO₂). The chemistry is identical in principle to a simple lab neutralisation but operates on an industrial scale. These solutions are effective but address the symptom (acid emissions) rather than the cause (burning sulfur-containing fossil fuels). The most fundamental solution is reducing fossil fuel use — prevention rather than cure.",
        "common_errors": [
          "Describing the applications without writing the chemical equations that explain the chemistry",
          "Not recognising that both applications are examples of the same principle — a basic compound neutralising an acidic oxide"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS3-C097",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that some metals are more reactive than others and that there is an order called the reactivity series.",
        "example_task": "Which is more reactive: gold or iron? How do you know?",
        "example_response": "Iron is much more reactive than gold. Iron reacts with oxygen and water — this is why iron rusts. Gold does not react with air or water, which is why gold jewellery stays shiny for thousands of years and gold coins survive from ancient times. The reactivity series puts metals in order from most reactive to least reactive.",
        "common_errors": [
          "Not connecting reactivity to everyday observations like rusting",
          "Thinking 'more expensive' means 'more reactive' — gold is unreactive, which is partly why it is valuable"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Listing the main metals in the reactivity series and understanding how it is determined from reactions with water and acids.",
        "example_task": "Put these metals in order of reactivity: copper, magnesium, iron, sodium. Explain how you know.",
        "example_response": "Most reactive to least reactive: sodium, magnesium, iron, copper. Evidence: sodium reacts vigorously with cold water (fizzing, moving on the surface, producing hydrogen). Magnesium reacts slowly with cold water but vigorously with dilute acid. Iron reacts slowly with dilute acid (gentle fizzing). Copper does not react with dilute acid at all. The reactivity series also includes carbon and hydrogen as reference points: metals above carbon can be extracted using carbon; metals above hydrogen react with dilute acids to produce hydrogen gas.",
        "common_errors": [
          "Putting metals in the wrong order — a common error is placing iron above magnesium",
          "Not including carbon and hydrogen as reference points in the series"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Using the reactivity series to predict displacement reactions and explain why they occur in terms of electron transfer.",
        "example_task": "Predict whether a reaction occurs when zinc is placed in copper sulfate solution. Write the equation and explain using the reactivity series.",
        "example_response": "Yes, a reaction occurs. Zinc is more reactive than copper (higher in the reactivity series), so zinc displaces copper from the solution. Zn(s) + CuSO₄(aq) → ZnSO₄(aq) + Cu(s). Observations: the blue copper sulfate solution becomes colourless (zinc sulfate solution), and a brown coating of copper metal appears on the zinc. In terms of electron transfer: zinc atoms lose electrons (oxidation): Zn → Zn²⁺ + 2e⁻. Copper ions gain electrons (reduction): Cu²⁺ + 2e⁻ → Cu. Zinc is oxidised because it loses electrons more readily than copper — this is fundamentally what 'more reactive' means. If instead copper were placed in zinc sulfate solution, nothing would happen because copper cannot displace the more reactive zinc.",
        "common_errors": [
          "Predicting a reaction when the added metal is less reactive than the metal in solution",
          "Not linking the reactivity series to electron transfer — more reactive metals lose electrons more easily"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Applying the reactivity series to explain extraction methods, evaluating the economic and environmental implications of different extraction techniques.",
        "example_task": "Aluminium is above carbon in the reactivity series, while iron is below. Explain why this affects how each metal is extracted and the cost implications.",
        "example_response": "Iron is below carbon in the reactivity series, so iron oxide can be reduced by carbon in a blast furnace: Fe₂O₃ + 3C → 2Fe + 3CO₂. This is relatively cheap — carbon (as coke) is abundant, and the process, while energy-intensive, is straightforward. Aluminium is above carbon, so carbon cannot reduce aluminium oxide — aluminium holds onto its oxygen more strongly than carbon can pull it away. Instead, aluminium must be extracted by electrolysis: aluminium oxide is dissolved in molten cryolite (to lower the melting point from 2072°C to about 950°C) and an electric current is passed through to decompose it: 2Al₂O₃ → 4Al + 3O₂. Electrolysis requires enormous amounts of electricity — extracting aluminium uses about 5% of the total electricity generated in some countries. This is why aluminium is much more expensive than iron despite being more abundant in the Earth's crust. It also explains why recycling aluminium (which only requires 5% of the energy of primary extraction) is economically and environmentally compelling. The reactivity series thus directly determines extraction method → energy requirement → cost → environmental impact. Very reactive metals (potassium, sodium) were not isolated until Humphry Davy invented electrolysis in 1807 — before that, no chemical reducing agent was powerful enough.",
        "common_errors": [
          "Not explaining why carbon cannot reduce aluminium oxide — aluminium is more reactive than carbon",
          "Failing to connect the extraction method to cost and environmental impact"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS3-C098",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that metals are found in rocks called ores and must be extracted to be useful.",
        "example_task": "Where does the iron in a car come from?",
        "example_response": "The iron comes from iron ore — a type of rock found in the ground that contains iron combined with other elements (usually oxygen). The iron ore is dug out of the ground by mining, then heated with carbon (coke) in a blast furnace to extract the pure iron metal. The iron is then made into steel for building cars.",
        "common_errors": [
          "Thinking iron is found as pure metal in the ground — most metals are found as compounds in ores",
          "Not knowing that extraction involves a chemical reaction to separate the metal from its ore"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Understanding reduction with carbon as the method for extracting metals below carbon in the reactivity series.",
        "example_task": "Explain how carbon is used to extract iron from iron oxide in a blast furnace.",
        "example_response": "In the blast furnace, iron oxide (Fe₂O₃) is heated with carbon (coke) at very high temperatures. The carbon reacts with the oxygen in the iron oxide, removing it: iron oxide + carbon → iron + carbon dioxide (Fe₂O₃ + 3C → 2Fe + 3CO₂). The iron oxide is reduced (loses oxygen) and the carbon is oxidised (gains oxygen). This works because carbon is more reactive than iron — it has a stronger attraction to oxygen, so it 'pulls' the oxygen away from the iron. The molten iron sinks to the bottom of the furnace and is tapped off. This only works for metals below carbon in the reactivity series.",
        "common_errors": [
          "Not explaining why carbon can extract iron — carbon is more reactive than iron, so it can remove the oxygen",
          "Confusing reduction (removal of oxygen) with oxidation (addition of oxygen) in this context"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Comparing extraction methods for different metals based on their position in the reactivity series, and understanding the economic factors.",
        "example_task": "Why is electrolysis needed to extract aluminium but not iron? Compare the costs and environmental impacts.",
        "example_response": "Iron is below carbon in the reactivity series, so carbon can reduce iron oxide to iron in a blast furnace at relatively low cost. Aluminium is above carbon, so no chemical reducing agent available on an industrial scale can remove the oxygen — electrolysis is required. In electrolysis, aluminium oxide is dissolved in molten cryolite (to reduce the melting point) and a large electric current passes through it, decomposing it into aluminium and oxygen. The costs differ dramatically: blast furnace iron production costs approximately 300-500 per tonne, while aluminium electrolysis costs approximately 1,500-2,500 per tonne. The environmental impacts also differ: the blast furnace produces CO₂ directly from carbon oxidation, while electrolysis produces CO₂ indirectly (from the electricity generation, unless renewable sources are used, and from the carbon anodes which are consumed). The extremely high energy requirement for aluminium extraction explains why aluminium recycling is so important — recycling uses only 5% of the energy of primary extraction, saving both cost and carbon emissions.",
        "common_errors": [
          "Not explaining why electrolysis is needed for aluminium in terms of the reactivity series",
          "Thinking electrolysis has no environmental impact because it does not directly burn carbon — the electricity source and anode consumption both produce CO₂"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluating the sustainability of metal extraction, understanding the role of recycling, and analysing emerging extraction technologies.",
        "example_task": "Evaluate whether recycling metals can solve the environmental problems associated with metal extraction.",
        "example_response": "Recycling significantly reduces but does not fully solve the environmental problems. Benefits: recycling aluminium uses 95% less energy than primary extraction, reducing CO₂ emissions proportionally. Recycling steel uses 74% less energy than primary production. Recycling reduces mining (habitat destruction, water pollution, soil erosion) and landfill waste. It conserves finite ore resources for future generations. Limitations: recycling cannot meet growing demand alone — global metal consumption is increasing, particularly for infrastructure in developing nations and for new technologies (lithium for batteries, rare earth elements for electronics). Not all metals can be recycled efficiently — alloys and mixed-metal products are difficult to separate. Collection and sorting infrastructure is expensive and incomplete. Some metal is lost in each recycling cycle (oxidation, contamination). Emerging technologies offer additional solutions: biomining uses bacteria to extract metals from low-grade ores or electronic waste (less energy than smelting). Hydrogen reduction could replace carbon in steelmaking, producing water instead of CO₂ (pilot plants are already operating in Sweden). Urban mining recovers metals from electronic waste — a tonne of circuit boards contains more gold than a tonne of gold ore. The complete solution requires a combination of recycling (maximise), efficiency (use less metal per product), substitution (replace scarce metals with abundant alternatives where possible), and cleaner extraction technologies (hydrogen reduction, biomining, renewable-powered electrolysis). No single approach is sufficient.",
        "common_errors": [
          "Presenting recycling as a complete solution without acknowledging its limitations",
          "Not mentioning emerging technologies like hydrogen reduction or biomining that address the limitations of current methods"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS3-C099",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that different materials (plastics, ceramics, metals) have different properties and are chosen for specific uses.",
        "example_task": "Why is a mug made of ceramic rather than paper?",
        "example_response": "Ceramic is chosen for mugs because it is heat-resistant (does not melt or burn when you pour in hot liquid), waterproof (does not absorb the liquid), hard (does not scratch easily), and an insulator (does not get too hot to hold). Paper would soak up the liquid, lose its shape, and eventually fall apart. Materials are chosen based on their properties matching the job.",
        "common_errors": [
          "Not linking the choice of material to specific properties needed for the application",
          "Thinking any material could be used for any job"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Comparing the properties of ceramics, polymers, and composites, and explaining why each is suited to different applications.",
        "example_task": "Compare the properties of a ceramic, a polymer, and a composite material, giving one application of each.",
        "example_response": "Ceramics (e.g., porcelain, glass, brick): hard, brittle, heat-resistant, electrical insulators, chemically inert. Application: tiles on the Space Shuttle protected it from extreme heat during re-entry. Polymers (e.g., polyethylene, PVC, nylon): lightweight, flexible, poor conductors, can be moulded into shape, some are waterproof. Application: plastic bottles are lightweight, shatterproof, and waterproof. Composites (e.g., carbon fibre reinforced polymer, fibreglass, concrete): combine properties of two or more materials — typically strong AND lightweight. Application: carbon fibre is used in aircraft and racing cars because it is as strong as steel but much lighter. Composites are designed to have the best properties of their components while avoiding their weaknesses.",
        "common_errors": [
          "Not explaining how composites combine the properties of their components",
          "Thinking polymers are all the same — there is enormous variety in polymer properties"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Explaining the properties of different material types in terms of their structure and bonding, and evaluating their suitability for specific applications.",
        "example_task": "A bridge engineer needs a material that is strong, lightweight, and resistant to corrosion. Evaluate whether steel, aluminium, or carbon fibre composite would be the best choice.",
        "example_response": "Steel: very strong and relatively cheap, but heavy (density ~7,800 kg/m³) and susceptible to corrosion (rusting) unless protected by painting or galvanising. Best for large structures where weight is less critical. Aluminium: lighter than steel (density ~2,700 kg/m³) and naturally corrosion-resistant (forms a protective oxide layer), but not as strong as steel and more expensive. Good for structures where weight matters but extreme strength is not required. Carbon fibre composite: strongest per unit weight (high specific strength), extremely lightweight (density ~1,600 kg/m³), and corrosion-resistant. However, it is very expensive, difficult to repair, and behaves differently under stress (it can fail suddenly without warning, unlike steel which deforms before breaking). For a bridge: steel is most commonly used because its high absolute strength, predictable failure mode (gradual deformation), and low cost outweigh its weight and corrosion disadvantages. Carbon fibre is increasingly used for pedestrian bridges and repair patches but is too expensive and unpredictable in failure for major vehicular bridges. The choice depends on balancing competing requirements — no material is perfect for all applications.",
        "common_errors": [
          "Choosing the 'best' material without acknowledging trade-offs — every material has advantages and disadvantages",
          "Not considering cost, repairability, and failure mode alongside physical properties"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Analysing how materials science develops new materials for specific needs, understanding smart materials and nanomaterials, and evaluating sustainability issues.",
        "example_task": "Explain how understanding the structure of materials at the atomic and molecular level has led to the development of new materials that could not exist naturally.",
        "example_response": "Materials science designs materials by manipulating structure at multiple scales. At the molecular level: Kevlar's extreme strength comes from its molecular structure — long polymer chains with many hydrogen bonds between them, creating sheets that align under tension. This structure was deliberately designed to maximise intermolecular bonding, creating a material five times stronger than steel per unit weight. At the nanoscale: carbon nanotubes are cylinders of carbon atoms arranged in a hexagonal pattern, with extraordinary properties — they are 100 times stronger than steel, conduct electricity better than copper, and conduct heat better than diamond. These properties emerge specifically from the nanoscale structure and do not exist in bulk carbon. Graphene (a single layer of carbon atoms) has similarly extraordinary properties. Smart materials respond to their environment: shape-memory alloys (like nitinol) return to their original shape when heated — used in medical stents that expand inside blood vessels. Thermochromic materials change colour with temperature — used in mood rings and baby bath thermometers. The sustainability challenge is significant: many advanced materials are difficult or impossible to recycle (composites cannot easily be separated into components), some require rare or toxic elements, and manufacturing often has high energy costs. The future of materials science must balance performance with sustainability — developing recyclable composites, bio-based polymers, and materials that can be disassembled and reused. This represents a fundamental shift from designing materials purely for performance to designing for their entire lifecycle.",
        "common_errors": [
          "Describing new materials without explaining how their structure at the atomic/molecular level creates their properties",
          "Not addressing the sustainability and recyclability challenges of advanced materials"
        ]
      }
    ]
  }
]