[
  {
    "concept_id": "SC-KS1-C032",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Sorting familiar items into 'alive' and 'not alive' with teacher support, using simple everyday reasoning.",
        "example_task": "Sort these items: a cat, a stone, a daisy, a toy car. Which are alive and which are not?",
        "example_response": "Alive: cat, daisy. Not alive: stone, toy car.",
        "common_errors": [
          "Thinking the daisy is not alive because it does not move",
          "Classifying the toy car as alive because it can move"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using the three categories — living, dead and never alive — and giving a reason for each classification.",
        "example_task": "Sort these into living, dead and never alive: a growing tree, a fallen leaf, a pebble, a worm, a wooden chair, a plastic bottle.",
        "example_response": "Living: growing tree (it is still growing), worm (it moves and eats). Dead: fallen leaf (it was part of a living tree but is no longer alive), wooden chair (the wood came from a tree that was alive). Never alive: pebble (rock was never living), plastic bottle (plastic was never alive).",
        "common_errors": [
          "Classifying the wooden chair as 'never alive' instead of 'dead'",
          "Classifying the fallen leaf as 'never alive' because it looks dry"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Accurately classifying a range of items including tricky examples (fire, seeds, shells, dried flowers) and justifying each choice by referring to life processes.",
        "example_task": "Classify these as living, dead or never alive: a dry seed, a fire, a seashell, a spider, a piece of coal. Explain the tricky ones.",
        "example_response": "Living: spider (it moves, eats, grows, reproduces), dry seed (it is alive but dormant — if you add water it will germinate). Dead: seashell (the shell was made by a living creature that has died), coal (formed from dead plants millions of years ago). Never alive: fire (it is not a living thing even though it seems to move and grow — it does not eat, reproduce, or have cells). The seed is tricky because it looks dead but is actually alive and resting.",
        "common_errors": [
          "Classifying the dry seed as dead because it does not seem to be doing anything",
          "Classifying fire as living because it moves, grows and seems to 'breathe' oxygen"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining why the living/dead/never alive classification is useful in science, and handling ambiguous cases by reasoning about life processes.",
        "example_task": "A robot can move, respond to sounds and follow instructions. Is it alive? A Venus flytrap can close its leaves when a fly lands on them. Is it alive? Explain how you decide.",
        "example_response": "The robot is never alive — even though it moves and responds, it was built by people from metal and plastic (never alive materials). It does not grow, eat, breathe or reproduce on its own. It only does what it was programmed to do. The Venus flytrap is alive — it is a plant that grows, makes its own food from sunlight, and reproduces by making seeds. It moves to catch insects, which gives it extra nutrients. We decide if something is living by checking for life processes like growth, nutrition and reproduction, not just movement.",
        "common_errors": [
          "Thinking movement alone means something is alive",
          "Not recognising that plants are alive because they do not move in obvious ways"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS1-C033",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Naming one or two things that living things do, such as grow and eat, when prompted.",
        "example_task": "What can a living thing do that a stone cannot?",
        "example_response": "A living thing can grow. A stone does not grow.",
        "common_errors": [
          "Saying 'move' without recognising that non-living things (rivers, clouds) can also move",
          "Struggling to name any life processes beyond movement"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Naming several characteristics of living things: they grow, eat (feed), move and produce young (reproduce).",
        "example_task": "How do we know a cat is alive? Name four things living things can do.",
        "example_response": "A cat is alive because it grows from a kitten, it eats food, it moves around, and it can have kittens of its own. Living things grow, eat, move and reproduce.",
        "common_errors": [
          "Listing activities (playing, sleeping) rather than life processes",
          "Not including 'reproduce' as it may be an unfamiliar concept"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Describing several life processes (growth, feeding, movement, reproduction, sensitivity) and using them to explain why something is or is not alive.",
        "example_task": "A child says 'My plant is not alive because it does not move.' Is the child correct? Use what you know about life processes to explain.",
        "example_response": "The child is not correct. Plants are alive even though they do not move from place to place. Plants show other life processes: they grow, they feed (make their own food using light), they reproduce by making seeds, and they respond to their environment (growing towards light). Movement is only one life process — we need to check for several to decide if something is alive.",
        "common_errors": [
          "Agreeing with the child because plants do not obviously move",
          "Listing life processes without applying them to the specific example"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Applying life process criteria to challenging examples and explaining why all the criteria matter, not just one.",
        "example_task": "A crystal in a cave gets bigger over many years. Is it alive? It seems to 'grow'. Explain your reasoning.",
        "example_response": "The crystal is not alive, even though it gets bigger. Getting bigger through adding minerals from water is not the same as biological growth. Living things grow by making new cells from food they have eaten or made. The crystal does not eat, breathe, move, reproduce or respond to stimuli — it only gets bigger through a physical process. We cannot just check one life process — we need to check several to be sure something is alive.",
        "common_errors": [
          "Thinking the crystal is alive because it grows",
          "Not distinguishing biological growth from physical accumulation of material"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS1-C034",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that different animals and plants live in different places, and naming one familiar habitat.",
        "example_task": "Where do fish live? Where do squirrels live?",
        "example_response": "Fish live in water — rivers, ponds or the sea. Squirrels live in trees in woods and parks.",
        "common_errors": [
          "Saying animals live 'outside' without being more specific",
          "Not using the word 'habitat'"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using the word 'habitat' to describe where an animal or plant lives, and naming several different types of habitat.",
        "example_task": "What is a habitat? Name three different habitats and an animal that lives in each.",
        "example_response": "A habitat is the place where an animal or plant lives. Woodland — deer. Pond — frog. Seashore — crab.",
        "common_errors": [
          "Thinking habitat means a cage or tank rather than a natural environment",
          "Only naming exotic habitats (jungle, Arctic) and not local ones"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Describing what a habitat provides for the animals and plants living there (food, water, shelter) and explaining why certain organisms live in certain habitats.",
        "example_task": "Describe a pond habitat. What does it provide for the animals and plants that live there?",
        "example_response": "A pond is a freshwater habitat. It provides water for drinking and living in. Plants like pondweed grow in the water and provide food for herbivores. The water has insects and larvae that frogs and fish eat. Reeds around the edge provide shelter and nesting places. A frog lives there because it needs water for its tadpoles, it can find food (insects), and there are places to hide from predators.",
        "common_errors": [
          "Describing only one thing the habitat provides (water) without mentioning food and shelter",
          "Not linking the habitat features to specific animal needs"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Comparing two different habitats and explaining why an animal suited to one would struggle in another.",
        "example_task": "A polar bear lives in the Arctic and a camel lives in the desert. Why would a polar bear struggle to survive in a desert?",
        "example_response": "A polar bear has thick fur and a layer of fat to keep it warm in the freezing Arctic — in the hot desert, it would overheat. Its white fur camouflages it in snow but would make it very visible in a sandy desert. It eats seals and fish from icy water, and there are no seals in a desert. The desert habitat does not provide the food, temperature or conditions the polar bear needs. Each animal is suited to its own habitat — what helps it survive in one place would be a problem in a different place.",
        "common_errors": [
          "Saying only 'it would be too hot' without explaining why the bear's features cause problems",
          "Not connecting the animal's adaptations to specific habitat conditions"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS1-C035",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that small creatures can be found in specific small places, such as under a stone or log.",
        "example_task": "We are going to look for minibeasts. Where should we look?",
        "example_response": "Under stones. Under logs. In the long grass.",
        "common_errors": [
          "Expecting to find minibeasts everywhere rather than in specific places",
          "Looking only in open, dry areas where fewer minibeasts are found"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using the term 'micro-habitat' and naming examples, describing the conditions found in each.",
        "example_task": "What is a micro-habitat? Name two and describe what they are like.",
        "example_response": "A micro-habitat is a very small habitat within a bigger one. Under a stone it is dark, damp and cool — that is where woodlice live. In leaf litter on the ground it is damp and rotting — worms and millipedes live there.",
        "common_errors": [
          "Confusing micro-habitat with the larger habitat (the whole garden vs. under a stone)",
          "Not describing the conditions, only the location"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Comparing conditions in different micro-habitats (light, moisture, temperature) and linking these conditions to the organisms found there.",
        "example_task": "We surveyed two micro-habitats: under a log and on top of a sunny wall. Compare the conditions and the organisms we found.",
        "example_response": "Under the log it was dark, damp and cool — we found woodlice, slugs, worms and centipedes. These animals need dampness because they can dry out easily. On the sunny wall it was bright, dry and warm — we found spiders, ants and a ladybird. These animals can cope with drier conditions. The different conditions mean different organisms are found in each micro-habitat.",
        "common_errors": [
          "Listing the organisms without explaining why they are found in those specific conditions",
          "Not comparing both micro-habitats, only describing one"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Predicting which organisms might be found in a micro-habitat they have not yet surveyed, based on its conditions, and explaining their reasoning.",
        "example_task": "We have not surveyed the school compost bin yet. Predict what conditions it will have and which organisms we might find. Explain your reasoning.",
        "example_response": "The compost bin will be warm (rotting material generates heat), moist and dark inside. There will be lots of decaying plant matter. I predict we will find worms because they like damp, dark places with rotting material to eat. We might find woodlice and millipedes for the same reason. We might also find tiny flies and their larvae because they are attracted to rotting food. I would not expect to find spiders or ants because they prefer drier conditions.",
        "common_errors": [
          "Making predictions without linking them to specific conditions",
          "Predicting organisms that do not match the conditions (e.g. butterflies in a dark compost bin)"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS1-C036",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Noticing that animals have features that help them in their environment, with teacher prompting and a familiar example.",
        "example_task": "Look at this picture of a duck. What part of its body helps it swim?",
        "example_response": "Its webbed feet help it paddle through the water.",
        "common_errors": [
          "Describing colour rather than a functional feature",
          "Not being able to explain how the feature helps"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying one or two features of a familiar animal that help it survive in its habitat, using descriptive language.",
        "example_task": "How is a rabbit suited to living in a meadow? Name two features that help it survive.",
        "example_response": "A rabbit has long ears to listen for predators like foxes. It has strong back legs for running away quickly. Its brown fur helps it blend in with the grass and soil.",
        "common_errors": [
          "Describing features that are not related to survival (e.g. 'it has a fluffy tail')",
          "Thinking the rabbit chose to have these features"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Describing how specific features of an animal or plant make it well-suited to its habitat, linking the feature to the habitat conditions.",
        "example_task": "A cactus lives in a hot, dry desert. Describe two features that help it survive there and explain how each one helps.",
        "example_response": "A cactus has thick, waxy stems that store water inside so it can survive long periods without rain. Instead of big leaves, it has spines which lose much less water to evaporation and protect it from animals trying to eat it for the water inside. Both features help the cactus cope with the desert's extreme heat and lack of water.",
        "common_errors": [
          "Describing the feature without explaining how it connects to the habitat conditions",
          "Thinking the cactus grew spines because it decided to protect itself"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Comparing how two different organisms in the same habitat are suited to it in different ways, or how similar features appear in organisms in similar habitats around the world.",
        "example_task": "A seal and a penguin both live in cold seas. How is each one suited to the cold water? What is similar about their adaptations?",
        "example_response": "A seal has thick blubber (fat) under its skin to keep warm, smooth fur that is waterproof, and flippers for swimming fast. A penguin has a thick layer of overlapping feathers that trap air for insulation, a layer of fat, and flipper-like wings for swimming. Both have a layer of insulation (blubber/feathers) to survive the cold, and both have streamlined bodies for swimming. Even though one is a mammal and one is a bird, they have similar solutions to the same problem — staying warm and catching fish in freezing water.",
        "common_errors": [
          "Not noticing the similarities in how different animals solve the same problem",
          "Thinking adaptations are deliberate choices made by the animal"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS1-C037",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that animals eat plants or other animals to survive, showing a simple understanding that living things depend on each other.",
        "example_task": "A caterpillar eats a leaf. A bird eats the caterpillar. What would happen to the bird if there were no caterpillars?",
        "example_response": "The bird would have nothing to eat. It might be hungry.",
        "common_errors": [
          "Thinking the bird would be fine and would just eat something else, without considering availability",
          "Not understanding the question about dependency"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing a simple example of how two organisms depend on each other, using the idea that one provides food or shelter for the other.",
        "example_task": "How do bees and flowers depend on each other?",
        "example_response": "Bees visit flowers to collect nectar, which they use to make honey. When the bee visits, pollen sticks to its body and gets carried to the next flower. This helps the flower make seeds. So the flower gives the bee food and the bee helps the flower reproduce.",
        "common_errors": [
          "Describing only one direction of the relationship (bees get nectar) without the other (flowers get pollinated)",
          "Thinking bees deliberately help flowers rather than it being a consequence of feeding"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining that organisms in a habitat depend on each other in multiple ways and that removing one organism affects others.",
        "example_task": "In a garden habitat: caterpillars eat leaves, birds eat caterpillars, and dead leaves feed worms that improve the soil for plants. What might happen if all the birds disappeared?",
        "example_response": "If the birds disappeared, the caterpillars would have no predators and their numbers would increase. More caterpillars would eat more leaves, which could damage or kill the plants. With fewer plants, there would be less food for other herbivores too. The whole habitat would be affected because the organisms are all connected — each one depends on others.",
        "common_errors": [
          "Thinking only the caterpillars would be affected, not seeing the chain reaction",
          "Not explaining why the change would spread through the habitat"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Describing multiple interdependent relationships in a habitat and explaining why biodiversity (many different species) makes a habitat healthier.",
        "example_task": "In a pond habitat, there are plants, snails, tadpoles, dragonfly larvae, fish and herons. Describe how these are connected. Why is it important to have lots of different species?",
        "example_response": "Plants produce oxygen and food for snails and tadpoles. Dragonfly larvae eat tadpoles. Fish eat dragonfly larvae and snails. Herons eat fish. Dead organisms are broken down and feed the plants. If there were only one type of food, and it disappeared, everything above it would be affected. Having lots of different species means if one type becomes scarce, animals can eat something else. A pond with many species is more stable because the connections overlap — it is like a web rather than a single chain.",
        "common_errors": [
          "Describing only a single food chain rather than the web of relationships",
          "Not explaining why variety (biodiversity) makes the habitat more resilient"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS1-C038",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that some animals eat plants and some eat other animals, and sequencing a simple three-step food chain with support.",
        "example_task": "Put these in order to make a food chain: caterpillar, lettuce, bird.",
        "example_response": "Lettuce → caterpillar → bird.",
        "common_errors": [
          "Putting the bird first because it is the biggest",
          "Not understanding which direction the arrows should go"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Constructing a simple food chain from a given habitat, starting with a plant and using arrows correctly to show 'is eaten by'.",
        "example_task": "Make a food chain from a garden using these organisms: slug, frog, dandelion, bird. Draw arrows to show who eats whom.",
        "example_response": "Dandelion → slug → frog → bird. The arrows show the direction of energy: the dandelion is eaten by the slug, the slug is eaten by the frog, the frog is eaten by the bird.",
        "common_errors": [
          "Drawing arrows pointing from predator to prey (wrong direction)",
          "Not starting with a plant"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Constructing food chains from a local habitat, explaining that they always start with a green plant (producer) and using the terms producer, prey and predator.",
        "example_task": "Create a food chain from a woodland habitat. Label the producer, prey and predator. Why must it start with a plant?",
        "example_response": "Oak tree (producer) → caterpillar (prey) → blue tit (predator and prey) → sparrowhawk (top predator). It must start with a plant because only plants can make their own food using sunlight. All the energy in the food chain starts with the plant. Without plants, no other organisms in the chain would have food.",
        "common_errors": [
          "Not including the term 'producer' or not understanding why the plant is called a producer",
          "Not recognising that the blue tit is both predator (eats caterpillar) and prey (eaten by sparrowhawk)"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Predicting what would happen if one organism in a food chain were removed, explaining the effect on organisms above and below it in the chain.",
        "example_task": "In this food chain — grass → rabbit → fox — what would happen if a disease killed all the rabbits? Think about what happens to the grass and the foxes.",
        "example_response": "If all the rabbits died, the foxes would lose their main food source and might starve or have to find other prey like mice. The grass would grow more than before because nothing is eating it — it would spread. This shows that each organism in a food chain affects the others. Removing one link changes the whole chain — there is too much food at the bottom (grass) and not enough at the top (for foxes).",
        "common_errors": [
          "Only thinking about the effect on foxes and not on the grass",
          "Thinking the fox would just eat grass instead"
        ]
      }
    ]
  }
]