[
  {
    "concept_id": "SC-KS2-C017",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that animals need to eat food to survive and that different animals eat different types of food.",
        "example_task": "Why do animals need to eat? Give an example of what a rabbit eats and what a fox eats.",
        "example_response": "Animals need to eat to get energy to move and grow. A rabbit eats grass and plants. A fox eats other animals like rabbits.",
        "common_errors": [
          "Thinking animals only eat to stop feeling hungry, not connecting food to energy and growth",
          "Not distinguishing between herbivores and carnivores"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explaining that animals cannot make their own food and must eat other organisms, and naming the main food groups that humans need.",
        "example_task": "How do animals get their food differently from plants? What types of food do humans need?",
        "example_response": "Plants make their own food using light (photosynthesis), but animals cannot do this. Animals must eat other living things — either plants or other animals. Humans need carbohydrates for energy, protein for growth and repair, fats for energy and insulation, vitamins and minerals to stay healthy, fibre for digestion, and water.",
        "common_errors": [
          "Not contrasting animal nutrition with plant nutrition",
          "Thinking 'fat' and 'carbohydrates' are always bad rather than essential nutrients"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining the role of different nutrients in the body and describing what a balanced diet looks like, using the Eatwell Guide as reference.",
        "example_task": "Explain why we need protein, carbohydrates and vitamins. What happens if our diet is not balanced?",
        "example_response": "Protein is needed for growth and repair — it builds and repairs muscles, skin and organs. Carbohydrates provide energy for activity and body functions. Vitamins keep us healthy — for example, vitamin C helps our immune system fight infections, and vitamin D helps our bones absorb calcium. An unbalanced diet causes problems: too little protein leads to poor growth, too few carbohydrates causes tiredness, lack of vitamin C can cause scurvy. A balanced diet means eating the right proportions from each food group, not too much or too little of any one type.",
        "common_errors": [
          "Listing food groups without explaining their functions",
          "Thinking a balanced diet means eating the same amount of everything"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Comparing the diets of different animals and linking dietary requirements to body structure and ecological role.",
        "example_task": "Compare the teeth and digestive systems of a cow (herbivore) and a cat (carnivore). How are they adapted to their different diets?",
        "example_response": "A cow has flat, broad molars for grinding tough plant material and a very long digestive system with multiple stomach chambers to break down cellulose (plant fibre), which is hard to digest. A cat has sharp canine teeth and carnassial teeth for tearing meat, and a shorter digestive system because meat is easier to digest than plant material. The cow's long gut is needed because plants take more processing to extract nutrients. The cat's sharp teeth are needed to kill prey and cut through flesh. Each animal's body is adapted to efficiently obtain nutrients from its specific food source — structure matches function.",
        "common_errors": [
          "Describing teeth without linking to diet",
          "Not explaining why herbivores need longer digestive systems"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C018",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that humans have a skeleton inside their body that holds them up and protects important parts.",
        "example_task": "Why do we have a skeleton? What would happen without one?",
        "example_response": "The skeleton holds our body up and gives us our shape. Without a skeleton we would be floppy like a jellyfish. It also protects important parts like the brain.",
        "common_errors": [
          "Thinking the skeleton is only for shape, not protection",
          "Not knowing that the skeleton is made of bones"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Naming the three functions of the skeleton (support, protection, movement) and giving examples of how specific bones fulfil each function.",
        "example_task": "The skeleton has three jobs: support, protection and movement. Give an example of each.",
        "example_response": "Support: the spine holds up our body so we can stand upright. Protection: the skull protects the brain, and the ribs protect the heart and lungs. Movement: bones act as levers that muscles pull on — the leg bones let us walk and run.",
        "common_errors": [
          "Forgetting the movement function of the skeleton",
          "Not giving specific bone examples for each function"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining how muscles work with bones to create movement, understanding that muscles can only pull (contract) and work in pairs.",
        "example_task": "Explain how the biceps and triceps muscles work together to bend and straighten your arm.",
        "example_response": "When the biceps muscle contracts (gets shorter), it pulls the lower arm upward, bending the arm at the elbow. The triceps relaxes (gets longer) to allow this. When the triceps contracts, it pulls the lower arm back down, straightening the arm, while the biceps relaxes. They work as an antagonistic pair because muscles can only pull — they cannot push. You need one muscle to pull the arm up and a different one to pull it back down. That is why muscles always work in pairs on either side of a joint.",
        "common_errors": [
          "Thinking muscles can both push and pull",
          "Not explaining that muscles work in opposing pairs"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Comparing the skeletal and muscular systems of different animals and explaining how different skeletal structures are adapted for different types of movement.",
        "example_task": "Compare the skeleton of a human (walks upright) and a fish (swims). How are they each adapted for their type of movement?",
        "example_response": "A human skeleton has a strong, vertical spine for upright posture, a broad pelvis for balance, and long leg bones with hinge joints at the knees for walking and running. Muscles attach to leg bones to create a walking stride. A fish skeleton has a flexible spine that can bend side to side, allowing the body to flex in waves for swimming. It has no legs — instead, fins supported by thin bones help with steering and stability. Fish muscles are arranged in blocks along the body that contract in sequence, creating the wave motion. Both skeletons support the body and enable movement, but the structures are completely different because walking upright and swimming require different mechanical solutions.",
        "common_errors": [
          "Listing differences without explaining how each skeleton is adapted for its movement type",
          "Not recognising that both systems serve the same fundamental functions (support and movement)"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C031",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that food goes into the mouth and travels through the body, and that teeth help chew food.",
        "example_task": "What happens to food when you eat it? Where does it go first?",
        "example_response": "Food goes into my mouth. My teeth chew it into smaller pieces. Then I swallow it and it goes down to my tummy.",
        "common_errors": [
          "Thinking food goes directly to the stomach from the mouth without a connecting tube",
          "Not mentioning the role of teeth in breaking down food"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Naming the main parts of the digestive system in order and describing what each does in simple terms.",
        "example_task": "Name the main parts food passes through from mouth to the end. What happens at each stage?",
        "example_response": "Mouth: teeth chew food, saliva starts to break it down. Oesophagus: a tube that squeezes food down to the stomach. Stomach: churns and mixes food with acid to break it down further. Small intestine: nutrients from food pass into the blood. Large intestine: water is absorbed and waste is formed.",
        "common_errors": [
          "Forgetting the oesophagus (many children jump from mouth to stomach)",
          "Thinking the stomach is the main organ for absorbing nutrients"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining the function of each part of the digestive system and describing how food is broken down both mechanically (chewing, churning) and chemically (enzymes, acid).",
        "example_task": "Explain the difference between how the mouth and the stomach break down food. Why do we need both types of breakdown?",
        "example_response": "The mouth breaks food down mechanically — teeth cut, tear and grind food into smaller pieces. Saliva also contains an enzyme that starts breaking down starch chemically. The stomach breaks food down both mechanically (churning muscles mix the food) and chemically (strong acid and enzymes dissolve the food into a soupy liquid). We need both types: mechanical breakdown increases the surface area so chemical breakdown can work faster. Without chewing, the stomach would take much longer to digest large chunks. The small intestine then absorbs the dissolved nutrients through its wall into the blood.",
        "common_errors": [
          "Not distinguishing mechanical from chemical digestion",
          "Thinking the stomach does all the digestion (most absorption happens in the small intestine)"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining the digestive system as an integrated system where each organ depends on the others, and predicting consequences of dysfunction.",
        "example_task": "If a person's small intestine were much shorter than normal, what effect would this have on their health? Explain using your knowledge of digestion.",
        "example_response": "The small intestine is where most nutrient absorption occurs. Its long length (about 6 metres) gives a very large surface area for nutrients to pass through the intestinal wall into the blood. If it were much shorter, less surface area would be available for absorption, so the body would absorb fewer nutrients from the same amount of food. The person would likely become malnourished — lacking energy, vitamins and minerals — even if they ate normally. They might need to eat more frequently or take nutritional supplements. This shows that the length of the small intestine is a critical design feature — it is long precisely because absorption needs a large surface area. Each part of the digestive system has evolved to do its specific job, and they all work together as a system.",
        "common_errors": [
          "Not connecting intestine length to surface area and absorption efficiency",
          "Thinking the person would simply feel hungrier without health consequences"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C032",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that we have different types of teeth and that they help us eat food.",
        "example_task": "Look in a mirror at your teeth. Are they all the same shape?",
        "example_response": "No, the front teeth are flat and thin. The back teeth are wider and bumpy. They are different shapes.",
        "common_errors": [
          "Thinking all teeth are the same",
          "Not noticing the pointed canine teeth"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Naming the four types of human teeth — incisors, canines, premolars and molars — and describing the function of each.",
        "example_task": "Name the four types of teeth and explain what each one does.",
        "example_response": "Incisors: flat, sharp front teeth for cutting and biting food. Canines: pointed teeth next to the incisors for tearing tough food. Premolars: wider teeth behind the canines for crushing food. Molars: large, flat back teeth for grinding food into small pieces.",
        "common_errors": [
          "Forgetting premolars and only naming three types",
          "Confusing the functions of canines and incisors"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining how tooth types relate to diet in humans and other animals, comparing herbivore and carnivore teeth.",
        "example_task": "Compare the teeth of a sheep and a wolf. What does each set of teeth tell us about the animal's diet?",
        "example_response": "A sheep has large, flat molars with ridged surfaces for grinding tough grass and plant material. It has incisors only on the bottom jaw (it uses a tough pad on the top) for cutting grass. It has no large canines because it does not need to catch prey. A wolf has large, sharp canine teeth for gripping and killing prey, and carnassial teeth (specialised premolars) like scissors for shearing meat from bones. Humans have a mix of all four types because we are omnivores — we eat both plants and meat. Tooth shape is evidence of diet: grinding teeth = herbivore, sharp tearing teeth = carnivore, mixed = omnivore.",
        "common_errors": [
          "Describing teeth without connecting to diet",
          "Not recognising that humans have a mix because we are omnivores"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using tooth structure as evidence for classification and diet in unknown or extinct animals, including fossils.",
        "example_task": "A palaeontologist finds a fossil skull with large, flat grinding teeth and no sharp canines. What can they infer about this animal? What other evidence would help?",
        "example_response": "The large, flat grinding teeth strongly suggest this was a herbivore — the teeth are adapted for chewing tough plant material. The absence of sharp canines confirms it did not need to catch and kill prey. The palaeontologist could also look at the jaw structure — herbivores often have jaws that move side to side for grinding, while carnivores have jaws that move mainly up and down for biting. Fossilised plant material in the stomach area or chemical analysis of the teeth could provide further evidence. Eye position might also help — herbivores often have eyes on the sides of the head for wide vision (watching for predators), while carnivores have forward-facing eyes for judging distance when hunting. Scientists use multiple lines of evidence together to build a reliable picture.",
        "common_errors": [
          "Making a conclusion from teeth alone without considering other evidence",
          "Not explaining why flat teeth indicate herbivory"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C033",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Constructing a simple food chain from given organisms, knowing that it starts with a plant.",
        "example_task": "Put these in order to make a food chain: owl, mouse, wheat. Draw arrows to show who eats whom.",
        "example_response": "Wheat → mouse → owl. The arrows show the direction of energy flow.",
        "common_errors": [
          "Drawing arrows pointing from predator to prey (wrong direction)",
          "Not starting with the plant"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using the terms producer, consumer, predator and prey correctly when describing food chains.",
        "example_task": "In this food chain — grass → rabbit → fox — label the producer, consumer, predator and prey.",
        "example_response": "Grass is the producer (it makes its own food). Rabbit is a primary consumer (it eats the producer), and it is the prey (it is eaten by the fox). Fox is a secondary consumer and the predator (it hunts and eats the rabbit).",
        "common_errors": [
          "Not knowing the difference between producer and consumer",
          "Not recognising that the rabbit is both consumer and prey"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Constructing multiple food chains from a habitat, explaining that producers are always the starting point because they convert sunlight into food, and describing the impact of removing one organism.",
        "example_task": "In a woodland: oak tree leaves, caterpillars, blue tits, sparrowhawks, aphids, ladybirds. Build two food chains and explain what would happen if the caterpillars disappeared.",
        "example_response": "Chain 1: Oak leaves → caterpillar → blue tit → sparrowhawk. Chain 2: Oak leaves → aphid → ladybird → blue tit → sparrowhawk. If caterpillars disappeared, blue tits would lose a major food source. They might eat more aphids, reducing ladybird food. Sparrowhawks would have fewer blue tits to eat. The oak tree might grow better without caterpillars eating its leaves. Changes ripple through the whole food web. This is why food webs are more realistic than single chains — animals usually eat more than one thing.",
        "common_errors": [
          "Only building one chain when the organisms support two",
          "Thinking only the immediate predator would be affected"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining energy flow through food chains, why chains rarely have more than four or five links, and applying this to real ecological problems.",
        "example_task": "Why do food chains rarely have more than four or five organisms? What does this tell us about energy in ecosystems?",
        "example_response": "At each stage of a food chain, most of the energy is used by the organism for moving, growing and keeping warm — only about 10% is passed on to the next level. Starting with 10,000 units of energy from the Sun captured by plants: herbivores get about 1,000, primary predators get about 100, secondary predators get about 10. By the fifth level, there is not enough energy to support another organism. This is why top predators like eagles and sharks are always rare compared to their prey, and why there cannot be a predator that eats eagles — there simply is not enough energy left. This energy pyramid also explains why eating plants is more energy-efficient than eating meat — you lose 90% of the energy at each link.",
        "common_errors": [
          "Not connecting chain length to energy loss",
          "Thinking the top predator simply has not evolved yet"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C046",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that humans start as babies and grow into adults, and that the body changes as we grow older.",
        "example_task": "Put these pictures in order from youngest to oldest: baby, teenager, elderly person, toddler, adult.",
        "example_response": "Baby → toddler → teenager → adult → elderly person.",
        "common_errors": [
          "Confusing the order of toddler and teenager",
          "Thinking that growth stops once you become an adult"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing the main stages of human development — baby, child, adolescent, adult, old age — and identifying some changes that occur at each stage.",
        "example_task": "What changes happen to the human body during adolescence (being a teenager)?",
        "example_response": "During adolescence, the body goes through puberty. There are growth spurts — getting taller quickly. Body shape changes. Body hair begins to grow. Skin may become oilier. Emotions can change. These changes happen because the body is developing from a child into an adult. Puberty starts at different ages for different people.",
        "common_errors": [
          "Thinking puberty happens at exactly the same age for everyone",
          "Not understanding that puberty is a gradual process over several years"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Describing the changes at each life stage in detail, explaining gestation and the timeline of human development from conception to old age.",
        "example_task": "Describe the journey from a fertilised egg to a newborn baby. How long does it take?",
        "example_response": "After fertilisation, the single cell divides many times to form an embryo. The embryo implants in the uterus wall and develops over about 9 months (the gestation period). During the first few weeks, the major organs begin to form. By about 12 weeks, the developing baby (now called a foetus) has recognisable human features. The baby continues to grow, developing lungs, a heart, a brain and all other organs. The mother provides oxygen and nutrients through the placenta. After approximately 40 weeks, the baby is born. At birth, a human baby is helpless and depends entirely on its parents — unlike many animals that can walk within hours.",
        "common_errors": [
          "Not using the terms embryo and foetus correctly",
          "Thinking the baby develops all at once rather than gradually over nine months"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Comparing human development with other species and explaining why humans have such an extended period of dependency and growth.",
        "example_task": "A horse foal can stand within an hour of birth. A human baby cannot walk for about a year. Why is there such a difference?",
        "example_response": "Humans are born at an earlier stage of physical development compared to horses because our large brain requires a large skull, which must pass through the birth canal. If humans developed longer in the womb, the head would be too large for birth. So human babies are born relatively helpless, with brains that continue developing rapidly after birth. This extended childhood allows time for learning — language, social skills, complex thinking — that our large brains are designed for. A horse needs to run from predators soon after birth (their survival depends on physical ability), so they are born physically mature. Humans survive through intelligence and social groups rather than speed, so our extended development period is an evolutionary trade-off: less physical readiness at birth, but much greater cognitive development over childhood.",
        "common_errors": [
          "Not connecting brain size to the need for early birth",
          "Thinking human babies are just 'less developed' without explaining the evolutionary advantage"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C060",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that the heart pumps blood around the body through tubes (blood vessels), and that blood carries important things the body needs.",
        "example_task": "Put your hand on your chest. What can you feel? What is the heart doing?",
        "example_response": "I can feel my heart beating. The heart is a pump that pushes blood around my body through tubes. The blood carries oxygen and food that my body needs to work.",
        "common_errors": [
          "Thinking the heart is on the left side of the chest (it is roughly central, slightly left)",
          "Not understanding that the heart is a pump"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Naming the main components of the circulatory system — heart, arteries, veins, capillaries — and describing the basic function of each.",
        "example_task": "What is the difference between arteries and veins?",
        "example_response": "Arteries carry blood away from the heart to the rest of the body. They carry oxygenated blood (blood rich in oxygen). Veins carry blood back to the heart. They carry deoxygenated blood (blood that has delivered its oxygen to the body's cells). Capillaries are tiny blood vessels that connect arteries to veins — this is where oxygen and nutrients pass from the blood into the body's cells.",
        "common_errors": [
          "Thinking blood is blue in veins (it is always red — dark red when deoxygenated)",
          "Getting arteries and veins the wrong way round"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Describing the double circulatory system: heart pumps blood to the lungs (to collect oxygen) and then to the body (to deliver oxygen), explaining the function of each circuit.",
        "example_task": "Trace the journey of blood from the heart to the lungs and back, then from the heart to the body and back. Why does blood go to the lungs?",
        "example_response": "The heart pumps blood in two circuits. Circuit 1 (to lungs): The right side of the heart pumps deoxygenated blood to the lungs through the pulmonary artery. In the lungs, blood picks up oxygen from the air we breathe and releases carbon dioxide (a waste product). The oxygenated blood returns to the left side of the heart through the pulmonary vein. Circuit 2 (to body): The left side of the heart pumps oxygenated blood through arteries to all parts of the body. In the capillaries, oxygen and nutrients pass into body cells, and waste (carbon dioxide) passes into the blood. Deoxygenated blood returns to the right side of the heart through veins. This is called double circulation because blood passes through the heart twice in each full circuit.",
        "common_errors": [
          "Not knowing that blood goes to the lungs to collect oxygen",
          "Thinking the heart has only one pump (it has two sides working together)"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining why the circulatory system is essential for all body functions and how exercise affects heart rate, linking to the body's oxygen demands.",
        "example_task": "When you exercise, your heart beats faster and you breathe harder. Explain why both of these happen, using your knowledge of the circulatory system.",
        "example_response": "During exercise, muscles work harder and need more energy. Energy is released from food using oxygen (respiration). Therefore exercising muscles need more oxygen delivered and more carbon dioxide removed. The heart beats faster to pump blood more quickly around the body, delivering oxygen faster to the muscles. You breathe harder and faster to get more oxygen into the lungs and expel more carbon dioxide. The two systems work together: the respiratory system gets oxygen into the blood; the circulatory system delivers it to the muscles. When you stop exercising, oxygen demand decreases and both heart rate and breathing rate gradually return to normal. A fit person's heart is more efficient — it pumps more blood per beat, so it does not need to beat as fast during exercise as an unfit person's heart. This is why resting heart rate is a measure of fitness.",
        "common_errors": [
          "Not linking faster breathing to increased oxygen demand in muscles",
          "Not explaining that heart rate AND breathing rate both increase because they serve connected functions"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C061",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that eating different foods and being active are important for staying healthy.",
        "example_task": "Why is it important to eat different types of food, not just your favourite food every day?",
        "example_response": "Different foods give your body different things it needs. Some foods give you energy to run and play. Others help you grow. Others help you fight off illness. If you only ate one food, your body would miss out on important things it needs.",
        "common_errors": [
          "Thinking some foods are always 'bad' (all nutrients are needed in appropriate amounts)",
          "Not understanding why variety matters"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Understanding that a balanced diet includes different food groups, that exercise keeps the body healthy, and that some substances (drugs) can be harmful.",
        "example_task": "What are the main food groups and what does each do for your body?",
        "example_response": "Carbohydrates (bread, pasta, rice) — provide energy. Proteins (meat, fish, beans, eggs) — help growth and repair of body tissues. Fats (butter, oil, nuts) — provide energy and insulation. Vitamins and minerals (fruit, vegetables) — keep the body working properly and fight illness. Water — keeps cells working and the body hydrated. Fibre (wholemeal bread, vegetables) — helps the digestive system work properly. A balanced diet includes the right amounts of all these groups.",
        "common_errors": [
          "Thinking fats are always unhealthy (the body needs some fat)",
          "Not including water as essential for health"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining how diet, exercise, drugs and lifestyle choices affect the body, including both beneficial and harmful effects.",
        "example_task": "Explain how regular exercise benefits the body. Include at least three different body systems.",
        "example_response": "Regular exercise benefits multiple body systems. Circulatory system: the heart muscle becomes stronger, pumps more blood per beat, and resting heart rate decreases. Blood vessels stay flexible and clear. Skeletal and muscular system: muscles grow stronger and more flexible. Bones become denser and stronger because exercise stimulates bone growth. Joints stay mobile. Respiratory system: lung capacity increases — you can take in more oxygen per breath, so you are less breathless during activity. Mental health: exercise releases chemicals in the brain that improve mood and reduce stress. Weight management: exercise uses energy, helping to maintain a healthy weight when combined with a balanced diet.",
        "common_errors": [
          "Only mentioning one benefit (e.g. weight loss) rather than multiple body systems",
          "Not explaining how exercise improves each system"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating health claims critically and understanding the difference between correlation and causation in health studies.",
        "example_task": "A news headline says 'People who eat chocolate live longer.' Does this prove chocolate makes you live longer? Explain your reasoning.",
        "example_response": "This headline shows a correlation (two things occurring together) but does not prove causation (one causing the other). People who eat chocolate might also have other lifestyle factors that contribute to longer life — perhaps they are wealthier (can afford chocolate and healthcare), less stressed, or more socially active. To prove chocolate itself causes longer life, you would need a controlled experiment: two similar groups, one eating chocolate and one not, with all other factors kept the same, observed over many years. Even then, chocolate contains hundreds of chemicals — which one might help? In science, we must be cautious about cause and effect. Many health headlines confuse correlation with causation. Critical evaluation of health claims is important because they influence real decisions people make about diet, exercise and medicines.",
        "common_errors": [
          "Accepting the headline at face value without questioning the evidence",
          "Not explaining the difference between correlation and causation"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C062",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that the food we eat needs to get to all parts of the body, and that blood carries it.",
        "example_task": "You eat a sandwich. How does the food get to your muscles and other body parts?",
        "example_response": "The food is broken down in your stomach and intestines into very tiny pieces. These tiny pieces go into your blood. The blood carries them to all the parts of your body that need them, like your muscles.",
        "common_errors": [
          "Thinking food goes directly from the stomach to the muscles",
          "Not mentioning blood as the transport system"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Understanding that nutrients are absorbed through the walls of the small intestine into the blood, and that the blood transports them to cells throughout the body.",
        "example_task": "Where exactly do nutrients from food enter the blood? How does the body get water from food and drink?",
        "example_response": "Nutrients enter the blood through the wall of the small intestine. The small intestine has a very large surface area with tiny finger-like projections that are surrounded by blood capillaries. Nutrients pass through the intestine wall into the blood. Water is mainly absorbed in the large intestine and also enters the blood. The blood then carries both nutrients and water to every cell in the body, where they are used for energy, growth and repair.",
        "common_errors": [
          "Thinking nutrients enter the blood in the stomach",
          "Not knowing that the small intestine is the main site of nutrient absorption"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Linking the digestive system to the circulatory system, explaining how nutrients are absorbed, transported and used by cells, and how waste is removed.",
        "example_task": "Trace the journey of a piece of bread from your mouth to a muscle cell in your arm. Include both the digestive and circulatory systems.",
        "example_response": "1. Mouth: bread is chewed into smaller pieces and mixed with saliva, which starts breaking down starch. 2. Oesophagus: food is squeezed down to the stomach by peristalsis. 3. Stomach: food is churned and mixed with acid and enzymes, breaking it down further. 4. Small intestine: enzymes complete digestion, breaking starch into glucose (a simple sugar). Glucose molecules pass through the intestine wall into blood capillaries surrounding the intestine. 5. Circulatory system: blood carries glucose through veins to the heart, then through arteries to the arm. 6. Capillaries in the arm muscle: glucose passes from the blood through the capillary wall into the muscle cell. 7. Muscle cell: glucose is combined with oxygen (from breathing) to release energy for the muscle to contract. The waste product (carbon dioxide) passes back into the blood and is carried to the lungs to be breathed out.",
        "common_errors": [
          "Skipping the absorption step in the small intestine",
          "Not explaining that glucose needs oxygen to release energy in the cell"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining why the small intestine is so well-adapted for absorption and comparing nutrient transport in the blood with oxygen transport.",
        "example_task": "The small intestine is about 6 metres long and has millions of tiny finger-like villi. Why has it evolved to be this way?",
        "example_response": "The small intestine needs to absorb as many nutrients as possible from digested food before it passes through. Its adaptations maximise absorption: (1) Length — 6 metres gives food a long time in contact with the absorbing surface. (2) Villi — millions of tiny projections increase the surface area enormously, like how a crumpled towel absorbs more than a flat one. (3) Thin walls — the villi walls are just one cell thick, so nutrients can pass through quickly into the blood. (4) Rich blood supply — dense networks of capillaries surrounding each villus carry absorbed nutrients away immediately, maintaining a concentration gradient that drives further absorption. These features work together: maximum surface area, minimum distance for absorption, and efficient removal of absorbed nutrients. This is a perfect example of structure-function relationship in biology — the organ's structure is precisely adapted to its function.",
        "common_errors": [
          "Not explaining why surface area matters for absorption",
          "Not connecting the thin walls and blood supply to efficient absorption"
        ]
      }
    ]
  }
]