[
  {
    "concept_id": "SC-KS1-C024",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Beginning to distinguish between what an object is and what it is made from, when prompted by the teacher.",
        "example_task": "I am holding a wooden spoon. What is the object? What is it made from?",
        "example_response": "The object is a spoon. It is made from wood.",
        "common_errors": [
          "Answering 'spoon' for both questions — naming the object when asked for the material",
          "Not understanding the question 'What is it made from?'"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Consistently distinguishing object from material for several everyday items, beginning to notice that the same object can be made from different materials.",
        "example_task": "Name the object and the material for each: a glass bottle, a plastic ruler, a metal coin.",
        "example_response": "Glass bottle: the object is a bottle, the material is glass. Plastic ruler: the object is a ruler, the material is plastic. Metal coin: the object is a coin, the material is metal.",
        "common_errors": [
          "Saying 'glass' is the object rather than the material",
          "Not recognising that 'plastic' is a material, not a type of object"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining the difference between an object and a material, and recognising that a single object can be made from more than one material.",
        "example_task": "Look at this pair of scissors. Is 'scissors' a material or an object? What materials is it made from? Why might it use more than one material?",
        "example_response": "Scissors is an object — something made for a purpose (cutting). It is made from two materials: metal for the blades because metal is hard and sharp, and plastic for the handles because plastic is comfortable to hold and does not hurt your hand. Different parts use different materials because each material has properties suited to that job.",
        "common_errors": [
          "Not noticing that the scissors has more than one material",
          "Not being able to explain why different materials are used for different parts"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining that the same material can be used to make many different objects, and the same object can be made from different materials, giving examples and reasons.",
        "example_task": "Give two examples of objects that can be made from glass. Then give two different materials a bottle could be made from. Why might you choose one material over another for a bottle?",
        "example_response": "Glass can be used to make windows and drinking glasses — because it is transparent and smooth. A bottle could be made from glass or plastic. A glass bottle is heavier but does not change the taste; a plastic bottle is lighter and does not break if you drop it, which is safer for children. The choice depends on what matters most — weight, safety, or keeping the taste.",
        "common_errors": [
          "Thinking each material can only be used for one purpose",
          "Not giving a reason for choosing one material over another"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS1-C025",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Naming two or three common everyday materials (wood, plastic, metal) when shown examples.",
        "example_task": "Feel these three objects. Can you name the material each one is made from? Here are word cards to help: wood, plastic, metal.",
        "example_response": "This one is wood — it feels hard and has lines on it. This one is plastic — it is smooth and light. This one is metal — it feels cold and heavy.",
        "common_errors": [
          "Naming the object instead of the material",
          "Calling all hard materials 'metal'"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Naming a wider range of everyday materials including wood, plastic, glass, metal, water, rock, fabric and paper.",
        "example_task": "Go on a materials hunt around the classroom. Find and name as many different materials as you can.",
        "example_response": "Wood — table top. Metal — scissors blades. Plastic — ruler. Glass — window. Paper — book. Fabric — curtains. Rubber — eraser. Cardboard — tissue box.",
        "common_errors": [
          "Confusing glass with clear plastic",
          "Not recognising fabric as a material (calling it 'cloth' or 'curtain')"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Identifying all NC-specified materials (wood, plastic, glass, metal, water, rock, brick, paper, cardboard, fabric, elastic, foil) and distinguishing between similar-looking materials by testing properties.",
        "example_task": "Here are two transparent objects — one is glass and one is plastic. They look the same. How could you tell which is which?",
        "example_response": "I could tap them — glass makes a ringing sound and plastic makes a duller sound. Glass feels colder when you touch it. Glass is heavier than plastic of the same size. Plastic bends a bit if you press it but glass does not — it would break. You could carefully check if it scratches easily — plastic scratches more easily than glass.",
        "common_errors": [
          "Thinking transparent objects are always glass",
          "Not thinking of ways to test beyond looking"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Classifying materials as natural or manufactured and explaining that some manufactured materials are designed to have specific properties.",
        "example_task": "Sort these materials into natural (found in nature) and manufactured (made by people): wood, plastic, rock, glass, cotton fabric, metal, rubber. Which ones are trickier to sort? Why?",
        "example_response": "Natural: wood (from trees), rock (from the ground), cotton (from cotton plants), rubber (from rubber trees). Manufactured: plastic (made in factories from oil), glass (made by melting sand). Metal is tricky — the metal ore comes from the ground (natural) but it has to be melted and shaped in factories (manufactured). Rubber is also tricky because natural rubber comes from trees but most rubber now is synthetic.",
        "common_errors": [
          "Thinking all materials humans use are manufactured",
          "Not recognising that glass is manufactured from natural materials (sand)"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS1-C026",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Describing one property of a given material using simple paired descriptors (hard/soft, rough/smooth), with teacher modelling.",
        "example_task": "Feel this piece of sandpaper. Is it rough or smooth?",
        "example_response": "It is rough.",
        "common_errors": [
          "Using general terms like 'nice' or 'not nice' instead of property words",
          "Confusing rough with hard"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using several paired descriptors to describe the properties of materials: hard/soft, rough/smooth, shiny/dull, bendy/stiff.",
        "example_task": "Describe the properties of this piece of tin foil using at least three describing words.",
        "example_response": "It is shiny, smooth and bendy. It is also thin and light.",
        "common_errors": [
          "Describing what the material looks like (silver) rather than its properties",
          "Using only one descriptor and struggling to think of more"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Testing and describing a range of material properties including waterproof/not waterproof, absorbent/not absorbent, opaque/transparent, and recording results systematically.",
        "example_task": "Test these four materials for three properties: waterproof, transparent, bendy. Record your results in a table.",
        "example_response": "Table with columns: Material | Waterproof? | Transparent? | Bendy? — Cling film: yes, yes, yes. Paper: no, no (opaque), yes. Tin foil: yes, no (opaque), yes. Fabric: no, no, yes.",
        "common_errors": [
          "Confusing transparent with translucent (frosted glass lets some light through but is not transparent)",
          "Not testing properly — guessing rather than dripping water to check waterproofness"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Recognising that the same material can have different properties depending on how it has been treated, and that properties can be tested and measured rather than just described.",
        "example_task": "A T-shirt is made of cotton fabric. A raincoat is also made of fabric but treated with a waterproof coating. How has changing one property made the material more useful? Can you think of another example?",
        "example_response": "The waterproof coating makes the raincoat fabric stop water getting through, while the cotton T-shirt would get soaked. Changing just one property (waterproofness) makes the material much more useful for rainy weather. Another example: paper is normally soft and weak, but when it is laminated (coated in plastic) it becomes waterproof and stronger — that is how we make things like place mats or book covers.",
        "common_errors": [
          "Thinking each material has fixed properties that can never be changed",
          "Not realising that manufactured changes to materials are deliberate design choices"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS1-C027",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Choosing a material for a simple purpose when given a clear reason, with teacher support.",
        "example_task": "We need to cover a window. Should we use cardboard or glass? Why?",
        "example_response": "Glass, because you can see through it.",
        "common_errors": [
          "Choosing based on preference rather than the property needed",
          "Not being able to explain why"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Choosing a suitable material for a given purpose and explaining the choice using one or two property words.",
        "example_task": "Which material would be best for making an umbrella: paper, plastic or fabric? Explain your choice.",
        "example_response": "Plastic would be best because it is waterproof and will not let the rain through. Paper would get soggy and tear. Fabric would soak up the water.",
        "common_errors": [
          "Choosing a material without explaining which property makes it suitable",
          "Not considering what would happen to unsuitable materials"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Evaluating the suitability of different materials for a given purpose by testing specific properties, and justifying choices with evidence from tests.",
        "example_task": "We need to choose a material for a waterproof hat. Test these three materials and recommend the best one. Explain your choice using evidence from the test.",
        "example_response": "I tested plastic, fabric and paper by pouring water on each. The plastic kept all the water out — waterproof. The fabric let some water through — not very waterproof. The paper went soggy and tore — not waterproof at all. I recommend plastic because our test showed it is completely waterproof, which is the most important property for a hat in the rain.",
        "common_errors": [
          "Recommending a material without referring to the test evidence",
          "Not considering more than one property (plastic is waterproof but also stiff — would it be comfortable?)"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining that material choice involves balancing several properties and that there may not be one perfect material, sometimes requiring a combination.",
        "example_task": "Why might a coat be made from fabric with a waterproof layer inside, rather than being made entirely from plastic? Think about the properties needed for a good coat.",
        "example_response": "A coat needs to be waterproof to keep rain out, but it also needs to be comfortable, flexible and breathable so the person does not get too hot and sweaty. Pure plastic would be waterproof but uncomfortable, stiff and would trap sweat inside. Fabric is comfortable and flexible but not waterproof on its own. By combining them — fabric on the outside with a waterproof layer inside — you get both comfort and waterproofness. Most real objects need a balance of several properties, not just one.",
        "common_errors": [
          "Thinking one property is always the most important without considering trade-offs",
          "Not recognising that combining materials can give the best of both"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS1-C028",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Showing that the shape of some objects can be changed by pushing, pulling or squashing them, through hands-on exploration.",
        "example_task": "Take this piece of plasticine. Can you change its shape? Show me how.",
        "example_response": "Child squashes the plasticine flat, then rolls it into a sausage shape.",
        "common_errors": [
          "Thinking the shape cannot be changed because the material 'is what it is'",
          "Only trying one way to change the shape"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using the correct terms — squashing, bending, twisting and stretching — to describe how the shapes of materials can be changed.",
        "example_task": "Try squashing, bending, twisting and stretching each of these materials: plasticine, elastic band, pipe cleaner, sponge. Which actions work on each?",
        "example_response": "Plasticine: I can squash it flat, bend it, and twist it, but it does not stretch much. Elastic band: I can stretch it a lot and twist it, but not squash it. Pipe cleaner: I can bend and twist it but not stretch it. Sponge: I can squash it and bend it, it stretches a little and I can twist it.",
        "common_errors": [
          "Confusing bending with stretching",
          "Thinking twisting and bending are the same action"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Testing which materials can be changed by squashing, bending, twisting and stretching, and noticing which changes are reversible (spring back) and which are permanent.",
        "example_task": "Stretch an elastic band and then let go. Bend a paper clip and then let go. What happens? What is different about the two results?",
        "example_response": "The elastic band springs back to its original shape — the stretching is reversible. The paper clip stays bent in the new shape — the bending is permanent, it does not spring back. Some materials return to their original shape and some do not. The elastic band is elastic but the paper clip is not.",
        "common_errors": [
          "Not noticing whether the material returns to its original shape",
          "Thinking all shape changes are permanent"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining why different materials respond differently to squashing, bending, twisting and stretching, and linking this to real-world applications.",
        "example_task": "Why are springs made of metal rather than plasticine? Use what you know about how materials respond to being stretched and squashed.",
        "example_response": "When you stretch or squash a metal spring, it bounces back to its original shape — the change is reversible. Plasticine would stay in whatever shape you squashed it into because its changes are permanent. Springs need to go back to their original shape every time — that is how they work in mattresses, pens and trampolines. Metal is chosen because it is elastic for this purpose.",
        "common_errors": [
          "Not connecting the material property (elasticity) to the function of the spring",
          "Thinking 'elastic' only applies to rubber or elastic bands"
        ]
      }
    ]
  }
]