[
  {
    "concept_id": "SC-KS2-C025",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that pushes and pulls are forces, and that forces can make things move, stop or change direction.",
        "example_task": "Give an example of a push force and a pull force.",
        "example_response": "Pushing a door open is a push force. Pulling a drawer out is a pull force.",
        "common_errors": [
          "Not recognising that gravity is a force because nothing visible is pushing or pulling",
          "Thinking forces only exist when something is moving"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Distinguishing between contact forces (push, pull, friction — require touching) and non-contact forces (gravity, magnetism — act at a distance).",
        "example_task": "Sort these forces into contact and non-contact: friction, gravity, pushing a trolley, a magnet attracting a paper clip.",
        "example_response": "Contact forces (need touching): friction (surfaces rubbing), pushing a trolley (hand touches trolley). Non-contact forces (act at a distance): gravity (pulls objects down without touching), magnet (attracts paper clip without touching it).",
        "common_errors": [
          "Thinking gravity is a contact force",
          "Not realising that magnets can act without touching"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining the difference between contact and non-contact forces with multiple examples, and understanding that forces can be measured using a force meter (Newtons).",
        "example_task": "Explain what a non-contact force is. Give two examples and describe how each one works.",
        "example_response": "A non-contact force acts between objects without them touching. Gravity pulls all objects toward the Earth — when you drop a ball, gravity pulls it down even though nothing visible is pushing it. Magnetic force can attract or repel — a magnet attracts an iron paper clip across a gap, pulling it through the air without touching. Both forces get weaker with distance. Contact forces like friction and air resistance require surfaces or objects to be in direct contact.",
        "common_errors": [
          "Thinking non-contact forces are weaker than contact forces",
          "Not mentioning that non-contact forces can work through gaps"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Applying understanding of forces to explain phenomena where multiple forces act simultaneously, and recognising balanced and unbalanced forces.",
        "example_task": "A book sits on a table without moving. Are there forces acting on it? Explain.",
        "example_response": "Yes, two forces are acting on the book even though it is not moving. Gravity pulls the book downward toward the Earth. The table pushes the book upward with an equal force (called the normal reaction force). These forces are balanced — they are equal in size but opposite in direction, so the book stays still. If the forces were unbalanced (for example, if you pushed down on the book), the book would move. Objects can have forces acting on them and still be stationary — this happens when the forces are balanced. This is an important idea that leads to Newton's First Law.",
        "common_errors": [
          "Thinking no forces act on stationary objects",
          "Not understanding that balanced forces result in no movement"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C026",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that magnets can attract some objects and that this pull can be felt.",
        "example_task": "Hold a magnet near these objects. Which ones does the magnet pull toward it?",
        "example_response": "The magnet pulls the paper clip and the nail. It does not pull the wooden block or the plastic pen.",
        "common_errors": [
          "Thinking the magnet attracts all metals (only iron, nickel, cobalt and their alloys)",
          "Not noticing that the magnet pulls through a gap (non-contact force)"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying magnetic materials, knowing that magnets have two poles (north and south), and that like poles repel while unlike poles attract.",
        "example_task": "What happens when you put two north poles together? What about a north and a south pole?",
        "example_response": "Two north poles repel — they push each other away. A north pole and a south pole attract — they pull toward each other. Opposite poles attract, same poles repel.",
        "common_errors": [
          "Mixing up attract and repel",
          "Thinking all parts of a magnet are equally strong"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Systematically testing materials for magnetic properties, recording results, and explaining that only materials containing iron, nickel or cobalt are magnetic.",
        "example_task": "We tested 12 materials and found that iron nails, steel scissors and nickel coins were magnetic, but copper coins, aluminium foil, gold ring, brass key, glass, wood, plastic, paper and rubber were not. What pattern do you notice?",
        "example_response": "Only the objects containing iron, nickel or steel (which contains iron) were magnetic. Copper, aluminium, brass and gold are metals but they are not magnetic. This disproves the common idea that 'all metals are magnetic'. The magnetic materials all contain iron, nickel or cobalt. Most everyday magnetic objects are made of steel, which is an alloy (mixture) of iron and carbon. Magnetic force is a non-contact force — the magnets attracted these materials without touching them.",
        "common_errors": [
          "Concluding that all metals are magnetic",
          "Not recognising that steel is an iron alloy"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Designing experiments to test magnetic properties (strength through different materials, distance effects) and applying understanding to real-world uses of magnets.",
        "example_task": "Design an experiment to test whether a magnet works through different materials. Predict and explain what you think will happen.",
        "example_response": "I would place a paper clip on a table and put different materials between the magnet and the clip: paper, cardboard, thin wood, plastic, aluminium foil, glass. I would slowly move the magnet closer until the clip moves. I predict the magnet will work through all non-magnetic materials (paper, cardboard, plastic, glass, wood) because magnetic force is a non-contact force that passes through non-magnetic substances. It should also work through aluminium foil because aluminium is not magnetic. The thickness of the material might affect the distance at which the clip responds because the magnetic force weakens with distance. This principle is used in fridge magnets (work through the fridge door) and magnetic locks.",
        "common_errors": [
          "Thinking magnetic force cannot pass through solid materials",
          "Not controlling the distance when testing different barrier materials"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C027",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that some surfaces are easier to slide on than others, from everyday experience.",
        "example_task": "Is it easier to slide on a wooden floor or on carpet? Why?",
        "example_response": "It is easier to slide on the wooden floor because it is smoother. The carpet is rough and harder to slide on.",
        "common_errors": [
          "Not connecting the difficulty of sliding to the surface's roughness",
          "Thinking the object changes rather than the surface"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using the word 'friction' to describe the force between surfaces that slows movement, and knowing that rough surfaces create more friction.",
        "example_task": "What is friction? How does the surface affect how far a toy car rolls?",
        "example_response": "Friction is a force between two surfaces that slows down or stops movement. A toy car rolls further on a smooth surface because there is less friction. On a rough surface like carpet, there is more friction, which slows the car down more quickly.",
        "common_errors": [
          "Describing friction without naming it as a force",
          "Thinking smooth surfaces have no friction at all"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Investigating how friction varies on different surfaces, measuring results systematically, and explaining that friction is a contact force that can be both useful and a nuisance.",
        "example_task": "Use a force meter to pull a shoe across four surfaces. Record the force needed. Explain why friction can be both helpful and a problem.",
        "example_response": "Sandpaper: 4.5N, carpet: 3.2N, wood: 1.8N, plastic: 1.5N. More force is needed on rougher surfaces because friction is greater. Friction is helpful: shoe treads grip the ground so we do not slip, brakes use friction to stop cars, and we need friction to hold a pencil. Friction is a problem: it slows down bicycles and cars (wasting energy), causes wear on moving parts, and generates unwanted heat in machines. Engineers reduce unwanted friction with lubricants (oil) and increase useful friction with textured surfaces.",
        "common_errors": [
          "Thinking friction is always a problem to be reduced",
          "Not measuring the force consistently across all surfaces"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Designing friction investigations with controlled variables and applying understanding to explain real-world engineering solutions.",
        "example_task": "Car tyres have deep grooves (tread) but racing cars on dry tracks use smooth tyres. Explain this apparent contradiction using your understanding of friction.",
        "example_response": "Normal car tyres have deep tread grooves to channel water away from under the tyre in wet conditions. Without tread, a layer of water can form between the tyre and road (aquaplaning), which dramatically reduces friction and makes the car impossible to control. The grooves give water somewhere to go, so the rubber maintains contact with the road. Racing cars on dry tracks use smooth tyres because on a dry surface, a smooth tyre has more rubber in contact with the road, which means more friction and more grip. They do not need to channel water because the track is dry. This shows that the best solution for friction depends on conditions — it is not always 'more friction is better' or 'less is better'.",
        "common_errors": [
          "Thinking more tread always means more grip",
          "Not explaining why water reduces friction (the tyre loses contact with the road)"
        ]
      }
    ]
  }
]