[
  {
    "concept_id": "SC-KS2-C037",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that sounds are made when objects vibrate, demonstrated by feeling or seeing vibrations.",
        "example_task": "Pluck this elastic band stretched over a box. What can you see and hear?",
        "example_response": "I can hear a sound. I can see the elastic band moving back and forth really fast — vibrating.",
        "common_errors": [
          "Not connecting the visible vibration to the sound they hear",
          "Thinking the sound comes from the box, not the vibrating band"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explaining that all sounds are caused by vibrations and giving multiple examples where vibration produces sound.",
        "example_task": "Give three examples of objects vibrating to produce sound.",
        "example_response": "A guitar string vibrates when plucked and produces a musical note. A drum skin vibrates when hit and makes a boom sound. Our vocal cords vibrate when we speak — I can feel this by touching my throat while talking.",
        "common_errors": [
          "Not being able to identify the vibrating part of an instrument (e.g. in a drum, it is the skin)",
          "Thinking sound can be made without anything vibrating"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining that vibrating objects cause surrounding air particles to vibrate, transmitting sound as a wave to the ear, and demonstrating this with practical examples.",
        "example_task": "Strike a tuning fork and touch it to the surface of water. What happens? Explain how the sound reaches your ear.",
        "example_response": "The tuning fork vibrates and when I touch it to the water, it makes the water splash — showing that the vibrations transfer energy to the water. The sound reaches my ear because the vibrating tuning fork pushes the air particles next to it back and forth. These particles push the next ones, and so on, creating a wave that travels through the air. When the wave reaches my ear, it makes my eardrum vibrate, and I hear the sound. The tuning fork → air particles → ear. The particles do not travel from the fork to my ear — they pass the vibration along like a Mexican wave.",
        "common_errors": [
          "Thinking air particles physically travel from the source to the ear",
          "Not explaining the step from vibrating object to vibrating air to vibrating eardrum"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using the vibration model to explain why sound cannot travel through a vacuum and predicting how changes to the vibrating object affect the sound.",
        "example_task": "Astronauts in space cannot hear each other without radios, even if they shout. Explain why, using your understanding of how sound travels.",
        "example_response": "Sound is a vibration that travels through a medium — solid, liquid or gas — by particles passing the vibration to neighbouring particles. In space, there is a vacuum — no air or other material, so there are no particles to vibrate. Without particles to carry the wave, the vibration cannot travel from one astronaut's mouth to another's ear. This proves that sound is not a 'thing' that floats through space — it is a wave that needs a medium to travel through. Astronauts use radios because radio waves are electromagnetic waves, not mechanical waves like sound. Electromagnetic waves can travel through a vacuum because they do not need particles. In science fiction films, explosions in space are shown with loud bangs — in reality, space is completely silent.",
        "common_errors": [
          "Thinking sound is blocked by space rather than understanding it needs particles",
          "Not distinguishing between sound waves (need particles) and radio waves (do not)"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C038",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that you can hear sounds through air and that sound can travel through solid objects too.",
        "example_task": "Put your ear on the desk while your partner taps the other end. Can you hear it? Is the sound louder through the desk or through the air?",
        "example_response": "Yes, I can hear the tapping through the desk. It sounds louder through the desk than through the air.",
        "common_errors": [
          "Not realising sound can travel through solids",
          "Thinking sound only travels through air"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Understanding that sound can travel through solids, liquids and gases, and that it cannot travel through a vacuum (empty space).",
        "example_task": "Name three types of material sound can travel through. Where can sound not travel?",
        "example_response": "Sound can travel through solids (like a desk), liquids (like water) and gases (like air). Sound cannot travel through a vacuum — empty space with no particles. That is why there is no sound in outer space.",
        "common_errors": [
          "Thinking sound can travel through a vacuum (influenced by films)",
          "Not including liquids as a medium for sound"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining that sound travels through different media at different speeds (fastest through solids, slowest through gases) using the particle model.",
        "example_task": "Sound travels fastest through solids, then liquids, then gases. Use the particle model to explain why.",
        "example_response": "In solids, particles are very close together and tightly connected. When one particle vibrates, it quickly passes the vibration to its neighbour because they are so close. In liquids, particles are close but can move more freely, so the vibration is passed along a little more slowly. In gases, particles are far apart with big gaps between them, so it takes longer for one particle to bump into the next and pass the vibration on. The closer the particles are, the faster sound travels. This is why you hear a train coming sooner if you put your ear to the rail (solid steel) than if you just listen through the air.",
        "common_errors": [
          "Thinking sound travels fastest through gases because air is 'easier to move through'",
          "Not connecting particle spacing to speed of sound transmission"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Applying understanding of sound transmission to explain practical phenomena and engineering solutions.",
        "example_task": "A string telephone works well when the string is tight but not when the string is loose. Explain why using your knowledge of how sound travels through materials.",
        "example_response": "When you speak into the cup, your voice makes the bottom of the cup vibrate. These vibrations travel along the string to the other cup, making its bottom vibrate, which produces sound the listener can hear. The string must be tight because a tight string has its particles in close contact — vibrations pass efficiently from one particle to the next, like a chain of dominoes. A loose string has slack sections where the particles are not in firm contact, so the vibration energy is absorbed and lost rather than transmitted. This is the same principle as a guitar string — tight strings vibrate and transmit sound efficiently, loose strings do not. It demonstrates that sound needs particles in good contact to travel effectively.",
        "common_errors": [
          "Not explaining why tension affects sound transmission",
          "Thinking the sound travels through the air inside the string (it travels through the string itself)"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C039",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that sounds can be high or low (pitch), and connecting pitch to the size or length of the sound source.",
        "example_task": "Tap a long chime bar and a short chime bar. Which makes a higher sound?",
        "example_response": "The short chime bar makes the higher sound. The long one makes a lower sound.",
        "common_errors": [
          "Confusing pitch (high/low) with volume (loud/quiet)",
          "Not noticing the difference between the two sounds"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Understanding that shorter, smaller or tighter objects produce higher-pitched sounds and longer, larger or looser objects produce lower-pitched sounds.",
        "example_task": "How can you make a higher-pitched note on a guitar? How can you make a lower-pitched note?",
        "example_response": "For a higher pitch: use a thinner string, or tighten the string, or press the string to make the vibrating part shorter. For a lower pitch: use a thicker string, loosen the string, or let the whole string vibrate (longer vibrating length). Shorter, thinner, tighter = higher pitch.",
        "common_errors": [
          "Confusing pitch with volume — pressing harder makes it louder, not higher",
          "Thinking only one factor (length) affects pitch"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Investigating the relationship between pitch and the features of the vibrating object, identifying patterns and explaining results.",
        "example_task": "We filled bottles to different levels with water and blew across the top. The bottle with the least water made the lowest note. Explain why.",
        "example_response": "When you blow across the top of a bottle, it is the column of air inside that vibrates to make the sound. The bottle with the least water has the most air inside — a longer air column. Longer air columns vibrate more slowly and produce lower-pitched sounds. The bottle with the most water has the least air — a shorter air column that vibrates faster and produces a higher-pitched sound. The pattern is: longer vibrating column = lower pitch, shorter column = higher pitch. This is the same principle as in wind instruments like flutes and organ pipes — changing the length of the vibrating air column changes the pitch.",
        "common_errors": [
          "Thinking the water produces the sound (it is the air column that vibrates)",
          "Confusing more water with lower pitch (more water = shorter air column = higher pitch)"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Applying pitch concepts to explain how musical instruments work and predicting the pitch of untested objects.",
        "example_task": "A xylophone has bars of different lengths. Without playing it, predict which end produces the lowest notes and explain your reasoning. How would you design a simple instrument with exactly 5 different notes?",
        "example_response": "The longest bars will produce the lowest notes because a longer vibrating object vibrates more slowly, creating a lower pitch. So the lowest notes are at the end with the longest bars. To design an instrument with 5 notes: I could use 5 pieces of the same material (e.g. wooden dowel or metal pipe) cut to 5 different lengths. I would keep the material and thickness the same so the only variable is length. Each length would produce a different pitch. I could test and adjust the lengths until the 5 notes sound pleasing together. This is exactly how marimbas and xylophones are made — the length of each bar is precisely calculated to produce the right note.",
        "common_errors": [
          "Not controlling other variables (material, thickness) in the instrument design",
          "Not connecting the instrument design to the scientific principle"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C040",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that hitting something harder makes a louder sound.",
        "example_task": "Hit the drum gently, then hit it hard. What is different about the two sounds?",
        "example_response": "The gentle hit made a quiet sound. The hard hit made a loud sound.",
        "common_errors": [
          "Confusing volume change with pitch change",
          "Not recognising that both hits produced the same note (pitch) at different volumes"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Understanding that louder sounds are caused by bigger (stronger) vibrations and connecting volume to the strength of the vibration.",
        "example_task": "Why does hitting a drum harder make a louder sound? Use the word 'vibration'.",
        "example_response": "Hitting the drum harder makes the drum skin vibrate more — bigger vibrations. Bigger vibrations push the air particles harder, which makes a louder sound wave that reaches our ears. A gentle tap makes smaller vibrations and a quieter sound.",
        "common_errors": [
          "Thinking louder means the sound travels faster (it does not — it has more energy)",
          "Not linking the strength of the hit to the size of the vibration"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining the relationship between vibration strength (amplitude) and volume, and investigating how volume decreases with distance from the source.",
        "example_task": "We measured the volume of a clap at 1m, 5m, 10m and 20m. It got quieter each time. Explain why sound gets fainter with distance.",
        "example_response": "Sound gets fainter with distance because the vibration energy spreads out as it travels away from the source. Close to the clap, all the energy is concentrated in a small area, so the sound is loud. Further away, the same energy is spread over a much larger area, so each point receives less energy and the sound is quieter. It is like ripples spreading from a stone dropped in a pond — near the stone, the ripples are big; further away, they are smaller. The sound does not 'run out' — it just gets too faint for our ears to detect.",
        "common_errors": [
          "Thinking the sound slows down rather than spreads out",
          "Not explaining why spreading out reduces loudness"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Distinguishing clearly between pitch and volume as independent properties of sound, and applying this understanding to solve problems.",
        "example_task": "A pupil says 'If I shout, my voice gets higher.' Is this true? Can a sound be loud and low-pitched at the same time? Give an example.",
        "example_response": "This is a common confusion. When you shout, your voice gets louder (more volume) but it may also seem to get higher because your vocal cords tighten when you strain. However, pitch and volume are independent properties — you can have any combination. A bass drum is loud AND low-pitched. A whispered high note is quiet AND high-pitched. A foghorn is very loud and very low. A mouse squeak is quiet and high. Volume depends on the strength of the vibration (amplitude). Pitch depends on the speed of vibration (frequency). They are controlled by different things and can vary independently.",
        "common_errors": [
          "Thinking loud automatically means high-pitched",
          "Not giving examples of all four combinations (loud-high, loud-low, quiet-high, quiet-low)"
        ]
      }
    ]
  }
]