[
  {
    "concept_id": "SC-KS2-C063",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that fossils show us animals and plants that lived long ago, and that some of them no longer exist (are extinct).",
        "example_task": "Look at this ammonite fossil. What does it tell us?",
        "example_response": "This fossil shows an animal that lived a very long time ago. It looks like a spiral shell. This animal does not exist any more — it has gone extinct. The fossil tells us that different animals lived on Earth in the past.",
        "common_errors": [
          "Thinking fossils are just old rocks with no connection to living things",
          "Not understanding that extinction means the species no longer exists anywhere"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Understanding that fossils provide evidence that living things have changed over time — organisms that lived millions of years ago were different from those alive today.",
        "example_task": "Scientists have found fossils of sea creatures on top of mountains. What does this tell us?",
        "example_response": "This tells us that the land where the mountains are now was once under the sea. Over millions of years, the sea floor was pushed up to form mountains, carrying the fossils with it. This is evidence that the Earth's surface has changed dramatically over time, and that the environments where organisms lived have changed too. Life on Earth has changed alongside these changes — the sea creatures that made those fossils are long extinct.",
        "common_errors": [
          "Thinking the sea creatures climbed the mountains",
          "Not connecting the fossils to environmental change over geological time"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using fossil evidence to explain that organisms have changed over time, comparing fossils with living organisms, and understanding what fossils reveal about past environments.",
        "example_task": "Compare a fossil of an ancient horse (Eohippus, the size of a dog with four toes) with a modern horse. What does this comparison suggest?",
        "example_response": "Eohippus (about 55 million years ago) was small (about 40cm tall, dog-sized), had four toes on each front foot, and had teeth suited to eating soft leaves in forests. Modern horses are much larger (about 160cm), have a single hoof on each foot, and have teeth suited to grinding tough grass on open plains. The fossil record shows a gradual series of changes between the two: increasing body size, reduction in toe number, and changes in tooth structure. This evidence suggests that horses have evolved over millions of years, changing as their environment changed from forests to grasslands. The intermediate fossils show this was not a sudden jump but a gradual process — each generation was slightly different from the last.",
        "common_errors": [
          "Thinking the ancient horse turned into the modern horse during its lifetime",
          "Not using the fossil evidence to support the argument"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating fossil evidence critically — understanding gaps in the fossil record and why not all organisms fossilise — and explaining how fossils support the theory of evolution.",
        "example_task": "Why do we not have fossils of every species that has ever lived? Does this weaken the evidence for evolution?",
        "example_response": "We do not have fossils of every species because fossilisation requires very specific conditions: the organism must be buried quickly in sediment before it decays, and the sediment must remain undisturbed for millions of years while minerals replace the original material. Soft-bodied organisms (like jellyfish and worms) rarely fossilise because they have no hard parts. Many fossils have been destroyed by geological processes — erosion, volcanic activity, tectonic movement. So the fossil record is necessarily incomplete — like having some pages of a very long book. This does not weaken the evidence for evolution. The fossils we do have consistently show: simpler organisms in older rocks, more complex ones in newer rocks; gradual changes within lineages over time; transitional forms (like Archaeopteryx, between dinosaurs and birds). No fossil has ever been found in the wrong geological layer. The pattern is overwhelmingly consistent, even with gaps.",
        "common_errors": [
          "Thinking gaps in the fossil record disprove evolution",
          "Not understanding why fossilisation is rare"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C064",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that children look similar to their parents but are not identical copies — there are always some differences.",
        "example_task": "Look at this family photo. In what ways does the child look like the parents? In what ways are they different?",
        "example_response": "The child has brown eyes like their dad and curly hair like their mum. But the child's face shape is different from both parents, and they are shorter than both parents were at the same age. Children look a bit like each parent but are not exactly the same as either one.",
        "common_errors": [
          "Thinking children should be exact copies of one parent",
          "Not noticing the differences alongside the similarities"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Understanding that offspring inherit characteristics from both parents, which explains both similarities and differences between family members.",
        "example_task": "Why do brothers and sisters look similar but not identical (unless they are identical twins)?",
        "example_response": "Brothers and sisters each receive a mix of characteristics from the same two parents. But the particular mix is different each time — like shuffling a deck of cards and dealing different hands. One child might get their mum's eye colour and dad's hair type, while their sibling gets the opposite combination. This is why siblings share some features but look different overall. Identical twins look the same because they developed from one fertilised egg that split, so they have exactly the same mix.",
        "common_errors": [
          "Thinking siblings should look the same because they have the same parents",
          "Confusing inherited traits with environmental ones (a scar is not inherited)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Distinguishing between inherited variation (passed from parents) and environmental variation (caused by conditions), and understanding that variation within a species is normal and important.",
        "example_task": "Which of these are inherited and which are caused by the environment: eye colour, spoken language, natural hair colour, a scar, height, ability to play piano?",
        "example_response": "Inherited: eye colour (determined by characteristics from parents), natural hair colour (same). Environmental: spoken language (learned from the community you grow up in), ability to play piano (learned through practice), a scar (caused by an injury). Height is both — you inherit a potential height range from your parents, but your actual height depends on nutrition, health and other environmental factors during growth. Many characteristics are influenced by both inheritance and environment. This variation within a species is normal and important — in nature, variation means that if conditions change, some individuals may be better suited to survive than others.",
        "common_errors": [
          "Thinking all characteristics are inherited",
          "Not recognising that some traits (like height) are influenced by both inheritance and environment"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining why variation is essential for a species' survival and connecting variation to natural selection without using genetic terminology.",
        "example_task": "A deadly disease hits a population of rabbits. Most die, but a few survive. Explain why variation in the population was crucial for the species' survival.",
        "example_response": "Within the rabbit population, natural variation means that not all rabbits are identical. Some may have a slightly different immune system that happens to be better at fighting this particular disease. These rabbits survive while others do not. The survivors reproduce, passing on their disease-resistant characteristics to their offspring. Over several generations, more rabbits in the population carry this resistance. Without variation, every rabbit would be equally vulnerable and the entire population could be wiped out. This is why variation is crucial for species survival — it is like having many different keys; if the lock changes (new disease, new predator, new climate), at least one key might still fit. Species with very little variation (like cheetahs) are at greater risk of extinction because they have fewer 'keys' to try. This is the foundation of natural selection — variation provides the raw material for species to adapt to changing conditions.",
        "common_errors": [
          "Thinking the rabbits chose to become resistant",
          "Not connecting variation to the species' ability to survive changing conditions"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C065",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that animals and plants have features that help them survive in the place where they live.",
        "example_task": "A polar bear has thick white fur. How does this help it survive in the Arctic?",
        "example_response": "The thick fur keeps the polar bear warm in the freezing cold. The white colour helps it hide in the snow so it can sneak up on prey without being seen.",
        "common_errors": [
          "Only mentioning one function (warmth) and not camouflage",
          "Not connecting the feature to the specific environment"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying multiple adaptations in an organism and explaining how each helps survival in its specific environment.",
        "example_task": "A cactus lives in a hot, dry desert. Describe three adaptations and explain how each one helps.",
        "example_response": "1. Spines instead of leaves — small surface area means less water is lost through evaporation. Spines also protect the cactus from animals that might eat it for water. 2. Thick, fleshy stem — stores water from rare rainfall, allowing the cactus to survive long dry periods. 3. Long, spreading roots — extend over a wide area just below the surface to collect water quickly when it rains. Each adaptation solves a problem created by the desert environment: extreme heat, very little rainfall, and animals seeking water.",
        "common_errors": [
          "Describing features without explaining how they help in that specific environment",
          "Thinking the cactus chose to develop these features"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Comparing adaptations in organisms from different environments and explaining why the same adaptation would not work everywhere.",
        "example_task": "Compare a camel (desert) and a penguin (Antarctic). Both survive in extreme environments but have very different adaptations. Why?",
        "example_response": "Camel adaptations for the hot, dry desert: humps store fat (not water) for energy when food is scarce; long eyelashes and closeable nostrils protect against sandstorms; wide feet spread weight on soft sand; can tolerate high body temperature to avoid sweating and water loss. Penguin adaptations for the freezing Antarctic: thick layer of blubber insulates against extreme cold; waterproof overlapping feathers trap air for insulation; huddle behaviour reduces heat loss; streamlined body and flipper-like wings for efficient swimming to catch fish. These adaptations are opposites because the environments demand opposite solutions. A camel's adaptations would be useless in Antarctica — it needs to conserve water, not heat. A penguin's thick blubber would cause overheating in a desert. Adaptations are specific to the challenges of each environment.",
        "common_errors": [
          "Describing adaptations without comparing them across environments",
          "Not explaining why an adaptation suited to one environment would fail in another"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining that adaptations develop over many generations through natural selection, not within an individual's lifetime, and predicting how a changing environment might affect adapted organisms.",
        "example_task": "If the Arctic ice melts due to climate change, what problems might polar bears face? Use your knowledge of adaptation to explain.",
        "example_response": "Polar bears are highly adapted to Arctic ice: white fur for camouflage on ice and snow, large paws for walking on ice, thick blubber for swimming in freezing water, and hunting behaviour that depends on sea ice as a platform for catching seals. If the ice melts: their white camouflage becomes a disadvantage on dark water or land. Seal-hunting platforms disappear, reducing food availability. Bears must swim longer distances, using energy and risking drowning. Competition with grizzly bears (already adapted to ice-free environments) increases. Crucially, adaptation happens over many generations — polar bears cannot simply adapt to ice-free conditions within a few decades. Evolution by natural selection requires many generations. If the environment changes faster than a species can adapt, the species faces extinction. Some polar bears might survive if they have variations that help them hunt on land, but the population would decrease dramatically. This is why rapid environmental change is so dangerous — it outpaces the natural pace of adaptation.",
        "common_errors": [
          "Thinking polar bears can quickly adapt to new conditions within their lifetime",
          "Not connecting the speed of environmental change to the speed of adaptation"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C066",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that animals and plants have changed over a very long time and that some types of living things that existed before are now extinct.",
        "example_task": "Dinosaurs lived millions of years ago but are not alive today. What do we call it when a type of animal no longer exists?",
        "example_response": "When a type of animal no longer exists anywhere on Earth, we say it has become extinct. Dinosaurs are extinct. We know about them from their fossils.",
        "common_errors": [
          "Thinking extinct animals might still be alive somewhere",
          "Confusing extinction with endangerment"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Understanding that living things have gradually changed over very long periods of time (evolution) and that variation and inheritance play a role in this process.",
        "example_task": "How might a population of mice gradually change colour over many generations?",
        "example_response": "Imagine a population of brown mice living on brown soil. Some mice are slightly darker and some slightly lighter due to natural variation. If the environment changes and the soil becomes lighter, darker mice are more easily seen by predators and more likely to be eaten. Lighter mice survive longer and have more babies. Those babies inherit the lighter colour. Over many generations, the population gradually becomes lighter. This is evolution — gradual change in a population over many generations.",
        "common_errors": [
          "Thinking individual mice change colour during their lifetime",
          "Not understanding that evolution happens across populations over many generations"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining evolution by natural selection using the concepts of variation, inheritance and survival, with reference to Darwin and Wallace.",
        "example_task": "Explain how Darwin's theory of evolution by natural selection works, using the peppered moth as an example.",
        "example_response": "Before the Industrial Revolution, most peppered moths were light-coloured, camouflaged against pale lichen-covered tree bark. Dark moths were rare and easily spotted by birds. During industrialisation, soot blackened the trees. Now light moths were visible and eaten, while dark moths were camouflaged and survived. Dark moths reproduced more, passing on their dark colouring. Within a few decades, most peppered moths in polluted areas were dark. After clean air laws reduced pollution, lichens returned, and the population shifted back towards lighter moths. This demonstrates Darwin and Wallace's theory: (1) individuals vary (light and dark moths exist); (2) some variations give a survival advantage in the current environment; (3) survivors reproduce and pass on advantageous traits; (4) over generations, the population changes. Natural selection does not have a goal — it is simply the result of better-adapted individuals surviving and reproducing more successfully.",
        "common_errors": [
          "Saying the moths 'decided' or 'chose' to change colour",
          "Thinking evolution has a direction or goal"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating the evidence for evolution from multiple sources and understanding why evolution is considered a scientific theory supported by overwhelming evidence, not 'just a guess'.",
        "example_task": "Some people say 'Evolution is just a theory.' In science, what does 'theory' mean? What evidence supports the theory of evolution?",
        "example_response": "In everyday language, 'theory' means a guess. In science, a theory is an explanation supported by a large body of evidence that has been tested repeatedly and never disproven. The theory of evolution is supported by: (1) Fossil evidence — showing gradual changes in organisms over time, including transitional forms. (2) Comparative anatomy — similar bone structures in different species (a human arm, a whale flipper, a bat wing all have the same bones) suggest a common ancestor. (3) DNA evidence — species that look similar have similar DNA; the more similar the DNA, the more recently they shared a common ancestor. (4) Observable evolution — bacteria developing antibiotic resistance, the peppered moth, dog breeding producing different breeds from wolves. (5) Biogeography — island species resemble nearby mainland species but with unique adaptations. No scientific evidence contradicts evolution. Like the theory of gravity, it is called a theory because it explains a vast amount of evidence — not because scientists are unsure about it.",
        "common_errors": [
          "Confusing the everyday meaning of 'theory' (guess) with the scientific meaning (well-supported explanation)",
          "Not providing multiple independent lines of evidence"
        ]
      }
    ]
  }
]