[
  {
    "concept_id": "SC-KS2-C022",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that we need light to see things and that it is dark when there is no light.",
        "example_task": "Why can you not see in a completely dark room?",
        "example_response": "Because there is no light. We need light to see things.",
        "common_errors": [
          "Thinking we can see in the dark if we wait long enough",
          "Thinking dark is a substance rather than the absence of light"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying sources of light (Sun, lamp, fire, torch) and understanding that we see objects because light from a source reaches our eyes, either directly or by bouncing off objects.",
        "example_task": "Name three light sources. How do we see a book in a lit room?",
        "example_response": "Light sources: the Sun, a lamp, a candle. We see the book because light from the lamp shines onto the book, bounces off the book's surface, and enters our eyes. Without the light reaching our eyes, we would not see the book.",
        "common_errors": [
          "Thinking our eyes produce light that goes out to objects (emission theory)",
          "Thinking the Moon is a light source (it reflects sunlight)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining how we see objects using the model that light travels from a source, reflects off objects and enters our eyes. Understanding that darkness is the absence of light.",
        "example_task": "Draw and label a diagram showing how we see a red apple when a lamp is on. Include the light source, the apple and the eye.",
        "example_response": "Diagram shows: lamp (light source) with arrows going to the apple, then arrows bouncing off the apple going to the eye. Labels: 'Light from the lamp travels to the apple', 'Light reflects off the apple's surface (red light reflects, other colours are absorbed)', 'Reflected light enters the eye, and we see a red apple'. In a dark room with no light source, no light reaches the apple or our eyes, so we see nothing.",
        "common_errors": [
          "Drawing arrows going from the eye to the object (the emission misconception)",
          "Not including the reflection step — going directly from source to eye"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Applying the light-and-vision model to explain everyday phenomena and recognising its development from Y3 observation to Y6 straight-line model.",
        "example_task": "Explain why you can see the Moon at night even though it is not a light source. Use the model of how we see things.",
        "example_response": "The Moon is not a light source — it does not produce its own light. We can see it because sunlight hits the Moon's surface and reflects off it. This reflected sunlight then travels through space to Earth and enters our eyes. We see the Moon the same way we see a book — by reflected light from a source. The light source is the Sun, even though the Sun is not visible to us at night (it is on the other side of Earth). This explains why the Moon's appearance changes through the month — we see different amounts of the sunlit side as the Moon orbits Earth.",
        "common_errors": [
          "Thinking the Moon makes its own light",
          "Not connecting moonlight to sunlight reflection"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C023",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that shiny surfaces like mirrors reflect light, demonstrated by seeing a torch beam bounce off a mirror.",
        "example_task": "Shine the torch at the mirror. What happens to the light?",
        "example_response": "The light bounces off the mirror and shines on the wall.",
        "common_errors": [
          "Thinking the mirror makes its own light",
          "Not noticing that the light changes direction"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Understanding that light reflects off surfaces and that smooth, shiny surfaces reflect light best. We see most objects because light bounces off them into our eyes.",
        "example_task": "Why can you see your face in a mirror but not in a piece of carpet?",
        "example_response": "A mirror is very smooth and shiny, so it reflects light evenly — the light bounces off in a neat pattern that shows an image. Carpet is rough, so light bounces off in all different directions (scattered) and does not form a clear image. Both reflect some light — that is how we can see both of them — but only the mirror reflects it neatly enough to show a reflection.",
        "common_errors": [
          "Thinking only mirrors reflect light",
          "Not understanding that we see all objects by reflected light"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Investigating reflection, identifying reflective and non-reflective surfaces, and understanding that the angle of reflection equals the angle at which light hits the surface.",
        "example_task": "We used a torch and mirror in a dark room. When we shone the torch at the mirror from the left, the light reflected to the right. What happens if we change the angle of the torch?",
        "example_response": "When we changed the angle of the torch, the reflected beam also changed direction. The angle of the reflected light matches the angle it arrives at. If the light hits the mirror straight on, it bounces straight back. If it hits at a steep angle, it reflects at the same steep angle on the other side. This is the law of reflection and it is why we can use mirrors to redirect light — for example, a periscope uses two mirrors to let you see over obstacles.",
        "common_errors": [
          "Thinking reflected light always goes in the same direction regardless of the incoming angle",
          "Not connecting the practical observation to the rule about equal angles"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Applying reflection principles to explain everyday phenomena and design solutions using mirrors.",
        "example_task": "Design a periscope that lets you see over a wall. Explain how it works using your knowledge of reflection.",
        "example_response": "A periscope uses two mirrors placed at 45° angles inside a tube. Light from the scene above the wall enters the top, hits the first mirror at 45° and reflects downward through the tube. At the bottom, it hits the second mirror at 45° and reflects horizontally into the viewer's eyes. Because light travels in straight lines, the mirrors redirect the light path around the corner. Each mirror changes the direction by 90° — two 90° turns means the light effectively travels in a Z-shape from above the wall down to eye level. This is also how submarine periscopes work.",
        "common_errors": [
          "Not explaining why the mirrors must be at 45°",
          "Drawing the light path incorrectly through the periscope"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C024",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that shadows form when something blocks the light, and that shadows are dark areas.",
        "example_task": "Stand in front of the lamp. What do you see on the wall behind you?",
        "example_response": "I can see my shadow on the wall. It is because my body is blocking the light.",
        "common_errors": [
          "Thinking shadows have colour or are reflections",
          "Not connecting the shadow to the light being blocked"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explaining that shadows form when opaque objects block light, and that transparent and translucent materials create different effects.",
        "example_task": "What happens when you put these three objects in front of the torch: cardboard, coloured glass, clear plastic?",
        "example_response": "Cardboard is opaque — it blocks all the light and makes a dark shadow. Coloured glass is translucent — it lets some light through but not clearly, making a faint coloured shadow. Clear plastic is transparent — it lets almost all the light through, so there is hardly any shadow.",
        "common_errors": [
          "Thinking transparent objects also create dark shadows",
          "Confusing translucent with transparent"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Investigating how shadow size changes with the position of the light source or object, and explaining the results using the idea that light travels in straight lines.",
        "example_task": "We moved a toy figure closer to and further from a torch. What happened to the shadow? Explain why.",
        "example_response": "When the figure was close to the torch, the shadow on the wall was large. When the figure was far from the torch (closer to the wall), the shadow was smaller and sharper. This is because light travels in straight lines from the torch. When the object is close to the light, the light rays spread out more beyond the object, creating a larger shadow area. When the object is closer to the wall, the rays have less room to spread, making a smaller shadow. The shadow always has the same shape as the object because light cannot bend around it.",
        "common_errors": [
          "Thinking the shadow changes shape as well as size",
          "Not explaining the result using the straight-line travel of light"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Using the straight-line model of light to explain shadow formation with ray diagrams, and applying this to real-world phenomena like sundials and eclipses.",
        "example_task": "Draw a ray diagram to explain why shadows change length during the day as the Sun moves across the sky. Why are shadows longest in the morning and evening?",
        "example_response": "Ray diagram showing the Sun low in the sky (morning): light rays hit a stick at a shallow angle, creating a long shadow stretching far from the base. Sun high in the sky (midday): rays come almost straight down, creating a short shadow directly below. Sun low again (evening): long shadow in the opposite direction from morning. Shadows are longest when the Sun is low because the light rays hit objects at a shallow angle, so the shadow stretches far along the ground. At midday, the rays are nearly vertical, so the shadow is shortest. This principle is how sundials tell the time — the shadow position changes predictably as the Sun moves across the sky. We must never look directly at the Sun when observing shadows.",
        "common_errors": [
          "Drawing ray diagrams without showing the angle of light correctly",
          "Not connecting shadow length to the Sun's angle in the sky"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C067",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that light comes from light sources and travels to our eyes, allowing us to see things.",
        "example_task": "Shine a torch at the wall. Can you see the bright spot? Now put a book in front of the torch. What happens?",
        "example_response": "The bright spot disappears because the book blocks the light. The light cannot go through the book or around it. There is a shadow behind the book.",
        "common_errors": [
          "Thinking light can bend around solid objects",
          "Not connecting the blocked light to the shadow"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Understanding that light travels in straight lines and this explains why shadows have the same shape as the object blocking the light.",
        "example_task": "Line up three cards with small holes in the centre. Shine a torch through them. What happens if you move one card sideways?",
        "example_response": "When all three holes are lined up, the torch light passes through all of them because light travels in a straight line through each hole. When I move one card sideways, the light is blocked because the straight line from the torch no longer passes through all three holes. This proves light travels in straight lines — if it could curve, it would still get through.",
        "common_errors": [
          "Not understanding that the experiment proves light travels in straight lines",
          "Thinking light might bend a little around the card"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Using the straight-line model of light to explain how we see objects (light reflects off them into our eyes), how shadows form, and drawing ray diagrams.",
        "example_task": "Draw a ray diagram to show how you see a book on a desk. Where does the light come from? Where does it go?",
        "example_response": "Ray diagram: Straight arrows from the light source (e.g., ceiling lamp) travel down to the book. The light reflects off the book's surface. Straight arrows from the book travel to my eyes. I see the book because light from the source has bounced off it and entered my eyes. I draw the rays as straight lines with arrows showing the direction: source → book → eye. If the light source were turned off, I would not see the book because no light would reach it to reflect. This model explains everything: we see luminous objects (sources like lamps, the Sun) because light travels directly from them to our eyes. We see non-luminous objects (books, walls, people) because light from a source reflects off them into our eyes.",
        "common_errors": [
          "Drawing light going from the eye to the object (emission theory — incorrect)",
          "Not including the reflection step — light must bounce off the object into the eye"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Applying the straight-line model to explain complex phenomena like why shadows become larger/smaller and how mirrors redirect light.",
        "example_task": "In a darkened room, you hold a ball between a torch and a wall. As you move the ball closer to the torch, the shadow gets bigger. Draw a ray diagram to explain why.",
        "example_response": "Ray diagram: Draw the torch (point light source) on the left, the ball in the middle, and the wall (screen) on the right. Draw straight rays from the torch that just pass the top and bottom edges of the ball — these are the boundary rays. They continue in straight lines to the wall, where the gap between them defines the shadow size. Now move the ball closer to the torch: the boundary rays diverge at a wider angle because the ball intercepts a wider spread of light closer to the source. By the time these rays reach the wall, they are further apart — creating a larger shadow. Move the ball closer to the wall and the opposite happens — the boundary rays have less distance to spread, so the shadow is smaller and sharper. This is pure geometry — light travelling in straight lines from a point source creates a cone of shadow (umbra) that gets wider with distance. This is the same principle used in shadow puppetry and in optical instruments like cameras.",
        "common_errors": [
          "Not drawing accurate straight-line rays that show the geometry",
          "Explaining the size change without reference to the straight-line model"
        ]
      }
    ]
  }
]