[
  {
    "concept_id": "SC-KS1-C009",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising and naming two or three common plants from direct observation or clear photographs, with visual support.",
        "example_task": "Look at these three plants in our school garden. Can you name any of them? Here are name cards to help you: daisy, dandelion, grass.",
        "example_response": "That one is a daisy because it has white petals with a yellow middle. That one with the fluffy ball is a dandelion.",
        "common_errors": [
          "Calling all small flowers 'daisies'",
          "Naming a plant based on colour alone rather than its distinctive features"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Naming several common wild and garden plants and one or two common trees, beginning to describe the features that help identify them.",
        "example_task": "Name five plants you can see in the school grounds. Point to one feature that helps you recognise each one.",
        "example_response": "Daisy — small white petals with yellow centre. Dandelion — bright yellow flower with jagged leaves. Buttercup — shiny yellow petals. Nettle — jagged leaves with stinging hairs. Oak tree — big tree with wavy-edged leaves.",
        "common_errors": [
          "Using colour as the only identifying feature",
          "Confusing similar-looking plants (e.g. buttercup and dandelion)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Confidently naming a range of common wild plants, garden plants and trees, describing distinguishing features such as leaf shape, flower structure and bark texture.",
        "example_task": "Use a simple identification guide to identify these four pressed leaves. Name the tree each one came from and explain how you know.",
        "example_response": "This is an oak leaf — it has rounded lobes along the edges. This is a horse chestnut leaf — it has five leaflets joined at one point. This is a holly leaf — it is shiny, dark green and has spiky edges. This is a beech leaf — it is oval with a smooth, wavy edge and fine hairs.",
        "common_errors": [
          "Relying on the guide picture without checking specific features described in the key",
          "Confusing sycamore and horse chestnut leaves, which have a similar palmate shape"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Identifying plants in different seasons or growth stages, explaining how the same plant looks different at different times of year.",
        "example_task": "This photograph shows an oak tree in summer and in winter. How can you tell it is the same tree? How does it change between the seasons?",
        "example_response": "I can tell it is the same tree because the trunk and branches are the same shape. In summer it has lots of green leaves and acorns, but in winter the leaves have fallen off and you can see the bare branches. Oak trees are deciduous — they lose their leaves in autumn and grow new ones in spring.",
        "common_errors": [
          "Thinking the winter tree is dead rather than dormant",
          "Not recognising the tree without its leaves"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS1-C010",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Pointing to and naming two or three basic parts of a flowering plant (e.g. flower, leaf, stem) when shown a real plant or clear diagram.",
        "example_task": "Look at this plant. Can you point to the flower? Can you point to a leaf? What is this long part called?",
        "example_response": "This is the flower at the top. These are the leaves. The long part is the stem.",
        "common_errors": [
          "Confusing the stem with the whole plant",
          "Not knowing the word 'stem' and calling it 'the stick part'"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Naming most of the basic parts of a flowering plant — roots, stem, leaves, flower, petals — and locating them on a real plant or diagram.",
        "example_task": "Label this diagram of a flowering plant. Use these words: roots, stem, leaves, flower, petals.",
        "example_response": "Labels correctly placed: roots below the soil, stem going upward, leaves growing from the stem, flower at the top, petals around the edge of the flower.",
        "common_errors": [
          "Placing the roots label above ground",
          "Swapping the labels for flower and petals, not recognising petals are part of the flower"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Naming all main parts of a flowering plant and a tree (roots, stem/trunk, branches, leaves, flowers/blossom, petals, fruit, seeds, bulb) and identifying them on real specimens.",
        "example_task": "Here is an apple tree branch with blossom and a daffodil bulb that is starting to grow. Name as many plant parts as you can on each one.",
        "example_response": "Apple tree branch: branch, leaves, blossom (flower), petals, and later there will be fruit (apples) with seeds inside. Daffodil: bulb underground, roots growing from the bottom of the bulb, stem (growing up), leaves, and the flower will have petals.",
        "common_errors": [
          "Not knowing that a bulb is a plant part that stores food underground",
          "Thinking that fruit means only sweet fruits like apples, not seed-containing structures like pea pods"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Comparing the parts of different plants, explaining how the same part can look different in different species while having the same basic role.",
        "example_task": "Compare a sunflower and an oak tree. Name the parts they both have. How are the same parts different?",
        "example_response": "Both have roots, but the oak tree has thick spreading roots and the sunflower has thinner roots. The sunflower has a soft green stem, but the oak tree has a hard woody trunk — both hold the plant up. Both have leaves, but the oak's leaves are small with wavy edges and the sunflower's are large and heart-shaped. Both make seeds — the sunflower seeds are in the flower head and the oak tree makes acorns.",
        "common_errors": [
          "Saying that trees do not have stems (the trunk is the stem of a tree)",
          "Not recognising that acorns are seeds inside a fruit"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS1-C011",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Recognising that some trees have leaves in winter and some do not, when observing real trees or photographs.",
        "example_task": "Look at these two photographs of trees in winter. What is different about them?",
        "example_response": "That tree has no leaves — just bare branches. This tree still has green leaves.",
        "common_errors": [
          "Thinking the tree with no leaves is dead",
          "Not noticing the difference without prompting"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using the terms 'deciduous' and 'evergreen' to describe trees that lose their leaves and trees that keep them, with support.",
        "example_task": "We learned two special words for types of trees. Which word goes with a tree that keeps its leaves all year? Which word goes with a tree that loses its leaves in autumn?",
        "example_response": "Evergreen trees keep their leaves all year round. Deciduous trees lose their leaves in autumn.",
        "common_errors": [
          "Mixing up the two terms",
          "Thinking 'evergreen' means the tree is always green in colour, not that it always has leaves"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Correctly classifying common trees as deciduous or evergreen and explaining the key difference using scientific vocabulary.",
        "example_task": "Sort these six trees into deciduous and evergreen: oak, holly, beech, pine, horse chestnut, yew. Explain how you decided.",
        "example_response": "Deciduous: oak, beech, horse chestnut — they lose their leaves in autumn and grow new ones in spring. Evergreen: holly, pine, yew — they keep their leaves (or needles) all year round. I know because I have seen the oak and beech trees bare in winter, and the holly and pine always have leaves.",
        "common_errors": [
          "Thinking all evergreen trees are conifers with needles (holly is evergreen with broad leaves)",
          "Classifying based on one observation in one season rather than year-round knowledge"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining why deciduous trees lose their leaves as a seasonal response, and connecting this to the concept of adaptation or survival.",
        "example_task": "Why do you think deciduous trees lose their leaves in autumn? What advantage might this give them?",
        "example_response": "In winter there is less sunlight and it is colder, so leaves would not work well for making food. Losing leaves helps the tree save water and energy in winter. The leaves would also get damaged by frost. The tree is not dead — it is resting, and it will grow new leaves in spring when there is more light.",
        "common_errors": [
          "Thinking the wind simply blows the leaves off rather than the tree actively shedding them",
          "Not connecting leaf loss to seasonal changes in light and temperature"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS1-C012",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that plants grow from seeds or bulbs, and describing a simple observation of a seed beginning to grow.",
        "example_task": "We planted some bean seeds last week. Look at your pot. What has happened?",
        "example_response": "A little green shoot has come out of the soil. It has started to grow.",
        "common_errors": [
          "Thinking the seed has been replaced by a different thing rather than growing into the shoot",
          "Not noticing any change because growth was small"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing the stages of growth from seed or bulb to mature plant based on direct observation over several weeks, using simple language.",
        "example_task": "Draw three pictures showing how your sunflower has changed from when we planted the seed to now.",
        "example_response": "Picture 1: seed in soil, nothing showing. Picture 2: small green shoot with two tiny leaves poking out. Picture 3: taller stem with several bigger leaves and a flower bud forming.",
        "common_errors": [
          "Drawing the mature plant in all three stages rather than the actual observed changes",
          "Forgetting to show that roots grow downward as the shoot grows upward"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Sequencing the growth stages of a plant from seed to mature plant, recording measurements over time, and comparing growth from seeds with growth from bulbs.",
        "example_task": "We grew sunflowers from seeds and daffodils from bulbs. Describe how they both grew. What was similar and what was different?",
        "example_response": "Both started underground and grew a shoot upward. The sunflower seed split open and sent a root down and a shoot up. The daffodil bulb already had a tiny plant inside and grew faster at first. Both grew leaves and then flowers. The bulb was bigger than the seed to start with, so the daffodil had more stored food.",
        "common_errors": [
          "Thinking a bulb is just a big seed rather than a different plant structure with stored food",
          "Not recognising that both seeds and bulbs need water to start growing"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining why seeds and bulbs contain everything needed to begin a new plant, and predicting what would happen if conditions changed during growth.",
        "example_task": "A bean seed and a daffodil bulb both grew well for three weeks. What would happen if we stopped watering them? Explain your thinking.",
        "example_response": "At first they might keep growing because the seed and bulb have some stored food and there is still moisture in the soil. But after a while they would stop growing and start to wilt because plants need water to stay alive and grow. The daffodil might survive longer because bulbs store more water and food than small seeds. If we watered them again quickly, they might recover.",
        "common_errors": [
          "Thinking the plant would die immediately without water",
          "Not considering the role of stored food in the seed or bulb as a temporary supply"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS1-C013",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that plants need water to grow, based on everyday experience or simple observation.",
        "example_task": "What do you think will happen if we stop watering this plant?",
        "example_response": "It will get dry and droopy. It might die because plants need water.",
        "common_errors": [
          "Thinking the plant will be fine without water because it gets energy from the sun",
          "Thinking plants drink water the same way people do"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Naming water, light and warmth as things plants need to grow, and describing what happens when one is missing.",
        "example_task": "Name three things a plant needs to grow well. What happens if it does not get enough light?",
        "example_response": "Plants need water, light and warmth. If a plant does not get enough light, it turns yellow and grows thin and tall because it is trying to find the light.",
        "common_errors": [
          "Listing soil as something the plant eats for food rather than a source of water and minerals",
          "Thinking plants need light to germinate (seeds germinate in the dark)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Describing the results of a comparative investigation into plant requirements, using evidence to explain what plants need and why.",
        "example_task": "We grew four identical plants: one with everything it needed, one without water, one without light, and one in a cold place. Describe what happened and explain what this tells us.",
        "example_response": "The plant with everything grew tall and green. The one without water wilted and its leaves dried out. The one without light grew tall but was yellow and weak. The one in the cold grew very slowly. This shows plants need water to stay alive, light to be green and healthy, and warmth to grow well.",
        "common_errors": [
          "Confusing the results of the plant without light (still grows but is yellow) with the plant without water (wilts)",
          "Not linking each specific result to the specific missing requirement"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining that plants need light to make their own food and distinguishing this from germination, which does not require light.",
        "example_task": "A child says 'Seeds need light to grow.' Do you agree? Explain your answer using what we have learned.",
        "example_response": "I partly agree and partly disagree. Seeds do not need light to germinate — they sprout in the dark using the food stored inside the seed. But once the seedling has used up its stored food, it needs light to make its own food and grow green and healthy. So seeds can start to grow without light, but the plant cannot keep growing without it.",
        "common_errors": [
          "Agreeing completely that seeds need light to grow, not distinguishing germination from later growth",
          "Thinking plants get their food from soil rather than making it using light"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS1-C014",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that seeds can grow into new plants and observing the first visible sign of germination (a shoot appearing).",
        "example_task": "We placed bean seeds on wet cotton wool. Look at them today. What has happened to the seeds?",
        "example_response": "The seeds have split open and something white is poking out. A little root is growing down.",
        "common_errors": [
          "Thinking the seed has broken rather than germinated",
          "Not noticing the root because it grows downward into the cotton wool"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing the germination process — the seed takes in water, swells, and produces a root and then a shoot — using the word 'germinate'.",
        "example_task": "Describe what happened to our cress seeds over the last five days. Use the word 'germinate'.",
        "example_response": "The seeds took in water and got bigger. After two days they started to germinate — a tiny root came out first, then a green shoot grew upward. Now the shoots have tiny leaves on top.",
        "common_errors": [
          "Saying the seed 'grew a plant' without describing the stages",
          "Thinking the shoot appears before the root"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining that germination needs water and a suitable temperature, and that the seed contains stored food for the early stages of growth.",
        "example_task": "We set up three groups of seeds: one on wet cotton wool in a warm place, one on dry cotton wool in a warm place, and one on wet cotton wool in a very cold place. Only the first group germinated. Why?",
        "example_response": "Seeds need water and warmth to germinate. The dry seeds could not take in water to start growing. The cold seeds had water but it was too cold for germination to begin. The first group had both water and warmth, so the seeds germinated. The seed has its own food store inside, so it does not need soil or light to start germinating.",
        "common_errors": [
          "Thinking seeds need light to germinate",
          "Thinking seeds need soil to germinate (they need water and warmth, not soil specifically)"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining that a germinating seed is alive but was dormant, and connecting germination to the start of the plant life cycle.",
        "example_task": "Is a dry seed alive, dead or never alive? Explain your thinking. What happens when it germinates?",
        "example_response": "A dry seed is alive but dormant — it is resting and waiting for the right conditions. It is not dead because it can still grow when it gets water and warmth. When it germinates, it wakes up and starts to grow. First a root pushes down to find water, then a shoot pushes up to find light. This is the very beginning of the plant's life cycle — from seed to seedling to mature plant that makes new seeds.",
        "common_errors": [
          "Classifying the dry seed as 'dead' or 'never alive' because it does not look like it is doing anything",
          "Not connecting germination to the broader life cycle concept"
        ]
      }
    ]
  }
]