[
  {
    "concept_id": "SC-KS1-C029",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Naming the four seasons in order, with visual support such as photographs.",
        "example_task": "Look at these four pictures. Can you name each season? Put them in order starting with spring.",
        "example_response": "Spring, summer, autumn, winter.",
        "common_errors": [
          "Putting autumn and winter in the wrong order",
          "Not knowing the name 'autumn' (some children say 'fall')"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing one or two characteristics of each season, such as typical weather or changes to plants.",
        "example_task": "What is the weather usually like in summer? What about winter?",
        "example_response": "In summer it is warm and sunny with long days. In winter it is cold, the days are short, and it might snow or frost.",
        "common_errors": [
          "Thinking it always snows in winter in the UK",
          "Describing idealised seasons from picture books rather than actual UK experience"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Describing the characteristics of all four seasons including weather, day length and changes in the natural world, and explaining that the seasons follow a repeating annual pattern.",
        "example_task": "Describe what happens in the natural world during autumn. How is it different from spring?",
        "example_response": "In autumn, leaves on deciduous trees change colour (yellow, orange, red) and fall off. The days get shorter and cooler. Animals like squirrels collect food for winter. Some birds fly to warmer countries. In spring, it is the opposite — new leaves grow, days get longer and warmer, flowers appear, birds build nests, and baby animals are born. Autumn is when nature prepares for winter; spring is when it wakes up again.",
        "common_errors": [
          "Describing only the weather without mentioning changes in plants and animals",
          "Not recognising autumn and spring as transitional seasons"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining why the seasons follow a repeating pattern and how living things respond to seasonal changes as part of their survival.",
        "example_task": "Why do some birds fly south in autumn and return in spring? How does this link to the seasons?",
        "example_response": "In autumn, the days get shorter and colder in the UK, so there are fewer insects and berries for birds to eat. Some birds like swallows fly south to warmer countries where there is still plenty of food — this is called migration. They return in spring when the UK gets warmer, days get longer, and food becomes plentiful again. The birds follow the seasonal pattern because their survival depends on having enough food, and the seasons affect food supply.",
        "common_errors": [
          "Thinking birds migrate because they do not like cold weather (it is mainly about food supply)",
          "Not connecting the migration pattern to the annual seasonal cycle"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS1-C030",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Describing today's weather using simple words such as sunny, rainy, cloudy, windy, cold or warm.",
        "example_task": "Look out of the window. What is the weather like today?",
        "example_response": "It is cloudy and a bit cold. I can see the wind blowing the trees.",
        "common_errors": [
          "Using only one word to describe the weather when several apply",
          "Describing yesterday's weather instead of today's"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Recording daily weather over a week or more and beginning to notice which types of weather are common in the current season.",
        "example_task": "Look at our weather chart for the last two weeks. What type of weather happened most often?",
        "example_response": "It was cloudy on eight days and rainy on five days. It was only sunny on three days. Cloudy weather was the most common this month.",
        "common_errors": [
          "Not counting accurately from the chart",
          "Saying 'it rained every day' when only some days were rainy"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Describing the typical weather patterns for each UK season, using data from class weather records as evidence.",
        "example_task": "We recorded the weather in September, October and November (autumn). Describe the pattern of autumn weather using our records.",
        "example_response": "In September it was still quite warm with some sunny days. In October it got cooler and we had more rain and wind. By November it was cold, we had some frost in the mornings, and the days were noticeably shorter. The pattern shows that autumn weather gets gradually colder and wetter, with shorter days, as we move towards winter.",
        "common_errors": [
          "Describing single memorable weather events rather than the overall pattern",
          "Not using the class data as evidence for their statements"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Comparing weather across seasons using collected data, distinguishing between typical weather patterns and unusual events, and understanding that weather varies from year to year.",
        "example_task": "In December we had an unusually warm week with temperatures of 14°C. Does this mean winter is not cold? Explain using what you know about seasonal weather patterns.",
        "example_response": "No, one warm week does not change the overall pattern. Winter in the UK is typically cold with short days, frost and sometimes snow. But the weather on any single day or week can be different from what is typical — that is why we record weather over a long time. The warm December week was unusual, not typical. If we look at all our winter records over several months, the overall pattern is still cold. Weather is what happens day to day; the seasonal pattern is what usually happens over many weeks.",
        "common_errors": [
          "Thinking one unusual event disproves the seasonal pattern",
          "Not distinguishing between daily weather and seasonal patterns"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS1-C031",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Noticing from personal experience that it gets dark earlier in winter and stays light later in summer.",
        "example_task": "Think about when you go to bed. Is it dark or light outside at bedtime in summer? What about winter?",
        "example_response": "In summer it is still light at bedtime. In winter it is dark before I go to bed and dark in the morning too.",
        "common_errors": [
          "Not connecting their personal experience to the concept of day length",
          "Thinking bedtime is the same as sunset"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Knowing that days are longer in summer and shorter in winter, and that this pattern changes gradually through the year.",
        "example_task": "Which season has the longest days? Which has the shortest? How do the days change from summer to winter?",
        "example_response": "Summer has the longest days — it stays light until about 9 o'clock at night. Winter has the shortest days — it gets dark by about 4 o'clock in the afternoon. The days get gradually shorter from summer through autumn to winter, then gradually longer again through spring.",
        "common_errors": [
          "Thinking the change happens suddenly rather than gradually",
          "Not knowing approximate times for sunset in different seasons"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Describing the pattern of day length change across the year using data, and connecting longer days with summer warmth and shorter days with winter cold. Safety: never look directly at the Sun.",
        "example_task": "We recorded sunrise and sunset times each month. In June, sunrise was at 5:00am and sunset at 9:15pm. In December, sunrise was at 8:00am and sunset at 3:45pm. How many hours of daylight in each month?",
        "example_response": "In June there were about 16 hours of daylight (5am to 9:15pm). In December there were only about 7 hours and 45 minutes of daylight (8am to 3:45pm). Summer days are more than twice as long as winter days. This connects to why summer is warmer — the sun is up for longer so the ground gets more heat. Remember we must never look directly at the Sun, even when studying day length.",
        "common_errors": [
          "Making calculation errors when working out hours between sunrise and sunset",
          "Not connecting day length to temperature differences between seasons"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Predicting day length patterns for months not yet recorded and explaining how day length affects plants, animals and human activity.",
        "example_task": "If the shortest day is in December and days get longer until June, predict what day length would be like in March (between December and June). How does day length affect nature?",
        "example_response": "March is halfway between December (shortest) and June (longest), so the day length should be roughly in the middle — about 12 hours. This makes sense because in March the sun sets around 6pm. Longer days in spring trigger plants to start growing and flowers to bloom. Birds begin nesting because the longer days give them more time to find food for their chicks. Shorter winter days mean less time for animals to find food, which is why some animals hibernate.",
        "common_errors": [
          "Thinking day length changes at the same rate every month (it changes faster around the equinoxes)",
          "Not connecting day length to animal and plant behaviour"
        ]
      }
    ]
  }
]