[
  {
    "concept_id": "SC-KS2-C019",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Observing and describing the appearance of different rocks, noting visible features like colour, texture and grain size.",
        "example_task": "Look at these three rocks. Describe what each one looks like and feels like.",
        "example_response": "Rock A is grey and smooth with sparkly bits. Rock B is brown and crumbly with tiny holes. Rock C is dark and shiny with no visible grains.",
        "common_errors": [
          "Using only colour to describe rocks",
          "Not touching the rocks to assess texture"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Testing rocks for simple properties — hardness (scratch test), permeability (water absorption), and appearance — and grouping them based on results.",
        "example_task": "Test each rock for hardness (can you scratch it with a nail?), permeability (does it absorb water?) and grain size (can you see individual grains?). Record your results.",
        "example_response": "Granite: very hard (nail cannot scratch it), does not absorb much water, visible crystals of different colours. Sandstone: medium hardness (nail scratches it slightly), absorbs water, visible sand grains. Chalk: soft (nail scratches it easily), absorbs lots of water, no visible grains — smooth and powdery.",
        "common_errors": [
          "Not testing systematically — skipping some tests for some rocks",
          "Confusing grain size with overall rock size"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Grouping rocks based on properties and beginning to understand that the three rock types (igneous, sedimentary, metamorphic) form in different ways.",
        "example_task": "Group these rocks by how they were formed: granite (cooled from melted rock underground), sandstone (layers of sand pressed together), marble (limestone changed by heat and pressure). What are the three rock types called?",
        "example_response": "Granite is igneous — formed when melted rock (magma) cooled slowly underground, which is why it has large crystals you can see. Sandstone is sedimentary — formed when layers of sand were squashed and cemented together over millions of years, which is why you can see the grains and sometimes find fossils in it. Marble is metamorphic — formed when limestone was changed by intense heat and pressure, creating a hard, crystalline rock. The three types are igneous (from heat), sedimentary (from layers) and metamorphic (from change).",
        "common_errors": [
          "Not linking each rock type to its formation process",
          "Thinking all rocks with crystals are the same type"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining how rock properties relate to formation processes, and using properties to identify an unknown rock's likely type.",
        "example_task": "I give you an unknown rock. It has visible layers, contains small shell fossils, and absorbs water when you drip on it. What type of rock is it likely to be? How do you know?",
        "example_response": "It is almost certainly sedimentary. The visible layers show it formed from material deposited in layers over time. The fossils prove it was once soft enough for organisms to be trapped in it — only sedimentary rocks typically contain fossils because igneous rocks form from hot molten material that would destroy organisms, and metamorphic rocks are changed by such intense heat and pressure that fossils are usually destroyed. Absorbing water means it is porous — sedimentary rocks often have gaps between their grains. Using multiple properties (layers, fossils, porosity) together gives a much more reliable identification than any single test alone.",
        "common_errors": [
          "Identifying the rock based on only one property rather than using multiple lines of evidence",
          "Thinking fossils can be found in all rock types"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C020",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that fossils are the remains of animals or plants from long ago that are found in rocks.",
        "example_task": "What is a fossil? Where might you find one?",
        "example_response": "A fossil is the remains of an animal or plant that lived a very long time ago. You find fossils inside rocks.",
        "common_errors": [
          "Thinking fossils are actual bones (they are usually mineralised replacements or impressions)",
          "Not knowing that fossils are very old — millions of years"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing in simple terms how a fossil forms: an organism dies, is buried by sediment, and its remains are slowly replaced by minerals over millions of years.",
        "example_task": "Describe how a dinosaur fossil might have formed. Use the words: died, buried, sediment, minerals, millions of years.",
        "example_response": "A dinosaur died and fell to the ground near a river. Its body was quickly covered by layers of sediment like sand and mud. Over millions of years, more layers built up on top. Very slowly, minerals from water seeped into the bones and replaced them, turning them to stone. The surrounding sediment also hardened into rock. That is how we find dinosaur bones inside rock today.",
        "common_errors": [
          "Thinking the fossil is the original bone rather than a mineral replacement",
          "Not understanding the immense timescale involved"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining the fossilisation process, why only some organisms fossilise (hard parts, rapid burial), and why fossils are found only in sedimentary rock.",
        "example_task": "Why are most fossils of bones, shells and teeth rather than soft body parts? Why do we not find fossils in volcanic rock?",
        "example_response": "Hard parts like bones, shells and teeth fossilise best because soft parts (skin, muscles, organs) decay quickly before they can be preserved. The organism must be buried rapidly — by sediment from a flood or river — before scavengers and decomposers destroy the remains. Fossils are found in sedimentary rock because this forms from layers of sediment that can trap and preserve remains. Volcanic (igneous) rock forms from hot molten magma, which would destroy any organisms. That is why palaeontologists look in sedimentary rock formations to find fossils.",
        "common_errors": [
          "Not explaining why soft parts rarely fossilise",
          "Thinking fossils can form in any type of rock"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining how fossils provide evidence about past environments and the history of life on Earth, linking to the concept of extinction.",
        "example_task": "Fossils of tropical plants have been found in Antarctica. What does this tell us about Earth's history?",
        "example_response": "Finding tropical plant fossils in Antarctica tells us that Antarctica was once much warmer than it is today — warm enough for tropical plants to grow. This could be because Earth's climate was warmer globally, or because the continent was in a different position closer to the equator (continental drift). This is powerful evidence because fossils preserve a record of what lived in a place millions of years ago. It shows that Earth's environments have changed dramatically over geological time. Fossils are like windows into the past — they tell us about ancient climates, extinct species, and how the planet has changed. Without fossils, we would have no way of knowing that Antarctica was once tropical.",
        "common_errors": [
          "Not considering that continents have moved over geological time",
          "Thinking Earth's climate has always been the same as today"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C021",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that soil is found on the ground and that plants grow in it.",
        "example_task": "What is soil? Why do gardeners need it?",
        "example_response": "Soil is the brown, crumbly stuff on the ground. Plants grow in soil because their roots go into it to get water.",
        "common_errors": [
          "Calling soil 'dirt' without recognising it has a specific composition",
          "Thinking soil is just one substance rather than a mixture"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing soil as a mixture of tiny rock pieces and decayed plant and animal material (organic matter).",
        "example_task": "What is soil made from? Name two things you would find in a handful of soil.",
        "example_response": "Soil is made from tiny pieces of rock that have broken down over time, mixed with decayed leaves and other organic matter. You might also find small roots, worms and other tiny living things.",
        "common_errors": [
          "Not knowing that soil contains broken-down rock",
          "Thinking soil is a single substance rather than a mixture"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining that soil forms from weathered rock mixed with organic matter, and that different soils have different properties depending on their composition.",
        "example_task": "We shook three different soils in jars of water and left them overnight. The layers settled differently. What does this tell us?",
        "example_response": "The layers show the different components of each soil. The bottom layer is heavy sand and gravel (rock particles), the middle layer is finer silt, and floating material on top is organic matter (decayed plants). Sandy soil had a thick bottom layer — it drains quickly but does not hold nutrients well. Clay soil had a thick middle layer — it holds water but can become waterlogged. Garden soil had a good mix of all layers plus lots of organic matter — this is why it is good for growing plants.",
        "common_errors": [
          "Not connecting the layers to different soil types",
          "Thinking all soil is the same everywhere"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining the rock cycle connection to soil formation and the role of living organisms in creating and maintaining healthy soil.",
        "example_task": "How do rocks become soil? What role do worms and other organisms play?",
        "example_response": "Rocks break down into soil through weathering — water gets into cracks and freezes, expanding and splitting the rock. Rain dissolves some minerals. Plant roots grow into cracks and push them apart. Over thousands of years, rocks crumble into smaller and smaller pieces. But rock particles alone are not good soil — living organisms are essential. Worms mix organic matter through the soil, create air channels, and their waste is rich in nutrients. Bacteria and fungi decompose dead leaves and animal remains into humus, which holds water and nutrients. A teaspoon of healthy soil contains billions of micro-organisms. Without these living things, soil would just be crushed rock — it would not support plant growth.",
        "common_errors": [
          "Describing only physical weathering without mentioning biological processes",
          "Not recognising the essential role of decomposers in soil formation"
        ]
      }
    ]
  }
]