[
  {
    "concept_id": "SC-KS3-C068",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that all matter is made of tiny particles that are too small to see, and that these particles are always moving.",
        "example_task": "If you could zoom in far enough on a glass of water, what would you see?",
        "example_response": "You would see billions of tiny particles (water molecules) all moving around. The particles are far too small to see with your eyes or even a normal microscope. They are constantly moving and bumping into each other. Even though the water looks still, the particles inside it are always in motion.",
        "common_errors": [
          "Thinking particles in a liquid are stationary because the liquid appears still",
          "Believing there is something (like air or glue) between the particles in a pure substance"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using the particle model to explain properties of solids, liquids, and gases in terms of particle arrangement, spacing, and movement.",
        "example_task": "Use the particle model to explain why you can compress a gas but not a liquid.",
        "example_response": "In a gas, particles are far apart with large spaces between them. They move quickly in random directions. When you compress a gas, you push the particles closer together into the empty space — the gas takes up less volume. In a liquid, particles are close together with very small spaces between them. They can slide over each other but cannot be pushed significantly closer. This is why liquids are virtually incompressible — there is very little empty space to squeeze out. In a solid, particles are even more tightly packed in a regular arrangement and can only vibrate — solids are also incompressible.",
        "common_errors": [
          "Thinking the particles themselves get smaller when a gas is compressed rather than understanding the spaces between them decrease",
          "Not explaining that liquids have particles close together already, which is why they cannot be compressed"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Using the particle model to explain a range of physical phenomena including diffusion, dissolving, and changes of state, and linking particle energy to temperature.",
        "example_task": "If you open a bottle of perfume in one corner of a room, you can eventually smell it on the other side. Explain this using the particle model.",
        "example_response": "The perfume molecules evaporate from the liquid and enter the air as gas particles. These gas particles move rapidly in random directions, colliding with air molecules and bouncing off in new directions. Over time, the random movement causes perfume particles to spread from the area of high concentration (near the bottle) to areas of low concentration (across the room) — this is diffusion. The process is relatively slow despite individual particles moving at hundreds of metres per second because each particle undergoes billions of collisions that send it in random directions, creating a zigzag path. If the room were warmer, diffusion would be faster because particles have more kinetic energy and move faster. If the room were perfectly still with no air currents, diffusion alone would take many minutes — in practice, convection currents in the air speed up the spreading process considerably.",
        "common_errors": [
          "Saying the perfume 'floats' across the room rather than explaining diffusion through random particle motion",
          "Not explaining why diffusion is slow despite individual particles moving quickly (billions of random collisions create a zigzag path)"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluating the strengths and limitations of the particle model, understanding that it is a simplified model, and applying it to unfamiliar contexts.",
        "example_task": "The particle model shows particles as solid spheres with nothing between them. Identify two limitations of this model and explain what a more accurate picture would include.",
        "example_response": "Limitation 1: The model shows particles as solid, rigid spheres — in reality, atoms have internal structure (nucleus, electron cloud) and are mostly empty space. Electrons occupy probability clouds rather than fixed orbits, and the nucleus is approximately 100,000 times smaller than the atom itself. Treating them as solid balls works for explaining bulk properties but fails for understanding chemical bonding, spectroscopy, or nuclear reactions. Limitation 2: The model shows no forces between particles — in reality, intermolecular forces (van der Waals forces, hydrogen bonds, dipole-dipole interactions) exist between particles and are responsible for properties like boiling point, viscosity, and surface tension. Without these forces, no substance could exist as a liquid or solid. A more accurate model would show particles with internal structure, surrounded by force fields that attract at medium range and repel at very short range. However, models are deliberately simplified to be useful — the particle model at KS3 level explains diffusion, gas pressure, and state changes effectively without the complexity of quantum mechanics. All scientific models involve trade-offs between simplicity and accuracy.",
        "common_errors": [
          "Criticising the model without acknowledging why simplification is useful and appropriate at this level",
          "Not identifying intermolecular forces as a key omission that limits the model's ability to explain why substances have different boiling points"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS3-C069",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that matter exists in three main states — solid, liquid, and gas — and identifying everyday examples of each.",
        "example_task": "Give two examples of a solid, a liquid, and a gas.",
        "example_response": "Solids: ice and wood — they have a fixed shape and do not flow. Liquids: water and milk — they flow and take the shape of their container but have a fixed volume. Gases: air and steam — they spread out to fill any space available and have no fixed shape or volume.",
        "common_errors": [
          "Thinking gases have no mass because they are invisible — gases have mass (air has weight)",
          "Classifying powders or sand as liquids because they can be poured — each grain is a solid"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explaining the properties of solids, liquids, and gases using the particle model, including differences in arrangement, spacing, and movement.",
        "example_task": "Draw and describe particle diagrams for a solid, a liquid, and a gas. Explain how particle arrangement causes their different properties.",
        "example_response": "Solid: particles are in a regular, closely packed arrangement. They vibrate about fixed positions but do not move from place to place. This is why solids have a fixed shape and fixed volume — the particles are locked in position. Liquid: particles are close together but in an irregular arrangement. They can slide over each other and move around. This is why liquids flow, take the shape of their container, but keep a fixed volume — particles are still attracted to each other. Gas: particles are far apart with large spaces between them. They move rapidly and randomly in all directions. This is why gases fill any container, can be compressed (large spaces between particles), and have no fixed shape or volume.",
        "common_errors": [
          "Drawing particles of different sizes in different states — the particles are the same; only their arrangement and spacing differ",
          "Not showing movement in solid particle diagrams — solid particles do vibrate about fixed positions"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Explaining density in terms of particle arrangement and using the particle model to explain unusual properties such as ice floating on water.",
        "example_task": "Most substances are denser as solids than as liquids. Water is the opposite — ice floats. Explain why this is unusual and what causes it.",
        "example_response": "In most substances, particles in the solid state are more closely packed than in the liquid state, so the solid is denser and sinks in its own liquid. Water is an unusual exception. In liquid water, water molecules move around and can pack relatively closely. When water freezes, the molecules form a regular crystalline structure held together by hydrogen bonds. This crystal structure is more open (less tightly packed) than liquid water because the hydrogen bonds hold molecules at fixed angles, creating hexagonal spaces. As a result, ice is about 9% less dense than liquid water, so it floats. This has enormous ecological importance: ice forms on the surface of lakes and ponds, insulating the liquid water below and allowing aquatic life to survive through winter. If ice sank, lakes would freeze from the bottom up, killing most aquatic organisms.",
        "common_errors": [
          "Thinking ice floats because it is a solid, without explaining the unusual open crystal structure caused by hydrogen bonding",
          "Not recognising that water's behaviour is an exception to the general rule that solids are denser than their liquid form"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Applying the particle model to explain the behaviour of substances that do not fit neatly into the three-state model, and understanding the concept of a fourth state (plasma).",
        "example_task": "Glass appears to be a solid, but some scientists describe it as a 'supercooled liquid'. Cornflour mixed with water behaves as both a solid and a liquid. Evaluate whether the simple three-state model is sufficient to describe all matter.",
        "example_response": "The three-state model (solid, liquid, gas) is a useful simplification but does not capture all observed behaviour. Glass is an amorphous solid — its particles are arranged irregularly (like a liquid) but are locked in position (like a solid). It has no sharp melting point but softens gradually when heated. This does not fit the particle model's definition of a solid (regular arrangement) or a liquid (particles sliding freely). Cornflour suspension is a non-Newtonian fluid — it flows like a liquid under gentle force but behaves like a solid under sudden impact. Its viscosity changes with applied force, which the simple particle model cannot explain. Additionally, the three-state model omits plasma — the fourth state of matter, in which particles are so energetic that electrons are stripped from atoms, creating a mixture of ions and free electrons. Plasma is actually the most common state of matter in the universe (stars, lightning, neon signs). These examples show that the three-state model is a useful approximation for most everyday situations but becomes inadequate for materials with unusual molecular structures (glass), complex mixtures (non-Newtonian fluids), or extreme temperatures (plasma). Scientific models are always simplifications — their value lies in how well they explain and predict, not in being complete.",
        "common_errors": [
          "Dismissing the three-state model entirely rather than recognising it as a useful simplification with known limitations",
          "Not knowing that plasma is a fourth state of matter and the most abundant state in the universe"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS3-C070",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that gas pushes on the walls of its container and that this push is called gas pressure.",
        "example_task": "What happens if you blow up a balloon too much? Why does it pop?",
        "example_response": "When you blow air into a balloon, the air particles inside push against the walls of the balloon from the inside. This push is called gas pressure. If you blow in too much air, there are so many particles pushing so hard that the balloon cannot stretch any further, and it pops.",
        "common_errors": [
          "Thinking the balloon pops because the air is 'too heavy' rather than because of pressure from particle collisions",
          "Not connecting gas pressure to particles colliding with the container walls"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explaining gas pressure in terms of particle collisions with container walls and understanding how temperature and volume affect pressure.",
        "example_task": "Explain why a sealed container of gas becomes more pressurised when heated.",
        "example_response": "Gas pressure is caused by gas particles colliding with the walls of their container. Each collision exerts a small force on the wall, and billions of collisions per second create a steady pressure. When the gas is heated, the particles gain kinetic energy and move faster. Faster-moving particles collide with the walls more frequently and with greater force. Since the container is sealed (fixed volume), the increased frequency and force of collisions results in higher pressure. This is why aerosol cans carry warnings not to heat them — the pressure inside could build up enough to cause an explosion.",
        "common_errors": [
          "Saying the particles 'expand' when heated rather than explaining they move faster",
          "Not linking both the increased frequency and the increased force of collisions to the pressure increase"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Explaining the relationship between pressure, volume, and temperature using the particle model, and applying this to real-world situations.",
        "example_task": "A diver descends to 30 metres underwater. Explain what happens to the volume of an air bubble released at that depth as it rises to the surface.",
        "example_response": "At 30 metres depth, the water pressure is approximately 4 atmospheres (1 atmosphere from the air above plus approximately 1 atmosphere for every 10 metres of water). This high pressure compresses the air bubble — the gas particles are pushed closer together by the surrounding water pressure, so the bubble is small. As the bubble rises, the water pressure decreases because there is less water above it. With less external pressure, the gas particles push outward more effectively — the bubble expands. At the surface (1 atmosphere), the bubble is approximately four times larger than it was at 30 metres. This is described by Boyle's Law: at constant temperature, pressure and volume are inversely proportional (P₁V₁ = P₂V₂). This is critical for divers — if a diver holds their breath and ascends, the air in their lungs expands, which can cause serious lung injury. Divers must breathe continuously and ascend slowly to allow pressure to equalise.",
        "common_errors": [
          "Not explaining that the volume change is due to the change in external pressure acting on the same number of gas particles",
          "Forgetting that Boyle's Law only applies at constant temperature"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Applying the particle model of gas pressure to explain atmospheric pressure, vacuum systems, and engineering applications, and understanding the quantitative relationship between pressure, volume, and temperature.",
        "example_task": "An aeroplane cabin is pressurised to the equivalent of about 1,800 metres altitude, even when flying at 10,000 metres. Explain why this is necessary and what would happen without pressurisation.",
        "example_response": "Atmospheric pressure at sea level is approximately 101 kPa, caused by the weight of the column of air above pressing down. At 10,000 metres altitude, the atmosphere is much thinner — there are far fewer air molecules per unit volume, so fewer collisions with surfaces, resulting in pressure of only about 26 kPa (roughly a quarter of sea level). At this low pressure, humans cannot absorb enough oxygen because the partial pressure of O₂ is too low to drive adequate diffusion across the alveoli in the lungs (oxygen moves from high to low concentration, and the concentration gradient is insufficient). Additionally, gases dissolved in the blood could come out of solution (similar to the bends in diving), and the pressure difference between body cavities and the external environment could cause tissue damage. Aircraft cabins are therefore pressurised to the equivalent of 1,800 metres (approximately 81 kPa) — high enough for comfortable breathing with adequate oxygen diffusion, but lower than sea level to reduce the structural stress on the fuselage. The fuselage must withstand the pressure difference between inside and outside — this is why aircraft windows are small and round (to distribute stress evenly) and why fuselage metal fatigue is a critical safety concern. If a window or door were to fail at altitude, the rapid decompression would cause the higher-pressure air inside to rush outward — a violent equalisation of pressure that could incapacitate passengers within seconds without supplementary oxygen.",
        "common_errors": [
          "Saying there is 'no air' at high altitude rather than explaining there is less air (lower density, fewer particles, therefore lower pressure)",
          "Not connecting the gas pressure concept to the biological need for adequate partial pressure of oxygen for diffusion in the lungs"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS3-C071",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that matter can change between solid, liquid, and gas states by heating or cooling, and naming these changes.",
        "example_task": "What happens to ice when you heat it? What is this change called?",
        "example_response": "When you heat ice, it turns into liquid water. This change is called melting. If you keep heating the water, it turns into steam (water vapour). This change is called boiling or evaporation. You can also reverse these changes: cooling steam turns it back into water (condensation), and cooling water turns it back into ice (freezing).",
        "common_errors": [
          "Confusing evaporation with boiling — evaporation happens at the surface at any temperature; boiling happens throughout the liquid at a specific temperature",
          "Not knowing the names of all the changes of state (melting, freezing, boiling, condensation, evaporation)"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explaining changes of state using the particle model and understanding that energy is needed to overcome forces between particles.",
        "example_task": "Use the particle model to explain what happens to the particles when ice melts.",
        "example_response": "In ice, particles are arranged in a regular pattern and vibrate about fixed positions. They are held in place by forces of attraction between them. When energy (heat) is transferred to the ice, the particles gain kinetic energy and vibrate more vigorously. At the melting point (0°C for water), the particles have enough energy to overcome some of the forces holding them in the fixed arrangement. They begin to move over and around each other while still remaining close together. The regular arrangement breaks down, and the solid becomes a liquid. The particles have not changed — they are the same water molecules — but their arrangement and movement have changed.",
        "common_errors": [
          "Thinking the particles themselves change or get bigger when heated",
          "Not mentioning that energy is needed to overcome the forces of attraction between particles"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Interpreting heating curves, explaining why temperature remains constant during a change of state, and understanding the energy changes involved.",
        "example_task": "A student heats ice from -10°C until it becomes steam at 110°C. On the heating curve, the temperature stays constant at 0°C and 100°C. Explain why.",
        "example_response": "During heating, the temperature rises as particles gain kinetic energy. At 0°C (melting point), the temperature stops rising even though heating continues. The energy being supplied is now used to break the intermolecular forces holding particles in the solid structure, not to increase their kinetic energy. This energy is called latent heat of fusion. Once all the ice has melted, the temperature rises again as liquid water particles gain kinetic energy. At 100°C (boiling point), the temperature plateaus again — energy is now used to completely separate particles from each other against intermolecular forces (latent heat of vaporisation). This requires more energy than melting because the particles must overcome all remaining intermolecular attractions to become a gas. Once all the water has boiled, the temperature of the steam rises again. The flat sections on the heating curve show that during a change of state, energy input changes the arrangement of particles (potential energy) rather than their speed (kinetic energy).",
        "common_errors": [
          "Not explaining that energy during a change of state goes into breaking intermolecular forces rather than increasing kinetic energy (temperature)",
          "Thinking temperature remains constant because no energy is being supplied, when in fact energy is being supplied but used differently"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Explaining sublimation and deposition, comparing latent heat values for different substances, and evaluating how intermolecular forces determine melting and boiling points.",
        "example_task": "Dry ice (solid CO₂) sublimes directly from solid to gas at -78.5°C without passing through the liquid state at normal atmospheric pressure. Explain why, and contrast this with water.",
        "example_response": "Sublimation occurs when particles in a solid gain enough energy to break free directly into the gas phase, bypassing the liquid state. Whether a substance melts or sublimes depends on the intermolecular forces and the external pressure. CO₂ has weak intermolecular forces (van der Waals forces only) because it is a non-polar molecule. At normal atmospheric pressure (1 atm), the triple point of CO₂ is at 5.1 atm — meaning liquid CO₂ cannot exist below 5.1 atm pressure. At 1 atm, when solid CO₂ is heated, particles gain enough energy to escape the solid lattice directly into the gas phase rather than forming a stable liquid. Water, in contrast, has much stronger intermolecular forces (hydrogen bonds in addition to van der Waals forces). Its triple point is at 0.006 atm, so at normal atmospheric pressure, the liquid phase is stable and water passes through solid → liquid → gas. The strength of intermolecular forces also explains why water has a much higher boiling point (100°C) than would be predicted from its molecular mass alone — hydrogen bonds require significant energy to break. Substances with stronger intermolecular forces generally have higher melting and boiling points because more energy is needed to overcome those forces. This relationship between intermolecular force strength and state-change temperatures is a powerful predictive tool in chemistry.",
        "common_errors": [
          "Thinking sublimation is an unusual phenomenon rather than understanding it is determined by the substance's phase diagram and external pressure",
          "Not connecting the strength of intermolecular forces to the melting and boiling points of different substances"
        ]
      }
    ]
  }
]
