[
  {
    "concept_id": "SC-KS2-C028",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Using a simple given classification key with yes/no questions to identify an organism, with teacher support.",
        "example_task": "Use this key to identify the minibeast you found. Start at question 1: 'Does it have legs?' Follow the arrows.",
        "example_response": "Does it have legs? Yes. Does it have more than 6 legs? No. Does it have wings? Yes. It is a ladybird.",
        "common_errors": [
          "Skipping questions and jumping to an answer",
          "Not reading the questions carefully enough to answer correctly"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using classification keys independently to identify organisms, and beginning to understand that the key uses observable features to narrow down possibilities.",
        "example_task": "Use this branching key to identify five different leaves. For each one, trace your path through the key.",
        "example_response": "Leaf 1: Is it a simple leaf? Yes. Does it have smooth edges? No → lobed edges. Are the lobes rounded? Yes → Oak leaf. I followed the key by looking at the actual leaf each time to answer the question accurately.",
        "common_errors": [
          "Answering questions from memory rather than observing the actual specimen",
          "Getting confused at branches with similar-sounding questions"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Creating their own simple branching key for a given set of organisms, choosing appropriate observable features for the yes/no questions.",
        "example_task": "Create a branching key that could be used to identify these six minibeasts: ant, spider, woodlouse, worm, snail, ladybird.",
        "example_response": "Does it have legs? No → Does it have a shell? Yes → Snail. No → Worm. Yes (has legs) → Does it have more than 6 legs? Yes → Does it have 8 legs? Yes → Spider. No (14 legs) → Woodlouse. No (6 legs) → Does it have spots? Yes → Ladybird. No → Ant.",
        "common_errors": [
          "Using subjective questions ('Is it nice?') rather than observable features",
          "Creating a key that does not successfully distinguish all organisms"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating the effectiveness of a classification key, identifying weaknesses and improving it, and understanding that good keys use unambiguous, observable features.",
        "example_task": "A pupil's key asks 'Is it big?' as the first question. Why is this a poor question? How would you improve the key?",
        "example_response": "'Is it big?' is a poor question because it is subjective — what counts as 'big' depends on who is answering. A spider might seem big to someone afraid of spiders but small compared to a woodlouse. Good key questions must be unambiguous — they should have a clear yes or no answer that everyone would agree on. Better questions use specific, observable features: 'Does it have legs?', 'Does it have more than 6 legs?', 'Is its body segmented?' These are objective and can be checked by observation. A good classification key should work for anyone using it, which means every question must have only one correct answer for each organism.",
        "common_errors": [
          "Not recognising why subjective questions are problematic",
          "Suggesting improvements that are still ambiguous"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C029",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Sorting living things into groups based on one observable feature chosen by the teacher.",
        "example_task": "Sort these animals into two groups: animals with four legs and animals without four legs.",
        "example_response": "Four legs: dog, cat, horse, frog. Not four legs: bird (two legs), fish (no legs), spider (eight legs), snake (no legs).",
        "common_errors": [
          "Placing animals in the wrong group because of incorrect counting",
          "Not knowing that frogs have four legs"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Grouping living things using a criterion they have chosen and explaining why they chose it. Beginning to understand that different criteria create different groupings.",
        "example_task": "Sort these animals into groups using a criterion you choose. Then sort them again using a different criterion.",
        "example_response": "First sort by body covering: fur (dog, rabbit), feathers (robin, owl), scales (fish, snake), no covering (frog, worm). Second sort by diet: herbivores (rabbit, caterpillar), carnivores (owl, spider), omnivores (dog, robin). The groups are different because different criteria give different classifications.",
        "common_errors": [
          "Using the same type of criterion both times",
          "Not recognising that the same animal appears in different groups under different criteria"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Understanding that scientists have agreed on classification systems based on observable characteristics, and that the choice of criteria matters for creating useful groupings.",
        "example_task": "Why is body structure (backbone, body covering, limbs) a more useful way to classify animals than colour?",
        "example_response": "Body structure reveals evolutionary relationships and shared ancestry — animals with backbones (vertebrates) are more closely related to each other than to invertebrates. Body covering (fur, feathers, scales) tells us about the animal's biology and classification group. Colour is not useful because it varies widely within the same species (dogs can be black, brown, white or spotted) and different species can be the same colour (a brown spider and a brown mouse have nothing else in common). Good classification criteria are those that reflect underlying biological relationships, not just superficial appearance.",
        "common_errors": [
          "Thinking classification by appearance (colour, size) is just as valid as structural classification",
          "Not understanding why scientists agree on shared criteria"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining that classification criteria can lead to surprising groupings that challenge everyday assumptions, and that scientific classification is based on evidence, not intuition.",
        "example_task": "A whale lives in the sea and looks like a fish. Why do scientists classify it as a mammal rather than a fish?",
        "example_response": "Scientists classify by biological features, not by habitat or appearance. A whale is a mammal because it breathes air with lungs (not gills), gives birth to live young (not eggs), feeds its babies milk, and has warm blood. These are the defining features of mammals. A fish breathes through gills, is usually cold-blooded, and lays eggs. Whales and fish look similar because they both evolved streamlined bodies for swimming (convergent evolution) — but this is a response to the same environment, not evidence of close relationship. Scientific classification is based on shared biological characteristics, which sometimes means organisms that look similar (whale and shark) are placed in different groups, and organisms that look different (whale and bat) are in the same group. Evidence overrides appearance.",
        "common_errors": [
          "Classifying by habitat rather than biological features",
          "Not understanding convergent evolution (similar appearance from different ancestry)"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C030",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that environments can change and that these changes affect the living things there.",
        "example_task": "What might happen to the animals in a wood if lots of the trees were cut down?",
        "example_response": "The animals might not have places to live or food to eat. Birds would lose their nests.",
        "common_errors": [
          "Thinking the animals would simply move somewhere else without any problem",
          "Not connecting tree loss to loss of food and shelter"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing examples of environmental change, both natural and human-caused, and explaining how they affect living things.",
        "example_task": "Name one natural change and one human-caused change to the environment. How does each affect living things?",
        "example_response": "Natural: seasonal change — in winter, there is less food, so some birds migrate and some mammals hibernate. Human: pollution in a river — chemicals kill fish and other water creatures, breaking the food chain and making the water unsafe for drinking.",
        "common_errors": [
          "Thinking all environmental change is caused by humans",
          "Not explaining the specific effect on living things"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Explaining both positive and negative human impacts on environments, and describing how environmental changes can threaten living things.",
        "example_task": "Describe one positive and one negative impact humans have on the environment. What can we do to protect habitats?",
        "example_response": "Negative: deforestation — cutting down rainforest destroys habitats for thousands of species, reduces the number of trees absorbing carbon dioxide, and can lead to soil erosion. Positive: creating nature reserves — protected areas where wildlife can live without human interference, allowing populations to recover. We can protect habitats by reducing pollution, planting trees, creating wildlife corridors between fragmented habitats, and reducing our use of resources. Small actions matter too — leaving areas of garden wild supports insects and birds.",
        "common_errors": [
          "Listing only negative impacts without any positive ones",
          "Suggesting solutions without explaining how they help"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating the complexity of environmental issues, recognising that solutions involve trade-offs, and using evidence to support arguments about environmental protection.",
        "example_task": "A farmer wants to remove a hedgerow to make a bigger field for crops. An ecologist says the hedgerow should be protected. What arguments might each person make? Is there a compromise?",
        "example_response": "The farmer: a bigger field means more food can be grown, which is important for feeding people. Removing the hedgerow makes farming more efficient with modern machinery. The ecologist: hedgerows are vital habitats for birds, insects, small mammals and plants. They provide food (berries, nectar), nesting sites and corridors connecting larger habitats. Removing them reduces biodiversity and can increase soil erosion. A compromise could be: keep the hedgerow and add a wildlife margin around the field edge — this provides habitat while still allowing productive farming. Some farmers receive environmental payments for maintaining hedgerows. This shows that environmental decisions involve weighing human needs against ecological value, and creative solutions can often satisfy both.",
        "common_errors": [
          "Presenting only one side of the argument",
          "Not recognising that environmental issues involve real trade-offs"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C044",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that different animals grow from babies to adults in different ways, with familiar examples.",
        "example_task": "How does a butterfly grow up differently from a dog?",
        "example_response": "A butterfly starts as an egg, then becomes a caterpillar, then goes into a chrysalis, and comes out as a butterfly. A dog is born as a puppy that looks like a small dog and just grows bigger.",
        "common_errors": [
          "Not recognising that the caterpillar and butterfly are the same organism at different life stages",
          "Thinking all animals grow up the same way"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Describing and comparing the life cycles of mammals, amphibians, insects and birds, using the term metamorphosis for dramatic changes.",
        "example_task": "What is metamorphosis? Which animal groups go through it?",
        "example_response": "Metamorphosis is a dramatic change in body form during an animal's life cycle. Amphibians like frogs go through it — a tadpole (with a tail and gills) transforms into a frog (with legs and lungs). Insects like butterflies also go through it — a caterpillar transforms inside a chrysalis into a butterfly with wings. Mammals and birds do not go through metamorphosis — their young look like smaller versions of the adults and grow gradually.",
        "common_errors": [
          "Thinking only butterflies undergo metamorphosis",
          "Not distinguishing complete metamorphosis (4 stages) from incomplete (3 stages)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Comparing life cycles of specific examples from each group, creating comparison charts, and explaining the advantages of different reproductive strategies.",
        "example_task": "Compare the life cycles of a human, a frog, a butterfly and a chicken. What is similar across all four?",
        "example_response": "Human (mammal): live birth → baby → child → teenager → adult. Extended parental care, slow growth. Frog (amphibian): eggs in water → tadpole → froglet → adult frog. Metamorphosis, many eggs, little parental care. Butterfly (insect): egg → caterpillar → chrysalis → adult butterfly. Complete metamorphosis, many eggs, no parental care. Chicken (bird): egg with hard shell → chick → adult. Egg-laying with incubation and some parental care. Similarities across all four: all start from a fertilised egg, all grow and develop, all eventually reproduce to continue the cycle, and all have a circular life cycle that repeats generation after generation.",
        "common_errors": [
          "Not identifying the similarities alongside the differences",
          "Forgetting that all life cycles are circular"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Explaining why different animals have evolved different life cycle strategies and the advantages of each approach.",
        "example_task": "Frogs lay hundreds of eggs with no parental care. Elephants have one calf and care for it for years. Why have such different strategies evolved? Is one better?",
        "example_response": "Neither is better — both are successful survival strategies adapted to different circumstances. Frogs produce hundreds of eggs because most will not survive — they are eaten by predators or die from environmental conditions. By producing many, the frog ensures at least some survive to adulthood. This is a high-quantity, low-investment strategy. Elephants invest heavily in each offspring — a long pregnancy, years of parental care and teaching. Their large size, intelligence and social groups protect the calf, so most survive. This is a low-quantity, high-investment strategy. Each strategy works in its ecological context. Small, vulnerable animals often produce many offspring; large animals with few predators invest more in fewer offspring. Evolution does not aim for one solution — it produces diverse strategies adapted to diverse environments.",
        "common_errors": [
          "Saying one strategy is 'better' without considering ecological context",
          "Not connecting the strategy to the animal's size, vulnerability and environment"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C045",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that both plants and animals can produce new living things (reproduce).",
        "example_task": "How do new sunflowers grow? How do kittens come to exist?",
        "example_response": "New sunflowers grow from seeds. Seeds come from the flowers on the old sunflower plant. Kittens grow inside their mother cat and are born alive.",
        "common_errors": [
          "Not connecting seeds to the parent plant's flowers",
          "Thinking plants come from the soil rather than from reproduction"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Distinguishing between sexual reproduction (two parents, offspring vary) and asexual reproduction (one parent, offspring identical) with examples from plants.",
        "example_task": "What is the difference between a strawberry plant producing new plants from runners and a strawberry plant producing seeds?",
        "example_response": "Runners are asexual reproduction — only one parent plant is needed and the new plant is identical to the parent. Seeds are sexual reproduction — pollen from one flower fertilises another, so two parents are involved and the offspring can be different from both parents. Gardeners use runners when they want exact copies of a good strawberry variety.",
        "common_errors": [
          "Thinking all reproduction requires two parents",
          "Confusing growth (getting bigger) with reproduction (making new organisms)"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Describing sexual and asexual reproduction in plants with specific examples, and explaining why sexual reproduction produces variation while asexual does not.",
        "example_task": "Give two examples of asexual reproduction in plants. Why does sexual reproduction lead to more variety in offspring?",
        "example_response": "Asexual examples: strawberry runners produce new plants identical to the parent; potato tubers each grow into a new plant that is a clone of the parent. Sexual reproduction produces more variety because the offspring gets a mix of characteristics from two different parents, so each seed can grow into a slightly different plant. This is why apple trees grown from seed rarely produce fruit identical to the parent — they are a new combination. Farmers who want identical plants use cuttings (asexual), while breeders wanting new varieties use pollination (sexual).",
        "common_errors": [
          "Not explaining why asexual offspring are identical (one parent, same genetic information)",
          "Thinking that cuttings will eventually become different from the parent plant"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Comparing sexual and asexual reproduction strategies and explaining the advantages and disadvantages of each for the species.",
        "example_task": "A gardener says 'I always grow my prize roses from cuttings, never from seeds.' Why? What is the disadvantage of this approach?",
        "example_response": "The gardener uses cuttings (asexual reproduction) because each new plant is genetically identical to the prize-winning parent — it guarantees the same flower colour, scent and form. Seeds would produce variation, and the offspring might not have the desirable qualities. The disadvantage is lack of genetic diversity — if a disease attacks one plant, all the identical clones are equally vulnerable and could all be wiped out. Sexually reproduced plants would show variation, meaning some might be resistant and survive. This is why the Irish Potato Famine was so devastating — almost all potatoes were clones of the same variety. In nature, a balance of both strategies is advantageous.",
        "common_errors": [
          "Not identifying that genetic uniformity is both the advantage and the risk",
          "Not giving a real-world example of why lack of variation is dangerous"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C058",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Sorting living things into broad groups — plants and animals — and sorting animals into those with backbones and those without.",
        "example_task": "Sort these into two groups: dog, oak tree, spider, tulip, goldfish, mushroom. What groups did you make?",
        "example_response": "Animals: dog, spider, goldfish. Plants: oak tree, tulip. I was not sure about the mushroom — it looks like a plant but it is not green and does not make its own food.",
        "common_errors": [
          "Putting mushrooms with plants (they are fungi, a separate group)",
          "Thinking all small creatures are insects"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using the formal classification groups: vertebrates (fish, amphibians, reptiles, birds, mammals) and invertebrates, and flowering vs non-flowering plants.",
        "example_task": "A whale lives in the sea and looks like a fish. Why do scientists classify it as a mammal, not a fish?",
        "example_response": "Scientists classify by biological features, not by where an animal lives. A whale is a mammal because it: breathes air with lungs (not gills), is warm-blooded, gives birth to live young, feeds its babies with milk, and has a small amount of hair. Fish breathe through gills, are cold-blooded, lay eggs, and have scales. Even though a whale looks like a fish and lives in water, its internal biology matches the mammal group. Classification is based on body features and biology, not habitat.",
        "common_errors": [
          "Classifying by habitat instead of biological features",
          "Not knowing the key features that define each vertebrate group"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Describing Linnaeus's classification system, classifying organisms using observable characteristics, and explaining why a consistent system is needed.",
        "example_task": "Carl Linnaeus developed a system for classifying living things. Why do we need a formal system? Why is it not enough to just say 'it looks like a fish'?",
        "example_response": "Without a formal system, classification would be based on opinion and appearance, leading to confusion. A whale looks like a fish but is not one — appearances are misleading. Linnaeus created a hierarchical system based on shared biological features, not appearance. This means scientists worldwide can agree on classification regardless of language. The system uses groups within groups: Kingdom → Phylum → Class → Order → Family → Genus → Species. Each level groups organisms by increasingly specific shared features. This system revealed evolutionary relationships: animals in the same group share a common ancestor. Without Linnaeus's system, we would have thousands of local naming systems with no way to communicate about organisms internationally.",
        "common_errors": [
          "Thinking classification is just about naming, not about understanding relationships",
          "Not explaining why biological features are better criteria than appearance or habitat"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Understanding that classification systems evolve with new evidence, and evaluating difficult classification cases.",
        "example_task": "The platypus lays eggs but produces milk. It has a beak like a duck but fur like a mammal. How should it be classified? What does this tell us about classification?",
        "example_response": "The platypus is classified as a mammal — specifically a monotreme (egg-laying mammal). Even though it lays eggs (like reptiles and birds), it has the key mammalian features: it produces milk, has fur, and is warm-blooded. Milk production is considered the defining mammalian feature. The platypus shows that classification is based on the most important shared features, not every feature. It also demonstrates that nature does not always fit neatly into human-made categories. The platypus is thought to have retained some ancient reptilian features (egg-laying) while evolving mammalian ones (milk, fur). This tells us that classification is a human tool for understanding nature — nature itself does not follow neat categories. As scientists discover new species and DNA evidence, classification is updated. The platypus was a genuine puzzle when first discovered in 1798 — scientists thought it was a hoax.",
        "common_errors": [
          "Thinking the platypus must be in a category by itself rather than understanding it fits within mammals",
          "Not recognising that classification systems can change as understanding develops"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS2-C059",
    "levels": [
      {
        "level_number": 1,
        "label": "entry",
        "description": "Knowing that there are tiny living things too small to see without special equipment, and that some cause illness while others are helpful.",
        "example_task": "Why do we wash our hands before eating?",
        "example_response": "We wash our hands to remove tiny living things called germs that are too small to see. If they get into our food and then into our body, they can make us ill.",
        "common_errors": [
          "Thinking germs are visible if you look carefully enough",
          "Thinking all micro-organisms are harmful"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Understanding that micro-organisms include bacteria, viruses and fungi, and that many are helpful — only some cause disease.",
        "example_task": "Give two examples of helpful micro-organisms and two examples of harmful ones.",
        "example_response": "Helpful: yeast (a fungus) is used to make bread rise and to brew drinks. Bacteria in yoghurt turn milk into yoghurt and are also good for digestion. Harmful: some bacteria cause food poisoning if food is not stored or cooked properly. Viruses cause illnesses like colds and flu. Most micro-organisms are harmless or helpful — only a small number cause disease.",
        "common_errors": [
          "Thinking all bacteria are harmful germs",
          "Confusing bacteria and viruses as the same thing"
        ]
      },
      {
        "level_number": 3,
        "label": "expected",
        "description": "Describing the roles of micro-organisms in decomposition, food production and disease, and understanding their place in the classification of living things.",
        "example_task": "What would happen if micro-organisms that cause decomposition suddenly disappeared?",
        "example_response": "If decomposing micro-organisms disappeared, dead plants and animals would pile up and not break down. Nutrients locked in dead matter would not be recycled back into the soil. Plants would eventually run out of nutrients in the soil and stop growing. Food chains would collapse as plants died and animals lost food sources. Fallen leaves, dead trees and animal remains would accumulate indefinitely. Decomposers (bacteria and fungi) are essential recyclers — they break down dead organic matter into simple nutrients that plants can absorb and use. Without them, the nutrient cycle stops and ecosystems collapse. This is why compost bins work: micro-organisms decompose kitchen and garden waste into nutrient-rich compost.",
        "common_errors": [
          "Not connecting decomposition to nutrient recycling",
          "Thinking decomposition is just 'rotting' without understanding its ecological importance"
        ]
      },
      {
        "level_number": 4,
        "label": "greater_depth",
        "description": "Evaluating the balance between beneficial and harmful micro-organisms and understanding why antibiotics work against bacteria but not viruses.",
        "example_task": "A doctor says 'Antibiotics will not help your cold.' Explain why, and why using antibiotics unnecessarily is a problem.",
        "example_response": "Colds are caused by viruses, and antibiotics only kill bacteria. Antibiotics work by attacking parts of bacterial cells (like their cell walls) that viruses do not have — viruses are much simpler structures that live inside our own cells, making them hard to target without harming us. Taking antibiotics for viral infections is a problem because: (1) they will not help the illness; (2) they kill beneficial bacteria in your body (gut bacteria that aid digestion); and (3) most importantly, unnecessary use drives antibiotic resistance. When bacteria are exposed to antibiotics, most die, but a few may survive due to natural variation. These resistant bacteria multiply and spread. Over time, antibiotics stop working against some infections. This is one of the biggest threats to modern medicine — without effective antibiotics, routine surgery and infections become dangerous again.",
        "common_errors": [
          "Thinking antibiotics kill viruses",
          "Not explaining why antibiotic resistance develops through overuse"
        ]
      }
    ]
  }
]