[
  {
    "concept_id": "SC-KS3-C057",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that living things in an environment depend on each other for food, shelter, or other needs.",
        "example_task": "Give an example of two organisms that depend on each other in a woodland.",
        "example_response": "Bees depend on flowers for nectar (food), and flowers depend on bees for pollination (so they can reproduce). Without bees, many flowers would not be pollinated and could not produce seeds. Without flowers, bees would have no food. They depend on each other.",
        "common_errors": [
          "Giving an example of a predator eating prey without explaining the mutual dependence",
          "Thinking organisms only depend on organisms they directly eat"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using ecological vocabulary to describe interdependence, including producers, consumers, and decomposers, and explaining how changes to one species affect others.",
        "example_task": "In a pond ecosystem, the population of frogs decreases due to disease. Explain how this could affect other organisms in the ecosystem.",
        "example_response": "Frogs are consumers that eat insects (including mosquitoes and flies). If the frog population decreases, the insect population would likely increase because fewer are being eaten. This could affect plants that insects feed on or pollinate. Frogs are also prey for organisms like herons and grass snakes — these predators would have less food and their populations might decrease. Fewer dead frogs would mean less food for decomposers. The effects cascade through the ecosystem because organisms are interconnected in food webs, not isolated food chains.",
        "common_errors": [
          "Only describing the effect on the organism directly above or below in the food chain, without recognising cascading effects",
          "Forgetting to consider the effect on decomposers and the recycling of nutrients"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Explaining interdependence through multiple types of ecological relationships including competition, predation, mutualism, and parasitism.",
        "example_task": "Describe three different types of ecological relationship that contribute to interdependence in a woodland ecosystem.",
        "example_response": "1. Predation: owls hunt mice — this controls the mouse population and prevents overgrazing of seeds and seedlings. If owls were removed, mouse numbers would increase, damaging plant populations. 2. Mutualism: mycorrhizal fungi grow on tree roots — the fungi help the tree absorb water and mineral ions from the soil, and the tree provides the fungi with sugars from photosynthesis. Both benefit. 3. Competition: oak trees and beech trees compete for light, water, and soil nutrients. The dominant species affects which other plants can grow in the understorey. All three relationships create interdependence — removing or changing any one species has knock-on effects throughout the community because organisms are linked by multiple types of interaction, not just feeding.",
        "common_errors": [
          "Confusing mutualism (both organisms benefit) with parasitism (one benefits, the other is harmed)",
          "Listing relationships without explaining how they create interdependence or what would happen if the relationship were disrupted"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Analysing the concept of keystone species and trophic cascades, and evaluating how human disruption of interdependence leads to ecosystem collapse.",
        "example_task": "When wolves were reintroduced to Yellowstone National Park in 1995 after 70 years of absence, the entire ecosystem changed — even the rivers shifted course. Explain how one species could have such far-reaching effects.",
        "example_response": "Wolves are a keystone species — their influence on the ecosystem is disproportionately large relative to their numbers. This is an example of a trophic cascade, where changes at the top of the food web cascade downward. Without wolves, elk populations grew unchecked and overgrazed vegetation, especially along riverbanks. Reintroducing wolves reduced elk numbers and, crucially, changed elk behaviour — elk avoided grazing in valleys and near rivers where they were vulnerable to wolf predation. This 'ecology of fear' allowed riverside vegetation (willows, aspens) to regenerate. Regrown vegetation stabilised riverbanks (reducing erosion, literally changing river courses), provided habitat for songbirds and beavers, created shade that cooled water (benefiting fish), and supported insect populations. Beaver dams created new ponds, further diversifying habitats. The cascade continued: more berries for bears, more carrion for scavengers, more insects for birds. This demonstrates that ecosystems are not just collections of species — they are networks of interdependent relationships. Removing a keystone species unravels the network from the top down.",
        "common_errors": [
          "Describing only the direct predator-prey relationship (wolves eat elk) without explaining the cascading effects on vegetation, river morphology, and other species",
          "Not distinguishing between the direct effect (reducing elk numbers) and the behavioural effect (changing where elk graze)"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS3-C058",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that food webs show how different organisms in an ecosystem are connected by what they eat.",
        "example_task": "Look at this food web. If the population of rabbits decreased, which other organisms would be affected?",
        "example_response": "If rabbits decreased, foxes would have less food and their population might decrease. The grass that rabbits eat would grow more because fewer rabbits are eating it. Other animals that foxes also eat (like mice) might be eaten more by foxes instead, so the mouse population could decrease too.",
        "common_errors": [
          "Only identifying the organism directly above the rabbit in the food web without considering wider effects",
          "Thinking the arrows in a food web show 'who eats who' rather than the direction of energy transfer"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Constructing and interpreting food webs using correct terminology including trophic levels, and understanding that food webs are interconnected food chains.",
        "example_task": "Using the organisms grass, grasshopper, mouse, frog, snake, and hawk, construct a food web and identify the trophic levels.",
        "example_response": "Grass is the producer (trophic level 1). Grasshopper and mouse are primary consumers/herbivores (trophic level 2) — both eat grass. Frog is a secondary consumer (trophic level 3) — it eats grasshoppers. Snake is a tertiary consumer (trophic level 3 or 4) — it eats frogs and mice. Hawk is a top predator (trophic level 4 or 5) — it eats snakes and mice. The arrows point from the organism being eaten to the organism eating it, showing the direction of energy transfer. This is a food web rather than a food chain because multiple chains interconnect — for example, the mouse is eaten by both snakes and hawks.",
        "common_errors": [
          "Drawing arrows in the wrong direction — arrows should point from prey to predator, showing energy flow",
          "Assigning a single fixed trophic level to omnivores like the hawk, when it feeds at multiple levels"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Predicting and explaining the effects of population changes in food webs, including indirect effects and time delays.",
        "example_task": "In a marine food web, overfishing removes most of the large predatory fish (tuna, swordfish). Predict and explain the effects on the rest of the food web.",
        "example_response": "Removing top predators would cause a trophic cascade. The populations of smaller fish that tuna and swordfish eat (such as mackerel and herring) would initially increase because predation pressure is reduced. However, the increased population of these smaller fish would then consume more zooplankton, reducing zooplankton numbers. With less zooplankton grazing on phytoplankton, phytoplankton might initially bloom. But the effects are complex — increased small fish populations would eventually face competition for food and could crash. The food web would become less stable because removing top predators reduces the regulation of populations lower down. There would also be time delays — population changes take generations to fully manifest. Real-world examples confirm this: the collapse of cod stocks in the North Atlantic led to an explosion of their prey species (shrimp, crab) and a restructured ecosystem that has not recovered even decades later.",
        "common_errors": [
          "Predicting only the immediate effect on the next trophic level without following the cascade further",
          "Not considering time delays — population changes do not happen instantly"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluating the limitations of food web models, including energy transfer efficiency between trophic levels and the implications for global food security.",
        "example_task": "Only about 10% of the energy at one trophic level is passed to the next. Explain why, and discuss what this means for feeding the world's population.",
        "example_response": "At each trophic level, approximately 90% of energy is lost — used for respiration (life processes, movement, maintaining body temperature), lost as heat to the surroundings, or contained in waste products and uneaten parts (bones, fur). Only about 10% is converted into new biomass that the next consumer can eat. This means a food chain of grass → cow → human transfers only about 1% of the original energy to the human (10% of 10%). If the human ate the grain directly, they would access 10% — ten times more. This has major implications for food security: producing 1 kg of beef requires approximately 8 kg of grain. As the global population grows, shifting towards more plant-based diets would be more energy-efficient. However, food web models are simplifications — they do not account for nutrient cycling by decomposers, the quality of nutrition at different trophic levels (animal protein provides essential amino acids), or the fact that some land is only suitable for grazing, not crops. Real food security solutions must balance energy efficiency with nutritional completeness and land-use practicality.",
        "common_errors": [
          "Stating the 10% rule without explaining where the other 90% goes (respiration, heat, waste)",
          "Drawing overly simplistic conclusions about diet without considering the limitations of the food web model"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS3-C059",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that insects like bees visit flowers and help plants reproduce, and that many of the foods we eat depend on this.",
        "example_task": "Why are bees important for the food we eat?",
        "example_response": "Bees visit flowers to collect nectar and pollen. As they move from flower to flower, they carry pollen between plants, which helps the plants reproduce and produce fruits and seeds. Many of the foods we eat — like apples, strawberries, and tomatoes — depend on bees for pollination. Without bees, these plants would not produce fruit.",
        "common_errors": [
          "Thinking bees deliberately help plants, rather than understanding pollination is a side effect of bees collecting food",
          "Not connecting pollination to the production of specific foods we eat"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explaining the process of insect pollination and understanding that a significant proportion of global food crops depend on insect pollinators.",
        "example_task": "Explain how insect pollination works and why it is important for food security.",
        "example_response": "When an insect such as a bee visits a flower to collect nectar, pollen grains from the anthers (male parts) stick to the insect's body. When the insect visits another flower of the same species, some pollen is transferred to the stigma (female part) — this is pollination. The pollen grain grows a tube to the ovule, enabling fertilisation and seed/fruit production. Approximately 75% of globally important food crops benefit from animal pollination, including fruits (apples, cherries), vegetables (tomatoes, courgettes), nuts (almonds), and crops like coffee and cocoa. Without insect pollinators, the yield of these crops would fall dramatically, threatening food security for billions of people.",
        "common_errors": [
          "Confusing pollination (transfer of pollen to the stigma) with fertilisation (fusion of male and female gametes)",
          "Thinking only bees are pollinators — butterflies, moths, hoverflies, beetles, and some flies are also important pollinators"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Evaluating the threats to pollinators and their consequences for agriculture, distinguishing between insect-pollinated and wind-pollinated crops.",
        "example_task": "Pollinator populations are declining worldwide. Explain the causes and evaluate the potential impact on human food production.",
        "example_response": "Pollinator decline has multiple causes: habitat loss (wildflower meadows converted to farmland), pesticide use (neonicotinoids are particularly harmful to bees — they affect their navigation and reproduction), disease (Varroa mites weaken honeybee colonies), climate change (disrupting the timing between flower blooming and pollinator activity), and monoculture farming (reducing the diversity of food sources for pollinators). The impact on food production would be severe but uneven. Insect-pollinated crops (fruits, nuts, oilseeds, many vegetables) would see dramatic yield decreases — some crops like almonds are almost entirely dependent on honeybee pollination. However, staple crops like wheat, rice, and maize are wind-pollinated and would be unaffected. The economic value of insect pollination globally is estimated at hundreds of billions of pounds annually. The impact would fall disproportionately on diets rich in fruits and vegetables, affecting nutrition and food diversity rather than total calorie production.",
        "common_errors": [
          "Thinking all crops would be equally affected by pollinator decline — wind-pollinated staples like wheat and rice would not be directly affected",
          "Listing threats without explaining the mechanism by which each one harms pollinators"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Analysing the ecological and economic complexities of pollinator conservation, including the limitations of technological alternatives and the co-evolutionary relationships between plants and pollinators.",
        "example_task": "In parts of China, farmers hand-pollinate apple and pear trees because local bee populations have collapsed. Evaluate whether technology could replace natural pollination services globally.",
        "example_response": "Hand-pollination in parts of China demonstrates both the severity of pollinator loss and the difficulty of replacing natural pollination. Hand-pollination is labour-intensive, slow, and expensive — it works for small orchards of high-value crops but is impractical at scale. Technological alternatives being developed include robotic micro-drones and artificial pollination systems, but these face significant challenges: they cannot match the efficiency of millions of insects working simultaneously, they require energy and maintenance, they lack the ability to respond to flower signals (scent, colour, UV patterns that guide real pollinators), and they cannot replicate the co-evolutionary specificity between certain plants and their specialist pollinators. Some orchid species, for example, can only be pollinated by a single insect species — no technology can replicate this relationship. The economic analysis also favours conservation: maintaining healthy pollinator populations through habitat restoration, reduced pesticide use, and wildflower corridors is far cheaper than technological replacement. Furthermore, pollinators provide ecosystem services beyond crop pollination — they sustain wild plant reproduction, which supports entire ecosystems. The pragmatic conclusion is that protecting natural pollinators is both ecologically and economically superior to any technological substitute.",
        "common_errors": [
          "Assuming technology can straightforwardly replace natural pollination without considering scale, cost, and co-evolutionary specificity",
          "Not considering the broader ecosystem services provided by pollinators beyond food crop pollination"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS3-C060",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that living things affect their environment and that the environment affects living things.",
        "example_task": "Give an example of how an animal changes its environment and how the environment affects an animal.",
        "example_response": "A beaver builds a dam across a river, creating a pond — this changes the environment for many other organisms. In the other direction, a cold winter (environment) affects hedgehogs by making them hibernate because there is not enough food available. Living things and their environment affect each other.",
        "common_errors": [
          "Only describing one direction — how the environment affects organisms — without recognising that organisms also change their environment",
          "Giving an example of a human changing the environment without considering non-human organisms"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Distinguishing between biotic and abiotic factors and explaining how organisms both respond to and modify their environment.",
        "example_task": "Explain the difference between biotic and abiotic factors, giving examples of each.",
        "example_response": "Abiotic factors are non-living conditions that affect organisms: temperature, light intensity, water availability, soil pH, wind speed, and mineral content. Biotic factors are living influences: predation, competition, disease, food availability, and pollination. Both types of factor interact — for example, a drought (abiotic) reduces plant growth, which reduces food for herbivores (biotic), which then affects predator populations. Organisms also modify abiotic factors: earthworms aerate soil and improve drainage, trees provide shade that reduces soil temperature and light levels beneath them, and coral builds reefs that create entirely new habitats.",
        "common_errors": [
          "Confusing biotic (living) and abiotic (non-living) factors",
          "Not recognising that organisms actively modify their environment rather than just passively responding to it"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Analysing how human activities affect ecosystems through multiple environmental interactions, and evaluating conservation strategies.",
        "example_task": "Explain how deforestation in a tropical rainforest affects both the local and global environment.",
        "example_response": "Locally, deforestation destroys habitats, causing species loss — many rainforest organisms are specialists that cannot survive elsewhere. The removal of trees means less transpiration, reducing local rainfall and potentially creating drier conditions. Without tree roots, soil erosion increases dramatically — topsoil is washed into rivers, causing silting and reducing water quality. The loss of the canopy exposes the forest floor to direct sunlight, raising soil temperature and killing soil organisms adapted to shade. Globally, deforestation releases stored carbon back into the atmosphere as CO₂ (through burning and decomposition of wood), contributing to climate change. The rainforest is also a major carbon sink — removing it reduces the Earth's capacity to absorb atmospheric CO₂. Reduced biodiversity means the loss of potential medicinal compounds, crop varieties, and genetic resources. The disruption operates through multiple interacting factors — biotic (species loss, food web disruption) and abiotic (climate, soil, water cycle changes) — demonstrating that ecosystems are interconnected systems, not isolated components.",
        "common_errors": [
          "Describing only local effects (habitat loss) without explaining global impacts (carbon release, climate change)",
          "Not connecting deforestation to the water cycle (reduced transpiration means reduced rainfall)"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluating the complexity of environmental interactions, including feedback loops, invasive species dynamics, and the challenges of ecological restoration.",
        "example_task": "When Japanese knotweed was introduced to the UK in the 1850s as an ornamental plant, it had no natural predators. Explain why invasive species are so difficult to control and what this reveals about environmental interactions.",
        "example_response": "Japanese knotweed illustrates several key principles of environmental interactions. In Japan, its growth is controlled by natural herbivores, fungi, and competing plants — it is part of a balanced ecosystem of interactions. In the UK, it has no natural enemies (no co-evolved herbivores or pathogens), giving it a competitive advantage. It grows extremely rapidly (up to 10 cm per day in summer), forms dense stands that shade out native plants, and can regenerate from fragments as small as 0.7 grams — meaning physical removal often spreads it further. This creates a positive feedback loop: as knotweed spreads, it reduces native plant diversity, which reduces habitat for native insects and animals, which further reduces competition and natural control, allowing more spread. Control is difficult because any intervention in one environmental factor affects others. Chemical herbicides damage other plants and can contaminate waterways. Biological control (introducing specialist herbivores from Japan, such as the psyllid Aphalara itadori) risks those organisms affecting non-target species — a lesson learned from disastrous biological control attempts elsewhere (cane toads in Australia). Ecological restoration must account for these interconnected interactions: simply removing the invasive species is not enough if the native community has been so disrupted that the invasive species will simply re-colonise. Successful restoration requires re-establishing the web of environmental interactions — competitors, herbivores, soil microbes — that keep native ecosystems in dynamic balance.",
        "common_errors": [
          "Not explaining why the lack of co-evolved natural enemies gives invasive species a competitive advantage",
          "Suggesting simple removal without recognising the need to restore the full web of ecological interactions"
        ]
      }
    ]
  }
]
