[
  {
    "concept_id": "SC-KS3-C081",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that in a chemical reaction, substances change into new substances that are different from the starting materials.",
        "example_task": "What happens when you toast bread? Is this a chemical reaction?",
        "example_response": "Yes, toasting bread is a chemical reaction. The bread changes colour (turns brown), changes texture (becomes crispy), and changes flavour. These are new properties — you cannot un-toast bread. The heat energy causes the molecules in the bread to rearrange into new substances. This is different from a physical change like melting butter, which can be reversed.",
        "common_errors": [
          "Confusing physical changes (like melting or dissolving) with chemical changes (new substances formed)",
          "Thinking all changes caused by heat are chemical reactions — melting is a physical change"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Understanding that chemical reactions involve atoms being rearranged to form new substances, while the atoms themselves are not changed.",
        "example_task": "Use the idea of atoms being rearranged to explain what happens when hydrogen burns in oxygen to form water.",
        "example_response": "Before the reaction, hydrogen molecules (H₂) and oxygen molecules (O₂) exist separately. During the reaction, the bonds between the hydrogen atoms in H₂ and between the oxygen atoms in O₂ are broken. The atoms then rearrange and new bonds form: each oxygen atom bonds with two hydrogen atoms to form water molecules (H₂O). The hydrogen and oxygen atoms have not been destroyed or changed — they have been rearranged into a new combination. The new substance (water) has completely different properties from the original elements.",
        "common_errors": [
          "Thinking atoms are broken apart or destroyed during reactions — atoms are rearranged, not destroyed",
          "Confusing atoms with molecules — H₂ is a molecule containing two hydrogen atoms"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Distinguishing chemical reactions from physical changes using multiple lines of evidence, and explaining bond breaking and forming as the mechanism of reaction.",
        "example_task": "How can you tell whether a change is a chemical reaction or a physical change? List the key indicators.",
        "example_response": "A chemical reaction produces one or more new substances with new properties. Key indicators: (1) colour change (not caused by mixing) — e.g., iron turning orange-brown when rusting; (2) gas production — bubbles or fizzing, e.g., acid reacting with metal; (3) temperature change — exothermic (gets hotter) or endothermic (gets cooler) without external heating/cooling; (4) precipitate formation — a solid forms from two solutions; (5) light or sound produced — e.g., burning magnesium produces bright light; (6) irreversibility — the change is difficult or impossible to reverse. At the atomic level, a chemical reaction involves breaking bonds in the reactants (which requires energy) and forming new bonds in the products (which releases energy). The net energy change determines whether the reaction is exothermic or endothermic. Physical changes do not involve bond breaking/forming between atoms — only changes in arrangement or state.",
        "common_errors": [
          "Thinking a single indicator (like a colour change) always proves a chemical reaction — dissolving can also cause colour change",
          "Not understanding that bond breaking requires energy input and bond forming releases energy"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Explaining reaction mechanisms at the atomic level, understanding activation energy, and evaluating the distinction between chemical and nuclear reactions.",
        "example_task": "In a chemical reaction, bonds are broken (requiring energy) and new bonds are formed (releasing energy). Explain why some reactions need an initial input of energy to start, even though the overall reaction releases energy.",
        "example_response": "All chemical reactions require an initial input of energy to break the bonds in the reactant molecules — this is the activation energy. Even in highly exothermic reactions (like combustion), the reactant bonds must be broken before new, stronger bonds can form in the products. A match must be struck to start a fire because the initial heat provides the activation energy to break bonds in the fuel and oxygen molecules. Once these initial bonds are broken and new bonds form, the energy released by forming product bonds exceeds the energy needed to continue breaking reactant bonds, so the reaction sustains itself. Catalysts work by providing an alternative reaction pathway with lower activation energy — the same overall energy change occurs, but less initial energy is needed. This is fundamentally different from nuclear reactions, where the nuclei of atoms themselves are changed (fission or fusion), releasing millions of times more energy. In chemical reactions, nuclei are unchanged — only the electrons in bonds are rearranged. This distinction between chemical reactions (electron rearrangement) and nuclear reactions (nuclear change) is one of the most important boundaries in science.",
        "common_errors": [
          "Thinking exothermic reactions do not need any energy input — all reactions require activation energy to start",
          "Confusing catalysts with energy sources — catalysts lower activation energy but do not provide energy"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS3-C082",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that chemical reactions can be written as word equations showing what reacts and what is produced.",
        "example_task": "Write a word equation for magnesium burning in oxygen.",
        "example_response": "Magnesium + oxygen → magnesium oxide. The arrow means 'reacts to form'. Magnesium and oxygen are the reactants (starting materials). Magnesium oxide is the product (what is made). The arrow is not an equals sign — it shows the direction of the reaction.",
        "common_errors": [
          "Using an equals sign instead of an arrow — the arrow shows a reaction, not a mathematical equation",
          "Writing the products on the left and reactants on the right"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writing symbol equations for simple reactions and understanding that equations must be balanced to show conservation of mass.",
        "example_task": "Write a balanced symbol equation for magnesium reacting with hydrochloric acid.",
        "example_response": "Word equation: magnesium + hydrochloric acid → magnesium chloride + hydrogen. Symbol equation: Mg + 2HCl → MgCl₂ + H₂. To balance: check each element — Mg: 1 on each side (balanced). H: 2 on left (2HCl), 2 on right (H₂) (balanced). Cl: 2 on left (2HCl), 2 on right (MgCl₂) (balanced). The equation is balanced because the number of each type of atom is the same on both sides, reflecting conservation of mass. The coefficient 2 before HCl means two molecules of hydrochloric acid are needed.",
        "common_errors": [
          "Changing subscripts instead of coefficients to balance — changing subscripts changes the substance (HCl₂ is not the same as 2HCl)",
          "Forgetting to balance all elements, not just the obvious ones"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Balancing more complex equations, adding state symbols, and interpreting what balanced equations tell us about the quantities of substances involved.",
        "example_task": "Balance the following equation and add state symbols: Fe₂O₃ + C → Fe + CO₂",
        "example_response": "Balancing: Start with Fe — 2 on left (Fe₂O₃), so need 2 on right: 2Fe. Now O — 3 on left (Fe₂O₃), need to check right. CO₂ has 2 oxygens. If we have 3CO₂ that gives 6 oxygens — too many. Let us balance C first: with 3CO₂ we need 3C. Check: 2Fe₂O₃ + 3C → 4Fe + 3CO₂? Left: 4 Fe, 6 O, 3 C. Right: 4 Fe, 6 O, 3 C. Balanced! With state symbols: 2Fe₂O₃(s) + 3C(s) → 4Fe(s) + 3CO₂(g). State symbols: (s) = solid, (l) = liquid, (g) = gas, (aq) = aqueous solution. This equation tells us quantitative information: 2 formula units of iron oxide react with 3 atoms of carbon to produce 4 atoms of iron and 3 molecules of carbon dioxide. This is the reaction used in blast furnaces to extract iron from its ore using carbon (coke) as the reducing agent.",
        "common_errors": [
          "Not checking that ALL elements balance after adjusting coefficients",
          "Forgetting that state symbols indicate the physical state of each substance under the reaction conditions"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Using balanced equations to calculate reacting masses, understanding the mole concept in relation to equations, and recognising that equations encode both qualitative and quantitative information.",
        "example_task": "The equation 2Mg + O₂ → 2MgO tells us that 2 atoms of magnesium react with 1 molecule of oxygen. Using relative atomic masses (Mg = 24, O = 16), calculate the mass of magnesium oxide produced when 4.8 g of magnesium burns completely.",
        "example_response": "From the equation: 2Mg + O₂ → 2MgO. Relative masses: 2 × 24 = 48 g of Mg reacts with 32 g of O₂ to produce 2 × (24+16) = 80 g of MgO. So 48 g Mg → 80 g MgO. We have 4.8 g Mg (which is 48/10 = one-tenth of the equation amount). Therefore MgO produced = 80/10 = 8.0 g. Check with conservation of mass: 4.8 g Mg + 3.2 g O₂ = 8.0 g MgO (4.8 + 3.2 = 8.0). The balanced equation is essentially a recipe: it tells us the exact proportions in which substances react and are produced. In industry, this is critical for calculating how much raw material is needed and how much product to expect. The gap between calculated and actual yield (percentage yield) indicates losses during the process — an important economic consideration.",
        "common_errors": [
          "Not using the balanced equation ratios correctly — the ratio of moles (or formula units) is the key to the calculation",
          "Forgetting to check the answer against conservation of mass"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS3-C083",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that there are different types of chemical reaction and that burning (combustion) is one type.",
        "example_task": "What is combustion? Give an everyday example.",
        "example_response": "Combustion means burning. It is a chemical reaction where a substance reacts with oxygen and releases energy as heat and light. An everyday example is burning natural gas on a cooker — the methane in the gas reacts with oxygen in the air to produce carbon dioxide and water vapour, releasing heat for cooking.",
        "common_errors": [
          "Thinking combustion only produces flames — slow combustion (like rusting) has no flame",
          "Not mentioning that oxygen is always needed for combustion"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Identifying and describing combustion, thermal decomposition, oxidation, and displacement reactions with examples.",
        "example_task": "What is the difference between combustion and thermal decomposition?",
        "example_response": "Combustion is a reaction with oxygen that releases energy. Example: methane + oxygen → carbon dioxide + water (+ energy). It requires two reactants (fuel and oxygen). Thermal decomposition is the breakdown of a single substance by heat alone. Example: copper carbonate → copper oxide + carbon dioxide. Only one reactant is needed — it breaks down into simpler substances when heated. Copper carbonate is green; when heated, it turns black (copper oxide) and produces a gas (CO₂). Thermal decomposition does not involve oxygen as a reactant.",
        "common_errors": [
          "Confusing thermal decomposition with burning — thermal decomposition breaks down one substance; burning requires oxygen",
          "Thinking thermal decomposition means the substance melts — melting is a physical change, thermal decomposition is a chemical change"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Explaining oxidation and reduction in displacement reactions, and predicting products using knowledge of the reactivity series.",
        "example_task": "When iron is added to copper sulfate solution, the solution changes from blue to green and brown copper appears. Write the equation and explain what has happened in terms of oxidation and reduction.",
        "example_response": "Fe(s) + CuSO₄(aq) → FeSO₄(aq) + Cu(s). Iron is more reactive than copper, so it displaces copper from the solution. Iron has been oxidised — it has lost electrons and formed Fe²⁺ ions, going into solution (this is why the solution turns green, as iron sulfate solution is green). Copper has been reduced — Cu²⁺ ions have gained electrons and been deposited as solid copper metal on the iron (the brown coating). Oxidation and reduction always happen together — this is called a redox reaction. You can predict this will happen because iron is above copper in the reactivity series — a more reactive metal will always displace a less reactive metal from a solution of its salt.",
        "common_errors": [
          "Forgetting that oxidation and reduction always occur together — you cannot have one without the other",
          "Predicting a reaction will occur when the added metal is less reactive than the metal in solution — a less reactive metal cannot displace a more reactive one"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Classifying unfamiliar reactions by type, explaining why certain reaction types are important industrially, and understanding how energy changes relate to reaction type.",
        "example_task": "When ammonium dichromate is heated, it decomposes vigorously, producing nitrogen gas, water vapour, and chromium(III) oxide — it resembles a miniature volcano. Classify this reaction and explain why it is so vigorous.",
        "example_response": "This is a thermal decomposition reaction — a single compound breaks down when heated. The equation is: (NH₄)₂Cr₂O₇ → N₂ + 4H₂O + Cr₂O₃. The vigour is explained by two factors: (1) the reaction is exothermic — once initiated by heat, the energy released sustains and accelerates the decomposition (it is self-propagating), and (2) a large volume of gas is produced (nitrogen and steam), which causes the dramatic expansion that resembles a volcanic eruption. This reaction also involves internal redox: the nitrogen in the ammonium ion is oxidised (from -3 to 0 oxidation state) while the chromium is reduced (from +6 to +3). The different reaction types are not always distinct — this single reaction is simultaneously a decomposition and a redox reaction. Understanding reaction types is industrially vital: thermal decomposition of limestone (CaCO₃ → CaO + CO₂) is one of the oldest and most important industrial processes, producing quicklime for cement, steel-making, and agriculture. Displacement reactions are used in metal extraction. Combustion reactions power vehicles and generate electricity. Each type has characteristic energy profiles and practical applications.",
        "common_errors": [
          "Classifying a reaction as only one type when it may exhibit characteristics of multiple types simultaneously",
          "Not explaining the vigour in terms of both the exothermic nature and the gas production"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS3-C084",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that acids taste sour and can be dangerous, while alkalis are the chemical opposite and are often found in cleaning products.",
        "example_task": "Name two acids and two alkalis you might find at home.",
        "example_response": "Acids: lemon juice (citric acid) and vinegar (ethanoic acid) — these taste sour. Alkalis: oven cleaner (sodium hydroxide) and bleach (sodium hypochlorite) — these feel slippery. Strong acids and alkalis can be corrosive and dangerous, but weak acids like those in food are safe.",
        "common_errors": [
          "Thinking all acids are dangerous — many are safe (citric acid in lemons, ethanoic acid in vinegar)",
          "Confusing acids and alkalis — acids are sour, alkalis are bitter and slippery"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Understanding that acids produce hydrogen ions in water and alkalis produce hydroxide ions, and that neutralisation occurs when they react.",
        "example_task": "What happens when an acid reacts with an alkali? Write a general equation.",
        "example_response": "When an acid reacts with an alkali, they neutralise each other, producing a salt and water. General equation: acid + alkali → salt + water. For example: hydrochloric acid + sodium hydroxide → sodium chloride + water (HCl + NaOH → NaCl + H₂O). In water, the acid produces hydrogen ions (H⁺) and the alkali produces hydroxide ions (OH⁻). During neutralisation, H⁺ + OH⁻ → H₂O — the ions combine to form water, which is neutral.",
        "common_errors": [
          "Thinking neutralisation always produces table salt (NaCl) — the specific salt depends on the acid and alkali used",
          "Not understanding that neutralisation is essentially H⁺ ions from the acid combining with OH⁻ ions from the alkali"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Predicting the salt produced from a given acid-alkali combination and explaining practical applications of neutralisation.",
        "example_task": "Predict the salt produced when sulfuric acid reacts with potassium hydroxide. Explain the naming rule.",
        "example_response": "Sulfuric acid + potassium hydroxide → potassium sulfate + water. H₂SO₄ + 2KOH → K₂SO₄ + 2H₂O. The naming rule: the metal comes from the alkali (potassium), and the type of salt comes from the acid — hydrochloric acid produces chlorides, sulfuric acid produces sulfates, nitric acid produces nitrates. Practical applications: antacid tablets neutralise excess stomach acid (HCl) with bases like magnesium hydroxide or calcium carbonate; farmers add lime (calcium hydroxide) to acidic soil to neutralise it for better crop growth; wastewater treatment uses neutralisation to bring effluent to safe pH before discharge.",
        "common_errors": [
          "Not knowing which acid produces which type of salt — HCl → chloride, H₂SO₄ → sulfate, HNO₃ → nitrate",
          "Forgetting to balance the equation — sulfuric acid is diprotic (two H⁺ ions) so needs 2 moles of KOH"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Distinguishing between strong and weak acids, concentrated and dilute acids, and evaluating pH in terms of hydrogen ion concentration.",
        "example_task": "Hydrochloric acid (HCl) and ethanoic acid (CH₃COOH) can both be at the same concentration, but HCl is a strong acid and ethanoic acid is a weak acid. Explain the difference and how it affects pH.",
        "example_response": "The distinction between strong and weak is about dissociation, not concentration. A strong acid (like HCl) fully dissociates in water — every HCl molecule splits into H⁺ and Cl⁻ ions. A weak acid (like ethanoic acid) only partially dissociates — most molecules remain intact as CH₃COOH, with only a small fraction splitting into H⁺ and CH₃COO⁻ ions. At the same concentration (e.g., 1 mol/dm³), HCl has a much higher H⁺ ion concentration than ethanoic acid, so HCl has a lower pH. This is separate from concentration, which describes how much acid is dissolved per unit volume. You can have concentrated weak acid (lots of ethanoic acid, still only partially dissociated) or dilute strong acid (a little HCl, but fully dissociated). A concentrated weak acid might have a similar pH to a dilute strong acid, but they would behave differently in reactions — the concentrated weak acid has a larger reserve of undissociated molecules that can dissociate as H⁺ ions are used up, giving it a buffering capacity. This distinction is crucial in biology (blood is buffered by weak acid/conjugate base systems) and in industry (choosing the right acid for the right application).",
        "common_errors": [
          "Confusing strong/weak (degree of dissociation) with concentrated/dilute (amount per volume)",
          "Thinking a weak acid is always less dangerous than a strong acid — a concentrated weak acid can still cause burns"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS3-C085",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that the pH scale runs from 0 to 14, with acids below 7, neutral at 7, and alkalis above 7.",
        "example_task": "What pH number would you expect for lemon juice? What about for soapy water?",
        "example_response": "Lemon juice is acidic, so its pH would be below 7 — about pH 2-3. Soapy water is alkaline, so its pH would be above 7 — about pH 9-10. Pure water is neutral at pH 7. The lower the pH number, the more acidic the substance. The higher the number, the more alkaline.",
        "common_errors": [
          "Thinking pH 0 means 'no acid' — pH 0 is extremely acidic",
          "Confusing the direction of the scale — lower numbers are more acidic, not less acidic"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Using indicators and pH meters to measure acidity, and understanding the colour changes of universal indicator across the pH range.",
        "example_task": "How does universal indicator help you measure pH?",
        "example_response": "Universal indicator is a mixture of dyes that changes colour depending on the pH of the solution. It produces a range of colours: red (pH 1-2, strongly acidic), orange (pH 3-4), yellow (pH 5-6, weakly acidic), green (pH 7, neutral), blue (pH 8-9, weakly alkaline), and purple (pH 12-14, strongly alkaline). You add a few drops to the solution and compare the colour to a pH colour chart. For more precise measurements, a pH meter (electronic probe) gives a numerical reading. Litmus paper is simpler but less informative — it only tells you acid (red) or alkali (blue), not the specific pH.",
        "common_errors": [
          "Thinking universal indicator only shows 'acid' or 'alkali' like litmus — it shows a range of pH values through colour",
          "Not using a colour chart to determine pH — describing the colour without matching it to a number"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Explaining the pH scale in terms of hydrogen ion concentration and understanding that it is a logarithmic scale.",
        "example_task": "A solution at pH 3 has 10 times more hydrogen ions than a solution at pH 4. Explain what this means for the pH scale.",
        "example_response": "The pH scale is logarithmic — each step represents a tenfold change in hydrogen ion concentration. A solution at pH 3 has 10 times more H⁺ ions per unit volume than one at pH 4. A solution at pH 2 has 100 times more H⁺ ions than pH 4 (10 × 10). This means the difference between pH 1 and pH 7 is not just 6 units — it represents a 1,000,000-fold (10⁶) difference in hydrogen ion concentration. This logarithmic nature means small changes in pH represent large changes in acidity. In biological systems, blood pH is maintained at approximately 7.35-7.45 — a shift of even 0.3 pH units (to 7.0 or 7.7) can be life-threatening because it represents a doubling or halving of H⁺ concentration, disrupting enzyme function and metabolic processes.",
        "common_errors": [
          "Thinking pH is a simple linear scale where each unit represents the same change",
          "Not realising that a change from pH 3 to pH 1 represents a 100-fold increase in H⁺ concentration, not just a doubling"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Calculating hydrogen ion concentration from pH, understanding the pH of strong and weak acids at the same concentration, and evaluating pH in industrial and environmental contexts.",
        "example_task": "Acid rain has a pH of approximately 4. Normal rain has a pH of approximately 5.6. How many times more acidic is acid rain than normal rain, and why is normal rain not pH 7?",
        "example_response": "Since the pH scale is logarithmic, a difference of 1.6 pH units means acid rain has approximately 10^1.6 ≈ 40 times more H⁺ ions than normal rain. Normal rain is not pH 7 because atmospheric CO₂ dissolves in rainwater to form carbonic acid (H₂CO₃): CO₂ + H₂O → H₂CO₃. This weak acid gives normal, unpolluted rain a natural pH of about 5.6. Acid rain (pH < 5.0) is caused by additional pollutants: sulfur dioxide (from burning fossil fuels) dissolves to form sulfuric acid (SO₂ + H₂O + ½O₂ → H₂SO₄), and nitrogen oxides form nitric acid (2NO₂ + H₂O → HNO₃ + HNO₂). The environmental damage from acid rain is significant: it acidifies lakes and rivers (killing fish and aquatic organisms), damages tree foliage (leaching essential minerals from leaves and soil), corrodes limestone buildings and monuments, and depletes soil nutrients. The 40-fold increase in acidity may sound modest, but because the pH scale is logarithmic, this represents a substantial chemical change. International efforts to reduce SO₂ and NOₓ emissions (like the Clean Air Act and catalytic converters) have significantly reduced acid rain in many regions, demonstrating that environmental damage is reversible when emissions are controlled.",
        "common_errors": [
          "Not converting the pH difference to a fold-change in H⁺ concentration using the logarithmic relationship",
          "Thinking normal rain should be pH 7 — the natural dissolution of CO₂ makes it slightly acidic"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS3-C086",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that some metals fizz when placed in acid, producing a gas.",
        "example_task": "What happens when you put a piece of magnesium ribbon in dilute acid?",
        "example_response": "The magnesium fizzes vigorously. Bubbles of gas are produced and the magnesium gradually dissolves and disappears. The gas produced is hydrogen. The liquid remaining is a salt solution.",
        "common_errors": [
          "Not knowing that the gas produced is hydrogen",
          "Thinking the metal disappears completely — it reacts to form a dissolved salt"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writing word and symbol equations for acid-metal reactions and testing for hydrogen gas.",
        "example_task": "Write the word equation for zinc reacting with hydrochloric acid. How would you test the gas produced?",
        "example_response": "Zinc + hydrochloric acid → zinc chloride + hydrogen. Zn + 2HCl → ZnCl₂ + H₂. To test for hydrogen: collect the gas in a test tube, bring a burning splint to the mouth of the tube — hydrogen burns with a squeaky pop. The general pattern is: metal + acid → salt + hydrogen. The name of the salt depends on the acid: hydrochloric acid → chloride, sulfuric acid → sulfate.",
        "common_errors": [
          "Confusing the squeaky pop test for hydrogen with the relighting splint test for oxygen",
          "Not knowing the general pattern: metal + acid → salt + hydrogen"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Predicting whether a metal will react with an acid based on its position in the reactivity series, and explaining the reaction in terms of electron transfer.",
        "example_task": "Copper is placed in dilute hydrochloric acid. Predict what will happen and explain why.",
        "example_response": "No reaction will occur. Copper is below hydrogen in the reactivity series, which means it is less reactive than hydrogen. For a metal to react with an acid, it must be more reactive than hydrogen — it must be able to displace hydrogen from the acid by donating electrons to H⁺ ions. Copper cannot do this because its atoms hold their electrons more tightly than hydrogen. In contrast, metals above hydrogen in the reactivity series (like magnesium, zinc, iron) will react because they can lose electrons more easily: Mg → Mg²⁺ + 2e⁻, and the electrons are transferred to H⁺ ions: 2H⁺ + 2e⁻ → H₂. This is why gold and platinum are unreactive — they are at the bottom of the reactivity series and cannot displace hydrogen from any acid (except very strong oxidising acids like aqua regia).",
        "common_errors": [
          "Predicting copper will react with acid — copper, silver, and gold do not react with dilute acids",
          "Not linking the reactivity series to electron transfer — more reactive metals lose electrons more easily"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Explaining reaction rates in acid-metal reactions, designing fair tests to investigate factors affecting rate, and connecting to industrial applications.",
        "example_task": "Magnesium reacts much more vigorously with acid than iron does. Explain why, and describe how you would investigate the effect of acid concentration on reaction rate.",
        "example_response": "Magnesium is higher in the reactivity series than iron — its atoms lose electrons more easily and more rapidly. This means the rate of electron transfer to H⁺ ions is faster, producing hydrogen gas more quickly (more vigorous fizzing). To investigate the effect of acid concentration: react identical pieces of magnesium ribbon with hydrochloric acid at different concentrations (0.5M, 1.0M, 1.5M, 2.0M). Control variables: same length/mass of magnesium, same volume of acid, same temperature, same surface area of magnesium. Measure either the volume of hydrogen gas produced over time (using a gas syringe) or the time taken for the magnesium to dissolve completely. I predict that higher acid concentration increases the reaction rate because there are more H⁺ ions per unit volume, so collisions between H⁺ ions and the metal surface are more frequent. Plotting volume of gas against time gives a curve — the initial gradient represents the initial rate. This collision theory principle is applied industrially in metal processing: pickling (cleaning metal surfaces with acid) uses optimised acid concentrations and temperatures to maximise cleaning rate while minimising metal loss.",
        "common_errors": [
          "Not controlling surface area of the metal — a powder reacts faster than a ribbon due to greater surface area",
          "Explaining rate differences only in terms of reactivity without connecting to collision theory (frequency of collisions between acid particles and metal surface)"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS3-C087",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that an acid and an alkali react together to cancel each other out, producing a neutral substance.",
        "example_task": "What happens when you mix an acid with an alkali?",
        "example_response": "The acid and alkali react together and cancel each other out. This is called neutralisation. The resulting mixture is less acidic and less alkaline — it moves towards neutral (pH 7). The reaction produces a salt and water.",
        "common_errors": [
          "Thinking acids and alkalis are always dangerous when mixed — the products (salt and water) are usually safe",
          "Not knowing that the process is called neutralisation"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Writing equations for neutralisation reactions and predicting the salt formed from specific acid-alkali combinations.",
        "example_task": "Write the word and symbol equations for the reaction between nitric acid and calcium hydroxide.",
        "example_response": "Word equation: nitric acid + calcium hydroxide → calcium nitrate + water. Symbol equation: 2HNO₃ + Ca(OH)₂ → Ca(NO₃)₂ + 2H₂O. The salt name: calcium comes from the alkali (calcium hydroxide), nitrate comes from the acid (nitric acid → nitrate). To balance: calcium hydroxide has 2 OH groups, so needs 2 molecules of nitric acid, producing 2 molecules of water.",
        "common_errors": [
          "Not recognising that nitric acid produces nitrates (not nitrides or nitrites)",
          "Forgetting to balance — Ca(OH)₂ needs 2HNO₃ because it has two hydroxide groups"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Carrying out neutralisation titrations to determine the exact point of neutralisation, and explaining practical applications.",
        "example_task": "Describe how you would carry out a titration to find the exact volume of sodium hydroxide needed to neutralise 25 cm³ of hydrochloric acid.",
        "example_response": "Pour exactly 25 cm³ of hydrochloric acid into a conical flask using a pipette. Add a few drops of indicator (phenolphthalein — colourless in acid, pink in alkali, or methyl orange — red in acid, yellow in alkali). Fill a burette with sodium hydroxide solution and record the starting volume. Add the sodium hydroxide slowly, swirling the flask after each addition. Near the endpoint, add drop by drop. The endpoint is reached when the indicator permanently changes colour — this is when the acid has been exactly neutralised. Record the final burette reading and calculate the volume of NaOH used. Repeat the titration at least twice more to get concordant results (within 0.1 cm³). The mean titre gives the accurate volume needed. This technique is used in quality control (checking the concentration of acids in industrial products), environmental monitoring (determining acid levels in river water), and pharmaceutical manufacturing.",
        "common_errors": [
          "Adding the alkali too quickly near the endpoint, overshooting the neutralisation point",
          "Not repeating the titration to get concordant results — a single result is not reliable"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Using titration results to calculate unknown concentrations, understanding the mole ratios involved, and evaluating the choice of indicator.",
        "example_task": "In a titration, 20.0 cm³ of 0.10 mol/dm³ NaOH exactly neutralises 25.0 cm³ of HCl. Calculate the concentration of the HCl. Why would phenolphthalein be a better indicator choice than universal indicator for this titration?",
        "example_response": "Moles of NaOH = concentration × volume = 0.10 × (20.0/1000) = 0.002 mol. From the equation NaOH + HCl → NaCl + H₂O, the mole ratio is 1:1, so moles of HCl = 0.002 mol. Concentration of HCl = moles/volume = 0.002/(25.0/1000) = 0.080 mol/dm³. Phenolphthalein is better than universal indicator for this titration because it has a sharp, clear colour change at a specific pH (colourless below pH 8.3, pink above) — you can identify the endpoint precisely to one drop. Universal indicator changes colour gradually across a range of pH values, making it impossible to identify the exact endpoint. Universal indicator is useful for estimating pH but unsuitable for accurate titrations. For a strong acid-strong base titration (like HCl + NaOH), any indicator that changes colour near pH 7 would work because the pH change at the endpoint is very steep (jumping from about pH 3 to pH 11 with a single drop). For weak acid-strong base titrations, phenolphthalein (endpoint around pH 8-10) is preferred because the equivalence point is above pH 7.",
        "common_errors": [
          "Making unit errors in the concentration calculation — volume must be converted from cm³ to dm³",
          "Thinking universal indicator is suitable for titrations — its gradual colour change makes precise endpoint detection impossible"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS3-C088",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that some substances speed up chemical reactions without being used up themselves.",
        "example_task": "What is a catalyst?",
        "example_response": "A catalyst is a substance that speeds up a chemical reaction without being used up. It is still there at the end of the reaction, unchanged. For example, in a car's catalytic converter, the catalyst helps convert harmful exhaust gases into less harmful ones, and the catalyst can be used over and over again.",
        "common_errors": [
          "Thinking catalysts are used up during the reaction — they are recovered unchanged",
          "Confusing catalysts with reactants — catalysts do not appear in the balanced equation"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explaining how catalysts work by lowering the activation energy, and giving examples of catalysts in biological and industrial contexts.",
        "example_task": "How does a catalyst speed up a reaction? Give an example from biology.",
        "example_response": "A catalyst speeds up a reaction by providing an alternative reaction pathway that has lower activation energy. This means less energy is needed for the reaction to start, so more particles have sufficient energy to react at any given temperature, and the reaction happens faster. In biology, enzymes are biological catalysts. For example, catalase in liver cells breaks down hydrogen peroxide (a toxic waste product) into water and oxygen extremely rapidly. Without catalase, the breakdown would be far too slow to prevent damage to cells. Enzymes are highly specific — each enzyme catalyses one particular reaction.",
        "common_errors": [
          "Thinking catalysts add energy to the reaction — they lower the activation energy needed, not add energy",
          "Not knowing that enzymes are biological catalysts"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Explaining catalysis using energy profile diagrams, understanding that catalysts are specific to particular reactions, and investigating the effect of catalysts experimentally.",
        "example_task": "Design an experiment to show that manganese dioxide acts as a catalyst for the decomposition of hydrogen peroxide.",
        "example_response": "Set up two conical flasks, each containing 50 cm³ of hydrogen peroxide solution at the same concentration. Add 1 g of manganese dioxide to one flask (the experimental) and leave the other without (the control). Collect the oxygen gas produced using a gas syringe or by water displacement. The flask with manganese dioxide will produce oxygen much faster — vigorous fizzing compared to slow bubbling. To prove the manganese dioxide is a catalyst (not a reactant), filter it out after the reaction, wash, dry, and weigh it — the mass should be unchanged. On an energy profile diagram, both reactions have the same overall energy change (same starting and ending energy levels), but the catalysed pathway has a lower activation energy peak. The word equation is: hydrogen peroxide → water + oxygen (manganese dioxide catalyst). The MnO₂ does not appear in the equation because it is unchanged.",
        "common_errors": [
          "Not including a control (without catalyst) to prove the catalyst speeds up the reaction",
          "Not verifying that the catalyst is recovered unchanged — this is essential to prove it is a catalyst and not a reactant"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Evaluating the industrial and environmental importance of catalysts, understanding catalyst poisoning, and explaining how catalysts affect reaction rates without changing equilibrium position.",
        "example_task": "The Haber process uses an iron catalyst to manufacture ammonia. Without the catalyst, the reaction would need impractically high temperatures. Explain the economic and environmental significance of catalysts in industrial chemistry.",
        "example_response": "The Haber process (N₂ + 3H₂ ⇌ 2NH₃) operates at 450°C with an iron catalyst. Without the catalyst, temperatures above 1000°C would be needed to achieve a useful rate — this would be prohibitively expensive in energy costs, require specialised (expensive) equipment, and actually shift the equilibrium away from ammonia (since the forward reaction is exothermic). The catalyst allows the reaction to proceed at a reasonable rate at a lower temperature, saving enormous amounts of energy and making ammonia production (essential for fertilisers feeding billions) economically viable. Catalysts are also environmentally critical: catalytic converters in car exhausts use platinum, palladium, and rhodium to convert CO, NOₓ, and unburnt hydrocarbons into CO₂, N₂, and H₂O — without these catalysts, air pollution in cities would be far worse. Importantly, catalysts do not change the position of equilibrium or the overall yield — they only speed up the rate at which equilibrium is reached. They are not consumed, so they can be used indefinitely in principle, but catalyst poisoning (impurities blocking active sites — e.g., lead poisoning platinum catalysts, which is why leaded petrol was phased out) can deactivate them. Research into new, more efficient, and less expensive catalysts (including nanocatalysts and biocatalysts) is one of the most active areas of chemistry, with implications for green energy, pharmaceutical manufacturing, and pollution control.",
        "common_errors": [
          "Thinking catalysts increase the yield (amount of product) — they increase the rate, not the equilibrium yield",
          "Not understanding catalyst poisoning — impurities can block the active sites and deactivate the catalyst"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS3-C089",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that you need to heat something to melt or boil it, and that this means energy is involved in changes of state.",
        "example_task": "Why do you need to keep heating water to turn it into steam?",
        "example_response": "To turn water into steam, you need to give the water particles enough energy to escape from the liquid and become a gas. The energy from heating makes the particles move faster and faster until they have enough energy to break free from the other water particles. Without this energy, the water stays as a liquid.",
        "common_errors": [
          "Thinking heating water just makes it 'hot' without understanding that energy is needed to change the arrangement of particles",
          "Not connecting the need for continuous heating to the energy required to break intermolecular forces"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Explaining that energy is absorbed during melting and boiling (endothermic) and released during freezing and condensation (exothermic).",
        "example_task": "Is freezing an exothermic or endothermic process? Explain.",
        "example_response": "Freezing is exothermic — it releases energy to the surroundings. When a liquid freezes, the particles slow down and form a regular arrangement. As new bonds form between particles (intermolecular forces), energy is released. This is why you can feel warmth when water freezes in the right conditions, and why oranges in orchards are sometimes sprayed with water before a frost — as the water freezes, it releases heat energy that helps protect the fruit. The reverse process (melting) is endothermic — energy must be absorbed to break the bonds between particles.",
        "common_errors": [
          "Thinking freezing absorbs energy because it makes things cold — freezing releases energy; it is the surroundings that get the released energy",
          "Confusing the direction of energy transfer — exothermic means energy goes OUT to the surroundings"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Explaining why temperature remains constant during changes of state using the concept of latent heat, and interpreting heating/cooling curves.",
        "example_task": "On a cooling curve for a pure substance, there are flat sections where the temperature does not change despite heat being lost. Explain what is happening at the particle level during these flat sections.",
        "example_response": "The flat sections represent changes of state. During condensation (gas → liquid), particles are forming intermolecular bonds and arranging into a closer configuration. The energy being released as these bonds form exactly compensates for the energy being lost to the surroundings, so the temperature remains constant. The energy released is latent heat of vaporisation — 'latent' means hidden, because it does not cause a temperature change. During freezing (liquid → solid), particles form a regular arrangement and the latent heat of fusion is released. Temperature only starts dropping again once the change of state is complete and all particles are in the new state. A pure substance has flat, horizontal sections at specific temperatures (its boiling and melting points). An impure substance has sloped sections at these transitions because different components change state at different temperatures.",
        "common_errors": [
          "Thinking the temperature stays constant because no energy change is occurring — energy IS being transferred, but it goes into changing the particle arrangement rather than changing the temperature",
          "Not distinguishing latent heat of fusion (melting/freezing) from latent heat of vaporisation (boiling/condensation)"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Comparing the energy required for different changes of state, explaining why latent heat of vaporisation is always greater than latent heat of fusion for the same substance, and applying this to real-world energy systems.",
        "example_task": "The latent heat of vaporisation of water (2,260 kJ/kg) is approximately 6.7 times greater than its latent heat of fusion (334 kJ/kg). Explain why, using the particle model.",
        "example_response": "During melting (fusion), particles gain enough energy to overcome some intermolecular forces and move from a fixed, regular arrangement to a close but disordered arrangement. The particles remain close together — they have overcome the forces that hold them in fixed positions but are still attracted to neighbouring particles. During boiling (vaporisation), particles must gain enough energy to completely overcome all remaining intermolecular forces and separate from each other entirely, moving far apart as a gas. This requires much more energy because all intermolecular attractions must be broken, not just the forces maintaining the fixed structure. This has practical significance: steam burns are much more severe than boiling water burns because steam releases its latent heat of vaporisation (2,260 kJ/kg) when it condenses on skin, in addition to the heat from cooling. This large latent heat also explains why steam is used in power stations and heating systems — it carries enormous amounts of energy in the gas phase that is released on condensation. Conversely, sweating cools you efficiently because evaporating water absorbs a large amount of heat energy from your skin (using the latent heat of vaporisation to cool you).",
        "common_errors": [
          "Not explaining the fundamental reason for the difference — vaporisation requires complete separation of particles, while melting only disrupts the fixed arrangement",
          "Failing to connect latent heat values to practical applications like steam burns, power generation, or evaporative cooling"
        ]
      }
    ]
  },
  {
    "concept_id": "SC-KS3-C090",
    "levels": [
      {
        "level_number": 1,
        "label": "emerging",
        "description": "Knowing that some chemical reactions give out heat (feel hot) and some take in heat (feel cold).",
        "example_task": "A hand warmer gets hot when you activate it. Is this an exothermic or endothermic reaction?",
        "example_response": "This is an exothermic reaction because it releases heat energy to the surroundings (your hand). Exo- means 'out' — energy goes out. The chemical reaction inside the hand warmer (usually iron oxidation) transfers energy to the surroundings, making them warmer.",
        "common_errors": [
          "Confusing exothermic (releases heat, feels hot) with endothermic (absorbs heat, feels cold)",
          "Thinking 'exothermic' means explosive — most exothermic reactions are gentle"
        ]
      },
      {
        "level_number": 2,
        "label": "developing",
        "description": "Classifying reactions as exothermic or endothermic, giving examples of each, and measuring temperature changes.",
        "example_task": "Give two examples of exothermic reactions and two examples of endothermic reactions.",
        "example_response": "Exothermic (release energy, temperature of surroundings increases): (1) combustion — burning methane releases heat and light; (2) neutralisation — adding acid to alkali causes the temperature of the solution to rise. Endothermic (absorb energy, temperature of surroundings decreases): (1) thermal decomposition — heating calcium carbonate requires continuous energy input; (2) dissolving ammonium nitrate in water — the temperature drops, making the beaker feel cold (used in instant cold packs for sports injuries). You can detect the energy change by measuring the temperature of the reaction mixture with a thermometer — a rise indicates exothermic, a fall indicates endothermic.",
        "common_errors": [
          "Thinking endothermic reactions produce cold — they absorb energy from the surroundings, which is why the surroundings feel cooler",
          "Classifying all dissolving as endothermic — some dissolving processes are exothermic (e.g., dissolving NaOH in water releases heat)"
        ]
      },
      {
        "level_number": 3,
        "label": "secure",
        "description": "Explaining exothermic and endothermic reactions in terms of bond energy (energy needed to break bonds vs energy released when new bonds form) and drawing simple energy level diagrams.",
        "example_task": "Draw an energy level diagram for an exothermic reaction and explain why the reaction releases energy overall.",
        "example_response": "In an exothermic reaction, the energy released from forming new bonds in the products is greater than the energy needed to break bonds in the reactants. On the energy level diagram: reactants are drawn at a higher energy level than products. The downward arrow between them represents the energy released to the surroundings. The difference in height is the overall energy change. There is also a small peak above the reactants representing the activation energy — the initial energy needed to start breaking reactant bonds. For endothermic reactions, the diagram is reversed: products are higher than reactants, and the upward arrow represents energy absorbed from the surroundings. The key principle: bond breaking is always endothermic (requires energy), bond forming is always exothermic (releases energy). The overall energy change depends on which is greater.",
        "common_errors": [
          "Drawing the diagram the wrong way — for exothermic reactions, products are LOWER than reactants on the energy axis",
          "Forgetting to include activation energy on the diagram — even exothermic reactions need initial energy to start"
        ]
      },
      {
        "level_number": 4,
        "label": "mastery",
        "description": "Calculating overall energy changes from bond energy data and evaluating the significance of exothermic and endothermic reactions in everyday life, industry, and the environment.",
        "example_task": "Using bond energies: C-H = 413 kJ/mol, O=O = 498 kJ/mol, C=O = 805 kJ/mol, O-H = 464 kJ/mol, calculate the overall energy change for the combustion of methane: CH₄ + 2O₂ → CO₂ + 2H₂O.",
        "example_response": "Bonds broken (energy absorbed): 4 × C-H = 4 × 413 = 1652 kJ; 2 × O=O = 2 × 498 = 996 kJ. Total energy in = 2648 kJ. Bonds formed (energy released): 2 × C=O = 2 × 805 = 1610 kJ; 4 × O-H = 4 × 464 = 1856 kJ. Total energy out = 3466 kJ. Overall energy change = energy in - energy out = 2648 - 3466 = -818 kJ/mol. The negative sign indicates the reaction is exothermic — more energy is released forming new bonds than is required to break the old ones. This 818 kJ per mole of methane is why natural gas is used as a fuel. In reality, the value is approximately -890 kJ/mol — bond energy calculations give approximate values because bond energies are averages across different molecular environments. This calculation method is powerful because it allows prediction of energy changes for reactions that have not been performed, which is valuable in designing fuels, explosives, and industrial processes. The balance between exothermic and endothermic processes also underlies climate science — the greenhouse effect involves the balance between exothermic infrared emission from Earth and endothermic absorption by greenhouse gases.",
        "common_errors": [
          "Getting the sign wrong — exothermic reactions have a negative energy change (energy is lost from the system)",
          "Confusing bonds broken (energy absorbed) with bonds formed (energy released) — remember: breaking bonds ALWAYS requires energy"
        ]
      }
    ]
  }
]