{
  "metadata": {
    "node_type": "ComputationalThinking",
    "subject": "Computing",
    "key_stages": ["KS1", "KS2", "KS3"],
    "dfe_reference": "DFE-00171-2013",
    "source": "National Curriculum 2014 + Jeannette Wing computational thinking framework (2006), CAS/BCS Computing curriculum guidance",
    "extraction_date": "2026-02-18"
  },
  "skills": [
    {
      "skill_id": "CT-KS1-001",
      "skill_name": "Abstraction (KS1)",
      "description": "Focus on the most important features of a problem or task while ignoring unnecessary detail; represent real-world actions as simple step-by-step instructions that capture the essential logic without irrelevant specifics.",
      "key_stage": "KS1",
      "complexity_level": 1,
      "source_reference": "National Curriculum 2014, DFE-00171-2013 — Computing KS1: 'understand what algorithms are; how they are implemented as programs on digital devices; and that programs execute by following precise and unambiguous instructions'; CAS computational thinking framework: abstraction pillar",
      "progression_from": null,
      "progression_to": "CT-KS2-001",
      "second_order": false,
      "strand": "abstraction"
    },
    {
      "skill_id": "CT-KS2-001",
      "skill_name": "Abstraction (KS2)",
      "description": "Design programs and digital solutions by identifying the key variables, inputs and outputs relevant to a problem while deliberately ignoring peripheral details; use procedures and functions as abstractions that hide implementation complexity; apply abstraction when planning programs using pseudocode or flowcharts.",
      "key_stage": "KS2",
      "complexity_level": 2,
      "source_reference": "National Curriculum 2014, DFE-00171-2013 — Computing KS2: 'solve problems by decomposing them into smaller parts'; 'use logical reasoning to explain how some simple algorithms work'; CO-KS12-C006: 'abstraction (ignoring irrelevant detail)'; CAS computational thinking framework: abstraction pillar",
      "progression_from": "CT-KS1-001",
      "progression_to": "CT-KS3-001",
      "second_order": false,
      "strand": "abstraction"
    },
    {
      "skill_id": "CT-KS3-001",
      "skill_name": "Abstraction (KS3)",
      "description": "Design and evaluate computational abstractions that model the state and behaviour of real-world problems and physical systems; select appropriate levels of abstraction for a given problem context; use abstract data types, classes and interfaces to hide implementation detail; understand the layered abstractions present in computing systems from hardware to application.",
      "key_stage": "KS3",
      "complexity_level": 4,
      "source_reference": "National Curriculum 2014, DFE-00191-2013 — Computing KS3: 'design, use and evaluate computational abstractions that model the state and behaviour of real-world problems and physical systems'; 'understand the hardware and software components that make up computer systems, and how they communicate with one another'",
      "progression_from": "CT-KS2-001",
      "progression_to": null,
      "second_order": false,
      "strand": "abstraction"
    },
    {
      "skill_id": "CT-KS1-002",
      "skill_name": "Decomposition (KS1)",
      "description": "Break a familiar task or problem into a sequence of smaller, ordered steps; understand that a complex instruction can be split into simpler sub-instructions that together achieve the same goal; apply this thinking when giving instructions to a programmable toy or creating a simple program.",
      "key_stage": "KS1",
      "complexity_level": 1,
      "source_reference": "National Curriculum 2014, DFE-00171-2013 — Computing KS1: 'create and debug simple programs'; 'understand what algorithms are; how they are implemented as programs on digital devices'; CAS computational thinking framework: decomposition pillar",
      "progression_from": null,
      "progression_to": "CT-KS2-002",
      "second_order": false,
      "strand": "decomposition"
    },
    {
      "skill_id": "CT-KS2-002",
      "skill_name": "Decomposition (KS2)",
      "description": "Decompose a complex programming problem or digital project into distinct, manageable sub-problems that can be developed and tested independently; plan program structure using top-down design before coding; use procedures and functions as the coded expression of decomposed sub-problems.",
      "key_stage": "KS2",
      "complexity_level": 2,
      "source_reference": "National Curriculum 2014, DFE-00171-2013 — Computing KS2: 'solve problems by decomposing them into smaller parts'; 'design, write and debug programs that accomplish specific goals'; CO-KS12-C006: 'decomposition — breaking a complex problem into smaller, manageable sub-problems'",
      "progression_from": "CT-KS1-002",
      "progression_to": "CT-KS3-002",
      "second_order": false,
      "strand": "decomposition"
    },
    {
      "skill_id": "CT-KS3-002",
      "skill_name": "Decomposition (KS3)",
      "description": "Design and develop modular programs that use procedures and functions to decompose complex problems; apply top-down and bottom-up design strategies; decompose data requirements as well as procedural logic, selecting appropriate data structures for each sub-problem; evaluate how modular decomposition improves code readability, maintainability and reuse.",
      "key_stage": "KS3",
      "complexity_level": 4,
      "source_reference": "National Curriculum 2014, DFE-00191-2013 — Computing KS3: 'design and develop modular programs that use procedures or functions'; 'use 2 or more programming languages, at least one of which is textual, to solve a variety of computational problems'; 'make appropriate use of data structures [for example, lists, tables or arrays]'",
      "progression_from": "CT-KS2-002",
      "progression_to": null,
      "second_order": false,
      "strand": "decomposition"
    },
    {
      "skill_id": "CT-KS1-003",
      "skill_name": "Pattern recognition (KS1)",
      "description": "Notice repeated elements in sequences of instructions or in real-world tasks; identify when a set of steps recurs and recognise that repetition can be expressed more efficiently using loops; spot similarities between different problems that suggest the same solution approach can be applied.",
      "key_stage": "KS1",
      "complexity_level": 1,
      "source_reference": "National Curriculum 2014, DFE-00171-2013 — Computing KS1: 'use logical reasoning to predict the behaviour of simple programs'; 'create and debug simple programs'; CAS computational thinking framework: pattern recognition pillar",
      "progression_from": null,
      "progression_to": "CT-KS2-003",
      "second_order": false,
      "strand": "pattern_recognition"
    },
    {
      "skill_id": "CT-KS2-003",
      "skill_name": "Pattern recognition (KS2)",
      "description": "Identify patterns and regularities in data sets and program behaviours; use pattern recognition to select appropriate control structures (repetition for repeated actions, selection for conditional branching); generalise from specific examples to produce reusable solutions; recognise when an existing algorithm or program component can be reused to solve a new problem.",
      "key_stage": "KS2",
      "complexity_level": 2,
      "source_reference": "National Curriculum 2014, DFE-00171-2013 — Computing KS2: 'use sequence, selection, and repetition in programs'; 'use logical reasoning to explain how some simple algorithms work and to detect and correct errors in algorithms and programs'; CO-KS12-C006: 'pattern recognition — identifying similarities, trends, regularities'",
      "progression_from": "CT-KS1-003",
      "progression_to": "CT-KS3-003",
      "second_order": false,
      "strand": "pattern_recognition"
    },
    {
      "skill_id": "CT-KS3-003",
      "skill_name": "Pattern recognition (KS3)",
      "description": "Identify and exploit structural patterns in computational problems to select or design efficient algorithms; recognise recurring algorithmic patterns such as searching, sorting and divide-and-conquer; use pattern recognition to understand when different data structures naturally suit a problem's access patterns; analyse trends in data and use them to inform computational solutions.",
      "key_stage": "KS3",
      "complexity_level": 3,
      "source_reference": "National Curriculum 2014, DFE-00191-2013 — Computing KS3: 'understand several key algorithms that reflect computational thinking [for example, ones for sorting and searching]'; 'use logical reasoning to compare the utility of alternative algorithms for the same problem'; CAS computational thinking framework: pattern recognition pillar",
      "progression_from": "CT-KS2-003",
      "progression_to": null,
      "second_order": false,
      "strand": "pattern_recognition"
    },
    {
      "skill_id": "CT-KS1-004",
      "skill_name": "Algorithm design (KS1)",
      "description": "Create precise, unambiguous sequences of instructions to accomplish a goal; understand that a computer follows instructions exactly as written; design, implement and debug simple programs as algorithms expressed in a programming environment; use logical reasoning to predict what a simple program will do.",
      "key_stage": "KS1",
      "complexity_level": 1,
      "source_reference": "National Curriculum 2014, DFE-00171-2013 — Computing KS1: 'understand what algorithms are; how they are implemented as programs on digital devices; and that programs execute by following precise and unambiguous instructions'; 'create and debug simple programs'; 'use logical reasoning to predict the behaviour of simple programs'",
      "progression_from": null,
      "progression_to": "CT-KS2-004",
      "second_order": false,
      "strand": "algorithms"
    },
    {
      "skill_id": "CT-KS2-004",
      "skill_name": "Algorithm design (KS2)",
      "description": "Design algorithms for specific goals using sequence, selection and repetition; express algorithms in pseudocode and flowcharts before implementation; implement algorithms as programs in block-based and text-based languages; use logical reasoning to explain how an algorithm works and to identify and correct errors; work with variables and input/output to create algorithms that generalise across inputs.",
      "key_stage": "KS2",
      "complexity_level": 2,
      "source_reference": "National Curriculum 2014, DFE-00171-2013 — Computing KS2: 'design, write and debug programs that accomplish specific goals, including controlling or simulating physical systems'; 'use sequence, selection, and repetition in programs; work with variables and various forms of input and output'; 'use logical reasoning to explain how some simple algorithms work'",
      "progression_from": "CT-KS1-004",
      "progression_to": "CT-KS3-004",
      "second_order": false,
      "strand": "algorithms"
    },
    {
      "skill_id": "CT-KS3-004",
      "skill_name": "Algorithm design (KS3)",
      "description": "Design, implement and analyse algorithms for non-trivial computational problems including sorting and searching; understand that multiple algorithms can solve the same problem with different efficiency characteristics; use logical reasoning and formal comparison techniques to assess the relative utility of alternative algorithms; implement algorithms in at least two programming languages, at least one text-based.",
      "key_stage": "KS3",
      "complexity_level": 4,
      "source_reference": "National Curriculum 2014, DFE-00191-2013 — Computing KS3: 'understand several key algorithms that reflect computational thinking [for example, ones for sorting and searching]'; 'use logical reasoning to compare the utility of alternative algorithms for the same problem'; 'use 2 or more programming languages, at least one of which is textual, to solve a variety of computational problems'",
      "progression_from": "CT-KS2-004",
      "progression_to": null,
      "second_order": false,
      "strand": "algorithms"
    },
    {
      "skill_id": "CT-KS2-005",
      "skill_name": "Evaluation (KS2)",
      "description": "Test programs systematically against expected outputs to detect errors; distinguish between syntax errors and logic errors; evaluate whether a completed program accomplishes its specified goal; reflect on the efficiency and clarity of code and suggest improvements.",
      "key_stage": "KS2",
      "complexity_level": 2,
      "source_reference": "National Curriculum 2014, DFE-00171-2013 — Computing KS2: 'design, write and debug programs that accomplish specific goals'; 'use logical reasoning to explain how some simple algorithms work and to detect and correct errors in algorithms and programs'; CO-KS12-C003: 'debugging is the process of finding and fixing errors in programs'",
      "progression_from": null,
      "progression_to": "CT-KS3-005",
      "second_order": false,
      "strand": "evaluation"
    },
    {
      "skill_id": "CT-KS3-005",
      "skill_name": "Evaluation (KS3)",
      "description": "Evaluate computational solutions against specified criteria including correctness, efficiency, usability and fitness for purpose; compare the performance of alternative algorithms for the same problem using logical reasoning and empirical testing; assess the design choices made in modular programs and digital artefacts; evaluate digital artefacts for trustworthiness, design quality and usability.",
      "key_stage": "KS3",
      "complexity_level": 4,
      "source_reference": "National Curriculum 2014, DFE-00191-2013 — Computing KS3: 'use logical reasoning to compare the utility of alternative algorithms for the same problem'; 'design, use and evaluate computational abstractions'; 'create, re-use, revise and repurpose digital artefacts for a given audience, with attention to trustworthiness, design and usability'",
      "progression_from": "CT-KS2-005",
      "progression_to": null,
      "second_order": false,
      "strand": "evaluation"
    },
    {
      "skill_id": "CT-KS3-006",
      "skill_name": "Data representation (KS3)",
      "description": "Understand how data of various types — integers, text, images, sound — is represented and manipulated in binary form; convert between binary and decimal number representations and perform simple binary arithmetic; understand how data structures (arrays, lists, records) organise data in programs; understand that all digital information is encoded as binary digits regardless of its perceived type.",
      "key_stage": "KS3",
      "complexity_level": 4,
      "source_reference": "National Curriculum 2014, DFE-00191-2013 — Computing KS3: 'understand how instructions are stored and executed within a computer system; understand how data of various types (including text, sounds and pictures) can be represented and manipulated digitally, in the form of binary digits'; 'understand simple Boolean logic [for example, AND, OR and NOT]'; 'understand how numbers can be represented in binary, and be able to carry out simple operations on binary numbers'",
      "progression_from": null,
      "progression_to": null,
      "second_order": false,
      "strand": "data"
    }
  ]
}
