{
  "metadata": {
    "subject": "Citizenship",
    "key_stage": "KS3",
    "years_covered": [
      7,
      8,
      9,
      10,
      11
    ],
    "document_reference": "DFE-00190-2013",
    "extraction_date": "2026-02-17",
    "structure_rating": 8
  },
  "domains": [
    {
      "domain_id": "CI-KS34-D001",
      "domain_name": "Democracy, Parliament and Government (KS3)",
      "description": "Understanding the political system of democratic government in the UK; how Parliament works; the roles of citizens, Parliament and the monarch; the nature of voting, elections and political parties; the precious liberties of UK citizens.",
      "curriculum_context": "At KS3, pupils develop foundational understanding of how the UK is governed - the institutions, processes and principles that constitute British democracy. This includes knowledge of Parliament as the sovereign legislative body, the relationship between Parliament, the executive and the monarch in the constitutional monarchy, and the role of elections in producing a democratic mandate. Understanding how laws are made and how Parliament scrutinises the executive grounds pupils' knowledge in institutional reality rather than abstract principle. The concept of precious liberties - freedom of speech, freedom of the press, freedom of assembly - connects constitutional structures to the rights and freedoms that democracy is designed to protect. This knowledge provides the foundation for meaningful democratic participation as citizens.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "CI-KS34-D002",
      "domain_name": "Law, Justice and Rights (KS3)",
      "description": "Understanding rules and laws in school and wider society; the justice system including the roles of police, courts and tribunals; the nature of rights and responsibilities in a democratic society.",
      "curriculum_context": "Understanding the rule of law at KS3 begins with the immediate experience of rules in schools and communities before extending to the national legal system. Pupils learn that rules and laws serve social functions - maintaining order, protecting rights, resolving disputes - that justify their authority, while also developing understanding that laws can be challenged and changed through legitimate processes. The distinction between civil and criminal law, the role of courts in applying law and the function of sentences in delivering justice provide concrete institutional knowledge. The relationship between rights and responsibilities is a central concept: rights in a democratic society come with corresponding duties to others and to the community. At KS3, these concepts are introduced through familiar and accessible examples before being extended to more complex legal and constitutional territory at KS4.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "CI-KS34-D003",
      "domain_name": "Community, Identity and Participation (KS3 and KS4)",
      "description": "Understanding the diverse national, regional, religious and ethnic identities in the UK; the role of public institutions and voluntary organisations; the nature and value of community participation and voluntary service.",
      "curriculum_context": "Community and identity at KS3-4 develops pupils' understanding of the UK as a diverse, pluralist society in which multiple identities coexist and contribute to shared civic life. Public institutions - local government, the NHS, public libraries, the police - serve the community and are accountable to citizens. Voluntary organisations and community groups extend the reach of civic life beyond the state, embodying the principle of active citizenship. Understanding the value of volunteering and community contribution develops pupils' sense of civic agency and social responsibility. The curriculum requires pupils to understand diversity as a feature of British society - different national, regional, religious and ethnic identities - and to engage with that diversity through the concept of mutual respect and understanding, which is foundational to democratic citizenship.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "CI-KS34-D004",
      "domain_name": "Constitutional Democracy, Human Rights and International Relations (KS4)",
      "description": "Understanding parliamentary democracy and the UK constitution; electoral systems; other forms of government; local, regional and international governance; human rights and international law.",
      "curriculum_context": "At KS4, citizenship knowledge becomes more analytically demanding, requiring pupils to understand the constitutional architecture of the UK state - the separation of powers between executive, legislature and judiciary, the role of the free press in democratic accountability, and the mechanisms by which citizens exercise political power. The curriculum extends beyond the UK to require knowledge of different electoral systems and forms of government, developing comparative political understanding. International governance - the UN, the EU, international law, human rights frameworks - situates UK democracy in a global context. Knowledge of human rights law and international obligations connects domestic rights to universal principles. At KS4, pupils are expected to analyse, evaluate and argue about political and constitutional questions, not merely describe them.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "CI-KS34-D005",
      "domain_name": "Personal Finance and Economic Understanding",
      "description": "Understanding personal financial management including income, expenditure, credit, debt, insurance, savings and pensions; understanding financial products and services; understanding public spending and taxation.",
      "curriculum_context": "Financial literacy is a component of citizenship because economic participation is an important dimension of adult life in a democratic society. At KS3, pupils are introduced to money management through the concepts of budgeting and financial risk, grounding abstract financial concepts in immediate, relatable contexts. At KS4, the curriculum extends to the full range of financial decisions that adults encounter: employment income, tax and National Insurance, borrowing through credit cards and loans, managing debt, insurance against risk, saving for retirement through pensions, and understanding how public services are funded through taxation. Understanding financial products and services - their costs, risks and benefits - equips pupils to make informed decisions as adult financial consumers. This knowledge connects to broader understanding of the economy and the relationship between individual financial decisions and public economic policy.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "CI-KS34-D006",
      "domain_name": "Citizenship Skills: Critical Analysis and Democratic Participation",
      "description": "Developing the skills of critical thinking, research, debate and advocacy; understanding diverse viewpoints; taking informed action as citizens; engaging with democratic processes.",
      "curriculum_context": "Citizenship as a subject is distinctive in requiring pupils not just to understand democratic society but to participate in it. The skills component of citizenship develops pupils' capacity to analyse political and social issues critically, evaluate evidence and argument, understand diverse perspectives and construct their own reasoned positions. Democratic participation skills - debating, advocacy, understanding how to engage with political processes, taking action on issues of concern - transform knowledge into agency. At KS3 and KS4, pupils are expected to develop these participatory skills through engagement with real issues and processes: mock elections, debates, research into community issues, contact with elected representatives. The goal is to develop citizens who are capable of active, informed, critical engagement with democratic life rather than passive recipients of political decisions.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    }
  ],
  "objectives": [
    {
      "objective_id": "CI-KS34-O001",
      "domain_id": "CI-KS34-D001",
      "objective_text": "the development of the political system of democratic government in the United Kingdom, including the roles of citizens, Parliament and the monarch",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "CI-KS34-O002",
      "domain_id": "CI-KS34-D001",
      "objective_text": "the operation of Parliament, including voting and elections, and the role of political parties",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "CI-KS34-O003",
      "domain_id": "CI-KS34-D001",
      "objective_text": "the precious liberties enjoyed by the citizens of the United Kingdom",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "CI-KS34-O004",
      "domain_id": "CI-KS34-D002",
      "objective_text": "the nature of rules and laws and the justice system, including the role of the police and the operation of courts and tribunals",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "CI-KS34-O005",
      "domain_id": "CI-KS34-D003",
      "objective_text": "the roles played by public institutions and voluntary groups in society, and the ways in which citizens work together to improve their communities, including opportunities to participate in school-based activities",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "CI-KS34-O006",
      "domain_id": "CI-KS34-D005",
      "objective_text": "the functions and uses of money, the importance and practice of budgeting, and managing risk",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "CI-KS34-O007",
      "domain_id": "CI-KS34-D004",
      "objective_text": "parliamentary democracy and the key elements of the constitution of the United Kingdom, including the power of government, the role of citizens and Parliament in holding those in power to account, and the rule of law",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "CI-KS34-O008",
      "domain_id": "CI-KS34-D004",
      "objective_text": "the different electoral systems used in and beyond the United Kingdom and actions citizens can take in democratic processes",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "CI-KS34-O009",
      "domain_id": "CI-KS34-D004",
      "objective_text": "other systems and forms of government, both democratic and non-democratic, beyond the United Kingdom",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "CI-KS34-O010",
      "domain_id": "CI-KS34-D004",
      "objective_text": "local, regional and international governance and the United Kingdom's relations with the rest of Europe and the wider world",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "CI-KS34-O011",
      "domain_id": "CI-KS34-D004",
      "objective_text": "human rights and international law",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "CI-KS34-O012",
      "domain_id": "CI-KS34-D002",
      "objective_text": "the legal system in England and how laws are shaped and enforced",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "CI-KS34-O013",
      "domain_id": "CI-KS34-D003",
      "objective_text": "diverse national, regional, religious and ethnic identities in the United Kingdom and the need for mutual respect and understanding",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "CI-KS34-O014",
      "domain_id": "CI-KS34-D003",
      "objective_text": "the different ways in which a citizen can contribute to the improvement of his or her community, to include the opportunity to participate actively in community volunteering, as well as other forms of responsible activity",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "CI-KS34-O015",
      "domain_id": "CI-KS34-D005",
      "objective_text": "income and expenditure, credit and debt, insurance, savings and pensions, financial products and services, and how public money is raised and spent",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "CI-KS34-C001",
      "domain_id": "CI-KS34-D001",
      "concept_name": "Parliamentary Democracy and the UK Constitution",
      "description": "Parliamentary democracy is the system of government in which the people elect representatives to a legislative assembly (Parliament) that is sovereign - the highest source of legal authority. The UK constitution is uncodified: rather than existing in a single written document, it is distributed across statutes, conventions, common law and authoritative documents such as Magna Carta and the Bill of Rights. Key constitutional principles include parliamentary sovereignty (Parliament's authority cannot be overridden by another body), the rule of law (all persons and institutions are subject to the same law), separation of powers (the executive, legislature and judiciary perform distinct functions), and ministerial accountability to Parliament. At KS3 and KS4, pupils develop from knowledge of how Parliament works to more analytical understanding of constitutional principles and the tensions between them.",
      "teaching_guidance": "Ground the constitution in concrete institutions and processes before moving to abstract principles. Use the passage of a specific bill through Parliament as a case study of how laws are made. Examine how the executive is held accountable through Prime Minister's Questions, select committees and the media. Explore the significance of key constitutional moments: the Glorious Revolution, the Human Rights Act, devolution. Discuss the advantages and disadvantages of an uncodified constitution compared to written constitutions. Use case studies of constitutional tension - parliamentary sovereignty versus human rights, devolution versus the unity of the UK - to develop analytical engagement.",
      "key_vocabulary": "Parliament, sovereignty, constitution, executive, legislature, judiciary, separation of powers, rule of law, democracy, election, political party, accountability, mandate, devolution, constitutional monarchy",
      "common_misconceptions": "Pupils often conflate Parliament with the government, not understanding that the government is drawn from Parliament but is a distinct institution that Parliament scrutinises and can hold to account. The idea that the UK has 'no constitution' because it is unwritten is a common error; explaining that the constitution exists in multiple sources and forms clarifies the distinction. The monarch's constitutional role is frequently misunderstood: the monarch's powers are exercised on the advice of ministers and are largely ceremonial in contemporary practice, though they are constitutionally significant.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "CI-KS34-C002",
      "domain_id": "CI-KS34-D002",
      "concept_name": "Rights, Liberties and the Rule of Law",
      "description": "Rights are legally or morally protected entitlements that individuals hold in relation to the state and to other individuals. In the UK, rights are protected through common law, statute law (including the Human Rights Act 1998, which incorporates the European Convention on Human Rights into UK law) and constitutional convention. The rule of law is the foundational principle that all persons and institutions - including the government itself - are subject to the same law, and that the law applies equally and predictably. The precious liberties of British citizens include freedom of expression, freedom of assembly and association, freedom of religion, and protection from arbitrary arrest and detention. Rights are balanced against each other and against the rights of the community, and this balancing requires democratic deliberation and judicial adjudication. At KS4, pupils understand the international framework of human rights and the role of courts in protecting them.",
      "teaching_guidance": "Distinguish between legal rights (enshrined in law and enforceable through courts) and moral rights (claims about what people ought to have, regardless of whether the law protects them). Use case studies of rights conflicts to show how courts and legislators balance competing rights: free speech versus privacy, security versus liberty. Study the European Convention on Human Rights and its incorporation into UK law through the Human Rights Act. Explore the history of rights in the UK: how were rights extended over time? Discuss what happens when the rule of law is weakened or violated. Connect human rights to international human rights frameworks: the Universal Declaration of Human Rights, the International Criminal Court.",
      "key_vocabulary": "rights, liberties, rule of law, human rights, freedom, convention, statute, court, judicial, equality, discrimination, civil liberties, Human Rights Act, entitlement, accountability",
      "common_misconceptions": "Pupils may believe that rights are absolute; exploring how rights are balanced against each other and against social interests develops more nuanced understanding. The relationship between morality and law is frequently confused: laws can be unjust (historically, laws enforced discrimination) and moral duties can go beyond what the law requires. The Human Rights Act and the European Convention are often conflated with EU membership; they are distinct instruments, and UK withdrawal from the EU did not automatically affect ECHR obligations.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "CI-KS34-C003",
      "domain_id": "CI-KS34-D004",
      "concept_name": "Democracy, Elections and Political Systems",
      "description": "Democracy is the system of government in which political authority is derived from and exercised on behalf of the people. In representative democracy, citizens elect representatives who make decisions on their behalf; in direct democracy, citizens vote directly on questions of policy. The UK uses a first-past-the-post system for general elections, in which the candidate with the most votes in each constituency wins, even without an overall majority. Other electoral systems - proportional representation, the alternative vote, the single transferable vote - have different characteristics and are used in different UK elections (Scottish Parliament, Welsh Senedd, London Assembly) and internationally. Understanding different forms of government - liberal democracy, constitutional monarchy, presidential systems, authoritarian government - develops comparative political literacy. At KS4, pupils can evaluate the strengths and weaknesses of different democratic systems.",
      "teaching_guidance": "Simulate elections using different electoral systems with the same votes to demonstrate how the system affects outcomes. Discuss the values underlying different systems: does proportional representation better represent the diversity of views? Does FPTP produce stronger, more stable governments? Study real examples of different democratic systems: compare UK Parliament with the US Congress, the French presidential system, the German Bundestag. Examine what distinguishes liberal democracy from other forms of government. Study non-democratic systems comparatively: how are authoritarian governments different from democracies in their relationship to citizens? Connect to current events: elections, referenda, political movements.",
      "key_vocabulary": "democracy, election, representative, constituency, proportional representation, first-past-the-post, mandate, government, opposition, parliament, franchise, suffrage, referendum, political party, manifesto",
      "common_misconceptions": "Pupils may assume that all elections work the same way; studying the different systems used in UK elections at different levels reveals the diversity of democratic mechanisms. The concept of a mandate - the democratic authority derived from election - is often misunderstood; a mandate has limits and is subject to parliamentary accountability. Pupils may equate democracy with elections alone; understanding that democratic systems require free press, independent judiciary, protection of civil liberties, and limits on executive power develops a more complete conception of democracy.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "CI-KS34-C004",
      "domain_id": "CI-KS34-D003",
      "concept_name": "Identity, Diversity and Mutual Respect",
      "description": "British society is characterised by diverse national (English, Scottish, Welsh, Northern Irish, British), regional, religious and ethnic identities that coexist within a shared civic framework. Identity is complex and multiple: individuals hold several identities simultaneously that may relate to place, religion, ethnicity, culture, family background and personal characteristics. Mutual respect and understanding - the commitment to treating people with different identities and beliefs with dignity and to engaging with diverse perspectives - is a foundational principle of democratic citizenship. Understanding diversity requires both factual knowledge of the range of identities and communities present in UK society and attitudinal development: the capacity to empathise, to engage respectfully with difference, and to resist prejudice and discrimination. At KS3 and KS4, citizenship education develops both dimensions.",
      "teaching_guidance": "Explore the full range of identities present in the school and community as well as in UK society more broadly. Use personal testimony and community voices to make diversity tangible rather than abstract. Develop vocabulary for discussing identity respectfully and accurately. Study the history of migration and diversity in the UK: how have different communities contributed to British society? Examine prejudice, discrimination and hate crime: what are they, how do they occur, and how can they be challenged? Engage with the protected characteristics under the Equality Act 2010. Connect to democratic values: why is mutual respect essential to democratic life?",
      "key_vocabulary": "identity, diversity, ethnicity, religion, nationality, culture, respect, tolerance, prejudice, discrimination, equality, inclusion, heritage, community, belonging",
      "common_misconceptions": "Pupils may understand identity as fixed and singular rather than as multiple, fluid and contextually expressed; exploring the many identities they themselves hold challenges this. The concept of tolerance is sometimes misunderstood as merely putting up with difference; distinguishing tolerance (accepting others' right to hold different views) from agreement (sharing those views) and from endorsement clarifies its meaning. Pupils may associate diversity only with ethnic or religious difference; identity includes many dimensions including disability, sexuality, gender, class and regional identity.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": true
    },
    {
      "concept_id": "CI-KS34-C005",
      "domain_id": "CI-KS34-D005",
      "concept_name": "Personal Financial Management",
      "description": "Financial literacy encompasses the knowledge and skills required to make informed, effective personal financial decisions across the life course. Core concepts include: income (money received from employment, benefits or investments), expenditure (money spent on goods and services), budgeting (planning income and expenditure to meet financial goals and avoid overspending), credit (borrowed money that must be repaid with interest), debt (money owed to creditors), insurance (paying regular premiums to protect against financial risk), saving (setting aside money for future needs) and pensions (saving for retirement income). Financial products - current accounts, savings accounts, credit cards, loans, mortgages - are the instruments through which these concepts are enacted. Understanding public finance - taxation, National Insurance, public spending - connects personal finance to the collective financial decisions of democratic society. At KS4, pupils develop the financial capability to navigate these decisions as adult citizens.",
      "teaching_guidance": "Ground financial concepts in realistic, relatable scenarios: a young person's first pay slip, a student loan decision, a household budget. Use real financial documents (anonymised) to make abstract concepts concrete. Teach compound interest through calculations that reveal the real cost of credit card debt and the real benefit of long-term saving. Develop pupils' critical awareness of financial product marketing: what are the real costs and risks of 'buy now, pay later' schemes? Connect personal finance to economic concepts: how do interest rates, inflation and employment levels affect personal financial decisions? Use case studies of financial problems (debt, redundancy, unexpected expenses) to develop financial resilience thinking.",
      "key_vocabulary": "income, expenditure, budget, credit, debt, interest, insurance, savings, pension, investment, tax, National Insurance, financial product, mortgage, compound interest",
      "common_misconceptions": "Pupils often underestimate the real cost of credit because they focus on monthly repayments rather than total repayment including interest; calculating the total cost of a loan reveals the true price of borrowing. The distinction between credit and debt (one is a facility, the other is an obligation) is frequently confused. Pupils may not understand that bank accounts and financial products are not free - the business model of financial services needs explanation to develop informed consumer behaviour. Saving for retirement can seem irrelevant to teenagers; connecting it to compound interest mathematics and the real-world outcomes of starting early versus late makes it more compelling.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "CI-KS34-C006",
      "domain_id": "CI-KS34-D006",
      "concept_name": "Active Citizenship and Democratic Participation",
      "description": "Active citizenship involves the knowledge, skills and dispositions to participate effectively in democratic life beyond the act of voting. At KS3 and KS4, citizenship education explicitly develops participatory skills: the ability to research issues, construct arguments, engage in debate, understand different perspectives, and take informed action. Understanding how citizens can engage with democratic processes - through petitions, contacting elected representatives, campaigning, community action, volunteering, media engagement - develops political efficacy (the belief that one's actions can make a difference). Community participation and voluntary service develop civic responsibility and build the social capital on which democratic communities depend. The skills of critical thinking, evidence-based argument and constructive debate are both citizenship skills and transferable intellectual capacities.",
      "teaching_guidance": "Provide genuine opportunities for pupils to engage with real issues and democratic processes, not only simulations. Organise links with local councillors, MPs or community organisations. Support pupils in identifying a real issue in their school or community and researching and proposing a response. Develop debate and discussion skills explicitly: how do you construct and present an argument? How do you engage respectfully with views you disagree with? Practise the practical skills of democratic participation: how do you write to an MP? How does a petition work? Connect to current events and news so that citizenship knowledge is applied to real political situations. Develop the habit of seeking reliable information from multiple sources.",
      "key_vocabulary": "citizen, participation, democracy, vote, campaign, petition, lobby, volunteer, community, representation, advocacy, engagement, political efficacy, civil society, accountability",
      "common_misconceptions": "Pupils may believe that politics is only for politicians and that ordinary people have no effective voice; studying examples of successful citizen action and community campaigning challenges this belief. The idea that voting is the only form of political participation ignores the many other ways in which citizens can influence policy and public life. Pupils may feel that national and international political issues are too distant to engage with; connecting them to local and school-level issues they can directly influence builds political confidence.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "CI-KS34-C003",
      "dependent_concept": "CI-KS34-C001",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.8,
      "rationale": "Understanding elections and democratic processes (C003) is a prerequisite for understanding the constitutional architecture of parliamentary democracy (C001), since the legitimacy of Parliament derives from democratic elections and the franchise."
    },
    {
      "prerequisite_concept": "CI-KS34-C001",
      "dependent_concept": "CI-KS34-C002",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.75,
      "rationale": "Understanding parliamentary democracy and constitutional principles (C001) provides the framework within which the rule of law and citizens' rights can be understood as constitutionally protected rather than merely aspirational."
    },
    {
      "prerequisite_concept": "CI-KS34-C004",
      "dependent_concept": "CI-KS34-C006",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.7,
      "rationale": "Understanding identity and diversity (C004) underpins active citizenship (C006) because effective democratic participation requires the ability to engage respectfully with citizens of different identities and perspectives."
    },
    {
      "prerequisite_concept": "CI-KS34-C002",
      "dependent_concept": "CI-KS34-C006",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.75,
      "rationale": "Knowledge of rights and liberties (C002) is foundational to active citizenship (C006) because citizens must understand what rights they hold and what democratic processes exist before they can participate effectively in exercising and defending them."
    }
  ]
}
