{
  "metadata": {
    "subject": "Computing",
    "key_stage": "KS3",
    "years_covered": [7, 8, 9, 10, 11],
    "document_reference": "DFE-00191-2013",
    "extraction_date": "2026-02-17",
    "structure_rating": 8
  },
  "domains": [
    {
      "domain_id": "CO-KS34-D001",
      "domain_name": "Computer Science: Computational Thinking and Programming",
      "description": "Understanding and applying computational abstractions; using two or more programming languages (at least one text-based); understanding data structures; designing and writing modular programs; using Boolean logic and binary.",
      "curriculum_context": "At KS3 and KS4, computer science develops into a rigorous academic discipline. Pupils are expected to work with computational abstractions that model real-world problems, making the connection between computational approaches and the problems they solve. Programming extends to at least two languages, at least one of which must be text-based, reflecting the reality that different programming languages are suited to different tasks and that professional programmers work with multiple languages. Data structures - arrays, lists, records, stacks, queues, trees - extend programming capability beyond simple variables. Boolean logic and binary underpin the mathematical foundations of digital computation, connecting computing to mathematics and providing insight into how hardware operates at the lowest levels.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "CO-KS34-D002",
      "domain_name": "Computer Systems and Hardware",
      "description": "Understanding the components of computer systems including hardware, software, storage and communications; understanding how instructions are stored and executed; understanding binary data representation.",
      "curriculum_context": "Computer systems knowledge at KS3 and KS4 addresses the architecture of computing devices: how processors execute instructions, how data is stored in memory and on persistent storage, how binary encoding represents all forms of data (numbers, text, images, sound), and how software interacts with hardware through operating systems and drivers. This knowledge connects the abstract world of programming to the physical reality of digital hardware, enabling pupils to understand why programs behave as they do and to make informed choices about hardware configurations. Understanding binary data representation provides the mathematical foundation for understanding how all digital information is encoded, processed and transmitted.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "CO-KS34-D003",
      "domain_name": "Digital Literacy, Online Safety and Ethics",
      "description": "Being responsible, competent and creative users of information and communication technology; understanding the implications of technology for individuals and society; using technology safely, respectfully and responsibly.",
      "curriculum_context": "Digital literacy at KS3 and KS4 encompasses both practical competence with digital tools and critical understanding of the social, ethical and safety implications of digital technology. Pupils are expected to use technology creatively and responsibly to create digital artefacts of real value, selecting appropriate tools for specific purposes. Online safety at this stage addresses more sophisticated threats and issues: identity fraud, manipulation, extremist content, digital rights and privacy. The ethical dimensions of computing - the impact of algorithmic decision-making, data surveillance, automation and artificial intelligence on individuals and society - become increasingly important and contested topics that pupils need conceptual tools to engage with. Responsible digital citizenship involves both protecting oneself and contributing positively to digital communities.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    }
  ],
  "objectives": [
    {
      "objective_id": "CO-KS34-O001",
      "domain_id": "CO-KS34-D001",
      "objective_text": "design, use and evaluate computational abstractions that model the state and behaviour of real-world problems and physical systems",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "CO-KS34-O002",
      "domain_id": "CO-KS34-D001",
      "objective_text": "understand several key algorithms that reflect computational thinking [for example, ones for sorting and searching]; use logical reasoning to compare the utility of alternative algorithms for the same problem",
      "non_statutory_guidance": null,
      "examples": "ones for sorting and searching",
      "is_statutory": true
    },
    {
      "objective_id": "CO-KS34-O003",
      "domain_id": "CO-KS34-D001",
      "objective_text": "use 2 or more programming languages, at least one of which is textual, to solve a variety of computational problems; make appropriate use of data structures [for example, lists, tables or arrays]; design and develop modular programs that use procedures or functions",
      "non_statutory_guidance": null,
      "examples": "lists, tables or arrays",
      "is_statutory": true
    },
    {
      "objective_id": "CO-KS34-O004",
      "domain_id": "CO-KS34-D001",
      "objective_text": "understand simple Boolean logic [for example, AND, OR and NOT] and some of its uses in circuits and programming; understand how numbers can be represented in binary, and be able to carry out simple operations on binary numbers [for example, binary addition, and conversion between binary and decimal]",
      "non_statutory_guidance": null,
      "examples": "AND, OR and NOT; binary addition, and conversion between binary and decimal",
      "is_statutory": true
    },
    {
      "objective_id": "CO-KS34-O005",
      "domain_id": "CO-KS34-D002",
      "objective_text": "understand the hardware and software components that make up computer systems, and how they communicate with one another and with other systems",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "CO-KS34-O006",
      "domain_id": "CO-KS34-D002",
      "objective_text": "understand how instructions are stored and executed within a computer system; understand how data of various types (including text, sounds and pictures) can be represented and manipulated digitally, in the form of binary digits",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "CO-KS34-O007",
      "domain_id": "CO-KS34-D003",
      "objective_text": "undertake creative projects that involve selecting, using, and combining multiple applications, preferably across a range of devices, to achieve challenging goals",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "CO-KS34-O008",
      "domain_id": "CO-KS34-D003",
      "objective_text": "create, re-use, revise and repurpose digital artefacts for a given audience, with attention to trustworthiness, design and usability",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "CO-KS34-O009",
      "domain_id": "CO-KS34-D003",
      "objective_text": "understand a range of ways to use technology safely, respectfully, responsibly and securely, including protecting their online identity and privacy; recognise inappropriate content, contact and conduct and know how to report concerns",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "CO-KS34-C001",
      "concept_name": "Algorithms: Sorting, Searching and Complexity",
      "description": "Classic algorithms for sorting (bubble sort, merge sort, quick sort) and searching (linear search, binary search) represent fundamental computational problems with well-understood solutions of different efficiencies. Algorithm complexity - how the time or space required by an algorithm grows as the input size grows - is expressed using Big O notation (O(n), O(n log n), O(n^2)). Understanding that different algorithms solving the same problem have different performance characteristics, and that the choice of algorithm matters at scale, is a key insight of computer science. At KS3, pupils study these algorithms, understand how they work and begin to compare their relative efficiency.",
      "teaching_guidance": "Implement sorting and searching algorithms in code and trace their execution with small data sets. Use physical activities (sorting cards, searching for a name in a list) to make the algorithms tangible before coding. Compare the steps required by linear and binary search for different list sizes to develop intuitive understanding of efficiency. Trace merge sort recursively to understand divide-and-conquer approaches. Connect to real applications: how does a database search work? Why does Google search so quickly? Introduce Big O notation as a way of expressing relative efficiency.",
      "key_vocabulary": "algorithm, sort, search, bubble sort, merge sort, binary search, linear search, efficiency, complexity, Big O, trace, comparison, swap, iteration, recursion",
      "common_misconceptions": "Pupils may assume the algorithm they first learned is the best for all cases. Exploring performance with different input sizes and orders demonstrates that no single algorithm is always optimal. Binary search's requirement for a sorted list is often overlooked; understanding the preconditions of an algorithm is part of understanding the algorithm. Tracing recursive algorithms like merge sort can be confusing; explicit tree diagrams that show recursive calls make the structure visible.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "CO-KS34-C002",
      "concept_name": "Boolean Logic and Binary",
      "description": "Boolean algebra is the branch of mathematics that deals with variables that can take only two values (true/false, 1/0). Boolean logic operations (AND, OR, NOT, NAND, NOR, XOR) are the fundamental operations of digital computing, implemented in hardware as logic gates. Binary (base 2) is the number system used by digital computers, where all data is represented as sequences of 0s and 1s. Understanding binary representation of integers, converting between binary and decimal, and performing binary arithmetic are foundational to understanding how computers store and process all types of data. Boolean logic connects programming (where logical conditions control program flow) to hardware (where logic gates implement digital circuits).",
      "teaching_guidance": "Teach Boolean operations through truth tables before connecting to programming and hardware. Use logic gate diagrams to show how Boolean operations are implemented physically. Practice binary-to-decimal and decimal-to-binary conversion systematically. Teach binary addition with carries. Connect to programming: the Boolean conditions in if statements and while loops use the same Boolean logic. Discuss how images, sound and text are encoded in binary: different data types, same underlying representation. Use physical logic gate simulations where possible.",
      "key_vocabulary": "Boolean, binary, bit, byte, AND, OR, NOT, truth table, logic gate, convert, decimal, hexadecimal, unsigned, signed, twos complement, overflow",
      "common_misconceptions": "Pupils often confuse binary (a number system) with a code for letters or colours, not realising it is a general-purpose representational system for any data. The fact that 0 and 1 in binary do not mean 'nothing' and 'one' but represent powers of two needs explicit teaching. Boolean AND requiring both inputs to be true (not either), and the counterintuitive behaviour of NAND and NOR gates, are common points of confusion requiring careful attention to truth tables.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "CO-KS34-C003",
      "concept_name": "Data Structures and Modular Programming",
      "description": "Data structures are ways of organising and storing data in a program so that it can be accessed and modified efficiently. Common data structures include arrays (indexed collections of items of the same type), lists (dynamic ordered collections), stacks (last-in, first-out collections), queues (first-in, first-out collections), and dictionaries/hash maps (key-value pair collections). Modular programming organises code into self-contained procedures or functions, each responsible for a specific task. This improves readability, enables reuse and simplifies debugging. At KS3, pupils learn to choose appropriate data structures and to design modular programs using procedures and functions.",
      "teaching_guidance": "Introduce data structures through problems they naturally solve: arrays for storing a list of scores, a stack for undo operations, a queue for a print job buffer. Teach pupils to choose data structures based on the operations required. Model modular program design: identify distinct tasks, write a function for each, test functions independently. Practice refactoring flat programs into modular ones. Connect data structures to real applications: how does a social media platform store users' friend lists? Develop understanding of the difference between accessing an element by index and searching through a list.",
      "key_vocabulary": "data structure, array, list, stack, queue, dictionary, record, index, procedure, function, parameter, return, modular, reuse, encapsulate",
      "common_misconceptions": "Pupils may not see the need for data structures beyond simple variables, especially in small programs. Showing how programs that use appropriate data structures scale to larger problems motivates their use. The difference between passing data to a function by value and by reference is a subtle but important concept that affects program behaviour. Functions that return values are often confused with procedures that only produce side effects; consistent terminology and practice develops clarity.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "CO-KS34-C004",
      "concept_name": "Ethics, Privacy and the Social Impact of Computing",
      "description": "Computing technologies are transforming society in profound ways, creating new opportunities and new risks. Algorithmic decision-making - using programs to make or assist decisions about credit, employment, criminal sentencing, medical diagnosis - raises questions about fairness, transparency and accountability when algorithms encode or amplify biases. Mass surveillance enabled by digital data collection challenges privacy and civil liberties. Automation threatens some forms of employment while creating others. Artificial intelligence raises questions about responsibility, creativity and the nature of intelligence. At KS3 and KS4, pupils develop the conceptual tools to engage with these ethical and social dimensions of computing as informed citizens.",
      "teaching_guidance": "Use real-world case studies to anchor abstract ethical discussions: algorithmic bias in hiring tools, facial recognition errors, data breaches. Teach pupils to identify stakeholders in technology systems and whose interests may be served or harmed. Develop vocabulary for ethical analysis: fairness, accountability, transparency, consent, privacy. Explore both the benefits and the risks of AI, social media and surveillance technologies. Connect to legal frameworks: GDPR, computer misuse legislation, intellectual property. Encourage pupils to evaluate technology critically rather than accepting or rejecting it wholesale.",
      "key_vocabulary": "ethics, privacy, surveillance, algorithm, bias, fairness, transparency, accountability, artificial intelligence, automation, data, consent, right, responsibility, impact",
      "common_misconceptions": "Pupils may assume that algorithms are neutral because they are mathematical. The data used to train machine learning models reflects historical human decisions and can encode and amplify historical biases. The idea that privacy is only a concern for people with 'something to hide' is common but misguided; developing nuanced understanding of privacy as a social good prevents this. Technology is neither inherently good nor bad; its impacts depend on how it is designed, deployed and governed.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": true
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "CO-KS12-C001",
      "dependent_concept": "CO-KS34-C001",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS3 study of sorting and searching algorithms directly extends the KS1-2 understanding of what algorithms are, applying that conceptual foundation to specific, classic algorithms with known efficiency characteristics."
    },
    {
      "prerequisite_concept": "CO-KS12-C002",
      "dependent_concept": "CO-KS34-C003",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS3 data structures and modular programming extend the KS1-2 programming skills of sequence, selection and repetition into more complex program structures requiring organised storage and modular code design."
    },
    {
      "prerequisite_concept": "CO-KS12-C005",
      "dependent_concept": "CO-KS34-C004",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.75,
      "rationale": "KS1-2 online safety and digital citizenship provides the foundational awareness of digital risks and responsibilities on which the more sophisticated ethical and social analysis of computing technology at KS3-4 is built."
    }
  ]
}
