{
  "metadata": {
    "subject": "Geography",
    "key_stage": "KS3",
    "years_covered": [7, 8, 9],
    "document_reference": "DFE-00193-2013",
    "extraction_date": "2026-02-17",
    "structure_rating": 8
  },
  "domains": [
    {
      "domain_id": "GE-KS3-D001",
      "domain_name": "Locational Knowledge",
      "description": "Consolidating and extending knowledge of locations across the globe including Africa, Russia, Asia and the Middle East; understanding environmental regions, key physical and human characteristics and major cities.",
      "curriculum_context": "Locational knowledge at KS3 consolidates and extends the world geography framework established at primary school. Pupils extend their knowledge to include Africa, Russia, Asia (with focus on China and India) and the Middle East - regions that are central to understanding contemporary global issues but often underrepresented in primary curricula. The study of environmental regions within these areas - desert, savannah, polar, rainforest - connects locational knowledge to physical geography and provides the geographical context for understanding human activity. Developing more detailed knowledge of the world's major geographical regions, including their human and physical characteristics, prepares pupils to engage with global issues from a grounded spatial understanding.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "GE-KS3-D002",
      "domain_name": "Place Knowledge",
      "description": "Understanding the human and physical geography of a region in Africa and a region in Asia, including human-physical interactions and how they change over time.",
      "curriculum_context": "Place knowledge at KS3 is centred on regions that offer contrast and complexity: a region in Africa and a region in Asia. These choices ensure that pupils develop knowledge of parts of the world that are central to global patterns of development, migration, conflict and environmental change, but that are often poorly understood by UK pupils. Understanding regions in depth - their physical geography, their human geography, the interaction between human activity and physical environment, and how these relationships change over time - develops the sophisticated place knowledge that underpins geographical understanding of global issues. The requirement to understand how places change over time prevents static, stereotypical portrayals of places and develops awareness of dynamism and agency.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "GE-KS3-D003",
      "domain_name": "Human and Physical Geography",
      "description": "Understanding geological timescales, plate tectonics, rocks, weathering, soils, weather systems, climate change, glaciation, hydrology and coasts; and population and urbanisation, international development, economic sectors, natural resources and human-physical environment interactions.",
      "curriculum_context": "The scope of physical and human geography at KS3 expands dramatically to include the geological and tectonic processes that shape the planet over vast timescales, as well as contemporary processes of climate change, glaciation, hydrology and coastal development. In human geography, pupils engage with the major processes transforming the contemporary world: population growth and urbanisation, the uneven geography of development, and the organisation of global economic activity. The curriculum requires understanding of how humans interact with physical environments - modifying them, depending on them, being threatened by them - connecting physical and human geography in ways that mirror the real complexity of geographical processes. This breadth prepares pupils to engage critically with major global challenges.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "GE-KS3-D004",
      "domain_name": "Geographical Skills and Fieldwork",
      "description": "Using geographical skills to collect, analyse and communicate information; using maps, atlases, globes and digital/GIS technologies; conducting fieldwork in contrasting locations.",
      "curriculum_context": "Geographical skills at KS3 develop in sophistication and range, incorporating geographical information systems (GIS) alongside more traditional map-based skills. Pupils are expected to use a wider range of data sources and analytical techniques, including statistical data, graphs, diagrams and digital mapping. Fieldwork at KS3 includes experience in contrasting locations - urban and rural, coastal and inland - developing the ability to ask geographical questions, collect and analyse primary data, and draw evidence-based conclusions in real geographical environments. The integration of GIS and digital technologies reflects the transformation of professional geographical practice and equips pupils with contemporary geographical tools.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    }
  ],
  "objectives": [
    {
      "objective_id": "GE-KS3-O001",
      "domain_id": "GE-KS3-D001",
      "objective_text": "consolidate and extend their knowledge of the world's countries, using maps of the world to focus on Africa, Russia, Asia and the Middle East, focusing on their environmental regions, including polar and hot deserts, key physical and human characteristics, countries, and major cities",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "GE-KS3-O002",
      "domain_id": "GE-KS3-D002",
      "objective_text": "understand geographical similarities, differences and links between places through the study of human and physical geography of a region within Africa and a region within Asia",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "GE-KS3-O003",
      "domain_id": "GE-KS3-D003",
      "objective_text": "understand, through the use of detailed place-based exemplars at a variety of scales, the key processes in physical geography relating to: geological timescales and plate tectonics; rocks, weathering and soils; weather and climate, including the change in climate from the Ice Age to the present, and evidence of further change; glaciation, hydrology and coasts",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "GE-KS3-O004",
      "domain_id": "GE-KS3-D003",
      "objective_text": "understand, through the use of detailed place-based exemplars at a variety of scales, the key processes in human geography relating to: population and urbanisation; international development; economic activity in the primary, secondary, tertiary and quaternary sectors; the use of natural resources, including energy production and dilemmas surrounding this",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "GE-KS3-O005",
      "domain_id": "GE-KS3-D004",
      "objective_text": "build on their knowledge of globes, maps and atlases and apply and develop this knowledge routinely in the classroom and in the field",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "GE-KS3-O006",
      "domain_id": "GE-KS3-D004",
      "objective_text": "interpret Ordnance Survey maps in the classroom and the field, including using grid references and scale, topographical and other thematic mapping, and aerial and satellite photographs",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "GE-KS3-O007",
      "domain_id": "GE-KS3-D004",
      "objective_text": "use Geographical Information Systems (GIS) to view, analyse and interpret places and data",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "GE-KS3-O008",
      "domain_id": "GE-KS3-D004",
      "objective_text": "use fieldwork in contrasting locations to collect, analyse and draw conclusions from geographical data, using multiple sources of increasingly complex information",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "GE-KS3-C001",
      "concept_name": "Plate Tectonics and Geological Processes",
      "description": "Plate tectonics is the scientific theory that the Earth's lithosphere is divided into large plates that move relative to each other over geological timescales, driven by convection currents in the mantle. Where plates meet, the interactions produce earthquakes, volcanoes, mountain building and ocean trenches. Understanding geological timescales - the vast spans of time over which these processes operate - requires conceptual adjustment from human time frames to geological ones. At KS3, pupils develop understanding of plate tectonics as the unifying theory of physical geography, explaining the distribution of earthquakes, volcanoes and mountain ranges globally.",
      "teaching_guidance": "Use animated diagrams to show plate movement and the different types of plate boundary (convergent, divergent, transform). Connect plate tectonics to the distribution of volcanoes and earthquakes on a global map. Study specific case studies at different plate boundaries. Explore geological timescales using analogies that make the depth of time comprehensible. Connect to rocks and the rock cycle: how does plate tectonic activity create igneous, sedimentary and metamorphic rocks? Discuss the evidence for plate tectonics: seafloor spreading, fossil distributions, jigsaw fit of continents.",
      "key_vocabulary": "plate tectonics, lithosphere, mantle, convection, boundary, convergent, divergent, transform, earthquake, volcano, subduction, mountain, ridge, trench, geological timescale",
      "common_misconceptions": "Pupils often think plate movement is fast enough to observe directly. Establishing that continental drift occurs at rates measured in centimetres per year over millions of years develops appropriate scale of time. The mechanism of plate movement (convection currents) is frequently confused with the plates themselves; keeping the two clearly distinct prevents conceptual muddle. The relationship between plate boundaries and the locations of earthquakes and volcanoes needs to be established empirically through map work as well as theoretically.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "GE-KS3-C002",
      "concept_name": "Global Development and Inequality",
      "description": "Development refers to the process of improvement in human wellbeing and living standards, measured by indicators such as GDP, HDI, life expectancy, literacy rates and access to services. The geography of development is highly uneven: some parts of the world have achieved high levels of human development while others remain in conditions of poverty and deprivation. Understanding why development is uneven requires analysis of historical factors (colonialism, trade patterns), geographical factors (resource endowment, climate, landlocked position) and current political and economic factors. At KS3, pupils develop the conceptual frameworks to analyse and evaluate patterns of global development.",
      "teaching_guidance": "Introduce a range of development indicators and discuss their strengths and limitations. Map the global distribution of development and identify patterns. Study specific countries at different levels of development using a range of data sources. Analyse the causes of uneven development using multiple factors. Discuss the debate between different theories of development (modernisation, dependency, bottom-up). Connect to trade, aid, debt and migration as mechanisms through which development is shaped. Evaluate proposed solutions to development challenges critically.",
      "key_vocabulary": "development, GDP, HDI, literacy, life expectancy, inequality, poverty, wealth, aid, trade, debt, colonialism, dependency, sustainable development, indicator",
      "common_misconceptions": "Pupils may view development as a simple linear progression from 'undeveloped' to 'developed', missing the complexity and political contestation involved. The assumption that more development is always better can be challenged by discussing environmental costs and alternative conceptions of wellbeing. Using the terminology 'developing' and 'developed' can mislead; discussing alternative framings (Global North/South, high-income/low-income) develops more nuanced vocabulary.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "GE-KS3-C003",
      "concept_name": "Climate Change and Environmental Geography",
      "description": "Climate change refers to long-term shifts in global temperatures and weather patterns, currently driven primarily by human emissions of greenhouse gases. Understanding climate change requires both physical geography knowledge (the mechanisms of the greenhouse effect, feedback loops, ocean circulation) and human geography knowledge (the economic and social causes of emissions, the uneven distribution of impacts and vulnerabilities, and the politics of international responses). At KS3, pupils develop understanding of climate change as a defining geographical challenge of the contemporary period, combining scientific understanding with social and political analysis.",
      "teaching_guidance": "Teach the physical mechanism of the enhanced greenhouse effect clearly before moving to its consequences. Distinguish between climate (long-term patterns) and weather (short-term conditions), and between natural climate variability and human-induced change. Map the vulnerability of different places to climate change impacts: sea level rise, drought, extreme weather. Explore the uneven responsibility for and impact of climate change. Discuss different responses: mitigation (reducing emissions), adaptation (adjusting to change) and geo-engineering. Connect to pupils' local environment: how might this area change?",
      "key_vocabulary": "climate change, greenhouse effect, greenhouse gas, carbon dioxide, global warming, feedback, sea level, extreme weather, mitigation, adaptation, vulnerability, emissions, fossil fuel, renewable energy",
      "common_misconceptions": "Pupils may confuse the ozone hole with the greenhouse effect; these are distinct phenomena with different causes, mechanisms and solutions. The idea that climate change is natural and has always occurred can be used to dismiss human-induced change; distinguishing natural variability from anthropogenic change is crucial. The concept of feedback loops is counterintuitive for many pupils; concrete examples (melting permafrost releasing methane, reduced ice reflecting less sunlight) make feedbacks tangible.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": true
    },
    {
      "concept_id": "GE-KS3-C004",
      "concept_name": "Population, Urbanisation and Migration",
      "description": "Population geography examines the distribution, density, composition and change of human populations. Urbanisation is the process by which an increasing proportion of a population lives in cities, driven by rural-to-urban migration in search of economic opportunities. Migration is the movement of people between places, driven by push factors (poverty, conflict, climate hazards) and pull factors (economic opportunity, safety, family). At KS3, pupils develop understanding of the major demographic processes reshaping the contemporary world: global population growth, urbanisation, ageing populations in wealthy countries and migration at local, national and global scales.",
      "teaching_guidance": "Use population pyramids to analyse population structure and predict future trends. Map the global distribution of population and explain the factors that determine population density. Study urbanisation in contrasting global contexts: high-income and low-income countries. Examine specific megacities and their challenges. Analyse migration using push-pull frameworks and case studies. Discuss the causes and consequences of population change for environments, economies and societies. Connect to current news and events involving migration, refugees and demographic change.",
      "key_vocabulary": "population, density, distribution, urbanisation, migration, push factor, pull factor, refugee, megacity, suburb, demographics, birth rate, death rate, natural increase, ageing population",
      "common_misconceptions": "Pupils may assume that population growth is necessarily problematic. The relationship between population density and resource availability is more complex; discussing both overpopulated and underpopulated regions challenges simple correlations. Migration is often portrayed as a problem rather than as a long-standing human response to opportunity and threat; a balanced examination of causes and consequences develops more nuanced understanding. The demographic transition model is a useful but simplified framework; discussing its limitations develops critical thinking.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "GE-KS2-C001",
      "dependent_concept": "GE-KS3-C001",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "KS2 understanding of latitude, longitude and the global coordinate system is the spatial prerequisite for locating and understanding the distribution of plate boundaries, earthquake zones and volcanic regions that are central to KS3 plate tectonics."
    },
    {
      "prerequisite_concept": "GE-KS2-C004",
      "dependent_concept": "GE-KS3-C004",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS2 settlement and economic geography provides the foundational concepts of settlement, land use and economic activity on which KS3 population, urbanisation and migration studies build in greater analytical depth."
    },
    {
      "prerequisite_concept": "GE-KS2-C002",
      "dependent_concept": "GE-KS3-C003",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.75,
      "rationale": "KS2 climate zones and biomes knowledge provides the physical geography baseline from which KS3 climate change can be understood as a shift in established climate patterns, requiring prior knowledge of what those patterns are and why they exist."
    }
  ]
}
