{
  "metadata": {
    "subject": "History",
    "key_stage": "KS3",
    "years_covered": [
      7,
      8,
      9
    ],
    "document_reference": "DFE-00194-2013",
    "extraction_date": "2026-02-17",
    "structure_rating": 8
  },
  "domains": [
    {
      "domain_id": "HI-KS3-D001",
      "domain_name": "British History from 1066 to Present",
      "description": "Studying the development of Church, state and society in Britain from the Norman Conquest through the medieval period, Reformation, Civil War, Industrial Revolution and into the twentieth century, including the World Wars and post-war period.",
      "curriculum_context": "British history at KS3 begins where the primary curriculum ends, taking pupils from 1066 to the present day through a series of substantial period studies. The structure reflects both chronological breadth (covering nearly a thousand years of British history) and thematic depth (organising content around the development of Church, state, society and economy as interconnected themes that run through all periods). Pupils study the transformation of Britain from a feudal medieval monarchy to a parliamentary democracy with a global empire, and then examine how that empire was built and how it dissolved. Studying the Holocaust is specifically mentioned as part of 'challenges for Britain, Europe and the wider world 1901 to present day', reflecting its status as a mandatory topic in the history curriculum with particular moral and educational significance.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "HI-KS3-D002",
      "domain_name": "World and Non-European History",
      "description": "Studying at least one significant society or issue in world history, and understanding how events in the wider world connect to and contrast with British history.",
      "curriculum_context": "World history at KS3 requires study of at least one significant world society or period that is not defined by its relationship to Britain or Europe: Mughal India, Qing China, Russia under the Tsars, or the United States in the twentieth century are suggested examples. This requirement ensures that pupils develop a genuinely global historical perspective, understanding that significant historical developments have occurred simultaneously across the world, not only in Britain and Europe. Connecting world history to British history - through colonialism, trade, conflict and cultural exchange - develops pupils' understanding of how Britain's history is embedded in a global context rather than separate from it.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "HI-KS3-D003",
      "domain_name": "Historical Thinking and Disciplinary Skills",
      "description": "Developing all aspects of historical thinking: chronology, causation, consequence, significance, change and continuity, evidence, interpretation, and the ability to construct historical arguments.",
      "curriculum_context": "Historical thinking at KS3 is expected to become fully developed across all the second-order concepts (the thinking tools of the discipline) as well as substantive historical knowledge. Pupils are expected to understand historical events and periods with increasing analytical sophistication, moving from description to explanation to evaluation and argument. The construction of sustained historical arguments - selecting, organising and deploying evidence to support a thesis - develops the high-level literacy and analytical capabilities that are central to academic historical study. At KS3, history as a discipline is fully established: pupils understand both the knowledge that history produces and the methods by which it produces it.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    }
  ],
  "objectives": [
    {
      "objective_id": "HI-KS3-O001",
      "domain_id": "HI-KS3-D001",
      "objective_text": "the development of Church, state and society in Medieval Britain 1066-1509",
      "non_statutory_guidance": "This could include: the Norman Conquest; Magna Carta and Parliament; the Black Death and Peasants' Revolt; the Hundred Years War; the Wars of the Roses; the English Reformation",
      "examples": "Norman Conquest; Magna Carta; Black Death; Peasants' Revolt; Hundred Years War; Wars of the Roses; English Reformation",
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS3-O002",
      "domain_id": "HI-KS3-D001",
      "objective_text": "the development of Church, state and society in Britain 1509-1745",
      "non_statutory_guidance": "This could include: the English Reformation; the reign of Elizabeth I; the English Civil War; the Glorious Revolution; the development of trade, colonialism and the slave trade",
      "examples": "English Reformation; Elizabeth I; English Civil War; Glorious Revolution; trade, colonialism and the slave trade",
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS3-O003",
      "domain_id": "HI-KS3-D001",
      "objective_text": "ideas, political power, industry and empire: Britain, 1745-1901",
      "non_statutory_guidance": "This could include: the Enlightenment; the American Revolution; the French Revolution; the Industrial Revolution; the abolition of the slave trade and slavery; the British Empire",
      "examples": "Enlightenment; American Revolution; Industrial Revolution; abolition of slavery; British Empire",
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS3-O004",
      "domain_id": "HI-KS3-D001",
      "objective_text": "challenges for Britain, Europe and the wider world 1901 to the present day",
      "non_statutory_guidance": "This could include: the First World War; the interwar period; the Second World War and the Holocaust; the Cold War; decolonisation; Britain's changing role in the world",
      "examples": "First World War; interwar period; Second World War and the Holocaust; Cold War; decolonisation",
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS3-O005",
      "domain_id": "HI-KS3-D001",
      "objective_text": "a local history study",
      "non_statutory_guidance": "For example: a depth study linked to one of the periods studied; a study over time tracing how national history is reflected in the locality; study of an aspect of history or site dating from a period beyond 1066 significant in the locality",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS3-O006",
      "domain_id": "HI-KS3-D001",
      "objective_text": "a study of an aspect or theme in British history that consolidates and extends pupils' chronological knowledge from before 1066",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS3-O007",
      "domain_id": "HI-KS3-D002",
      "objective_text": "at least one study of a significant society or issue in world history and how it has connected to wider world developments [for example, Mughal India 1526-1857; China's Qing dynasty 1644-1912; Changing Russian empires c.1800-1989; USA in the 20th Century]",
      "non_statutory_guidance": null,
      "examples": "Mughal India 1526-1857; China's Qing dynasty 1644-1912; Changing Russian empires c.1800-1989; USA in the 20th Century",
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "HI-KS3-C001",
      "domain_id": "HI-KS3-D001",
      "concept_name": "Power, Monarchy and Democracy",
      "description": "The history of political power in Britain is the story of the transformation from absolute monarchy to parliamentary democracy over approximately a thousand years. Key stages include the limitation of royal power by Magna Carta (1215), the development of Parliament, the English Civil War and execution of Charles I, the Glorious Revolution and constitutional monarchy, the gradual extension of the franchise, and the welfare state. Understanding this progression requires analysis of the forces that drove change - economic development, religious conflict, intellectual movements, social pressure - and the contested nature of each advance.",
      "teaching_guidance": "Build an explicit narrative of the development of British democracy as a thread running through medieval and early modern history. Study key moments of constitutional change in depth: Magna Carta, the Civil War, the Glorious Revolution, the Reform Acts, universal suffrage. Analyse the arguments of those who resisted and those who demanded change. Connect to pupils' understanding of current democratic institutions: Parliament, elections, rights. Compare British constitutional development with developments in other countries.",
      "key_vocabulary": "monarchy, parliament, democracy, constitution, rights, revolution, reform, franchise, suffrage, civil war, constitutional, feudal, Magna Carta, sovereignty, power",
      "common_misconceptions": "Pupils may see the development of democracy as inevitable or straightforward. The contested, reversible nature of each advance - and the real possibility that different outcomes were possible - develops more sophisticated historical understanding. Pupils may present Magna Carta as establishing democracy; in reality it was a document protecting baronial privilege, and its later association with rights is a product of subsequent reinterpretation. The diversity of attitudes to democracy across different social groups at each stage of change needs explicit attention.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "HI-KS3-C002",
      "domain_id": "HI-KS3-D001",
      "concept_name": "Empire, Colonialism and its Consequences",
      "description": "The British Empire was at its height one of the largest empires in history, eventually covering approximately a quarter of the world's land surface. Its creation involved trade, conquest, settlement and the exploitation of colonised peoples and their resources. The transatlantic slave trade was an integral part of the economic system of empire. Decolonisation in the twentieth century dismantled formal imperial structures, but the legacies of empire - in patterns of global inequality, migration, cultural exchange and political boundaries - remain central to understanding the contemporary world. At KS3, pupils develop analytical understanding of empire as a global historical force with enduring consequences.",
      "teaching_guidance": "Study the British Empire across its full chronology: early trading relationships, plantation colonies, conquest of India, the Victorian empire, decolonisation. Connect to the transatlantic slave trade: its scale, mechanisms, economic importance and human consequences. Explore the experiences of colonised peoples as well as colonisers. Study decolonisation: what drove it? Who resisted? What did newly independent states inherit? Connect imperial history to contemporary issues: migration, diversity, global inequality. Be alert to and challenge triumphalist or apologetic framings that oversimplify complex history.",
      "key_vocabulary": "empire, colonialism, imperialism, slave trade, plantation, colony, decolonisation, independence, exploitation, resistance, trade, legacy, migration, inequality, heritage",
      "common_misconceptions": "Pupils may have received simplified positive or negative narratives about empire. Developing a more complex, evidence-based understanding that acknowledges both the violence and exploitation of empire and the complex ways in which colonised peoples responded to and shaped imperial history is the educational goal. The slave trade is sometimes treated as separate from empire; integrating it as a foundational element of the economic and social history of empire gives it appropriate centrality.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "HI-KS3-C003",
      "domain_id": "HI-KS3-D002",
      "concept_name": "The Holocaust: Understanding Genocide",
      "description": "The Holocaust was the systematic, state-sponsored persecution and murder of six million Jews by the Nazi regime and its collaborators between 1933 and 1945. It also included the murder of millions of others: Roma, disabled people, Soviet prisoners of war, political opponents, gay men. Understanding the Holocaust requires knowledge of the specific historical context (Weimar Germany, the rise of Nazism, antisemitism), the mechanisms of persecution (propaganda, legal discrimination, ghettoisation, deportation, mass murder), and the responses of bystanders, collaborators, resisters and rescuers. It also requires engagement with the moral questions the Holocaust raises about human nature, responsibility and the fragility of civilisation.",
      "teaching_guidance": "Follow guidance from the Holocaust Educational Trust and Yad Vashem on sensitive and effective Holocaust education. Begin with individual testimony to establish the human reality before moving to broader historical context. Study the progression of persecution rather than jumping to the death camps. Examine the roles of different groups: perpetrators, bystanders, collaborators, resisters, rescuers. Discuss the conditions that made the Holocaust possible: the role of ideology, propaganda, dehumanisation, bureaucracy and ordinary people's choices. Avoid comparisons that trivialise the Holocaust. Connect to the concept of genocide and international human rights frameworks that emerged in response.",
      "key_vocabulary": "Holocaust, genocide, antisemitism, Nazi, persecution, deportation, concentration camp, extermination, testimony, survivor, bystander, perpetrator, rescuer, never again, memorial",
      "common_misconceptions": "Pupils may think the Holocaust happened quickly and suddenly. Understanding the gradual escalation of persecution from 1933 to 1945 - and that it was not inevitable at any stage - develops more nuanced understanding. Pupils may portray all Germans as knowing perpetrators or all as ignorant victims; the complex spectrum of responses - active support, passive compliance, resistance and rescue - challenges simple categorisation. The Holocaust should be understood in its specific historical context rather than as a timeless example of human evil.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "HI-KS3-C004",
      "domain_id": "HI-KS3-D003",
      "concept_name": "Constructing Historical Arguments",
      "description": "A historical argument is a structured, evidenced response to a historical question, in which a thesis is developed, supported by selected and evaluated evidence, and qualified where necessary by consideration of counter-evidence or alternative interpretations. Constructing historical arguments requires integrating all the second-order concepts of the discipline: chronological knowledge, causal understanding, appreciation of significance, ability to evaluate evidence and awareness of interpretive diversity. At KS3, pupils are expected to construct extended historical arguments in both oral discussion and extended writing.",
      "teaching_guidance": "Teach argument construction explicitly as a skill: develop a thesis, select supporting evidence, address counter-evidence, conclude. Use structured debate and discussion activities to develop oral argument skills before extended writing. Teach pupils to signal the structure of their argument through discourse markers (However, Furthermore, Nevertheless). Build essay writing skills progressively: from paragraph structure to full essay. Use mark schemes and exemplars to make clear what a strong historical argument looks like. Provide regular feedback focused on argument quality as well as historical knowledge.",
      "key_vocabulary": "argument, thesis, evidence, counter-argument, evaluate, interpret, justify, assert, claim, support, qualify, conclude, sustained, analytical, perspective",
      "common_misconceptions": "Pupils may write descriptive narratives rather than analytical arguments, telling a story rather than answering a question. Making the question central and repeatedly asking 'does this sentence answer the question?' redirects from narrative to argument. Pupils may present evidence without linking it explicitly to their argument; teaching them to explain the significance of each piece of evidence develops more analytical writing. The idea that a good historical argument acknowledges and addresses counter-evidence rather than ignoring it is important to establish.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "HI-KS2-C001",
      "dependent_concept": "HI-KS3-C001",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS2 understanding of historical causation is the prerequisite for the more sophisticated analysis of how political power developed and changed in Britain, which requires multi-causal historical explanation at the level expected at KS3."
    },
    {
      "prerequisite_concept": "HI-KS2-C003",
      "dependent_concept": "HI-KS3-C004",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS2 historical evidence and interpretation skills are directly extended and deepened in KS3 argument construction, which requires the ability to evaluate, select and deploy historical evidence in support of an analytical thesis."
    },
    {
      "prerequisite_concept": "HI-KS2-C005",
      "dependent_concept": "HI-KS3-C001",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS2 knowledge of British historical periods from prehistoric to medieval provides the chronological foundation and content knowledge on which KS3 British history from 1066 onwards is built."
    },
    {
      "prerequisite_concept": "HI-KS3-C004",
      "dependent_concept": "HI-KS3-C003",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.7,
      "rationale": "Understanding the Holocaust requires not only historical knowledge but the analytical and argumentative skills to engage with moral complexity, evaluate diverse evidence and construct justified conclusions from incomplete and contested information."
    }
  ]
}
