{
  "metadata": {
    "subject": "Languages",
    "key_stage": "KS3",
    "years_covered": [
      7,
      8,
      9
    ],
    "document_reference": "DFE-00195-2013",
    "extraction_date": "2026-02-17",
    "structure_rating": 7
  },
  "domains": [
    {
      "domain_id": "LA-KS3-D001",
      "domain_name": "Listening and Speaking",
      "description": "Listening to and understanding spoken language from a variety of sources and speakers, including different regional varieties and accents; initiating and developing conversations with increasing fluency and confidence; speaking with accurate pronunciation and intonation.",
      "curriculum_context": "Listening and speaking at KS3 demand a substantial leap beyond the KS2 foundation. Pupils encounter spoken language as it is actually used - with variation in accent, dialect, speed and register - rather than only in carefully controlled classroom settings. This exposure to authentic spoken language develops the listening stamina and processing flexibility that genuine communicative competence requires. Speaking expectations at KS3 require pupils to initiate and develop conversations, moving beyond responding to prompts to generating and sustaining exchanges autonomously. Accurate pronunciation and intonation are specifically required because these are the features of speech that mark a speaker as comprehensible to native speakers. The ability to narrate, explain and express opinions orally develops the kind of extended, purposeful speaking that characterises mature language use.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "LA-KS3-D002",
      "domain_name": "Reading",
      "description": "Reading and understanding a range of authentic and adapted written materials, literary texts and online sources; using translation and contextual strategies to comprehend unfamiliar language.",
      "curriculum_context": "Reading at KS3 introduces pupils to authentic and literary texts, representing a qualitative shift from the controlled, pedagogically simplified texts that dominate KS2 language learning. Authentic materials - newspaper articles, websites, short stories, poems - expose pupils to the full complexity of the target language as used by native speakers, including vocabulary they have not been explicitly taught, idiomatic expressions and complex sentence structures. Reading literary texts develops engagement with the cultural and imaginative life of the target language community, connecting language learning to broader cultural understanding. The use of translation as a comprehension strategy (rather than as a crutch to avoid engagement with the target language) develops pupils' ability to move between languages with precision.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "LA-KS3-D003",
      "domain_name": "Writing",
      "description": "Writing prose using an increasingly wide range of grammatical structures and vocabulary; translating short passages into the target language; writing for different purposes and audiences with attention to accuracy.",
      "curriculum_context": "Writing at KS3 requires the consolidation of grammatical knowledge into controlled, accurate written production across a range of text types and purposes. Pupils are expected to use a wide range of grammar and vocabulary - including complex structures such as different tenses, moods and voices - with increasing accuracy and sophistication. The explicit requirement to translate short passages into the target language places a premium on grammatical precision, since translation errors are immediately apparent when measured against the source text. Writing for different purposes and audiences develops awareness of register and genre conventions in the target language, preventing the production of competent but stylistically undifferentiated prose. Accurate spelling and punctuation in the target language reflect the importance of written accuracy as a component of genuine literacy in a foreign language.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "LA-KS3-D004",
      "domain_name": "Grammar, Vocabulary and Language Knowledge",
      "description": "Understanding and applying the grammatical structures of the target language including tenses, grammatical patterns, voices and moods; building a wide-ranging and precise vocabulary; understanding how language works systematically.",
      "curriculum_context": "Grammar and vocabulary knowledge at KS3 is not merely the accumulation of linguistic forms but the development of systematic understanding of how the target language works. Pupils are expected to understand and use a range of tenses (covering present, past and future events), grammatical structures and patterns (the systematic organisation of language at sentence level), different voices (active and passive) and moods (indicative, subjunctive where relevant). This grammatical knowledge is not an end in itself but the foundation for increasingly flexible and precise use of the language across all four skills. Vocabulary development at KS3 explicitly includes vocabulary for expressing and discussing opinions and wider issues, reflecting the expectation that pupils will engage with content of substance rather than only with personal and immediate topics.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    }
  ],
  "objectives": [
    {
      "objective_id": "LA-KS3-O001",
      "domain_id": "LA-KS3-D004",
      "objective_text": "identify and use tenses or other structures which convey the present, past, and future as appropriate to the language being studied",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS3-O002",
      "domain_id": "LA-KS3-D004",
      "objective_text": "use and manipulate a variety of key grammatical structures and patterns, including voices and moods, as appropriate",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS3-O003",
      "domain_id": "LA-KS3-D004",
      "objective_text": "develop and use a wide-ranging and deepening vocabulary that goes beyond their immediate needs and interests, allowing them to give and justify opinions and take part in discussion about wider issues",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS3-O004",
      "domain_id": "LA-KS3-D004",
      "objective_text": "use accurate grammar, spelling and punctuation",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS3-O005",
      "domain_id": "LA-KS3-D001",
      "objective_text": "listen to a variety of forms of spoken language to obtain information and respond appropriately",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS3-O006",
      "domain_id": "LA-KS3-D003",
      "objective_text": "transcribe words and short sentences that they hear with increasing accuracy",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS3-O007",
      "domain_id": "LA-KS3-D001",
      "objective_text": "initiate and develop conversations, coping with unfamiliar language and unexpected responses, making use of important social conventions such as formal modes of address",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS3-O008",
      "domain_id": "LA-KS3-D001",
      "objective_text": "express and develop ideas clearly and with increasing accuracy, both orally and in writing",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS3-O009",
      "domain_id": "LA-KS3-D001",
      "objective_text": "speak coherently and confidently, with increasingly accurate pronunciation and intonation",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS3-O010",
      "domain_id": "LA-KS3-D002",
      "objective_text": "read and show comprehension of original and adapted materials from a range of different sources, understanding the purpose, important ideas and details, and provide an accurate English translation of short, suitable material",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS3-O011",
      "domain_id": "LA-KS3-D002",
      "objective_text": "read literary texts in the language [such as stories, songs, poems and letters] to stimulate ideas, develop creative expression and expand understanding of the language and culture",
      "non_statutory_guidance": null,
      "examples": "stories, songs, poems and letters",
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS3-O012",
      "domain_id": "LA-KS3-D003",
      "objective_text": "write prose using an increasingly wide range of grammar and vocabulary, write creatively to express their own ideas and opinions, and translate short written text accurately into the foreign language",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "LA-KS3-C001",
      "domain_id": "LA-KS3-D004",
      "concept_name": "Grammatical System and Structure",
      "description": "Every language has a grammatical system - a set of rules and patterns governing how words are formed and combined to convey meaning. At KS3, pupils develop explicit understanding of the grammatical system of their target language, moving from implicit, formulaic use of structures to explicit, generative understanding of rules that can be applied to new situations. Key elements include tense systems (how time is grammatically encoded), grammatical gender (in languages where it applies), case systems (where relevant), verb conjugation, agreement rules, and the use of different moods (indicative, subjunctive, conditional) to express different degrees of certainty, possibility and conditionality. This explicit grammatical knowledge enables pupils to use the language generatively, constructing novel sentences rather than reproducing memorised phrases.",
      "teaching_guidance": "Teach grammar inductively where possible: present examples of the structure in context and guide pupils to identify the pattern before formalising the rule. Use paradigm tables for verb conjugations as reference tools rather than as the primary learning method. Practise new structures in controlled (substitution drills), then guided (sentence building), then free (communicative tasks) contexts. Connect new grammar explicitly to grammar already known: how does the new tense relate to others already learned? Use error analysis productively: when pupils make systematic errors, the error reveals a misunderstanding that explicit teaching can address. Revisit structures regularly to prevent fossilisation of errors and to develop automaticity.",
      "key_vocabulary": "tense, conjugate, verb, noun, adjective, agreement, gender, case, mood, indicative, subjunctive, conditional, voice, active, passive, clause, phrase, syntax, morphology, inflection",
      "common_misconceptions": "Pupils may treat conjugated verb forms as vocabulary items to be memorised individually rather than as applications of a productive rule system; explicit teaching of the paradigm and the underlying rule prevents this. The subjunctive mood, which is not grammaticalised in English, is frequently misunderstood because pupils have no direct equivalent in their first language; connecting it to the semantic concept of doubt, uncertainty and hypotheticality makes it more accessible. In languages with grammatical gender, pupils may assume gender is arbitrary rather than systematic, leading to random guessing; teaching gender patterns and providing reliable rules reduces this.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "LA-KS3-C002",
      "domain_id": "LA-KS3-D001",
      "concept_name": "Extended Oral Communication",
      "description": "Extended oral communication at KS3 encompasses the ability to initiate and sustain conversations beyond simple question-and-answer exchanges, cope with unexpected responses and unfamiliar language, express and develop ideas at length, and use appropriate social conventions including formal registers where required. This represents a qualitative leap from the more controlled conversational exchanges of KS2, requiring pupils to develop real communicative flexibility and resilience. The ability to cope with unfamiliar language - to use inferencing, circumlocution and clarification strategies when communication breaks down - is a mark of genuine communicative competence as distinct from the ability to perform scripted exchanges. Accurate pronunciation and intonation are integral to extended oral communication because they determine whether speech is comprehensible to native speakers.",
      "teaching_guidance": "Develop conversational resilience through unpredictable role-play and open-ended discussion tasks where pupils cannot simply recall memorised answers. Teach and practise repair strategies explicitly: how do you ask someone to repeat, speak more slowly, or clarify? Teach formal modes of address in languages where these are grammatically marked (vous/tu, usted/tu, Sie/du) and the social contexts that determine their use. Use recordings of authentic spoken language to develop listening to real-world speed and variation. Develop extended speaking through structured discussion tasks where pupils must justify opinions, not merely state them. Provide regular opportunities for low-stakes speaking to build confidence.",
      "key_vocabulary": "pronunciation, intonation, fluency, register, formal, informal, initiate, conversation, circumlocution, clarification, repair, opinion, justify, argue, address",
      "common_misconceptions": "Pupils often believe they need to understand every word to follow a spoken text; developing tolerance for ambiguity and the use of context to infer meaning challenges this assumption. The distinction between formal and informal register is sometimes treated as merely a vocabulary difference; in languages where it is grammaticalised (affecting verb forms and pronouns), it is a systematic grammatical distinction requiring explicit teaching. Pupils may believe accurate pronunciation is optional or cosmetic; understanding that mispronunciation can affect comprehensibility (and listener relationships) motivates more careful attention to phonological accuracy.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "LA-KS3-C003",
      "domain_id": "LA-KS3-D002",
      "concept_name": "Reading Authentic and Literary Texts",
      "description": "Reading authentic and literary texts in KS3 exposes pupils to the target language as used by native speakers for real communicative purposes, rather than as constructed for pedagogical control. Authentic materials - newspaper articles, websites, blogs, brochures - use genuine vocabulary, idiomatic expressions and complex sentences that challenge pupils to deploy inferencing, contextual and referential strategies to construct meaning. Literary texts - short stories, poems, songs, letters - develop pupils' engagement with the cultural and imaginative life of the target language community, and provide qualitatively different language that is often more expressive and formally complex than informational prose. Reading with comprehension across a range of genres and text types develops flexible reading strategies and builds vocabulary incidentally through repeated exposure.",
      "teaching_guidance": "Teach reading strategies explicitly: skimming for gist, scanning for specific information, close reading for detail. Pre-teach blocking vocabulary before reading, but also develop tolerance for unfamiliar words by modelling the use of context to infer meaning. Distinguish between what pupils need to understand in detail and what they only need to grasp generally. Use authentic texts alongside adapted versions of the same material to show pupils what they are working towards. Literary texts should be approached as literature - for their imagery, characters, themes and cultural significance - not merely as grammar exercises. Connect what pupils read to their own experiences, opinions and culture to develop genuine engagement.",
      "key_vocabulary": "authentic, literary, genre, comprehension, inference, context, skimming, scanning, translation, gist, detail, idiomatic, register, narrative, poetry",
      "common_misconceptions": "Pupils may attempt to decode every word of a text rather than reading for overall meaning, producing paralysis in the face of unknown vocabulary; explicit teaching of reading for gist prevents this. Translation is sometimes treated as a transparent process of word substitution; understanding that translation requires understanding of meaning, not just form, and that good translation preserves meaning and effect rather than literal wording, develops more sophisticated translation practice. Literary texts in a foreign language may seem inaccessible; using well-chosen, appropriately pitched texts and supporting pupils to engage with them as literature (not just as language exercises) builds genuine engagement.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "LA-KS3-C004",
      "domain_id": "LA-KS3-D004",
      "concept_name": "Vocabulary Range, Precision and Register",
      "description": "A wide and deepening vocabulary is the foundation of communicative range and precision in a foreign language. At KS3, vocabulary development goes beyond the immediate and personal topics of KS2 (family, school, food, hobbies) to include language for discussing wider issues, justifying opinions and engaging with abstract ideas. Precision in vocabulary involves choosing words that convey exactly the intended meaning rather than approximating with simpler, safer vocabulary. Register awareness - understanding that different social contexts require different vocabulary choices (formal/informal, academic/colloquial) - develops the sociolinguistic competence that marks a sophisticated language user. Vocabulary is most durably learned through repeated, spaced encounter in meaningful contexts rather than through isolated word-list memorisation.",
      "teaching_guidance": "Develop vocabulary learning strategies explicitly: spaced repetition, word families, cognate awareness, semantic mapping. Encourage pupils to move beyond safe, familiar vocabulary by rewarding ambitious use of language even when it involves errors. Teach vocabulary for expressing and nuancing opinion (I think, I believe, In my view, Although, However, Nevertheless) as a distinct functional category. Develop awareness of register by comparing formal and informal versions of the same message. Use authentic texts as vocabulary input, exposing pupils to words in context. Build word-level knowledge (spelling, pronunciation, grammatical behaviour) as well as meaning.",
      "key_vocabulary": "vocabulary, register, formal, colloquial, cognate, synonym, antonym, connotation, denotation, semantic, word family, idiom, phrase, expression, precision",
      "common_misconceptions": "Pupils often equate knowing a word with knowing its English translation, overlooking grammatical behaviour (gender, irregular conjugations), collocations (the words it naturally combines with) and register. The existence of false cognates (words that look similar across languages but mean different things) can mislead pupils who rely heavily on cognate guessing; awareness of this risk develops more careful checking. Pupils may believe their vocabulary is adequate when it is merely safe, avoiding more precise but risky vocabulary choices; encouraging ambitious vocabulary use within a supportive environment develops lexical courage.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "LA-KS3-C005",
      "domain_id": "LA-KS3-D002",
      "concept_name": "Language and Culture",
      "description": "Language and culture are inseparably linked: languages encode the values, assumptions, social structures and worldviews of their speakers, and understanding a language's cultural context enriches and deepens linguistic competence. At KS3, this connection is developed through engagement with authentic cultural materials (literature, film, music, media) and through attention to culturally specific features of language use (social conventions, politeness systems, culturally embedded idioms). The study of literature in the target language provides particular depth of cultural engagement, connecting linguistic competence to the imaginative and intellectual life of the target language community. Cultural understanding developed through language learning also enriches pupils' understanding of their own culture by providing a reflective contrast.",
      "teaching_guidance": "Integrate authentic cultural content throughout language teaching rather than treating culture as an add-on. Use literature, film, music and media from the target language community as both language learning material and as cultural education. Explore culturally specific features of language: what social structures does the formal/informal pronoun distinction reflect? What does a proverb reveal about cultural values? Connect target language culture to pupils' own cultural experiences and encourage reflection on both. Invite native speakers to the classroom where possible. Develop awareness that the target language has diverse speakers across many cultural contexts, not a single monolithic culture.",
      "key_vocabulary": "culture, tradition, identity, society, convention, politeness, idiom, proverb, literature, perspective, comparison, diversity, heritage, community, intercultural",
      "common_misconceptions": "Pupils may equate the target language with a single national culture, overlooking the diversity of communities that speak it (French is spoken in France, Belgium, Switzerland, Canada, many African countries and elsewhere). The social conventions of the target language may seem arbitrary or unnecessarily complex; connecting them to the social structures and values they reflect makes them comprehensible and more memorable. Pupils may approach target language culture as exotic or other; developing a stance of genuine curiosity and comparative reflection challenges both ethnocentrism and superficial exoticisation.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": true
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "LA-KS2-C003",
      "dependent_concept": "LA-KS3-C001",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS3 grammatical system knowledge directly extends the KS2 grammar of gender, number and verb conjugation, building the more complex grammatical structures (voices, moods, complex tenses) on the foundational grammatical awareness established at KS2."
    },
    {
      "prerequisite_concept": "LA-KS2-C004",
      "dependent_concept": "LA-KS3-C002",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS3 extended oral communication develops directly from the KS2 communicative competence of basic conversation and listening, requiring the same fundamental skills at greater depth, range and autonomy."
    },
    {
      "prerequisite_concept": "LA-KS2-C001",
      "dependent_concept": "LA-KS3-C002",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "KS2 phonology and pronunciation skills are the direct foundation for the KS3 requirement of accurate pronunciation and intonation in extended oral communication."
    },
    {
      "prerequisite_concept": "LA-KS2-C002",
      "dependent_concept": "LA-KS3-C004",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS2 vocabulary acquisition and use provides the initial vocabulary base and the learning strategies on which KS3 wide-ranging and deepening vocabulary development is built."
    },
    {
      "prerequisite_concept": "LA-KS2-C005",
      "dependent_concept": "LA-KS3-C005",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.75,
      "rationale": "KS2 language awareness and transfer develops the metalinguistic and intercultural sensitivity on which KS3 deeper engagement with language and culture is founded."
    }
  ]
}
