{
  "metadata": {
    "subject": "Music",
    "key_stage": "KS3",
    "years_covered": [7, 8, 9],
    "document_reference": "DFE-00187-2013",
    "extraction_date": "2026-02-17",
    "structure_rating": 7
  },
  "domains": [
    {
      "domain_id": "MU-KS3-D001",
      "domain_name": "Performing",
      "description": "Playing and performing confidently in solo and ensemble contexts, using voice and instruments with increasing accuracy, fluency, control and expression across a range of musical styles, genres and traditions.",
      "curriculum_context": "Performance at KS3 builds on the KS2 development of performing skill to require confidence, not just competence. Pupils are expected to perform in solo contexts, which demands a different kind of musical and personal confidence from ensemble work, and in ensembles where the coordination, listening and contribution required become more musically complex. The curriculum specifies accuracy, fluency, control and expression as the four qualities of mature performance - the same four as KS2, but at a much more demanding level. Performing across a range of styles, genres and traditions requires pupils to adapt their technique and expressive approach to different musical contexts, developing versatility and musical intelligence rather than narrow technical proficiency in a single tradition.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "MU-KS3-D002",
      "domain_name": "Composing and Improvising",
      "description": "Improvising and composing using a range of musical structures, styles, genres and traditions, and extending and developing musical ideas.",
      "curriculum_context": "Composition at KS3 develops substantially in ambition and sophistication. Pupils are expected to work with a range of musical structures, styles, genres and traditions as frameworks and starting points for their own creative work, demonstrating both knowledge of and personal response to the musical materials available to them. The requirement to extend and develop musical ideas rather than simply generate them implies a more sustained compositional process: ideas are introduced, varied, contrasted and developed over longer time spans. Improvisation at KS3 continues to develop spontaneous musical decision-making, now expected to demonstrate increasing musicality and structural coherence. Working across diverse traditions also develops pupils' understanding of composition as a culturally situated activity.",
      "is_cross_cutting": false,
      "structure_type": "process"
    },
    {
      "domain_id": "MU-KS3-D003",
      "domain_name": "Listening and Appraising",
      "description": "Listening with increasing discrimination and deepening understanding to a wide range of music from great composers and musicians; developing understanding of the history of music and the contexts in which music is created and performed.",
      "curriculum_context": "Listening at KS3 becomes more discriminating and analytically sophisticated, requiring pupils to hear and identify increasingly subtle musical features, structural devices and expressive techniques. The requirement to listen to a wide range from great composers and musicians maintains the breadth of listening experience that develops musical culture and broadens pupils' creative references. Developing a deepening understanding of the music performed and listened to, and its history, connects musical experience to historical, cultural and social contexts. This historical and contextual understanding enriches both listening (by providing interpretive frameworks) and composing (by providing a repertoire of techniques and traditions to draw on).",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "MU-KS3-D004",
      "domain_name": "Musical Elements and Notation",
      "description": "Using staff and other notations appropriately and accurately; identifying and using the inter-related dimensions of music with increasing sophistication including tonalities, scales and musical devices.",
      "curriculum_context": "At KS3, musical notation skills extend beyond basic staff reading to appropriate and accurate use across a range of notational systems suitable for the styles being studied: conventional staff notation for Western art music; chord symbols and lead sheets for jazz and popular music; graphic notation for contemporary and experimental music. The inter-related dimensions of music (pitch, duration, dynamics, tempo, timbre, texture, structure) are used with increasing sophistication, with the addition of tonalities (major, minor, modal) and scales as specific technical concepts that give pupils more precise analytical and compositional tools. Musical devices - sequence, ostinato, pedal, imitation, augmentation, diminution - are introduced as building blocks of musical craft.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    }
  ],
  "objectives": [
    {
      "objective_id": "MU-KS3-O001",
      "domain_id": "MU-KS3-D001",
      "objective_text": "play and perform confidently in a range of solo and ensemble contexts using their voice, playing instruments musically, fluently and with accuracy and expression",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "MU-KS3-O002",
      "domain_id": "MU-KS3-D002",
      "objective_text": "improvise and compose; and extend and develop musical ideas by drawing on a range of musical structures, styles, genres and traditions",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "MU-KS3-O003",
      "domain_id": "MU-KS3-D004",
      "objective_text": "use staff and other relevant notations appropriately and accurately in a range of musical styles, genres and traditions",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "MU-KS3-O004",
      "domain_id": "MU-KS3-D004",
      "objective_text": "identify and use the inter-related dimensions of music expressively and with increasing sophistication, including use of tonalities, different types of scales and other musical devices",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "MU-KS3-O005",
      "domain_id": "MU-KS3-D003",
      "objective_text": "listen with increasing discrimination to a wide range of music from great composers and musicians",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "MU-KS3-O006",
      "domain_id": "MU-KS3-D003",
      "objective_text": "develop a deepening understanding of the music that they perform and to which they listen, and its history",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "MU-KS3-C001",
      "concept_name": "Advanced Performance Skills",
      "description": "Advanced performance skills at KS3 encompass technical proficiency (accurate and fluent execution of pitches, rhythms and techniques), musical expression (the communication of character, emotion and musical meaning through phrasing, dynamics and articulation), stylistic awareness (adapting technique and expression to the demands of different musical styles and traditions), and ensemble musicianship (listening, balancing, responding and contributing to a shared musical outcome). These dimensions of performance are interdependent: technical accuracy without expression produces mechanical playing, while expressive intent without technical control cannot be reliably communicated.",
      "teaching_guidance": "Set performance goals that specify both technical and expressive targets. Use recordings of professional performances for analysis: what specific technical and expressive choices does this performer make? Develop ensemble listening skills through activities that require pupils to adjust their playing in response to others. Teach stylistic awareness by comparing performances of the same piece in different styles. Develop performance confidence through regular low-stakes performance opportunities as well as formal performances. Use self-recording and playback as a tool for reflective improvement.",
      "key_vocabulary": "technique, fluency, accuracy, expression, phrasing, dynamics, articulation, tone, stylistic, ensemble, balance, blend, communicate, interpret, perform",
      "common_misconceptions": "Pupils may equate technical accuracy with good performance, overlooking the expressive dimension that makes music meaningful. Discussing and demonstrating how the same piece sounds different with different expressive choices addresses this. Pupils may believe they cannot play expressively until they are technically perfect; exploring expression within technical capability rather than waiting for technical mastery first builds expressive confidence earlier. Ensemble performance requires active listening as well as playing; developing the habit of listening across the ensemble needs consistent emphasis.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MU-KS3-C002",
      "concept_name": "Tonality and Harmony",
      "description": "Tonality refers to the organisation of music around a central pitch (the tonic) and the hierarchical relationships between all other pitches, creating a sense of stability, tension and resolution. Major and minor tonalities are the most common in Western music, each with characteristic emotional associations and scale patterns. Modal scales (Dorian, Phrygian, Lydian, Mixolydian and others) organise pitch in different hierarchical patterns, each with a distinctive character. Harmony refers to the simultaneous sounding of two or more pitches and the way chords progress to create movement, tension and resolution. At KS3, pupils develop understanding of tonality and harmony as foundational elements of musical structure and expression.",
      "teaching_guidance": "Teach major and minor scales and their characteristic sounds through singing and playing. Explore how changing a piece from major to minor alters its character. Introduce modal scales through folk music and world music examples where modes are characteristic. Teach primary chord progressions (I-IV-V, I-vi-IV-V) and use them as frameworks for composition and improvisation. Develop aural awareness of harmonic movement: can pupils hear when a chord changes and identify where it moves to? Connect harmony to musical emotion and expression.",
      "key_vocabulary": "tonality, major, minor, modal, scale, tonic, dominant, subdominant, chord, harmony, consonance, dissonance, resolution, tension, key, interval",
      "common_misconceptions": "Pupils may struggle to hear the difference between major and minor; consistent aural training, connecting the theoretical distinction to audible character, builds this discrimination. The concept of relative major and minor (sharing the same key signature) is frequently confusing; practical examples clarify the relationship. Pupils may see chords as arbitrary groupings of notes rather than as functional elements in a tonal hierarchy; connecting chords to their function (tonic, dominant, subdominant) makes the logic clear.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MU-KS3-C003",
      "concept_name": "Compositional Techniques and Devices",
      "description": "Compositional techniques are the methods composers use to develop, extend and transform musical material. Key devices include: ostinato (a repeated pattern over which other music is built), sequence (a melodic idea repeated at a different pitch level), imitation (one part echoing another after a time delay), augmentation and diminution (presenting a rhythm or melody in longer or shorter note values), and inversion (turning a melody upside down). Structure provides the large-scale organisation of a composition. At KS3, pupils develop the craft of composition by learning to use these techniques with intention and understanding their effect.",
      "teaching_guidance": "Teach each device through listening examples where it is clearly audible, then practice using it in simple compositional exercises before applying it in projects. Help pupils understand the effect of each device: ostinato creates continuity; sequence creates a sense of development; imitation creates dialogue. Analyse how professional composers use these devices in the repertoire pupils are performing and listening to. Set composition tasks that specify the use of particular devices, then allow pupils to choose devices freely in more open projects. Evaluate how effectively devices have been used in terms of their musical effect.",
      "key_vocabulary": "ostinato, sequence, imitation, augmentation, diminution, inversion, retrograde, motif, theme, development, variation, structure, form, binary, ternary, rondo",
      "common_misconceptions": "Pupils may use compositional devices mechanically without understanding their effect; always discussing the musical consequences of each device prevents this. Imitation can be confused with strict canon; explaining that imitation need not be exact or complete distinguishes the concepts. Pupils may not see the connection between compositional devices and the music they listen to; deliberate analytical listening that identifies devices in real pieces makes the connection.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MU-KS3-C004",
      "concept_name": "Musical Traditions and World Music",
      "description": "World music encompasses the musical traditions of diverse cultures across the globe, each with its own characteristic scales, rhythms, textures, instruments, performance practices and cultural functions. Understanding world music traditions requires both musical analysis (identifying characteristic features) and cultural contextualisation (understanding the social, spiritual and ceremonial roles music plays in different communities). At KS3, pupils extend their musical experience beyond Western art and popular music to develop appreciation and understanding of diverse global musical traditions, enriching both their listening and their compositional resources.",
      "teaching_guidance": "Study specific world music traditions in depth, including both the music itself and its cultural context. Use authentic recordings rather than simplified or Westernised arrangements. Connect to pupils' own cultural backgrounds where relevant. Explore characteristic features: what are the distinctive scales, rhythms, instruments and textures of this tradition? How does this music function in its cultural context? Use world music as a starting point for composition tasks. Be careful to present world music as living, evolving tradition rather than as static, exotic curiosity. Collaborate with cultural experts and community musicians where possible.",
      "key_vocabulary": "tradition, culture, genre, style, folk, classical, jazz, world music, percussion, melody, rhythm, call-and-response, heterophony, modal, pentatonic",
      "common_misconceptions": "Pupils may approach world music with an ethnocentric assumption that Western music is the norm and other traditions are exotic variants. Presenting diverse traditions as equally sophisticated and complete musical systems challenges this. Pupils may assume that complex music requires complex notation; world music often demonstrates that sophisticated musical understanding can be transmitted and developed entirely orally. The concept that music can serve different social functions in different cultures (religious, ceremonial, work-related) may challenge assumptions that music is primarily entertainment.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "MU-KS2-C001",
      "dependent_concept": "MU-KS3-C001",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS3 advanced performance skills directly develop from the ensemble performance skills established at KS2, requiring greater technical proficiency, expressive range and stylistic versatility."
    },
    {
      "prerequisite_concept": "MU-KS2-C003",
      "dependent_concept": "MU-KS3-C003",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS3 compositional techniques and devices directly extend the KS2 musical structure and composition knowledge, adding a more sophisticated repertoire of specific compositional tools to the structural framework established at KS2."
    },
    {
      "prerequisite_concept": "MU-KS2-C004",
      "dependent_concept": "MU-KS3-C002",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS3 tonality and harmony builds directly on KS2 staff notation skills and the understanding of pitch relationships that notation represents, extending to more sophisticated harmonic and tonal concepts."
    },
    {
      "prerequisite_concept": "MU-KS2-C005",
      "dependent_concept": "MU-KS3-C004",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "KS2 music history and cultural context provides the historical framework within which KS3 world music traditions can be studied with appropriate contextualisation and cultural perspective."
    }
  ]
}
