{
  "version": "1.0",
  "authored_by": "english-specialist-teacher",
  "authored_date": "2026-02-24",
  "note": "16 reusable Genre nodes for the English ontology. 11 primary genres (KS1-KS3) + 5 secondary genres (KS3-KS4). Each genre progresses across key stages: what 'narrative' means in Y1 is fundamentally different from Y10. Genre nodes are referenced by EnglishUnit nodes via IN_GENRE relationships.",
  "genres": [
    {
      "genre_id": "GEN-NARR",
      "name": "Narrative",
      "genre_family": "fiction",
      "key_stages": ["KS1", "KS2", "KS3", "KS4"],
      "conventions": ["characters", "setting", "plot", "conflict", "resolution", "narrator", "dialogue"],
      "sub_genres": ["adventure", "mystery", "historical", "sci-fi", "fantasy", "horror", "realistic"],
      "primary_writing_purposes": ["to_entertain"],
      "description": "Extended prose fiction with characters, setting, and a plot driven by conflict and resolution. The dominant literary form across all key stages, progressing from simple retelling (KS1) through structured narrative (KS2) to literary fiction with controlled voice and style (KS3-KS4).",
      "ks1_expectations": "Write sentences sequenced to form short narratives (4-8 sentences). Use beginning-middle-end structure. Include simple character and setting. Use 'and' to join ideas. Oral retelling before writing.",
      "ks2_expectations": "Write extended narratives (400-700 words) with clear structure (opening, build-up, climax, resolution). Use dialogue to advance plot. Employ fronted adverbials, expanded noun phrases, and varied sentence openings. Develop character through action and speech.",
      "ks3_expectations": "Write literary narratives with controlled narrative voice, varied sentence structures for effect, and sophisticated structural choices. Experiment with non-linear chronology, unreliable narrators, and symbolic settings. Conscious use of genre conventions.",
      "ks4_expectations": "Write narrative/descriptive pieces under timed conditions (GCSE Language Paper 1). Demonstrate conscious control of voice, structure, and language for effect. Deploy a range of literary and rhetorical devices with precision.",
      "display_category": "English Ontology",
      "display_color": "#059669",
      "display_icon": "menu_book"
    },
    {
      "genre_id": "GEN-TRAD",
      "name": "Traditional Tale",
      "genre_family": "fiction",
      "key_stages": ["KS1", "KS2"],
      "conventions": ["archetypal characters", "moral", "repetition", "transformation", "rule of three", "traditional opening and closing", "good versus evil"],
      "sub_genres": ["fairy tale", "myth", "legend", "fable", "folk tale", "pourquoi tale"],
      "primary_writing_purposes": ["to_entertain"],
      "description": "Stories passed down through oral tradition with archetypal characters, repetitive structures, and moral lessons. The entry point to narrative for KS1 children because the familiar structures scaffold retelling and independent composition. Includes fairy tales, myths, legends, fables, and folk tales.",
      "ks1_expectations": "Retell familiar traditional tales in 4-6 sentences using sequencing words. Identify beginning, middle, end. Recognise repeated refrains and the rule of three. Use oral retelling with story maps before writing.",
      "ks2_expectations": "Compare versions of traditional tales from different cultures. Retell myths and legends with own embellishments (400-600 words). Write own traditional tales using genre conventions. Subvert fairy tale expectations in retellings (e.g. villain's perspective). Explore themes of good/evil, transformation, and morality.",
      "ks3_expectations": null,
      "ks4_expectations": null,
      "display_category": "English Ontology",
      "display_color": "#059669",
      "display_icon": "menu_book"
    },
    {
      "genre_id": "GEN-POET",
      "name": "Poetry",
      "genre_family": "poetry",
      "key_stages": ["KS1", "KS2", "KS3", "KS4"],
      "conventions": ["rhythm", "rhyme", "imagery", "figurative language", "verse structure", "voice", "line breaks", "stanza"],
      "sub_genres": ["haiku", "limerick", "sonnet", "ballad", "free verse", "narrative poetry", "concrete poetry", "acrostic", "kenning"],
      "primary_writing_purposes": ["to_entertain", "to_describe", "to_analyse"],
      "description": "Literature using rhythm, imagery, and condensed language to convey meaning and emotion. Poetry is continuous across all key stages with no progression break, but expectations increase: from recitation and simple pattern-following (KS1) through multiple forms and figurative language (KS2) to analysis of poetic conventions and unseen poetry comparison (KS4).",
      "ks1_expectations": "Listen to and recite a range of poems by heart. Recognise rhyme and rhythm. Join in with repeated refrains. Begin to appreciate how language sounds create effects. Write simple poems using patterns (acrostic, list poems).",
      "ks2_expectations": "Read and perform poems aloud with expression, pace, and volume. Identify and discuss different poetry forms (haiku, limerick, free verse, narrative). Analyse figurative language (simile, metaphor, personification). Write poems in at least 2 different forms. Discuss effect of language choices.",
      "ks3_expectations": "Analyse poetic conventions, form, and structure. Study poets in depth across literary heritage and contemporary writing. Write poetry with conscious craft choices. Understand how form shapes meaning. Compare poems thematically and stylistically.",
      "ks4_expectations": "Analyse anthology poems and unseen poems under timed conditions. Compare poets' methods and perspectives. Deploy subject-specific terminology (volta, enjambment, caesura, sibilance). Write analytical essays on poetry using AO1/AO2/AO3.",
      "display_category": "English Ontology",
      "display_color": "#059669",
      "display_icon": "menu_book"
    },
    {
      "genre_id": "GEN-PLAY",
      "name": "Playscript",
      "genre_family": "drama",
      "key_stages": ["KS1", "KS2", "KS3"],
      "conventions": ["stage directions", "dialogue", "scenes", "cast list", "dramatic tension", "character entrance and exit"],
      "sub_genres": [],
      "primary_writing_purposes": ["to_entertain"],
      "description": "Texts written for performance with dialogue, stage directions, and dramatic structure. At KS1-KS2, playscripts are a writing form that teaches dialogue conventions and text layout. At KS3, script writing develops into a compositional form with dramatic purpose and audience awareness.",
      "ks1_expectations": "Recognise dialogue in stories. Begin to use speech marks in narrative. Act out simple scenes from stories. Understand that plays are stories performed by actors.",
      "ks2_expectations": "Read and perform playscripts aloud. Understand layout conventions (character name, colon, stage directions in brackets). Write short playscripts adapted from stories or original scenarios. Use dialogue to reveal character and advance plot.",
      "ks3_expectations": "Write scripts with dramatic tension, character development, and thematic purpose. Study professional scripts. Understand theatrical conventions (aside, soliloquy, dramatic irony). Rehearse and perform scripted scenes.",
      "ks4_expectations": null,
      "display_category": "English Ontology",
      "display_color": "#059669",
      "display_icon": "menu_book"
    },
    {
      "genre_id": "GEN-RECOUNT",
      "name": "Recount",
      "genre_family": "non_fiction",
      "key_stages": ["KS1", "KS2"],
      "conventions": ["chronological order", "first or third person", "time connectives", "specific detail", "past tense", "personal or historical focus"],
      "sub_genres": ["personal recount", "historical recount", "diary entry", "biography", "autobiography", "news report"],
      "primary_writing_purposes": ["to_inform", "to_describe"],
      "description": "Texts that retell events in chronological order with specific detail. The simplest non-fiction form at KS1, progressing from 'what I did at the weekend' personal recounts to historical recounts, diary entries from characters' perspectives, and biographical writing at KS2. Develops into literary non-fiction at KS3-KS4.",
      "ks1_expectations": "Write simple recounts of personal experiences in chronological order. Use time words (first, then, next, finally). Write in past tense. Include specific details (who, what, when, where).",
      "ks2_expectations": "Write extended recounts (300-500 words) including diary entries from characters' perspectives, historical recounts, and biographical writing. Use paragraphs to organise chronologically. Vary sentence openings with fronted adverbials. Include personal response and reflection.",
      "ks3_expectations": null,
      "ks4_expectations": null,
      "display_category": "English Ontology",
      "display_color": "#059669",
      "display_icon": "menu_book"
    },
    {
      "genre_id": "GEN-REPORT",
      "name": "Report",
      "genre_family": "non_fiction",
      "key_stages": ["KS1", "KS2", "KS3"],
      "conventions": ["subheadings", "topic sentences", "present tense", "formal register", "diagrams", "technical vocabulary", "third person"],
      "sub_genres": ["non-chronological report", "comparative report", "research report"],
      "primary_writing_purposes": ["to_inform"],
      "description": "Texts that present factual information organised by topic rather than chronologically. A core non-fiction form across KS1-KS3 that develops research, retrieval, and organisational skills. Cross-curricular by nature: report writing in English draws on content from Science, Geography, and History.",
      "ks1_expectations": "Write simple information sentences about a topic. Use a title and simple subheadings. Present tense for facts. Include labelled diagrams.",
      "ks2_expectations": "Write non-chronological reports (400-600 words) with subheadings, topic sentences, technical vocabulary, and integrated diagrams. Retrieve and record information from non-fiction texts. Use formal register and expanded noun phrases.",
      "ks3_expectations": "Write research reports with formal academic register, evidence-based claims, and structured argumentation. Synthesise information from multiple sources. Use footnotes, bibliography, and cross-referencing.",
      "ks4_expectations": null,
      "display_category": "English Ontology",
      "display_color": "#059669",
      "display_icon": "menu_book"
    },
    {
      "genre_id": "GEN-INSTRUCT",
      "name": "Instruction",
      "genre_family": "non_fiction",
      "key_stages": ["KS1", "KS2"],
      "conventions": ["imperative verbs", "numbered steps", "chronological order", "diagrams", "specific detail", "second person", "title and goal statement"],
      "sub_genres": ["recipe", "how-to guide", "rules", "directions", "manual"],
      "primary_writing_purposes": ["to_instruct"],
      "description": "Texts that tell the reader how to do something in sequential steps. One of the earliest non-fiction forms taught because its clear structure (numbered steps, imperative verbs) is highly scaffolded and accessible. Often taught through cross-curricular contexts (DT recipes, Science investigations).",
      "ks1_expectations": "Write simple instructions with numbered steps. Use imperative verbs (cut, stick, mix). Include a title and what you need list. Sequence steps using time words.",
      "ks2_expectations": "Write detailed instructions with clear goal statement, sequenced steps, diagrams, and specific measurements or quantities. Use imperative verbs, adverbs for precision, and conditional language (if... then). Evaluate clarity of instructions through testing.",
      "ks3_expectations": null,
      "ks4_expectations": null,
      "display_category": "English Ontology",
      "display_color": "#059669",
      "display_icon": "menu_book"
    },
    {
      "genre_id": "GEN-EXPLAIN",
      "name": "Explanation",
      "genre_family": "non_fiction",
      "key_stages": ["KS2", "KS3"],
      "conventions": ["causal connectives", "present tense", "technical vocabulary", "process description", "logical sequence", "diagrams and flow charts"],
      "sub_genres": ["process explanation", "causal explanation", "mechanism explanation"],
      "primary_writing_purposes": ["to_explain"],
      "description": "Texts that explain how or why something happens, focusing on causes and processes rather than simple facts. More analytically demanding than reports because pupils must understand and articulate causal relationships. Frequently cross-curricular with Science (water cycle, digestion) and Geography (erosion, weather).",
      "ks1_expectations": null,
      "ks2_expectations": "Write explanations (300-500 words) of how or why something happens using causal connectives (because, therefore, as a result, consequently). Use diagrams or flow charts. Present tense for general truths. Technical vocabulary appropriate to the subject.",
      "ks3_expectations": "Write extended analytical explanations with multiple causes, nuanced reasoning, and academic register. Distinguish between contributing factors and direct causes. Use hedging language (tends to, may result in, is likely to).",
      "ks4_expectations": null,
      "display_category": "English Ontology",
      "display_color": "#059669",
      "display_icon": "menu_book"
    },
    {
      "genre_id": "GEN-PERSUADE",
      "name": "Persuasion",
      "genre_family": "non_fiction",
      "key_stages": ["KS2", "KS3"],
      "conventions": ["rhetorical devices", "emotive language", "logical argument", "audience address", "call to action", "one-sided argument"],
      "sub_genres": ["persuasive letter", "advertisement", "campaign", "editorial", "manifesto"],
      "primary_writing_purposes": ["to_persuade"],
      "description": "Texts that argue a single point of view using rhetorical and emotional techniques to convince the reader. Distinct from discussion (which is balanced): persuasion is deliberately one-sided. Teaches pupils to identify and deploy techniques including rhetorical questions, emotive language, repetition, and direct address.",
      "ks1_expectations": null,
      "ks2_expectations": "Write persuasive texts (300-500 words) with clear arguments organised in paragraphs. Use rhetorical questions, emotive language, and direct address. Formal register and letter/speech conventions. Anticipate and counter opposing views.",
      "ks3_expectations": "Write extended persuasive texts with sophisticated rhetorical control. Deploy a range of devices strategically (tricolon, anaphora, antithesis). Control register and tone for different audiences. Analyse persuasive techniques in non-fiction texts critically.",
      "ks4_expectations": null,
      "display_category": "English Ontology",
      "display_color": "#059669",
      "display_icon": "menu_book"
    },
    {
      "genre_id": "GEN-DISCUSS",
      "name": "Discussion",
      "genre_family": "non_fiction",
      "key_stages": ["KS2", "KS3"],
      "conventions": ["for and against structure", "balanced argument", "connectives for contrast", "justified conclusion", "formal register", "hedging language"],
      "sub_genres": ["balanced argument", "discursive essay", "debate text"],
      "primary_writing_purposes": ["to_discuss"],
      "description": "Texts that present multiple viewpoints on a debatable issue, reaching a justified conclusion. More demanding than persuasion because pupils must hold two opposing positions in mind simultaneously and treat both fairly. Often paired with spoken language (debate) to develop oracy alongside writing.",
      "ks1_expectations": null,
      "ks2_expectations": "Write balanced discussion texts (400-600 words) with for and against paragraphs. Use connectives for contrast (however, on the other hand, although). Write a justified conclusion that weighs evidence from both sides. Formal register throughout.",
      "ks3_expectations": "Write extended discursive essays with nuanced argumentation, acknowledged complexity, and sophisticated hedging. Move beyond simple for/against to explore multiple perspectives. Integrate evidence from texts and wider reading. Academic essay conventions.",
      "ks4_expectations": null,
      "display_category": "English Ontology",
      "display_color": "#059669",
      "display_icon": "menu_book"
    },
    {
      "genre_id": "GEN-INFO",
      "name": "Information",
      "genre_family": "non_fiction",
      "key_stages": ["KS1", "KS2"],
      "conventions": ["reference features", "glossary", "index", "cross-references", "alphabetical order", "contents page", "headings"],
      "sub_genres": ["encyclopaedia entry", "glossary", "fact file", "leaflet"],
      "primary_writing_purposes": ["to_inform"],
      "description": "Reference texts organised for retrieval rather than continuous reading. Teaches pupils to use and create non-linear text features (contents, index, glossary, cross-references). Distinct from reports in that information texts are designed for dipping into rather than reading sequentially.",
      "ks1_expectations": "Use contents pages and indexes to find information. Create simple fact files with headings and pictures. Understand alphabetical order for reference use.",
      "ks2_expectations": "Create information texts with contents, index, glossary, and cross-references. Use digital research tools. Present information using appropriate layout features (text boxes, captions, diagrams, bullet points). Write entries for glossaries and encyclopaedias.",
      "ks3_expectations": null,
      "ks4_expectations": null,
      "display_category": "English Ontology",
      "display_color": "#059669",
      "display_icon": "menu_book"
    },
    {
      "genre_id": "GEN-FICT",
      "name": "Literary Fiction",
      "genre_family": "fiction",
      "key_stages": ["KS3", "KS4"],
      "conventions": ["narrative voice", "characterisation", "theme", "structure", "style", "symbolism", "motif"],
      "sub_genres": ["gothic", "dystopian", "bildungsroman", "social realism", "magical realism"],
      "primary_writing_purposes": ["to_entertain", "to_analyse"],
      "description": "Prose fiction studied analytically for its literary qualities rather than simply read for plot. The progression from KS2 narrative: at KS3-KS4, fiction becomes an object of critical study where students analyse how authors construct meaning through language, structure, and form. Includes both reading (textual analysis) and writing (creative composition).",
      "ks1_expectations": null,
      "ks2_expectations": null,
      "ks3_expectations": "Read literary fiction across genres (gothic, dystopian, social realism). Analyse narrative voice, characterisation, setting, and structural choices. Study authors in depth. Write literary fiction with conscious stylistic choices and thematic purpose.",
      "ks4_expectations": "Study set texts (19th-century novel, modern prose/drama) for GCSE Literature. Write analytical essays on character, theme, and context. Write creative fiction for GCSE Language with controlled voice, structure, and technical accuracy.",
      "display_category": "English Ontology",
      "display_color": "#059669",
      "display_icon": "menu_book"
    },
    {
      "genre_id": "GEN-DRAMA",
      "name": "Drama",
      "genre_family": "drama",
      "key_stages": ["KS3", "KS4"],
      "conventions": ["dialogue", "stage directions", "dramatic irony", "soliloquy", "theatrical convention", "act and scene structure", "aside"],
      "sub_genres": ["tragedy", "comedy", "morality play", "naturalistic drama", "expressionist drama"],
      "primary_writing_purposes": ["to_entertain", "to_analyse"],
      "description": "Dramatic literature studied for its theatrical and literary qualities. Distinct from KS1-KS2 playscript writing: at KS3-KS4, drama means studying published plays as literary texts, analysing dramatic conventions, and understanding performance context. Shakespeare study is the dominant form at KS4.",
      "ks1_expectations": null,
      "ks2_expectations": null,
      "ks3_expectations": "Study Shakespeare and other dramatists. Analyse dramatic conventions (soliloquy, dramatic irony, aside). Understand performance context and staging. Discuss how drama communicates theme and character differently from prose.",
      "ks4_expectations": "Study set Shakespeare play and modern drama text for GCSE Literature. Write analytical essays on dramatic technique, character, and context. Understand genre (tragedy, comedy, morality play). Close analysis of key scenes and quotations.",
      "display_category": "English Ontology",
      "display_color": "#059669",
      "display_icon": "menu_book"
    },
    {
      "genre_id": "GEN-LITNF",
      "name": "Literary Non-Fiction",
      "genre_family": "non_fiction",
      "key_stages": ["KS3", "KS4"],
      "conventions": ["personal voice", "rhetorical technique", "structural craft", "perspective", "bias and viewpoint"],
      "sub_genres": ["travel writing", "memoir", "essay", "journalism", "autobiography", "speech", "letter"],
      "primary_writing_purposes": ["to_inform", "to_persuade", "to_describe", "to_analyse"],
      "description": "Non-fiction texts with literary quality and personal voice, studied for how writers present perspectives and craft meaning. The KS3-KS4 progression from KS2 recount: where KS2 teaches factual recount, KS3-KS4 literary non-fiction examines how real-world writing uses literary techniques for effect. Central to GCSE English Language Paper 2.",
      "ks1_expectations": null,
      "ks2_expectations": null,
      "ks3_expectations": "Read travel writing, memoir, essays, speeches, and journalism. Analyse how writers use language and structure to present viewpoints. Compare non-fiction texts with different perspectives on the same subject. Write literary non-fiction with personal voice.",
      "ks4_expectations": "Analyse 19th-century and modern non-fiction texts under timed conditions (GCSE Language Paper 2). Compare writers' perspectives and methods. Write non-fiction with controlled rhetorical technique for specified audiences.",
      "display_category": "English Ontology",
      "display_color": "#059669",
      "display_icon": "menu_book"
    },
    {
      "genre_id": "GEN-TRANS",
      "name": "Transactional",
      "genre_family": "non_fiction",
      "key_stages": ["KS3", "KS4"],
      "conventions": ["purpose-driven form", "audience awareness", "register control", "structural conventions specific to form", "rhetorical technique"],
      "sub_genres": ["letter", "article", "speech", "review", "report", "leaflet", "blog post"],
      "primary_writing_purposes": ["to_persuade", "to_inform", "to_explain", "to_evaluate"],
      "description": "Purpose-driven non-fiction forms written for a specific audience and context. The KS3-KS4 progression from KS2 persuasion and discussion: at GCSE, transactional writing encompasses all non-fiction forms (letter, article, speech, review, report) and is assessed on audience awareness, register control, and rhetorical effectiveness. The most frequently examined writing form on GCSE Language Paper 2.",
      "ks1_expectations": null,
      "ks2_expectations": null,
      "ks3_expectations": "Write in a range of transactional forms (letter, article, speech, review). Match form, register, and tone to audience and purpose. Deploy rhetorical devices strategically. Understand conventions specific to each form.",
      "ks4_expectations": "Write transactional pieces under timed conditions (GCSE Language Paper 2 Section B). Demonstrate precise audience awareness, controlled register, and effective rhetorical technique. Forms include letter, article, speech, review, report, essay.",
      "display_category": "English Ontology",
      "display_color": "#059669",
      "display_icon": "menu_book"
    },
    {
      "genre_id": "GEN-CREAT",
      "name": "Creative Writing",
      "genre_family": "fiction",
      "key_stages": ["KS3", "KS4"],
      "conventions": ["narrative voice", "descriptive technique", "structural control", "language for effect", "atmospheric writing"],
      "sub_genres": ["narrative", "descriptive", "experimental", "flash fiction", "monologue"],
      "primary_writing_purposes": ["to_entertain", "to_describe"],
      "description": "Creative composition assessed as a GCSE exam component, encompassing narrative and descriptive writing. Distinct from KS2 narrative because creative writing at KS4 is a timed exam skill requiring conscious technical control under pressure. Students must demonstrate a range of vocabulary, sentence structures, and structural techniques within a single piece.",
      "ks1_expectations": null,
      "ks2_expectations": null,
      "ks3_expectations": "Develop creative writing craft through experimentation with voice, perspective, and structure. Write in a range of forms (short story, monologue, descriptive piece, flash fiction). Give and receive feedback on creative work.",
      "ks4_expectations": "Write narrative or descriptive pieces under timed conditions (GCSE Language Paper 1 Section B). Demonstrate ambitious vocabulary, varied sentence structures, conscious paragraphing, and structural control. Respond to visual or textual prompts with originality.",
      "display_category": "English Ontology",
      "display_color": "#059669",
      "display_icon": "menu_book"
    }
  ],
  "genre_progressions": [
    {
      "from_genre_id": "GEN-TRAD",
      "to_genre_id": "GEN-NARR",
      "from_ks": "KS1",
      "to_ks": "KS2",
      "progression_note": "Traditional tales teach narrative structure through familiar, scaffolded forms. Pupils progress from retelling known stories with archetypal characters to writing original narratives with more complex plot structures."
    },
    {
      "from_genre_id": "GEN-NARR",
      "to_genre_id": "GEN-FICT",
      "from_ks": "KS2",
      "to_ks": "KS3",
      "progression_note": "KS2 narrative writing (genre_study) progresses to literary fiction where narrative becomes both a writing form and an analytical object. Students move from writing in genres to studying how authors construct meaning within genres."
    },
    {
      "from_genre_id": "GEN-NARR",
      "to_genre_id": "GEN-CREAT",
      "from_ks": "KS2",
      "to_ks": "KS4",
      "progression_note": "KS2 narrative writing progresses to the GCSE creative writing component where narrative and descriptive skills are assessed under timed conditions with emphasis on technical control."
    },
    {
      "from_genre_id": "GEN-RECOUNT",
      "to_genre_id": "GEN-LITNF",
      "from_ks": "KS2",
      "to_ks": "KS3",
      "progression_note": "Personal and historical recounts develop into literary non-fiction study. The focus shifts from chronological retelling to analysing how writers craft personal voice and perspective in factual writing."
    },
    {
      "from_genre_id": "GEN-PERSUADE",
      "to_genre_id": "GEN-TRANS",
      "from_ks": "KS2",
      "to_ks": "KS3",
      "progression_note": "One-sided persuasive writing broadens into the full range of transactional forms. Students learn that persuasion is one purpose among many, and that audience and form shape rhetorical choices."
    },
    {
      "from_genre_id": "GEN-DISCUSS",
      "to_genre_id": "GEN-TRANS",
      "from_ks": "KS2",
      "to_ks": "KS3",
      "progression_note": "Balanced discussion writing feeds into transactional writing where form, register, and audience awareness become the organising principles rather than the for/against structure."
    },
    {
      "from_genre_id": "GEN-PLAY",
      "to_genre_id": "GEN-DRAMA",
      "from_ks": "KS2",
      "to_ks": "KS3",
      "progression_note": "Playscript writing as a format skill progresses to studying drama as a literary form. Students move from writing dialogue with stage directions to analysing dramatic conventions, performance context, and thematic significance."
    }
  ],
  "genre_affinities": [
    {
      "genre_id_1": "GEN-PERSUADE",
      "genre_id_2": "GEN-DISCUSS",
      "affinity_note": "Share argument structure and rhetorical technique. Persuasion is one-sided; discussion is balanced. Teaching them in sequence helps pupils understand the difference between advocating and weighing evidence."
    },
    {
      "genre_id_1": "GEN-RECOUNT",
      "genre_id_2": "GEN-REPORT",
      "affinity_note": "Both organise factual information, but recounts are chronological (temporal) and reports are thematic (categorical). Teaching them together highlights the difference between time-based and topic-based organisation."
    },
    {
      "genre_id_1": "GEN-NARR",
      "genre_id_2": "GEN-TRAD",
      "affinity_note": "Traditional tales are a sub-category of narrative with additional genre-specific conventions (rule of three, archetypal characters, moral). Traditional tales scaffold narrative writing by providing familiar structures."
    },
    {
      "genre_id_1": "GEN-EXPLAIN",
      "genre_id_2": "GEN-REPORT",
      "affinity_note": "Both are informational non-fiction. Reports present facts (what); explanations present causes and processes (how/why). Teaching them together develops the distinction between descriptive and causal writing."
    },
    {
      "genre_id_1": "GEN-FICT",
      "genre_id_2": "GEN-CREAT",
      "affinity_note": "Literary fiction study (reading) and creative writing (composition) are complementary: students analyse how published authors achieve effects, then deploy those techniques in their own writing."
    },
    {
      "genre_id_1": "GEN-LITNF",
      "genre_id_2": "GEN-TRANS",
      "affinity_note": "Both are non-fiction forms at KS3-KS4. Literary non-fiction focuses on reading and analysis of published texts; transactional writing focuses on the student's own composition for specified audiences."
    }
  ]
}