{
  "version": "1.0",
  "subject": "History",
  "skill_type": "HistoricalThinking",
  "authored_by": "human",
  "authored_date": "2026-02-22",
  "note": "Concept-level DEVELOPS_SKILL links seeded from v4 teacher simulation (Adeyemi). Maps KS3 History concepts to HistoricalThinking skills. Adeyemi noted that C004 (Historical Arguments) collapses 6 distinct second-order concepts into one — these links restore the granularity by connecting each content concept to the specific disciplinary skills it develops.",
  "links": [
    {
      "concept_id": "HI-KS3-C001",
      "skill_id": "HT-002",
      "rationale": "Power, Monarchy and Democracy: understanding WHY political power shifted — from feudal monarchy through Magna Carta to parliamentary democracy. Core causation skill."
    },
    {
      "concept_id": "HI-KS3-C001",
      "skill_id": "HT-003",
      "rationale": "Power, Monarchy and Democracy: the long arc of constitutional change — what changed (voting rights, parliamentary power) vs what continued (monarchy, social hierarchy). Core change/continuity skill."
    },
    {
      "concept_id": "HI-KS3-C001",
      "skill_id": "HT-005",
      "rationale": "Power, Monarchy and Democracy: assessing the significance of events like Magna Carta, the English Civil War, the Great Reform Act. Which changes mattered most and for whom?"
    },
    {
      "concept_id": "HI-KS3-C001",
      "skill_id": "HT-001",
      "rationale": "Power, Monarchy and Democracy spans 1066-present — requires secure chronological framework. Pupils must sequence events across nearly 1000 years."
    },
    {
      "concept_id": "HI-KS3-C002",
      "skill_id": "HT-002",
      "rationale": "Empire, Colonialism and its Consequences: causes of imperial expansion (trade, power, religion, resources) and consequences (slavery, decolonisation, modern inequality). Multi-causal analysis."
    },
    {
      "concept_id": "HI-KS3-C002",
      "skill_id": "HT-005",
      "rationale": "Empire: assessing significance of the slave trade, abolition, decolonisation. Contested significance — who benefits from which narrative of empire?"
    },
    {
      "concept_id": "HI-KS3-C002",
      "skill_id": "HT-006",
      "rationale": "Empire: using primary sources (Equiano's autobiography, plantation records, abolition pamphlets, photographs). Source evaluation — provenance, reliability, utility."
    },
    {
      "concept_id": "HI-KS3-C002",
      "skill_id": "HT-007",
      "rationale": "Empire: competing interpretations — was the Empire a 'force for good'? Understanding how different historians and communities construct different narratives about the same events."
    },
    {
      "concept_id": "HI-KS3-C003",
      "skill_id": "HT-002",
      "rationale": "The Holocaust: understanding the escalation from prejudice to genocide — gradual causation through legislation, propaganda, dehumanisation. Multi-step causal chain."
    },
    {
      "concept_id": "HI-KS3-C003",
      "skill_id": "HT-004",
      "rationale": "The Holocaust: comparing responses — perpetrator, bystander, resistor, rescuer. Understanding similarity and difference in human responses to persecution."
    },
    {
      "concept_id": "HI-KS3-C003",
      "skill_id": "HT-005",
      "rationale": "The Holocaust: why this event is given unique significance in the curriculum. Assessment of what makes an event historically significant and how commemoration works."
    },
    {
      "concept_id": "HI-KS3-C003",
      "skill_id": "HT-006",
      "rationale": "The Holocaust: using testimony, photographs, documents, and museum sources. Sensitive source work — understanding that sources are partial and that survivors' accounts are primary evidence."
    },
    {
      "concept_id": "HI-KS3-C004",
      "skill_id": "HT-006",
      "rationale": "Constructing Historical Arguments requires locating, selecting, and evaluating evidence from multiple sources. The evidence skill is the methodological foundation of argument."
    },
    {
      "concept_id": "HI-KS3-C004",
      "skill_id": "HT-007",
      "rationale": "Constructing Historical Arguments requires understanding that accounts are interpretations, not neutral records. Pupils evaluate competing interpretations and construct their own."
    },
    {
      "concept_id": "HI-KS3-C004",
      "skill_id": "HT-008",
      "rationale": "Constructing Historical Arguments IS historical enquiry — formulating questions, planning investigation, constructing argued response. The enquiry skill made explicit."
    },
    {
      "concept_id": "HI-KS2-C001",
      "skill_id": "HT-002",
      "rationale": "KS2 Cause and Consequence: understanding why events happened (Great Fire of London, Roman invasion) and what resulted. Foundation for KS3 causal analysis."
    },
    {
      "concept_id": "HI-KS2-C002",
      "skill_id": "HT-005",
      "rationale": "KS2 Historical Significance: assessing why we remember certain people and events. Foundation for KS3 significance assessment using explicit criteria."
    },
    {
      "concept_id": "HI-KS2-C003",
      "skill_id": "HT-006",
      "rationale": "KS2 Historical Evidence: using artefacts, written sources, and archaeological evidence to find out about the past. Foundation for KS3 source evaluation."
    }
  ]
}
