{
  "version": "1.0",
  "subject": "Science",
  "skill_type": "WorkingScientifically",
  "authored_by": "human",
  "authored_date": "2026-02-22",
  "note": "Concept-level DEVELOPS_SKILL links seeded from v4 teacher simulation (Kapoor KS2, Osei KS3). Maps specific science concepts to the Working Scientifically skills they develop. The NC says 'Working Scientifically should be embedded in teaching across all domains' — these links make that explicit.",
  "links": [
    {
      "concept_id": "SC-KS2-C027",
      "skill_id": "WS-KS2-003",
      "enquiry_type": "fair_test",
      "rationale": "Friction investigation: 'How does the surface affect how far a toy car travels?' Classic fair test — independent variable (surface), dependent variable (distance), control variables (car, ramp angle)."
    },
    {
      "concept_id": "SC-KS2-C027",
      "skill_id": "WS-KS2-005",
      "enquiry_type": "fair_test",
      "rationale": "Friction investigation requires recording results in tables (surface | distance trial 1/2/3 | mean) and drawing bar charts (categorical independent variable)."
    },
    {
      "concept_id": "SC-KS2-C067",
      "skill_id": "WS-KS2-003",
      "enquiry_type": "fair_test",
      "rationale": "Light travels in straight lines: torch-and-cards investigation. Fair test — align holes to show light travels straight. Also shadow size investigation (distance from light source)."
    },
    {
      "concept_id": "SC-KS2-C022",
      "skill_id": "WS-KS2-004",
      "enquiry_type": "classifying",
      "rationale": "Light sources: classifying objects as light sources vs reflectors. Sorting activities — which objects produce their own light?"
    },
    {
      "concept_id": "SC-KS2-C022",
      "skill_id": "WS-KS2-002",
      "enquiry_type": "observation",
      "rationale": "Shadow observation: how shadows change through the day (observation over time). Observing and measuring shadow length at intervals."
    },
    {
      "concept_id": "SC-KS2-C058",
      "skill_id": "WS-KS2-004",
      "enquiry_type": "classifying",
      "rationale": "Formal classification: using and constructing classification keys for living things. Core classifying skill — the classification key IS the WS skill applied to biology content."
    },
    {
      "concept_id": "SC-KS2-C059",
      "skill_id": "WS-KS2-004",
      "enquiry_type": "classifying",
      "rationale": "Micro-organisms: classifying micro-organisms as helpful (yeast, bacteria in yoghurt) vs harmful (bacteria causing disease). Extends classification to non-visible organisms."
    },
    {
      "concept_id": "SC-KS2-C065",
      "skill_id": "WS-KS2-006",
      "enquiry_type": "secondary_research",
      "rationale": "Adaptation: drawing conclusions from evidence of how organisms are adapted to their environments. Using observational evidence and secondary sources to explain adaptations."
    },
    {
      "concept_id": "SC-KS2-C066",
      "skill_id": "WS-KS2-008",
      "enquiry_type": "secondary_research",
      "rationale": "Evolution: using evidence (fossils, anatomical similarities, selective breeding) to support or refute ideas about how living things have changed over time. Core evidence evaluation skill."
    },
    {
      "concept_id": "SC-KS2-C030",
      "skill_id": "WS-KS2-006",
      "enquiry_type": "observation",
      "rationale": "Environmental change: drawing conclusions from data about how changes to environments affect living things. Interpreting population data, habitat surveys."
    },
    {
      "concept_id": "SC-KS2-C050",
      "skill_id": "WS-KS2-003",
      "enquiry_type": "fair_test",
      "rationale": "Reversible changes: investigating dissolving — does temperature affect how quickly sugar dissolves? Fair test with temperature as independent variable."
    },
    {
      "concept_id": "SC-KS2-C051",
      "skill_id": "WS-KS2-002",
      "enquiry_type": "observation",
      "rationale": "Irreversible changes: observing burning, rusting, cooking — changes that cannot be reversed. Careful observation of what happens during chemical reactions."
    },
    {
      "concept_id": "SC-KS2-C044",
      "skill_id": "WS-KS2-002",
      "enquiry_type": "observation",
      "rationale": "Life cycles: observation over time — watching caterpillar to butterfly, tadpole to frog, seed to plant. Extended observation requiring systematic recording."
    },
    {
      "concept_id": "SC-KS2-C045",
      "skill_id": "WS-KS2-002",
      "enquiry_type": "observation",
      "rationale": "Plant reproduction: observing flower parts (dissection), pollen transfer, seed dispersal mechanisms. First-hand observation with magnifying equipment."
    },
    {
      "concept_id": "SC-KS2-C048",
      "skill_id": "WS-KS2-003",
      "enquiry_type": "fair_test",
      "rationale": "Dissolving: 'Does stirring affect how quickly salt dissolves?' Classic fair test — independent variable (stirring/not stirring), dependent variable (time to dissolve), controls (water volume, temperature, amount of salt)."
    },
    {
      "concept_id": "SC-KS2-C052",
      "skill_id": "WS-KS2-004",
      "enquiry_type": "pattern_seeking",
      "rationale": "Solar system: identifying patterns in planetary data (distance from sun, orbital period, size). Pattern seeking using secondary source data — not a fair test but a genuine scientific enquiry."
    },
    {
      "concept_id": "SC-KS3-C040",
      "skill_id": "WS-KS3-003",
      "enquiry_type": "fair_test",
      "rationale": "Osei: Enzyme activity investigation — effect of temperature on enzyme action. Classic controlled experiment with temperature as IV, rate of reaction as DV."
    },
    {
      "concept_id": "SC-KS3-C040",
      "skill_id": "WS-KS3-005",
      "enquiry_type": "fair_test",
      "rationale": "Enzyme investigation data requires tables (temperature | time for reaction) and line graphs (continuous IV). Students must select appropriate graph type."
    },
    {
      "concept_id": "SC-KS3-C078",
      "skill_id": "WS-KS3-003",
      "enquiry_type": "fair_test",
      "rationale": "Osei: Diffusion rate investigation — effect of temperature on diffusion rate of potassium permanganate. Controlled experiment requiring careful variable management."
    },
    {
      "concept_id": "SC-KS3-C127",
      "skill_id": "WS-KS3-003",
      "enquiry_type": "fair_test",
      "rationale": "Osei: Hooke's Law investigation — force vs extension of a spring. Systematic variable control, repeated measurements, plotting force-extension graph."
    },
    {
      "concept_id": "SC-KS3-C127",
      "skill_id": "WS-KS3-005",
      "enquiry_type": "fair_test",
      "rationale": "Hooke's Law requires plotting force-extension line graph, calculating gradient (spring constant), identifying the limit of proportionality on a graph."
    },
    {
      "concept_id": "SC-KS3-C119",
      "skill_id": "WS-KS3-005",
      "enquiry_type": "pattern_seeking",
      "rationale": "Osei: Distance-time graphs — presenting motion data graphically. Core data presentation skill applied to kinematics."
    },
    {
      "concept_id": "SC-KS3-C071",
      "skill_id": "WS-KS3-005",
      "enquiry_type": "observation",
      "rationale": "Osei: Heating curves — recording temperature over time during changes of state. Line graph with plateaux at melting/boiling points."
    },
    {
      "concept_id": "SC-KS3-C106",
      "skill_id": "WS-KS3-006",
      "enquiry_type": "secondary_research",
      "rationale": "Osei: Climate data interpretation — analysing temperature records, CO2 concentration data, sea level records. Pattern identification in large secondary datasets."
    },
    {
      "concept_id": "SC-KS3-C064",
      "skill_id": "WS-KS3-006",
      "enquiry_type": "pattern_seeking",
      "rationale": "Osei: Variation data — measuring and analysing continuous variation in a population (hand span, height). Statistical analysis of biological data."
    },
    {
      "concept_id": "SC-KS3-C064",
      "skill_id": "WS-KS3-011",
      "enquiry_type": "pattern_seeking",
      "rationale": "Variation data requires calculating means, ranges, and presenting data in frequency diagrams/histograms. Core statistical analysis applied to biology."
    },
    {
      "concept_id": "SC-KS3-C063",
      "skill_id": "WS-KS3-009",
      "enquiry_type": "secondary_research",
      "rationale": "Osei: DNA discovery — evaluating historical evidence (Watson, Crick, Franklin, Wilkins). Understanding how scientific knowledge develops through evidence, publication, and peer review."
    },
    {
      "concept_id": "SC-KS3-C092",
      "skill_id": "WS-KS3-009",
      "enquiry_type": "secondary_research",
      "rationale": "Osei: Mendeleev's periodic table — predictions confirmed by later discovery. Evaluating how scientific models are tested and refined. Historical evidence evaluation."
    },
    {
      "concept_id": "SC-KS3-C075",
      "skill_id": "WS-KS3-003",
      "enquiry_type": "fair_test",
      "rationale": "Conservation of mass: weighing before and after chemical reactions in sealed/open containers. Controlled experiment demonstrating that mass is conserved."
    },
    {
      "concept_id": "SC-KS3-C075",
      "skill_id": "WS-KS3-004",
      "enquiry_type": "fair_test",
      "rationale": "Conservation of mass requires precise mass measurements using balances, understanding precision and systematic error when gas escapes from open containers."
    },
    {
      "concept_id": "SC-KS3-C084",
      "skill_id": "WS-KS3-003",
      "enquiry_type": "fair_test",
      "rationale": "Acids and pH: investigating neutralisation — adding acid to alkali and measuring pH change. Systematic investigation with pH meter/indicator."
    },
    {
      "concept_id": "SC-KS3-C084",
      "skill_id": "WS-KS3-012",
      "enquiry_type": "fair_test",
      "rationale": "Acid practicals require risk assessment: corrosive substances, eye protection, safe handling of concentrated acids. CLEAPSS hazard awareness."
    },
    {
      "concept_id": "SC-KS3-C121",
      "skill_id": "WS-KS3-003",
      "enquiry_type": "fair_test",
      "rationale": "Forces and motion: investigating factors affecting friction, air resistance, or water resistance. Classic controlled experiments with force meters."
    },
    {
      "concept_id": "SC-KS3-C088",
      "skill_id": "WS-KS3-003",
      "enquiry_type": "fair_test",
      "rationale": "Catalysts: investigating effect of catalase (from potato) on hydrogen peroxide decomposition rate. Comparing reaction rate with/without catalyst."
    }
  ]
}
