{
  "metadata": {
    "subject": "Art and Design",
    "key_stage": "KS3",
    "years_covered": [
      7,
      8,
      9
    ],
    "document_reference": "DFE-00189-2013",
    "extraction_date": "2026-02-17",
    "structure_rating": 6
  },
  "domains": [
    {
      "domain_id": "AD-KS3-D001",
      "domain_name": "Developing Techniques and Media",
      "description": "Using a range of techniques to record observations in sketchbooks, journals or other media; using a range of techniques and media including painting; increasing proficiency in handling different materials.",
      "curriculum_context": "At KS3, art and design technique development becomes more deliberately ambitious and critically aware. Pupils are expected to use a wider range of techniques and media than at primary school, with increasing proficiency that results from sustained practice and self-evaluation. The explicit requirement to work in sketchbooks and journals as recording and developmental tools - rather than for finished work - positions the sketchbook as an integral professional habit rather than a classroom exercise. The curriculum specifies painting alongside other media, but the phrase 'range of techniques and media' deliberately keeps the scope broad, allowing schools to develop specialisms and respond to the strengths and interests of their communities while ensuring breadth of experience. Increasing proficiency implies both technical improvement and increasing intentionality: pupils choose techniques and media for their expressive and communicative qualities rather than using whatever is available.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "AD-KS3-D002",
      "domain_name": "Analysis and Evaluation",
      "description": "Analysing and evaluating own work and the work of others to strengthen the visual impact or applications; understanding how knowledge of art history and artistic conventions have been used by artists to influence visual communication.",
      "curriculum_context": "Critical analysis and self-evaluation become central to art and design at KS3, marking a shift from the primarily practical orientation of primary art education. Pupils are expected to engage in the critical and reflective dialogue that characterises artistic practice, applying analytical frameworks from art history and theory to their own work and to the work of others. The requirement to 'strengthen visual impact' is significant: evaluation is not merely retrospective commentary but a tool for improvement, used actively throughout the making process. Understanding how artistic conventions and historical knowledge have been used to create visual communication introduces pupils to the idea that art is culturally and historically situated - that understanding the tradition is a resource for creative work rather than a constraint on it.",
      "is_cross_cutting": false,
      "structure_type": "process"
    },
    {
      "domain_id": "AD-KS3-D003",
      "domain_name": "Art, Craft and Design History",
      "description": "Knowing about great artists, craft makers and designers, and understanding the historical and cultural development of their art forms; understanding how art, craft and design reflect and shape culture and society.",
      "curriculum_context": "Art history at KS3 is substantially more ambitious than at primary, requiring pupils to understand the historical and cultural development of art forms across periods, styles and major movements from ancient times to the present day. This is not merely the accumulation of factual knowledge but the development of genuine art historical understanding: the ability to locate works within their cultural and historical context, to understand how artists have responded to and shaped their social worlds, and to recognise the relationship between artistic tradition and innovation. The explicit inclusion of craft makers and designers alongside fine artists broadens the scope beyond the Western canonical tradition to include functional and vernacular creative practices, challenging the hierarchy of fine art over craft and design that can limit pupils' understanding of the full range of human creative endeavour.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    }
  ],
  "objectives": [
    {
      "objective_id": "AD-KS3-O001",
      "domain_id": "AD-KS3-D001",
      "objective_text": "use a range of techniques to record their observations in visual journals",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "AD-KS3-O002",
      "domain_id": "AD-KS3-D001",
      "objective_text": "use a range of techniques and media, including painting",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "AD-KS3-O003",
      "domain_id": "AD-KS3-D001",
      "objective_text": "increase their proficiency in the handling of different materials",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "AD-KS3-O004",
      "domain_id": "AD-KS3-D002",
      "objective_text": "analyse and evaluate their own work, and that of others, in order to strengthen the visual impact or applications of their work",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "AD-KS3-O005",
      "domain_id": "AD-KS3-D003",
      "objective_text": "about the history of art, craft, design and architecture, including periods, styles and major movements from ancient times to the present day",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "AD-KS3-C001",
      "domain_id": "AD-KS3-D001",
      "concept_name": "Advanced Technical Proficiency",
      "description": "Technical proficiency in art and design involves the developed ability to use materials, tools and processes with skill, control and intentionality to achieve specific visual, tactile and expressive effects. At KS3, pupils move beyond the competent execution of learned techniques to develop personal approaches to materials and media, understanding how technical choices serve creative and communicative purposes. Proficiency is not merely mechanical accuracy but the integration of technical skill with critical and creative intelligence, enabling pupils to select, combine and adapt techniques in response to their creative intentions.",
      "teaching_guidance": "Set extended projects that require sustained engagement with specific materials and techniques. Encourage pupils to experiment at the edges of their technical capability rather than remaining in comfort zones. Build in regular opportunities for technical skill-building exercises alongside project work. Develop pupils' understanding of the relationship between technique and effect: why does this mark or process create this visual result? Model advanced technical skills and the professional habits of practice that support them. Connect to art history: how have artists developed personal technical vocabularies?",
      "key_vocabulary": "technique, media, proficiency, control, intentional, process, surface, material, application, manipulation, mark-making, layering, experimentation, refinement, mastery",
      "common_misconceptions": "Pupils may separate technical skill from creative vision, seeing them as alternatives rather than as integrated. Emphasising that great technique serves creative intent prevents this split. Pupils may resist new technical challenges if they have established a comfortable approach; framing technical exploration as expanding creative vocabulary rather than abandoning current skills helps. The idea that proficiency requires sustained practice over time can be discouraging; celebrating incremental improvement maintains motivation.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": [
        "AD-KS3-C004"
      ]
    },
    {
      "concept_id": "AD-KS3-C002",
      "domain_id": "AD-KS3-D002",
      "concept_name": "Critical Analysis and Evaluation",
      "description": "Critical analysis involves the systematic examination of artworks, design objects or craft pieces using structured frameworks that consider formal elements, compositional choices, contextual factors and expressive or communicative qualities. Evaluation extends analysis to make judgements about the effectiveness, significance and quality of a work in relation to its apparent purposes and contexts. At KS3, pupils develop the ability to analyse and evaluate works rigorously and to apply this critical thinking to their own work in progress, using evaluation as a tool for iterative improvement.",
      "teaching_guidance": "Teach a systematic analytical framework: formal elements (line, tone, colour, texture, form, space), composition, context, meaning/intention, impact. Apply this framework consistently to both historical works and pupils' own work. Develop vocabulary for critical description that goes beyond 'I like/dislike' to specific, reasoned judgements. Use critique sessions where pupils present work-in-progress and respond to structured questions. Teach pupils to receive critical feedback as useful information rather than personal judgement. Connect analysis to making: how can this insight be used to improve the next iteration?",
      "key_vocabulary": "analyse, evaluate, critique, formal element, composition, intention, impact, effect, context, meaning, interpret, judge, refine, improve, respond",
      "common_misconceptions": "Pupils may confuse description (what is there) with analysis (how it works) and evaluation (how effectively). Teaching these as distinct but connected activities develops more nuanced critical thinking. Pupils may think critical analysis means negative criticism; establishing that analysis can be appreciative as well as questioning broadens the concept. The idea that their own work can be analysed and evaluated in the same way as canonical artworks can be liberating for pupils who perceive a hierarchy between 'real art' and school work.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "AD-KS3-C003",
      "domain_id": "AD-KS3-D003",
      "concept_name": "Art History: Periods, Styles and Movements",
      "description": "Art history organises the development of visual art, architecture and craft/design into periods (broadly chronological divisions), styles (distinctive approaches to form, technique and subject matter) and movements (organised groups of practitioners sharing aesthetic aims and often manifestos). Major movements include Renaissance, Baroque, Romanticism, Impressionism, Expressionism, Modernism and its variants, and Postmodernism. Understanding periods, styles and movements enables pupils to contextualise individual works, understand how artistic traditions develop through innovation and reaction, and situate their own creative work within the broader history of visual culture.",
      "teaching_guidance": "Teach art historical periods, styles and movements through specific exemplary works and practitioners. Build a coherent chronological framework so pupils can locate movements in relation to each other. Explore how movements respond to historical contexts: what social, political or cultural conditions produced this artistic response? Study works from multiple cultures and geographies to challenge the Euro-American centrism of much art historical teaching. Connect art history to studio practice: use historical movements as starting points for pupils' own work. Develop pupils' ability to make connections and comparisons across periods, cultures and disciplines.",
      "key_vocabulary": "period, style, movement, Renaissance, Baroque, Romanticism, Impressionism, Expressionism, Modernism, Postmodernism, avant-garde, tradition, influence, reaction, innovation",
      "common_misconceptions": "Pupils may see art history as a fixed canon of important works rather than as a contested and constantly revised account of the past. Discussing how the canon is constructed and whose art has been excluded challenges this. The periodisation of art history into neat movements can imply a false tidiness; discussing how individual artists span or resist categorisation develops more nuanced understanding. Pupils may not see the relevance of art history to their own practice; making explicit connections between historical approaches and contemporary studio work addresses this.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "AD-KS3-C004",
      "domain_id": "AD-KS3-D001",
      "concept_name": "Personal Creative Voice",
      "description": "A personal creative voice is a distinctive approach to making and creating that reflects an individual's particular sensibility, interests, technical preferences and ways of seeing. At KS3, pupils are expected to move beyond technical competence to develop their own artistic identities, making increasingly personal and considered creative choices rather than simply following instructions or replicating given styles. Developing a personal creative voice requires taking creative risks, reflecting critically on outcomes, and sustaining creative enquiry over extended projects.",
      "teaching_guidance": "Set open-ended projects that allow diverse creative responses rather than directing pupils towards specific outcomes. Develop a culture where unusual, experimental or unconventional choices are respected and explored. Encourage pupils to develop personal 'banks' of images, themes and approaches by maintaining visual journals over time. Discuss how famous artists developed distinctive voices through sustained practice and exploration. Respond to pupils' emerging interests by offering relevant contextual references and technical support. Evaluate creative decision-making as well as technical quality in assessment.",
      "key_vocabulary": "personal, voice, identity, intention, aesthetic, sensibility, distinctive, original, creative, choice, experiment, develop, investigate, respond, express",
      "common_misconceptions": "Pupils may think a personal voice is something innate rather than something developed through practice and reflection. Showing how artists' distinctive voices evolved over time challenges this. Some pupils may feel they 'don't have' a personal style; sustained work with open-ended briefs and regular self-reflection develops emerging creative identity. The idea that personal voice means ignoring tradition is incorrect; the most distinctive artists are often deeply knowledgeable about the tradition they work within or against.",
      "concept_type": "process",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "AD-KS2-C001",
      "dependent_concept": "AD-KS3-C001",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS3 advanced technical proficiency directly extends the drawing mastery developed at KS2, building on established drawing skills towards greater range, control and intentionality across a wider variety of media."
    },
    {
      "prerequisite_concept": "AD-KS2-C004",
      "dependent_concept": "AD-KS3-C002",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS3 critical analysis builds on the sketchbook-based reflective practice established at KS2, extending the habit of evaluation and annotation into more systematic and vocabulary-rich analytical frameworks."
    },
    {
      "prerequisite_concept": "AD-KS2-C005",
      "dependent_concept": "AD-KS3-C003",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS3 art history knowledge of periods, styles and movements directly extends the KS2 study of significant individual artists, architects and designers into broader contextual and historical understanding."
    },
    {
      "prerequisite_concept": "AD-KS3-C002",
      "dependent_concept": "AD-KS3-C004",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.75,
      "rationale": "Developing a personal creative voice requires critical self-evaluation: the ability to reflect on one's own work, identify what is distinctive or interesting, and consciously develop those aspects through subsequent making."
    }
  ]
}
