{
  "metadata": {
    "subject": "Design and Technology",
    "key_stage": "KS4",
    "years_covered": [
      10,
      11
    ],
    "document_reference": "DFE-00283-2015",
    "extraction_date": "2026-02-21",
    "structure_rating": 8
  },
  "domains": [
    {
      "domain_id": "DT-KS4-D001",
      "domain_name": "Core Technical Principles",
      "description": "Understanding the properties and working characteristics of materials categories (textiles, metals and alloys, polymers, timber-based materials, papers and boards, electronic and mechanical systems, modern and smart materials, composite materials) and how these properties determine their appropriate use in design and manufacturing contexts.",
      "curriculum_context": "The 2017 GCSE Design and Technology specification introduced a unified core technical principles content to replace the separate endorsement-specific content of earlier specifications. All students must study core principles across all material categories, ensuring breadth of technical knowledge before deepening into a specific material focus. Understanding material properties — physical (density, strength, hardness, elasticity), mechanical (stiffness, toughness, malleability), thermal, electrical and aesthetic — is prerequisite to making informed design decisions. Knowledge of modern and smart materials (thermochromic inks, piezoelectric materials, shape-memory alloys) and composite materials (carbon fibre, glass-reinforced plastic) reflects the contemporary materials landscape that designers encounter in industry. Technical knowledge must be applied to design contexts: knowing the properties of a material is only valuable when connected to understanding of why those properties make it suitable or unsuitable for specific applications.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "DT-KS4-D002",
      "domain_name": "Designing",
      "description": "Using iterative design processes to develop design ideas from brief to specification to detailed design proposal, incorporating human factors, ergonomics, aesthetics, function, and consideration of wider issues including sustainability, ethical sourcing and inclusive design.",
      "curriculum_context": "The designing process at GCSE encompasses the full iterative design cycle from problem identification through research, ideation, development and refinement to resolved design proposal. Pupils are expected to use a range of design strategies: user research, mind-mapping, sketching, CAD (Computer-Aided Design), modelling and prototyping. The iterative dimension is fundamental: designs are not created once and refined once but go through multiple cycles of generation, testing, evaluation and development. Human factors and ergonomics are explicitly required, situating design within the study of how humans interact with objects and systems. Sustainability, ethical sourcing and inclusive design reflect the contemporary design agenda, requiring pupils to understand that the impact of design decisions extends far beyond the immediate function of the product.",
      "is_cross_cutting": false,
      "structure_type": "process"
    },
    {
      "domain_id": "DT-KS4-D003",
      "domain_name": "Making",
      "description": "Using a range of tools, techniques and processes to create outcomes with precision and quality, including hand tools, machine tools and CAM (Computer-Aided Manufacturing), with understanding of safe workshop practice and quality control.",
      "curriculum_context": "Making at GCSE requires both technical skill with hand tools and an understanding of how industrial and commercial manufacture operates, including the use of CAD/CAM processes. Pupils must demonstrate the ability to make to a good quality standard, with evidence of precision, appropriate use of tools and processes, and quality control throughout the making process. Safe working practice is a non-negotiable element: pupils must understand and apply safety procedures relevant to the tools and materials they are working with. The relationship between designing and making is iterative: making a prototype often reveals design problems that require design development, and design ideas must be adapted in response to making constraints. Understanding of manufacturing processes at different scales — one-off, batch and mass production — connects school making to the industrial context.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "DT-KS4-D004",
      "domain_name": "Evaluating",
      "description": "Evaluating design ideas and outcomes against specifications, user needs and broader considerations of function, aesthetics, sustainability, safety and fitness for purpose; analysing and evaluating the work of existing designers and products.",
      "curriculum_context": "Evaluation at GCSE is both a product-focused skill (assessing how well a design outcome meets its specification and user needs) and a process-focused discipline (assessing and improving design decisions throughout the iterative design and making process). Formal evaluation against a specification involves testing outcomes objectively against measurable criteria, gathering user feedback, and making justified recommendations for further development. The evaluation of existing products and the work of professional designers is a valuable analytical and inspirational resource that connects pupils' own practice to professional design culture. Sustainability evaluation — assessing the environmental and social impact of design decisions across the full lifecycle of a product — is an increasingly important dimension of professional design practice that is explicitly required at GCSE.",
      "is_cross_cutting": false,
      "structure_type": "process"
    },
    {
      "domain_id": "DT-KS4-D005",
      "domain_name": "Design in Context: Society, Culture and Environment",
      "description": "Understanding the influence of historical, cultural, social and environmental factors on design and technology, including the work of influential designers and the impact of design on people's lives, society and the environment.",
      "curriculum_context": "Design does not occur in a vacuum but is shaped by and in turn shapes cultural, social, historical and environmental contexts. At GCSE, pupils must understand how design has developed historically, how significant designers and design movements have influenced the trajectory of design culture, and how contemporary design is responding to the major challenges of sustainability, inclusivity and global production. The study of influential designers across different periods and traditions provides contextual reference points and design vocabulary. Understanding the environmental impact of design — through materials sourcing, manufacturing processes, product use and end-of-life disposal — develops the sustainability literacy increasingly expected of professional designers. Social and ethical dimensions of design include understanding of fair trade, ethical manufacturing, planned obsolescence and inclusive design for diverse users.",
      "is_cross_cutting": true,
      "structure_type": "knowledge"
    }
  ],
  "objectives": [
    {
      "objective_id": "DT-KS4-O001",
      "domain_id": "DT-KS4-D001",
      "objective_text": "demonstrate knowledge and understanding of the properties and working characteristics of a range of material categories and their appropriate use in design contexts",
      "non_statutory_guidance": null,
      "examples": "Timber-based materials, metals and alloys, polymers, textiles, papers and boards, electronic systems, modern and smart materials, composites.",
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS4-O002",
      "domain_id": "DT-KS4-D001",
      "objective_text": "understand the properties and applications of modern and smart materials and emerging technologies relevant to design and technology",
      "non_statutory_guidance": null,
      "examples": "Thermochromic materials, piezoelectric sensors, shape-memory alloys, biomimicry, wearable electronics.",
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS4-O003",
      "domain_id": "DT-KS4-D002",
      "objective_text": "use iterative design processes to identify user needs, develop and communicate design ideas, and create detailed design proposals",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS4-O004",
      "domain_id": "DT-KS4-D002",
      "objective_text": "apply human factors and ergonomics in design, considering the physical, cognitive and emotional needs of users",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS4-O005",
      "domain_id": "DT-KS4-D002",
      "objective_text": "use a range of design strategies and communication methods including sketching, modelling, CAD and prototyping to develop and communicate design ideas",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS4-O006",
      "domain_id": "DT-KS4-D003",
      "objective_text": "select and use appropriate tools, techniques and processes to make design outcomes to a good quality standard with precision and accuracy",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS4-O007",
      "domain_id": "DT-KS4-D003",
      "objective_text": "demonstrate safe working practices in the use of tools, equipment and materials",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS4-O008",
      "domain_id": "DT-KS4-D003",
      "objective_text": "understand and apply CAD/CAM processes in design and manufacturing contexts",
      "non_statutory_guidance": null,
      "examples": "Laser cutting, 3D printing, CNC milling, vinyl cutting.",
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS4-O009",
      "domain_id": "DT-KS4-D004",
      "objective_text": "evaluate design ideas and outcomes against a specification and user needs, making justified recommendations for improvement",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS4-O010",
      "domain_id": "DT-KS4-D004",
      "objective_text": "analyse and evaluate existing products and the work of professional designers using appropriate design criteria",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS4-O011",
      "domain_id": "DT-KS4-D005",
      "objective_text": "understand the impact of design and technology on society, culture, the environment and the economy, including issues of sustainability and ethical production",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS4-O012",
      "domain_id": "DT-KS4-D005",
      "objective_text": "demonstrate knowledge of the work of significant designers and design movements and their influence on the development of design culture",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "DT-KS4-C006",
      "domain_id": "DT-KS4-D004",
      "concept_name": "Evaluation Against Specification and User Needs",
      "description": "Formal evaluation at GCSE involves systematically assessing a design outcome against both the original specification — the measurable criteria derived from the design brief — and the needs of the intended user. Effective evaluation is evidence-based: outcomes are tested against objective criteria rather than assessed through personal opinion. Methods include physical testing (does it meet strength, size, weight or capacity requirements?), user testing (does the intended user find it usable, comfortable and appealing?), and comparative analysis (how does it compare to existing products that address the same brief?). Evaluation findings are used to make justified recommendations for further development.",
      "teaching_guidance": "Teach pupils to distinguish between objective criteria (measurable, checkable) and subjective criteria (based on opinion and preference) in their design specifications, and to use both types in evaluation. Develop user testing protocols: how do you test a product with a real user in a structured way that produces useful feedback? Practise writing evaluation conclusions that reference specific evidence: 'The product met criterion 3 because...' rather than 'The product is good because I like it.' For examination preparation, practise structured evaluation responses that identify specific strengths and specific, justified areas for improvement. Connect evaluation back to the iterative design process: evaluation outcomes should feed into the next design iteration.",
      "key_vocabulary": "evaluate, specification, criterion, user need, test, evidence, objective, subjective, user feedback, strength, limitation, improvement, justify, recommend, fitness for purpose",
      "common_misconceptions": "Pupils frequently write evaluation that is entirely positive or is based on personal preference, rather than being referenced to the specification and user feedback. Teaching that honest evaluation of limitations is more valuable than praise — because it drives improvement — changes this. Some pupils confuse evaluation with description: saying what they made rather than assessing how well it meets its specification. The distinction between 'what I made' and 'how well it works' needs explicit teaching.",
      "concept_type": "process",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "DT-KS4-C007",
      "domain_id": "DT-KS4-D004",
      "concept_name": "Life Cycle Analysis and Sustainability Evaluation",
      "description": "Life cycle analysis (LCA) is a systematic method for assessing the environmental impact of a product across its entire life — from raw material extraction through processing, manufacturing, distribution, use and end-of-life disposal or recycling. LCA reveals the full environmental cost of a product's existence, including energy use, water use, emissions and waste at each stage. At GCSE, pupils use LCA as an evaluation framework to assess the environmental performance of existing products and their own designs, making justified judgements about the relative sustainability of different design decisions.",
      "teaching_guidance": "Introduce LCA through a familiar product: trace the journey of a plastic bottle, a cotton t-shirt or a smartphone from raw materials to disposal, identifying environmental impacts at each stage. Use the four LCA stages (material extraction, manufacturing, use, end-of-life) as a consistent framework for environmental evaluation. Connect LCA to the six Rs of sustainability (Rethink, Refuse, Reduce, Reuse, Repair, Recycle) as a design response framework. Practise GCSE examination questions that ask pupils to evaluate the sustainability of a product or material choice using LCA concepts. Develop pupils' ability to make justified comparative judgements: 'Material A has a lower impact in manufacturing but higher impact at end-of-life because...'",
      "key_vocabulary": "life cycle analysis, LCA, environmental impact, carbon footprint, material extraction, manufacturing, distribution, use, end-of-life, recycling, sustainability, six Rs, biodegradable, carbon neutral, embodied energy",
      "common_misconceptions": "Pupils may reduce sustainability evaluation to 'is it recyclable?' missing the full lifecycle dimension. A recyclable product made from energy-intensive materials may have a higher overall environmental impact than a non-recyclable product with minimal processing. The concept of 'embodied energy' — the energy used in making a product before it is ever used — is often missed but is one of the most significant dimensions of environmental impact for manufactured goods.",
      "concept_type": "process",
      "complexity_level": 4,
      "is_cross_cutting": true,
      "teaching_weight": 4,
      "co_teach_hints": []
    },
    {
      "concept_id": "DT-KS4-C001",
      "domain_id": "DT-KS4-D001",
      "concept_name": "Material Properties and Selection",
      "description": "Material properties are the specific physical, mechanical, electrical, thermal and aesthetic characteristics that determine how a material behaves and what it can appropriately be used for. Physical properties include density, hardness, strength, elasticity and malleability. Mechanical properties include stiffness, toughness and compressive and tensile strength. Thermal properties include conductivity and resistance. Electrical properties include conductivity and resistance. Aesthetic properties include texture, colour, translucency and surface quality. Material selection requires matching the properties of available materials to the specific demands of a design brief, considering also cost, availability, environmental impact, and the manufacturing processes required to work with the material.",
      "teaching_guidance": "Teach material properties through practical investigation: test the strength, flexibility and workability of materials rather than simply listing properties. Develop a systematic framework for material comparison: physical, mechanical, thermal, electrical, aesthetic, environmental, economic. Set material selection tasks where pupils must justify their choice with reference to specific property requirements. Practise examination questions that ask pupils to explain why a specific material is or is not suitable for a given application: focus on the match between required and actual properties. Develop understanding of how materials are modified and enhanced through finishing processes (painting, varnishing, plating, anodising, laminating) and how this affects their properties.",
      "key_vocabulary": "density, hardness, tensile strength, compressive strength, elasticity, malleability, ductility, thermal conductivity, electrical conductivity, corrosion resistance, aesthetics, composite, alloy, polymer, timber",
      "common_misconceptions": "Pupils frequently confuse 'hardness' (resistance to scratching) with 'strength' (resistance to force); teaching the precise definition of each property and its testing method clarifies the distinction. The idea that one material is universally 'best' ignores the context-specificity of design decisions; every material selection must be justified in relation to specific requirements. Students may treat modern and smart materials as exotic curiosities rather than as materials with specific, relevant properties; connecting them to real design applications makes their relevance concrete.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 4,
      "co_teach_hints": []
    },
    {
      "concept_id": "DT-KS4-C002",
      "domain_id": "DT-KS4-D002",
      "concept_name": "Iterative Design Process",
      "description": "The iterative design process is a cyclical model of design activity in which design ideas are repeatedly generated, tested, evaluated and refined through multiple cycles until an effective design solution is achieved. Unlike the linear design model (brief → research → idea → prototype → evaluation), the iterative model acknowledges that design problems are not fully understood at the outset, that evaluation at any stage may require returning to earlier stages, and that prototyping and testing are integral to the development of ideas rather than merely their verification. At GCSE, the iterative design process is reflected in the non-examined assessment, which requires pupils to document the development of their design through multiple iterations.",
      "teaching_guidance": "Model the iterative design process explicitly: show pupils examples of real design development in which early ideas are substantially revised in response to testing and evaluation. Require pupils to produce and evaluate multiple design iterations rather than moving directly from initial idea to final prototype. Develop reflective evaluation habits: after each iteration, what worked? What did not? What needs to change? Connect iteration to the broader design process: how does testing a prototype inform the next design iteration? For examination questions about design process, practise structuring responses that show understanding of iteration as a design method rather than simply a sequence of steps.",
      "key_vocabulary": "iterative, design cycle, prototype, testing, evaluation, feedback, refinement, specification, brief, research, development, CAD, modelling, user testing, iteration",
      "common_misconceptions": "Many pupils think of the design process as a linear sequence of steps, not understanding that effective design requires returning to earlier stages as new information emerges. The concept of 'failure' in prototyping is often misunderstood; a prototype that reveals a problem has succeeded as a testing tool, even if it fails as a product. Students may conflate the school assessment submission (a record of work done) with the design process itself; the process and its documentation are different things.",
      "concept_type": "process",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 4,
      "co_teach_hints": []
    },
    {
      "concept_id": "DT-KS4-C003",
      "domain_id": "DT-KS4-D002",
      "concept_name": "Human Factors, Ergonomics and Inclusive Design",
      "description": "Human factors is the study of how people interact with designed objects and systems, with the aim of optimising that interaction for safety, comfort, efficiency and effectiveness. Ergonomics applies human factors knowledge to the design of products: ensuring that objects fit the human body (anthropometrics), are cognitively manageable (usability), and meet the physical, sensory and cognitive capabilities of their intended users. Inclusive design — also called universal design — extends ergonomic thinking to ensure that products are usable by the widest possible range of people, including those with disabilities, across the full age range and in diverse cultural contexts.",
      "teaching_guidance": "Introduce anthropometric data (percentile tables for body dimensions) and teach pupils to apply this data in product design. Develop user research skills: how do you find out what users actually need? Practise user testing of prototypes: observing users interacting with a prototype reveals usability issues that are invisible to the designer. Explore inclusive design principles through case studies: how was this product designed to be accessible to users with visual impairment? Physical disabilities? Limited hand strength? For examination questions, practise explaining how specific design features address specific human factors considerations. Connect ergonomics to sustainability: well-designed ergonomic products are more likely to be used effectively and retained rather than discarded.",
      "key_vocabulary": "ergonomics, anthropometrics, inclusive design, universal design, user research, usability, accessibility, prototype, percentile, cognitive load, user testing, disability, accessibility standard, user need, function",
      "common_misconceptions": "Pupils may think ergonomics is only about physical comfort (chair height, handle grip) rather than also addressing cognitive, sensory and emotional dimensions of user experience. The concept of designing for the full range of users, not the 'average' user, is counterintuitive to many; teaching that designing for the extremes often improves the experience for everyone addresses this. Students may conduct user research by asking people what they want rather than observing what they actually do; developing observational user research methods is more effective in practice.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "DT-KS4-C004",
      "domain_id": "DT-KS4-D003",
      "concept_name": "CAD/CAM and Digital Manufacturing",
      "description": "Computer-Aided Design (CAD) refers to the use of software to create, modify, analyse and optimise design drawings and models. Computer-Aided Manufacturing (CAM) refers to the use of computer-controlled manufacturing equipment to produce parts from digital design files. Common CAM processes include laser cutting, 3D printing (additive manufacturing), CNC milling and routing, and vinyl cutting. The integration of CAD and CAM enables rapid prototyping, design iteration and small-batch manufacture with a precision that hand manufacturing cannot match, and reflects the dominant mode of contemporary industrial design and manufacturing.",
      "teaching_guidance": "Develop practical competence with at least one CAD package appropriate to the material specialism. Teach the relationship between CAD file format requirements and CAM machine requirements: how does a 2D vector file become a laser cut outcome? How does a 3D model become a 3D printed part? Develop pupils' understanding of the advantages and limitations of each CAM process: laser cutting (two-dimensional; limited depth; heat-affected zone); 3D printing (slow; limited material choice; additive process); CNC milling (subtractive process; waste material; precise). For examination questions about manufacturing processes, practise comparing the suitability of different CAD/CAM processes for specific design tasks. Connect CAD/CAM to wider manufacturing: how do the same tools operate at industrial scale?",
      "key_vocabulary": "CAD, CAM, laser cutting, 3D printing, CNC, additive manufacturing, subtractive manufacturing, vector file, tolerance, prototype, digital fabrication, rapid prototyping, filament, toolpath, rendering",
      "common_misconceptions": "Pupils frequently assume that CAD/CAM replaces the need for design thinking; understanding that digital tools are a medium for implementing design decisions, not making them, is essential. The precision of digital manufacturing can give a false sense that the design is better than it is; a poorly designed object produced to high tolerance is still a poorly designed object. Students may not understand the difference between 2D and 3D CAD file formats and their applications; developing practical literacy with both develops more appropriate tool selection.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "DT-KS4-C005",
      "domain_id": "DT-KS4-D005",
      "concept_name": "Sustainability and Responsible Design",
      "description": "Sustainability in design and technology refers to the practice of creating products, processes and systems that meet present needs without compromising the ability of future generations to meet their own needs. Sustainable design considers the full lifecycle of a product from raw material extraction through processing, manufacturing, distribution, use and end-of-life disposal, assessing and minimising environmental impact at each stage. Key concepts include: circular economy (designing for reuse, repair and recycling rather than disposal); material efficiency (using the minimum material necessary); energy efficiency in use; ethical sourcing (ensuring that materials and manufacturing processes do not exploit workers or damage communities); and biomimicry (learning from natural systems to create more sustainable designs).",
      "teaching_guidance": "Develop lifecycle thinking through product lifecycle analysis exercises: map the full journey of a familiar product from raw materials to disposal, identifying environmental impacts at each stage. Introduce the six Rs of sustainability (Rethink, Refuse, Reduce, Reuse, Repair, Recycle) as a framework for evaluating design decisions. Study specific examples of sustainable design innovation: the circular economy in practice; cradle-to-cradle design; bioplastics. Connect sustainability to economic and social dimensions: fair trade certification; ethical manufacturing standards; community impact. For examination questions, practise evaluating specific design decisions against sustainability criteria, making justified judgements about their relative environmental and social impact.",
      "key_vocabulary": "sustainability, lifecycle, circular economy, carbon footprint, cradle to cradle, fair trade, ethical, biodegradable, recyclability, energy efficiency, biomimicry, planned obsolescence, material efficiency, carbon neutral, ecological footprint",
      "common_misconceptions": "The reduction of sustainability to 'using recycled materials' or 'being green' obscures the systemic and lifecycle dimensions of genuine sustainable design thinking. Pupils may believe that individual consumer choices are the primary driver of sustainability, rather than systemic design decisions made at the product and system level. The concept of planned obsolescence — deliberately designing products to fail or become unfashionable quickly — may be unfamiliar; studying it is essential for understanding the relationship between business models and sustainability outcomes.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": true,
      "teaching_weight": 5,
      "co_teach_hints": []
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "DT-KS4-C001",
      "dependent_concept": "DT-KS4-C002",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.85,
      "rationale": "Effective iterative design requires knowledge of material properties: design iterations are informed by understanding of what materials can and cannot do, and prototyping choices depend on understanding material workability."
    },
    {
      "prerequisite_concept": "DT-KS4-C002",
      "dependent_concept": "DT-KS4-C003",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.75,
      "rationale": "Human factors and ergonomics are most effectively applied within an iterative design process where user testing at each prototype stage informs the development of subsequent iterations."
    },
    {
      "prerequisite_concept": "DT-KS4-C004",
      "dependent_concept": "DT-KS4-C002",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.7,
      "rationale": "CAD/CAM tools are a major vehicle for iterative design: the ability to modify digital files rapidly and produce revised prototypes makes iteration faster and more manageable, and understanding CAD/CAM enables pupils to choose appropriate iteration strategies."
    },
    {
      "prerequisite_concept": "DT-KS4-C001",
      "dependent_concept": "DT-KS4-C005",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.8,
      "rationale": "Sustainability evaluation of design decisions requires knowledge of material properties, sources and processing: assessing the environmental impact of a material choice requires knowing where the material comes from and what processes are involved in its production and disposal."
    },
    {
      "prerequisite_concept": "DT-KS4-C002",
      "dependent_concept": "DT-KS4-C005",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.65,
      "rationale": "Sustainable design principles are most effectively integrated into practice within an iterative design process where sustainability criteria can be evaluated at each stage and used to guide development decisions."
    },
    {
      "prerequisite_concept": "DT-KS3-C004",
      "dependent_concept": "DT-KS4-C006",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS4 evaluation against specification and user needs directly extends KS3 ethical and sustainable evaluation, requiring the same evaluative rigour but applied to formal design specifications and user testing evidence in the context of GCSE assessment."
    },
    {
      "prerequisite_concept": "DT-KS4-C002",
      "dependent_concept": "DT-KS4-C006",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Evaluation against specification requires a specification to exist; the iterative design process generates and refines the specification through research and development, making design process knowledge a direct prerequisite for specification-referenced evaluation."
    },
    {
      "prerequisite_concept": "DT-KS4-C003",
      "dependent_concept": "DT-KS4-C006",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.75,
      "rationale": "User needs evaluation requires understanding of human factors and ergonomics; knowing what dimensions of user experience to assess and how to conduct structured user testing depends on ergonomic and human factors knowledge."
    },
    {
      "prerequisite_concept": "DT-KS3-C004",
      "dependent_concept": "DT-KS4-C007",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS4 life cycle analysis extends the KS3 ethical and sustainable design framework with a more systematic, stage-by-stage methodology for quantifying environmental impact across the full product lifecycle."
    },
    {
      "prerequisite_concept": "DT-KS4-C005",
      "dependent_concept": "DT-KS4-C007",
      "confidence": "inferred",
      "relationship_type": "logical",
      "strength": 0.8,
      "rationale": "Life cycle analysis is the analytical tool used to operationalise sustainability and responsible design principles; understanding what sustainability means conceptually is prerequisite to conducting systematic lifecycle impact assessments."
    },
    {
      "prerequisite_concept": "DT-KS4-C001",
      "dependent_concept": "DT-KS4-C007",
      "confidence": "inferred",
      "relationship_type": "logical",
      "strength": 0.7,
      "rationale": "Meaningful LCA requires material property knowledge; assessing the environmental impact of material choices at each lifecycle stage depends on understanding the properties, sourcing and processing requirements of the materials involved."
    }
  ]
}
