{
  "metadata": {
    "subject": "Design and Technology",
    "key_stage": "KS3",
    "years_covered": [
      7,
      8,
      9
    ],
    "document_reference": "DFE-00192-2013",
    "extraction_date": "2026-02-17",
    "structure_rating": 8
  },
  "domains": [
    {
      "domain_id": "DT-KS3-D001",
      "domain_name": "Design",
      "description": "Using research and exploration to identify and solve own design problems; developing and communicating design ideas using annotated sketches, detailed plans, 3D and mathematical modelling, and computer-aided design.",
      "curriculum_context": "At KS3, design becomes genuinely self-directed: pupils are expected to identify and solve their own design problems rather than working to given briefs. This autonomy marks a significant shift from KS2, where the design brief was typically provided. Pupils are expected to conduct in-depth research and exploration - including user research, existing product analysis, material investigation and contextual study - to identify authentic user needs and opportunities. Design specification becomes more rigorous, articulating measurable criteria against which final products can be evaluated. Communication through multiple representational modes, including annotated sketches, formal technical drawings, scale models, 3D computer modelling and mathematical modelling of structural or mechanical properties, equips pupils with the full toolkit of professional designers.",
      "is_cross_cutting": false,
      "structure_type": "process"
    },
    {
      "domain_id": "DT-KS3-D002",
      "domain_name": "Make",
      "description": "Selecting from and using specialist tools, techniques and processes, including computer-aided manufacture, and adapting and modifying the design as appropriate to refine and improve the product.",
      "curriculum_context": "Making at KS3 extends to specialist tools and processes including computer-aided manufacture (CAM), reflecting the increasingly technological nature of contemporary design and manufacturing practice. Pupils are expected to select appropriate tools, processes and materials for specific making tasks, demonstrating understanding of how properties of materials interact with making processes to determine quality of outcome. The curriculum acknowledges that design and making are iterative rather than sequential: pupils are expected to adapt and modify their designs during making as problems are encountered and solutions are discovered. This iterative making process develops the engineering and problem-solving mindset that characterises professional design and manufacturing practice.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "DT-KS3-D003",
      "domain_name": "Evaluate",
      "description": "Analysing the work of past and present professionals; investigating new and emerging technologies; testing, evaluating and refining products against design specifications and considering ethical, environmental and social dimensions.",
      "curriculum_context": "Evaluation at KS3 expands significantly in scope to include investigation of new and emerging technologies - drones, artificial intelligence, 3D printing, smart materials - as transformative forces in design and technology. Pupils also develop understanding of how key events and individuals in design and technology have shaped the world, giving historical and cultural perspective on the subject as a discipline. Most significantly, evaluation at KS3 is expected to engage with the broader consequences of design decisions: the ethical implications of product use, the environmental impact of materials and manufacturing processes, and the social consequences of design choices. This introduces pupils to the idea that designers have responsibilities that extend beyond the functional requirements of a brief.",
      "is_cross_cutting": false,
      "structure_type": "process"
    },
    {
      "domain_id": "DT-KS3-D004",
      "domain_name": "Technical Knowledge",
      "description": "Understanding and applying properties of materials and structural elements; understanding mechanical and electrical/electronic systems; using computing and electronics to embed intelligence into products through sensors, actuators and microcontrollers.",
      "curriculum_context": "Technical knowledge at KS3 reaches the level of genuine engineering complexity. Pupils develop systematic understanding of the properties of materials and how they determine appropriate applications and manufacturing processes. Structural knowledge extends to the engineering principles of how structures carry loads and how to design against failure. Mechanical systems become more complex, covering a wider range of mechanisms. Electrical and electronic systems extend to programmable microcontrollers and sensors, enabling pupils to design products with embedded intelligence that can sense, process and respond to their environment. This convergence of electronics, programming and physical design is the defining characteristic of contemporary technology products, and its inclusion at KS3 prepares pupils for the technological landscape they inhabit.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "DT-KS3-D005",
      "domain_name": "Cooking and Nutrition",
      "description": "Understanding and applying principles of nutrition and health; cooking a repertoire of increasingly complex dishes; understanding how ingredients are sourced, grown, reared or caught and the impact of food choices on health, the environment and society.",
      "curriculum_context": "Cooking and nutrition at KS3 builds from KS2 knowledge of healthy eating and basic cooking to a more sophisticated understanding of nutrition science, a wider repertoire of dishes and cooking techniques, and broader awareness of the food system. Pupils develop understanding of how the macronutrients and micronutrients in food affect health, and how to plan diets that meet nutritional needs. The cooking repertoire extends to more complex dishes requiring more advanced techniques. Understanding of ingredient sourcing becomes more nuanced, including the environmental and social dimensions of food choices: food miles, ethical sourcing, food security and the environmental impact of different diets.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    }
  ],
  "objectives": [
    {
      "objective_id": "DT-KS3-O001",
      "domain_id": "DT-KS3-D001",
      "objective_text": "use research and exploration, such as the study of different cultures, to identify and understand user needs",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS3-O002",
      "domain_id": "DT-KS3-D001",
      "objective_text": "identify and solve their own design problems and understand how to reformulate problems given to them",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS3-O003",
      "domain_id": "DT-KS3-D001",
      "objective_text": "develop specifications to inform the design of innovative, functional, appealing products that respond to needs in a variety of situations",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS3-O004",
      "domain_id": "DT-KS3-D001",
      "objective_text": "use a variety of approaches [for example, biomimicry and user-centred design], to generate creative ideas and avoid stereotypical responses",
      "non_statutory_guidance": null,
      "examples": "biomimicry and user-centred design",
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS3-O005",
      "domain_id": "DT-KS3-D001",
      "objective_text": "communicate their design ideas to others, including annotated sketches, detailed plans, 3-dimensional and mathematical models, oral and digital presentations and computer-aided design",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS3-O006",
      "domain_id": "DT-KS3-D002",
      "objective_text": "select from and use specialist tools, techniques, processes, equipment and machinery precisely, including computer-aided manufacture",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS3-O007",
      "domain_id": "DT-KS3-D002",
      "objective_text": "select from and use a wider, more complex range of materials, components and ingredients, taking into account their properties",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS3-O008",
      "domain_id": "DT-KS3-D003",
      "objective_text": "analyse the work of past and present professionals and others to develop and broaden their understanding",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS3-O009",
      "domain_id": "DT-KS3-D003",
      "objective_text": "investigate new and emerging technologies",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS3-O010",
      "domain_id": "DT-KS3-D003",
      "objective_text": "test, evaluate and refine their ideas and products against a specification, taking into account the views of intended users and other interested groups",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS3-O011",
      "domain_id": "DT-KS3-D003",
      "objective_text": "understand developments in design and technology, its impact on individuals, society and the environment, and the responsibilities of designers, engineers and technologists",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS3-O012",
      "domain_id": "DT-KS3-D004",
      "objective_text": "understand and use the properties of materials and the performance of structural elements to achieve functional solutions",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS3-O013",
      "domain_id": "DT-KS3-D004",
      "objective_text": "understand how more advanced mechanical systems used in their products enable changes in movement and force",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS3-O014",
      "domain_id": "DT-KS3-D004",
      "objective_text": "understand how more advanced electrical and electronic systems can be powered and used in their products [for example, circuits with heat, light, sound and movement as inputs and outputs]",
      "non_statutory_guidance": null,
      "examples": "circuits with heat, light, sound and movement as inputs and outputs",
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS3-O015",
      "domain_id": "DT-KS3-D004",
      "objective_text": "apply computing and use electronics to embed intelligence in products that respond to inputs [for example, sensors], and control outputs [for example, actuators], using programmable components [for example, microcontrollers]",
      "non_statutory_guidance": null,
      "examples": "sensors; actuators; microcontrollers",
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS3-O016",
      "domain_id": "DT-KS3-D005",
      "objective_text": "understand and apply the principles of nutrition and health",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS3-O017",
      "domain_id": "DT-KS3-D005",
      "objective_text": "cook a repertoire of predominantly savoury dishes so that they are able to feed themselves and others a healthy and varied diet",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS3-O018",
      "domain_id": "DT-KS3-D005",
      "objective_text": "become competent in a range of cooking techniques [for example, selecting and preparing ingredients; using utensils and electrical equipment; applying heat in different ways; using awareness of taste, texture and smell to decide if food is ready]",
      "non_statutory_guidance": null,
      "examples": "selecting and preparing ingredients; using utensils and electrical equipment; applying heat in different ways; using awareness of taste, texture and smell to decide if food is ready",
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS3-O019",
      "domain_id": "DT-KS3-D005",
      "objective_text": "understand the source, seasonality and characteristics of a broad range of ingredients",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "DT-KS3-C005",
      "domain_id": "DT-KS3-D002",
      "concept_name": "Specialist Making Processes and CAM",
      "description": "At KS3, making extends beyond hand tool skills to encompass specialist processes — including laser cutting, CNC routing, 3D printing, vacuum forming, heat bending, laminating and computer-aided manufacture (CAM) — that are used in professional design and manufacturing contexts. Understanding which processes are appropriate for specific materials and design outcomes, and developing competence in executing them precisely, is the central challenge of the make domain at KS3. Pupils also develop understanding that making is not a one-pass process but an iterative one: encountering problems during making often requires returning to the design to adapt it.",
      "teaching_guidance": "Introduce CAM processes by connecting them to the design file: how does a 2D vector drawing become a laser-cut part? How does a 3D model become a 3D-printed component? Set making tasks that require pupils to select from a range of available processes, justifying their choice in terms of material, precision, speed and scale. Build in time for pupils to encounter and solve problems during making, developing their adaptive and iterative making skills. Teach quality control as an integral part of making: check, measure and test at each stage, not only at the end.",
      "key_vocabulary": "CAM, laser cutting, 3D printing, CNC, vacuum forming, laminating, process, precision, tolerance, iterate, adapt, quality, manufacture, prototype, subtractive",
      "common_misconceptions": "Pupils may assume that CAM processes always produce better results than hand making, not understanding that the quality of the output depends on the quality of the design file. They may also see CAM as 'cheating' rather than as a professional making skill. Some pupils may not understand why making problems require design modifications rather than just making harder; the iterative relationship between designing and making needs explicit modelling.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "DT-KS3-C006",
      "domain_id": "DT-KS3-D002",
      "concept_name": "Material Selection for Complex Products",
      "description": "Selecting materials for complex products at KS3 requires systematic evaluation of a wider range of materials — including metals, polymers, wood-based materials, composites, textiles, smart materials and electronic components — against multiple criteria simultaneously: functional performance, aesthetic requirements, cost, availability, environmental impact, and compatibility with available making processes. The increased complexity of KS3 products means that multiple materials are often combined, requiring understanding of how materials interact with each other and with making processes.",
      "teaching_guidance": "Develop a materials selection matrix approach: list requirements on one axis, candidate materials on the other, score each material against each requirement, and select the material with the highest combined score. Investigate how composite materials combine properties from different constituent materials. Study materials data sheets and supplier catalogues as real-world selection tools. Set open material selection tasks where pupils must research, compare and justify their material choices for complex multi-material products. Connect material selection to sustainability: what is the environmental cost of different material choices?",
      "key_vocabulary": "material, composite, polymer, metal, alloy, wood, textile, smart material, selection, criteria, property, process, compatibility, sustainability, specification",
      "common_misconceptions": "Pupils may select familiar materials rather than the most appropriate ones. Systematic matrix-based selection challenges habitual choosing. The idea that different materials in a single product must be compatible with the same making processes can be missed; teaching pupils to consider how each part will be made alongside what it will be made from prevents this.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "DT-KS3-C007",
      "domain_id": "DT-KS3-D005",
      "concept_name": "Nutrition Science and Dietary Planning",
      "description": "Nutrition science is the study of how the nutrients contained in food — macronutrients (carbohydrates, proteins, fats) and micronutrients (vitamins, minerals) — are used by the body to maintain health, support growth and provide energy. At KS3, pupils develop beyond basic food group awareness to understand the specific roles of macronutrients and key micronutrients, the consequences of nutritional deficiency or excess, and how to plan a diet that meets individual nutritional needs. This knowledge underpins the ability to make informed food choices and to prepare nutritionally appropriate meals.",
      "teaching_guidance": "Teach macronutrients and key micronutrients through their specific functions in the body: carbohydrates for energy, proteins for growth and repair, fats for energy storage and cell structure, iron for oxygen transport, calcium for bone density. Use nutritional analysis tools and food labels to develop pupils' ability to evaluate the nutritional content of ingredients and dishes. Set dietary planning tasks that require pupils to design a day's meals meeting specified nutritional targets. Connect to cooking through the selection of ingredients that together provide a balanced nutrient profile.",
      "key_vocabulary": "macronutrient, micronutrient, carbohydrate, protein, fat, vitamin, mineral, fibre, calorie, energy, deficiency, diet, nutrition, balance, guideline daily amount",
      "common_misconceptions": "Pupils may have oversimplified views of nutritional 'good' and 'bad' foods, not understanding that most foods provide a range of nutrients and that nutritional quality depends on overall diet pattern rather than individual foods. The roles of fat and carbohydrate are often misunderstood due to popular diet culture; teaching evidence-based nutritional science corrects common misconceptions about these macronutrients.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "DT-KS3-C008",
      "domain_id": "DT-KS3-D005",
      "concept_name": "Advanced Cooking Techniques and Culinary Skills",
      "description": "Advanced cooking techniques at KS3 extend pupils' practical competence to include a broader repertoire of preparation and cooking methods across different food categories and cuisines. These include more complex knife skills (julienne, chiffonade, dicing), a range of heat application methods (sautéing, braising, roasting, poaching, steaming), and techniques for improving flavour, texture and presentation (seasoning, reduction, garnishing, emulsification). Developing a repertoire of competent cooking techniques enables pupils to prepare a wide variety of dishes that support a healthy, varied diet.",
      "teaching_guidance": "Build cooking technique competence progressively across KS3, setting dishes that require new techniques while revisiting and consolidating earlier ones. Develop sensory evaluation skills: taste, smell, texture and visual assessment are important tools for a cook. Teach seasoning and flavour development as skills, not afterthoughts. Introduce multi-component dishes that require coordination of timing and technique. Connect cooking techniques to science: what happens to proteins when heated? Why does bread rise? How does an emulsion hold together? Emphasise food safety and hygiene as non-negotiable throughout.",
      "key_vocabulary": "technique, knife skill, sauté, braise, roast, poach, steam, season, reduce, emulsify, garnish, texture, flavour, aroma, preparation",
      "common_misconceptions": "Pupils may approach cooking as recipe-following rather than skill development, missing the transferable technique knowledge that allows them to cook without a recipe. Framing each cooking session as practising a specific technique, not just making a specific dish, develops this broader competence. Pupils may underestimate the importance of preparation (mise en place) to a smooth cooking process; practising organised preparation as a skill in itself addresses this.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "DT-KS3-C001",
      "domain_id": "DT-KS3-D001",
      "concept_name": "User-Centred Design",
      "description": "User-centred design is a design philosophy and process that places the needs, capabilities, preferences and context of intended users at the centre of every design decision. It involves deep empathy with users, structured research methods (interviews, observation, surveys, prototyping), iterative testing with real users, and continuous refinement based on user feedback. At KS3, pupils develop understanding of user-centred design as a distinct and powerful approach that produces solutions better suited to genuine human needs than solutions derived purely from technical or aesthetic assumptions.",
      "teaching_guidance": "Introduce user research methods: structured interviews, observation, persona development, user journey mapping. Set projects where pupils must engage with real potential users before and during the design process. Teach prototyping as a user testing tool, not just a making exercise. Discuss famous examples of user-centred design (and failures caused by ignoring users). Develop pupils' ability to translate qualitative user insights into quantitative design criteria. Connect to real professional practice: how do product companies discover user needs?",
      "key_vocabulary": "user, need, empathy, research, interview, observation, persona, prototype, iterate, test, feedback, usability, accessibility, human-centred, specification",
      "common_misconceptions": "Pupils may assume they understand user needs without researching them; conducting actual user research and discovering unexpected insights challenges this assumption. Pupils may treat prototyping as the production of a miniature final product rather than as a testing tool; emphasising that prototypes are for learning, not perfecting, changes the approach. The idea that design can be improved through testing can seem obvious but requires practical experience to become a genuine habit.",
      "concept_type": "process",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "DT-KS3-C002",
      "domain_id": "DT-KS3-D004",
      "concept_name": "Materials Science and Properties",
      "description": "Materials science is the study of the properties of materials - physical, mechanical, thermal, electrical, chemical and aesthetic - and how these properties determine the suitability of materials for specific applications. At KS3, pupils develop systematic understanding of the properties of a range of materials including metals, polymers, wood-based materials, ceramics, composites and smart materials. Understanding properties enables pupils to make informed material selection decisions and to understand why materials behave as they do under different conditions and manufacturing processes.",
      "teaching_guidance": "Teach properties systematically with practical testing activities: compare strength, flexibility, conductivity, thermal properties of different materials. Study how manufacturing processes alter properties: how does heat treatment change metal? How does grain direction affect wood? Investigate smart and composite materials: shape-memory alloys, carbon fibre, Kevlar. Connect material choice to product examples: why is this product made from this material? What would change if a different material were used? Use material data sheets as professional reference tools.",
      "key_vocabulary": "property, material, strength, stiffness, ductility, malleability, conductivity, thermal, density, composite, smart material, alloy, polymer, ceramic, corrosion",
      "common_misconceptions": "Pupils may have oversimplified mental models of materials (metal = hard, plastic = soft) that do not account for the enormous range within each material category. Systematic comparison activities challenge these generalisations. The distinction between material properties (inherent characteristics) and manufacturing properties (how easily a material can be shaped) is important but often conflated. Smart materials may seem magical; explaining the underlying scientific principles demystifies them.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "DT-KS3-C003",
      "domain_id": "DT-KS3-D004",
      "concept_name": "Embedded Computing and Product Intelligence",
      "description": "Embedded computing refers to the integration of programmable microcontrollers and electronic components into physical products, enabling them to sense their environment, process information and control physical outputs. This creates intelligent, responsive products that adapt their behaviour to conditions and user inputs. At KS3, pupils learn to design and build products with embedded computing, applying programming knowledge from computing to create sensors, input devices, output actuators and control logic within designed products.",
      "teaching_guidance": "Use accessible microcontroller platforms (micro:bit, Arduino, Raspberry Pi) for embedded computing projects. Design tasks that require products to respond to sensor inputs (temperature, light, sound, proximity, touch) and control physical outputs (motors, LEDs, speakers, displays). Teach pupils to specify the input-process-output logic of their product's intelligence before programming. Connect to the wider world: how is embedded computing used in everyday products (washing machines, smartphones, cars, medical devices)? Evaluate how well the program meets the product's design specification.",
      "key_vocabulary": "embedded, microcontroller, sensor, actuator, input, output, program, control, logic, condition, feedback, responsive, automation, interface, prototype",
      "common_misconceptions": "Pupils may see electronics and programming as separate from 'proper' DT making. Framing embedded computing as a component of product design, like any other mechanical or material element, integrates it appropriately. Pupils may find it difficult to specify product behaviour before programming; teaching input-process-output planning as a design step addresses this. The debugging of electronic and software systems can be frustrating; systematic fault-finding strategies build resilience.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": true
    },
    {
      "concept_id": "DT-KS3-C004",
      "domain_id": "DT-KS3-D003",
      "concept_name": "Ethical and Sustainable Design",
      "description": "Ethical design considers the consequences of design decisions for users, workers in the supply chain, communities and the broader environment. Sustainable design aims to meet current needs without compromising the ability of future generations to meet their own needs, considering the environmental impact of materials extraction, manufacturing, product use and end-of-life disposal. At KS3, pupils develop the analytical frameworks to evaluate products and their own designs from ethical and environmental perspectives, understanding that designers have responsibilities that extend beyond functional requirements.",
      "teaching_guidance": "Use life cycle analysis (LCA) to trace the environmental impact of a product from raw material extraction to end-of-life disposal. Discuss fair trade and ethical sourcing in the context of materials and food ingredients. Investigate the circular economy and how products can be designed for repair, reuse and recycling rather than disposal. Explore real examples of ethical and unethical design decisions: tobacco packaging, single-use plastics, accessibility failures. Connect to pupils' own design work by requiring ethical and environmental consideration as part of the evaluation process.",
      "key_vocabulary": "sustainable, ethical, life cycle, carbon footprint, fair trade, circular economy, biodegradable, recycling, supply chain, environmental impact, social responsibility, consequence, equity",
      "common_misconceptions": "Pupils may think sustainability means using recycled materials, missing the much broader concept of reducing impact across the entire life cycle. Pupils may not see a connection between their individual design decisions and wider environmental or social outcomes; tracing specific design choices to their broader consequences makes this concrete. The apparent conflict between sustainability and cost or performance requires honest discussion of real-world trade-offs.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": true
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "DT-KS2-C001",
      "dependent_concept": "DT-KS3-C001",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS3 user-centred design directly extends the KS2 research-informed design approach, adding more sophisticated user research methods, persona development and iterative prototyping to the research-to-criteria framework established at KS2."
    },
    {
      "prerequisite_concept": "DT-KS2-C004",
      "dependent_concept": "DT-KS3-C003",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS3 embedded computing extends the KS2 understanding of series circuits and computing control, applying these concepts in more complex product designs with programmable microcontrollers, sensors and actuators."
    },
    {
      "prerequisite_concept": "DT-KS3-C003",
      "dependent_concept": "DT-KS3-C004",
      "confidence": "inferred",
      "relationship_type": "logical",
      "strength": 0.6,
      "rationale": "Understanding the technical capabilities of embedded computing systems is a prerequisite for meaningfully evaluating their ethical and environmental implications, since these implications flow from specific product design and manufacturing decisions."
    },
    {
      "prerequisite_concept": "DT-KS3-C002",
      "dependent_concept": "DT-KS3-C004",
      "confidence": "inferred",
      "relationship_type": "logical",
      "strength": 0.7,
      "rationale": "Understanding materials science and properties is prerequisite to meaningful engagement with sustainable design, since sustainability analysis requires understanding the environmental impacts associated with specific material extraction, processing and disposal."
    },
    {
      "prerequisite_concept": "DT-KS2-C006",
      "dependent_concept": "DT-KS3-C005",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS3 specialist making and CAM directly extends KS2 accurate making skills, adding digital manufacturing processes and the expectation of iterative adaptation during making to the precision-focused foundation established at KS2."
    },
    {
      "prerequisite_concept": "DT-KS2-C007",
      "dependent_concept": "DT-KS3-C006",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS3 material selection for complex products extends KS2 functional and aesthetic material knowledge to a wider range of materials and a more systematic, multi-criteria selection process."
    },
    {
      "prerequisite_concept": "DT-KS3-C002",
      "dependent_concept": "DT-KS3-C006",
      "confidence": "inferred",
      "relationship_type": "logical",
      "strength": 0.75,
      "rationale": "Materials science provides the systematic property knowledge needed for principled material selection: without understanding why materials have specific properties, selection decisions remain intuitive rather than evidence-based."
    },
    {
      "prerequisite_concept": "DT-KS2-C011",
      "dependent_concept": "DT-KS3-C007",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "KS3 nutrition science builds on KS2 seasonality and ingredient sourcing knowledge, extending from food origins and basic healthy eating to systematic understanding of macronutrients, micronutrients and dietary planning."
    },
    {
      "prerequisite_concept": "DT-KS2-C010",
      "dependent_concept": "DT-KS3-C008",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS3 advanced cooking techniques directly extend the range of cooking methods introduced at KS2, requiring the foundational skills of preparation, basic heat application and food hygiene as prerequisites for more complex culinary work."
    },
    {
      "prerequisite_concept": "DT-KS3-C007",
      "dependent_concept": "DT-KS3-C008",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.7,
      "rationale": "Advanced cooking technique development is most purposeful when connected to nutritional goals; understanding which nutrients different ingredients provide guides the selection and combination of techniques in nutritionally balanced dish preparation."
    }
  ]
}
