{
  "metadata": {
    "subject": "Drama",
    "key_stage": "KS4",
    "years_covered": [
      10,
      11
    ],
    "document_reference": "DFE-00039-2015",
    "extraction_date": "2026-02-21",
    "structure_rating": 8
  },
  "domains": [
    {
      "domain_id": "DR-KS4-D001",
      "domain_name": "Creating and Devising",
      "description": "Creating original dramatic work through collaborative and individual devising processes, using a range of stimuli, dramatic forms and theatrical techniques to develop and communicate meaning. Devised work constitutes a major assessed component in most GCSE Drama specifications.",
      "curriculum_context": "Devising at GCSE requires pupils to engage in the full creative process from initial stimulus through to performed and evaluated outcome. Unlike scripted performance, devising demands that pupils make fundamental decisions about form, content, structure and theatrical style, demonstrating creative ownership of the work. The collaborative dimension of devising develops skills of creative negotiation, ensemble cohesion and collective decision-making that reflect professional theatrical practice. Pupils must document their devising process — recording decisions made, approaches tried and rejected, and the evolution of the piece — as this process documentation constitutes part of the assessed submission alongside the performance itself. The range of stimuli from which devising work can develop is broad: image, text, music, physical object, social theme, historical event.",
      "is_cross_cutting": false,
      "structure_type": "process"
    },
    {
      "domain_id": "DR-KS4-D002",
      "domain_name": "Performing: Physical and Vocal Skills",
      "description": "Performing scripted and devised work with technical control over physical and vocal skills, demonstrating characterisation, expressive range and ensemble awareness. Performance skills are assessed in both devised and scripted contexts throughout the GCSE.",
      "curriculum_context": "Performance at GCSE demands a substantially higher level of technical control, expressive range and characterisation than at KS3. Physical skills encompass posture, gesture, movement, spatial awareness, proxemics and physical characterisation — the creation of distinct physicality for characters different from the performer's own. Vocal skills encompass projection, clarity, pace, pitch, pause, intonation and accent — the full range of vocal choices through which character, emotion and dramatic meaning are communicated. At GCSE, physical and vocal skills must work in integrated service of characterisation and communication of dramatic meaning; technical exercises are valuable only insofar as they serve the performer's expressive and communicative purposes. Pupils are also required to see live professional theatre as part of their course, and this experience must inform their analytical and practical development.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "DR-KS4-D003",
      "domain_name": "Design and Production",
      "description": "Understanding and applying the principles of theatre design — including set design, costume design, lighting design and sound design — in the service of theatrical communication. Design and production knowledge informs practical work and analytical writing.",
      "curriculum_context": "Theatre design at GCSE encompasses the range of production elements through which theatrical meaning is communicated beyond the actor's body: set and staging, lighting, sound, costume and make-up. Pupils must understand how each design element can be used to communicate character, period, atmosphere, theme and genre, and demonstrate this understanding in both their practical work and their analytical writing. The study of design must include understanding of different staging configurations (end-on, in-the-round, traverse, thrust) and how staging choices affect the performer-audience relationship and the possible meanings of the work. At GCSE, some pupils may be assessed specifically as designers rather than as performers; the subject content must provide sufficient depth in design knowledge for this specialist route to be effectively supported.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "DR-KS4-D004",
      "domain_name": "Analysing and Evaluating Theatre",
      "description": "Analysing and evaluating drama and theatre with knowledge and understanding of theatrical contexts, practitioners, design elements and performance choices. The written analysis of live and recorded theatre is a key component of GCSE Drama assessment.",
      "curriculum_context": "Analytical and evaluative writing about drama and theatre at GCSE requires pupils to deploy a sophisticated critical vocabulary, rooted in understanding of theatrical form and convention, to examine how specific performances and productions communicate meaning. The 2017 update to GCSE Drama specifications strengthened the requirement for pupils to see live professional theatre, with the analysis of a live or recorded performance constituting a significant assessed component. Pupils must be able to write about performance skills, design choices and directorial interpretation with specific reference to observed examples, explaining how particular theatrical choices created specific effects and meanings for the audience. The ability to use theatrical terminology accurately and to support evaluative judgements with specific, detailed evidence is central to high performance in this component.",
      "is_cross_cutting": false,
      "structure_type": "process"
    }
  ],
  "objectives": [
    {
      "objective_id": "DR-KS4-O001",
      "domain_id": "DR-KS4-D001",
      "objective_text": "create and develop ideas for devised drama using a range of stimuli, dramatic forms and theatrical techniques",
      "non_statutory_guidance": null,
      "examples": "Image-based stimuli; text stimuli; social or political themes; physical theatre starting points.",
      "is_statutory": true
    },
    {
      "objective_id": "DR-KS4-O002",
      "domain_id": "DR-KS4-D001",
      "objective_text": "structure and shape devised work to create dramatic tension, pace and meaning",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DR-KS4-O003",
      "domain_id": "DR-KS4-D001",
      "objective_text": "document and reflect on the creative and collaborative devising process",
      "non_statutory_guidance": null,
      "examples": "Process documentation may include rehearsal diary, portfolio of ideas, annotated scripts, video recordings of rehearsals.",
      "is_statutory": true
    },
    {
      "objective_id": "DR-KS4-O004",
      "domain_id": "DR-KS4-D002",
      "objective_text": "demonstrate technical control of physical skills including posture, gesture, movement, facial expression and proxemics in performance",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DR-KS4-O005",
      "domain_id": "DR-KS4-D002",
      "objective_text": "demonstrate technical control of vocal skills including projection, clarity, pace, pitch, pause and intonation in performance",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DR-KS4-O006",
      "domain_id": "DR-KS4-D002",
      "objective_text": "perform scripted drama with understanding of character, motivation, relationships and dramatic context",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DR-KS4-O007",
      "domain_id": "DR-KS4-D002",
      "objective_text": "see and reflect on live professional theatre as part of the course",
      "non_statutory_guidance": "This requirement was clarified in the 2017 update to the subject content.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DR-KS4-O008",
      "domain_id": "DR-KS4-D003",
      "objective_text": "understand and apply principles of theatre design including set, lighting, sound and costume in relation to performance",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DR-KS4-O009",
      "domain_id": "DR-KS4-D003",
      "objective_text": "demonstrate knowledge of different staging configurations and how staging choices affect theatrical communication",
      "non_statutory_guidance": null,
      "examples": "End-on, proscenium arch, in-the-round, traverse, thrust, promenade.",
      "is_statutory": true
    },
    {
      "objective_id": "DR-KS4-O010",
      "domain_id": "DR-KS4-D004",
      "objective_text": "analyse and evaluate the work of theatre-makers, including performance, design and directorial choices",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DR-KS4-O011",
      "domain_id": "DR-KS4-D004",
      "objective_text": "write analytically and evaluatively about live or recorded theatre using accurate theatrical terminology",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DR-KS4-O012",
      "domain_id": "DR-KS4-D004",
      "objective_text": "understand the work and methods of significant theatre practitioners and the influence of their approaches on contemporary theatre",
      "non_statutory_guidance": "Practitioners studied should include both historical and contemporary theatre-makers.",
      "examples": "Stanislavski, Brecht, Artaud, Berkoff, Frantic Assembly, DV8.",
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "DR-KS4-C001",
      "domain_id": "DR-KS4-D002",
      "concept_name": "Physical and Vocal Characterisation",
      "description": "Physical and vocal characterisation is the process by which an actor creates a character distinct from themselves using the full range of physical and vocal means available: posture, gesture, gait, facial expression, proxemics, voice quality, pitch, pace, accent, pause and rhythm of speech. At GCSE, characterisation must be consistent, technically controlled and in service of the dramatic meaning of the work. Strong characterisation communicates character psychology, status, relationships and motivation through concrete physical and vocal choices rather than through indicating or generalised expression.",
      "teaching_guidance": "Develop physical characterisation through practical exercises: status games, character walks, physicalising abstract qualities (play this character as though their spine is made of stone). Develop vocal characterisation through voice work: accent modification, register shifting, pace and pause work. Practise sustaining characterisation consistently throughout extended scenes, especially when not the focus of attention. Develop pupils' ability to justify characterisation choices with reference to the text and character analysis: why this gesture, this voice quality, this physical relationship to space? For examination performance components, develop a consistent evaluation vocabulary: specific, precise description of physical and vocal choices and their effect on the audience.",
      "key_vocabulary": "physicality, gesture, posture, gait, proxemics, projection, intonation, pace, pitch, pause, accent, status, characterisation, motivation, consistent",
      "common_misconceptions": "Pupils frequently use generalised physical and vocal expression (moving anxiously; speaking nervously) rather than specific, concrete choices; developing the habit of specific physical decision-making produces more powerful characterisation. Students may believe that good characterisation means becoming the character emotionally rather than making precise physical and vocal choices; the technical craft of characterisation can coexist with genuine emotional engagement. The idea that characterisation is only relevant during lines or active moments is incorrect; sustained characterisation when listening and reacting is equally important.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "DR-KS4-C002",
      "domain_id": "DR-KS4-D001",
      "concept_name": "Dramatic Form and Genre",
      "description": "Dramatic form refers to the structural and stylistic principles that shape a piece of theatre: whether it is naturalistic or stylised, linear or non-linear, scripted or devised, text-based or physical, site-specific or presented in a traditional theatre space. Genre encompasses the conventional categories of dramatic work — tragedy, comedy, melodrama, farce, documentary theatre, physical theatre, verbatim theatre — each with characteristic structural patterns, theatrical conventions and audience relationships. At GCSE, pupils must understand a range of dramatic forms and genres both analytically (for evaluative writing) and practically (for devising and performing).",
      "teaching_guidance": "Teach dramatic form and genre through practical exploration: work in a range of styles and forms rather than focusing exclusively on naturalistic scripted performance. Develop pupils' understanding that form and content are inseparable: the choice of form is a statement of meaning. Explore how the same story or theme can be treated in radically different ways by changing the dramatic form. Use practitioner study to introduce pupils to forms they might not encounter otherwise: Brechtian epic theatre, Artaudian theatre of cruelty, physical theatre. For analytical writing, develop pupils' ability to identify specific formal and generic features of theatre they have seen and explain how these features serve the work's meanings and intentions.",
      "key_vocabulary": "naturalistic, stylised, epic theatre, physical theatre, verbatim, documentary, site-specific, tragedy, comedy, melodrama, farce, genre, form, structure, convention",
      "common_misconceptions": "Many pupils are familiar only with naturalistic drama and may treat it as the default form, understanding stylised or non-naturalistic theatre as 'unusual' rather than as an equally legitimate set of conventions. Broadening exposure to diverse theatrical forms challenges this. The conflation of 'form' (structural approach) with 'genre' (category of drama) is common; teaching these as distinct but related concepts develops more precise critical vocabulary. Pupils may assume that experimental or non-naturalistic forms are necessarily more sophisticated than naturalistic ones; appreciating the distinct challenges and possibilities of each form develops more nuanced theatrical understanding.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "DR-KS4-C003",
      "domain_id": "DR-KS4-D003",
      "concept_name": "Theatre Design and Production Elements",
      "description": "Theatre design encompasses the ensemble of production choices through which theatrical meaning is communicated beyond the actor's body. Set design creates the physical world of the performance: its period, location, social context and thematic environment. Lighting design shapes the audience's perception of time, space, mood and focus. Sound design encompasses recorded and live sound effects, music and atmospheric soundscapes that establish environment, pace and emotional register. Costume and make-up communicate character, period, status and relationship. Each design element must be considered as an active contributor to meaning rather than a passive background for performance.",
      "teaching_guidance": "Teach each design element through analysis of specific productions, connecting design choices to their dramatic effects. Develop pupils' ability to write about design with specificity: not 'the lighting was dark' but 'the deep blue wash, broken by a single white spotlight centred on the protagonist, created a sense of isolation and inevitability'. Practise making design decisions for scripted extracts: if you were designing the lighting for this scene, what would you choose and why? For design-specialist routes, develop practical skills in design realisation. For all pupils, develop understanding of how design elements work together to create a unified theatrical environment. In analytical writing, always connect design observations to dramatic effect and intention.",
      "key_vocabulary": "set design, lighting design, sound design, costume, make-up, staging, proxemics, lantern, wash, focus, gel, projection, atmosphere, sightlines, cyclorama",
      "common_misconceptions": "Pupils frequently describe design elements without explaining their dramatic effect; teaching the connection between design choice and audience experience is the key analytical skill. The assumption that design is subordinate to performance — merely setting the scene for the actors — misunderstands the collaborative and co-creative nature of theatre-making; design can carry meaning independently. Students may conflate the set as described in a script with the set as realised in a specific production, not understanding that production choices are interpretive decisions.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "DR-KS4-C004",
      "domain_id": "DR-KS4-D004",
      "concept_name": "Theatre Practitioners and Their Methodologies",
      "description": "Theatre practitioners are the directors, writers, performers and theatre-makers whose work has significantly shaped the theory and practice of theatre. At GCSE, pupils must understand the work and approaches of key practitioners and recognise their influence on contemporary theatre-making. Significant practitioners typically studied include: Stanislavski (naturalistic acting method, psychological truth, emotional memory, given circumstances); Brecht (epic theatre, Verfremdungseffekt, gestus, direct address, didactic theatre); Artaud (theatre of cruelty, sensory bombardment, non-verbal theatre); and contemporary physical theatre companies such as Frantic Assembly (physical storytelling, choreographic approaches to characterisation) and DV8.",
      "teaching_guidance": "Introduce each practitioner through specific examples of their work and its context: why did Brecht develop his approach in Weimar Germany? What specific theatrical problems was Stanislavski trying to solve? Develop pupils' understanding of practitioners as developing responses to specific artistic and political contexts rather than as inventors of timeless systems. Connect practitioner methods to practical exploration: use Stanislavski's given circumstances in script analysis; use Brechtian techniques in devising stylised work. For written examination questions about practitioners, practise structuring analytical responses that connect practitioner theory to specific theatrical examples. Develop pupils' ability to identify practitioner influences in theatre they have seen.",
      "key_vocabulary": "Stanislavski, Brecht, Artaud, naturalism, epic theatre, Verfremdungseffekt, gestus, theatre of cruelty, physical theatre, method, practitioner, influence, technique, stylistic, contemporary",
      "common_misconceptions": "Pupils may treat practitioner methodologies as prescriptive rules rather than as creative approaches developed for specific purposes; understanding them as responses to particular theatrical problems preserves their usefulness. The Stanislavskian 'method' is frequently misunderstood as requiring actors to actually experience the emotions of their characters; Stanislavski's own writing emphasises craft and technique rather than uncontrolled emotional experience. Brecht's Verfremdungseffekt is often misunderstood as 'alienating the audience so they don't feel anything'; the concept is more nuanced — it aims to prevent automatic emotional identification so that critical thinking can occur alongside emotional response.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "teaching_weight": 5,
      "co_teach_hints": []
    },
    {
      "concept_id": "DR-KS4-C005",
      "domain_id": "DR-KS4-D004",
      "concept_name": "Critical Analysis and Evaluation of Theatre",
      "description": "Critical analysis and evaluation of theatre involves the systematic examination of theatrical work — performances, productions, design choices and directorial interpretations — using appropriate analytical frameworks and accurate theatrical terminology, and the making of substantiated evaluative judgements about the effectiveness of theatrical choices in communicating meaning to audiences. At GCSE, this skill is assessed primarily through written responses, both to live and recorded theatre seen as part of the course and to scripted extracts in examination conditions. The ability to move from specific observed detail to generalised analytical insight is the central challenge.",
      "teaching_guidance": "Teach a systematic framework for theatrical analysis: performers (physical skills, vocal skills, characterisation, ensemble relationships); design elements (set, lighting, sound, costume); direction (staging, pace, tension, use of space); overall interpretation and communication of the playwright's or devisers' intentions. Practise writing analytical responses to short recordings of theatre before tackling longer extended written tasks. Develop the habit of specific evidence: every analytical claim should be supported by a specific, detailed example from what was seen. Practise the evaluative dimension: having described and analysed a choice, assess how effective it was and why. For examination preparation, practise writing to time constraints while maintaining analytical depth.",
      "key_vocabulary": "analyse, evaluate, interpret, effect, intention, communicate, audience, impact, staging, characterisation, direction, design, justify, specific, evidence",
      "common_misconceptions": "The most common weakness in theatrical analysis is the absence of specific evidence: pupils make general claims ('the acting was good') without supporting them with specific observed detail. Teaching the discipline of specificity — every claim needs an example — is the single most effective intervention. Pupils frequently describe what they saw rather than analysing how it worked or why it was effective; developing the analytical habit of always asking 'how?' and 'why?' after 'what?' builds more sophisticated responses. Evaluation (making judgements about effectiveness) is often conflated with personal preference; teaching the distinction between 'I liked' and 'this was effective because' develops more objective evaluative writing.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "teaching_weight": 4,
      "co_teach_hints": []
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "DR-KS4-C002",
      "dependent_concept": "DR-KS4-C001",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.75,
      "rationale": "Understanding dramatic form and genre provides the frameworks within which physical and vocal characterisation choices are made: characterisation techniques differ fundamentally between naturalistic and stylised forms."
    },
    {
      "prerequisite_concept": "DR-KS4-C004",
      "dependent_concept": "DR-KS4-C005",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.85,
      "rationale": "Knowledge of theatre practitioners and their methodologies provides the analytical frameworks through which theatre can be critically evaluated: understanding Brechtian or Stanislavskian approaches enables more specific and informed analysis."
    },
    {
      "prerequisite_concept": "DR-KS4-C003",
      "dependent_concept": "DR-KS4-C005",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.8,
      "rationale": "Understanding theatre design elements is prerequisite to critically analysing them in written evaluations of live or recorded theatre: vocabulary and conceptual understanding of design must precede analytical application."
    },
    {
      "prerequisite_concept": "DR-KS4-C001",
      "dependent_concept": "DR-KS4-C005",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.7,
      "rationale": "Understanding physical and vocal performance skills from a practitioner's perspective enables more precise and technically grounded analysis of observed performers, moving beyond superficial description to informed evaluation."
    },
    {
      "prerequisite_concept": "DR-KS4-C002",
      "dependent_concept": "DR-KS4-C004",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.7,
      "rationale": "Understanding dramatic form and genre provides the conceptual foundation on which practitioner methodologies can be understood: Brecht's epic theatre and Stanislavski's naturalism are both responses to prior theatrical forms."
    },
    {
      "prerequisite_concept": "DR-KS4-C004",
      "dependent_concept": "DR-KS4-C001",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.65,
      "rationale": "Knowledge of practitioner techniques enriches physical and vocal characterisation by providing specific methodological approaches (Stanislavski's given circumstances, Brechtian gestus) that can be consciously applied in performance."
    }
  ]
}
