{
  "metadata": {
    "subject": "English Literature",
    "key_stage": "KS4",
    "years_covered": [10, 11],
    "document_reference": "DFE-00231-2013",
    "extraction_date": "2026-02-21",
    "structure_rating": 8,
    "notes": "Based on DfE GCSE English Literature Subject Content and Assessment Objectives (2013/2014). Assessment objectives: AO1 (read, understand and respond to texts — maintain critical style, develop informed personal response, use textual references including quotations to support interpretations), AO2 (analyse the language, form and structure used by a writer to create meanings and effects, using relevant subject terminology), AO3 (show understanding of the relationships between texts and the contexts in which they were written), AO4 (use a range of vocabulary and sentence structures for clarity, purpose and effect, with accurate spelling and punctuation). Minimum text requirement: 6 texts, at least 3 from the English/Welsh/Irish literary heritage. Must include Shakespeare play. Must include 19th-century fiction or drama. Poetry anthology minimum 15 poems by at least 5 different poets, minimum 300 lines. Closed book exams — students must memorise quotations."
  },
  "domains": [
    {
      "domain_id": "ELT-KS4-D001",
      "domain_name": "Shakespeare",
      "description": "Study of a complete Shakespeare play in depth, developing analytical reading of dramatic text, language, character, themes and context. Students must demonstrate understanding of how Shakespeare uses language, form and structure to create meaning in the context of Elizabethan and Jacobean drama.",
      "curriculum_context": "The study of Shakespeare is a statutory requirement of GCSE English Literature. Students must study a complete Shakespeare play and be assessed on it in a closed-book examination. The DfE subject content requires students to show understanding of the relationships between the text and the context in which it was written (AO3), including the conventions of Elizabethan theatre, the social and political world Shakespeare inhabited, and how his use of soliloquy, blank verse, prose and dramatic irony creates specific theatrical effects. Students are assessed across AO1 (informed personal response with textual evidence), AO2 (language, form and structure analysis) and AO3 (historical and cultural context). Examination questions typically ask students to respond to an extract and then consider the play as a whole, encouraging both close reading and wider understanding of the text's themes and dramatic impact. Because examinations are closed book, students must develop strategies for memorising and deploying quotations accurately.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "ELT-KS4-D002",
      "domain_name": "19th-Century Fiction and Drama",
      "description": "Study of a prose fiction text or drama published between 1789 and 1914, developing understanding of Victorian and early 20th-century literary conventions, social and historical contexts, narrative technique, characterisation and theme. Students must read the complete text and be able to analyse it in a closed-book examination.",
      "curriculum_context": "The statutory inclusion of a 19th-century text ensures students engage with a period of English literature that is markedly different in style, vocabulary and social context from contemporary writing. The DfE subject content requires students to demonstrate understanding of the relationships between 19th-century texts and the social, cultural and historical contexts in which they were written (AO3), including the conditions of industrialisation, class society, empire, gender relations and the conventions of realist fiction and melodrama. Students must be able to analyse how novelists and playwrights of the period construct narrative, create character through dialogue and description, and use the conventions of their genre — Gothic, sensation fiction, social realism, the bildungsroman — to achieve specific effects on a reader. The closed-book examination tests retention of knowledge of the whole text alongside the ability to close-read an extract. Students who understand the social and moral concerns of the Victorian period are better equipped to contextualise specific language choices.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "ELT-KS4-D003",
      "domain_name": "Modern Texts — Fiction and Drama",
      "description": "Study of modern prose fiction or drama from the 20th or 21st century, examining how contemporary and recent writers construct character, theme, narrative or dramatic structure, and how their work reflects the social and political contexts of the period. Students engage with at least one text written post-1914.",
      "curriculum_context": "Modern texts allow students to engage with literature that reflects familiar or recent social realities — including post-colonial perspectives, working-class experience, war, domestic life and personal identity. The DfE subject content requires students to study texts that are of sufficient literary quality to enable analysis of language, form and structure (AO2). Modern fiction and drama are studied in relation to their social and cultural contexts (AO3), encouraging students to consider how specific historical moments — the Second World War, decolonisation, social change in the late 20th century — shape the concerns and techniques of writers. Drama texts require additional understanding of theatrical convention, stagecraft, stage directions and the relationship between text and performance. Students must demonstrate the ability to develop an informed and personal literary response (AO1) while reading texts written with a greater variety of narrative voice, free indirect discourse and postmodern technique than the more conventionally structured texts of the 19th century.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "ELT-KS4-D004",
      "domain_name": "Poetry — Anthology and Unseen",
      "description": "Study of a curated anthology of 15 or more poems by at least five different poets, plus the ability to analyse unseen poems encountered for the first time in the examination. Students develop skills in close reading of poetic form, voice, imagery and meaning, and in comparing poems thematically and technically.",
      "curriculum_context": "Poetry is assessed in two ways in GCSE English Literature: through a studied anthology (where comparison of two poems is required in the examination) and through an unseen poem (where students demonstrate transferable analytical skills). The DfE subject content requires the anthology to contain a minimum of 15 poems by at least five different poets, totalling at least 300 lines. Examination boards curate anthologies around thematic clusters — such as power and conflict, love and relationships, or identity — and students must compare poems across and within these clusters. The skills required for poetry analysis (AO2 — language, form and structure) are highly specific: students must understand metre, rhyme scheme, stanza form, enjambment, caesura, voice and tone, and be able to explain how formal choices create specific effects. Unseen poetry assessment requires students to apply these skills to an unfamiliar poem within a timed examination, demonstrating independence and transferability of analytical technique. This makes poetry one of the most intellectually demanding domains of the GCSE.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    }
  ],
  "objectives": [
    {
      "objective_id": "ELT-KS4-O001",
      "domain_id": "ELT-KS4-D001",
      "objective_text": "Read, understand and respond to a Shakespeare play, maintaining a critical style and developing an informed personal response supported by textual evidence including quotation.",
      "non_statutory_guidance": "AO1 — students must demonstrate more than retelling of plot; responses must be analytical and substantiated with evidence.",
      "examples": "Tragedies: Macbeth, Romeo and Juliet, Hamlet, Othello. Comedies: A Midsummer Night's Dream, Much Ado About Nothing, The Merchant of Venice. Histories: Henry V, Richard III.",
      "is_statutory": true
    },
    {
      "objective_id": "ELT-KS4-O002",
      "domain_id": "ELT-KS4-D001",
      "objective_text": "Analyse the language, form and structure Shakespeare uses to create meaning and effects, using relevant subject terminology including dramatic and poetic conventions.",
      "non_statutory_guidance": "AO2 — students should comment on specific lexical choices, the function of blank verse versus prose, the use of soliloquy, dramatic irony, and structural choices at act and scene level.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "ELT-KS4-O003",
      "domain_id": "ELT-KS4-D001",
      "objective_text": "Show understanding of the relationship between the Shakespeare play studied and the social, historical and theatrical contexts in which it was written and first performed.",
      "non_statutory_guidance": "AO3 — context should be used to illuminate the text, not substituted for analysis. Over-contextualisation without textual evidence does not score marks.",
      "examples": "Jacobean attitudes to witchcraft and kingship (Macbeth); Elizabethan conventions of romantic comedy; the role of soliloquy in the theatre of the period.",
      "is_statutory": true
    },
    {
      "objective_id": "ELT-KS4-O004",
      "domain_id": "ELT-KS4-D001",
      "objective_text": "Write in a critical, analytical style about Shakespeare, using a range of vocabulary and accurate spelling and punctuation to support clear and effective literary argument.",
      "non_statutory_guidance": "AO4 — writing quality is assessed in all Literature responses. Students must write in continuous prose, not bullet points or note form.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "ELT-KS4-O005",
      "domain_id": "ELT-KS4-D001",
      "objective_text": "Analyse Shakespeare's characterisation, demonstrating understanding of how characters are constructed through dialogue, action, other characters' responses and dramatic function within the play.",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "ELT-KS4-O006",
      "domain_id": "ELT-KS4-D001",
      "objective_text": "Explore key themes across the whole Shakespeare play studied, identifying how themes are developed across acts, connecting specific textual moments to overarching thematic concerns.",
      "non_statutory_guidance": null,
      "examples": "Themes: power, ambition, jealousy, love, gender, betrayal, appearance versus reality, justice, fate, identity.",
      "is_statutory": true
    },
    {
      "objective_id": "ELT-KS4-O007",
      "domain_id": "ELT-KS4-D002",
      "objective_text": "Read, understand and respond to a complete 19th-century prose fiction or drama text, developing an informed and critical personal response with detailed textual support.",
      "non_statutory_guidance": "AO1 — students must read the whole text, not selected extracts, and demonstrate knowledge of the complete narrative arc.",
      "examples": "Prose: A Christmas Carol (Dickens), Great Expectations (Dickens), Jane Eyre (Bronte), The Strange Case of Dr Jekyll and Mr Hyde (Stevenson), Frankenstein (Shelley), Pride and Prejudice (Austen). Drama: An Inspector Calls (Priestley — 1945 but widely taught as 19th century in context).",
      "is_statutory": true
    },
    {
      "objective_id": "ELT-KS4-O008",
      "domain_id": "ELT-KS4-D002",
      "objective_text": "Analyse how writers of the 19th century use language, narrative technique, characterisation and structure to create meaning and achieve effects on a reader.",
      "non_statutory_guidance": "AO2 — includes analysis of narrative voice (first person, third person omniscient, free indirect discourse), sentence structures, use of symbolism, descriptive technique.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "ELT-KS4-O009",
      "domain_id": "ELT-KS4-D002",
      "objective_text": "Show understanding of the relationships between 19th-century texts and the social, historical and cultural contexts in which they were written, including relevant literary movements and genres.",
      "non_statutory_guidance": "AO3 — students should understand how Victorian social conditions, class structures, attitudes to gender and empire shape the concerns and techniques of 19th-century writers.",
      "examples": "Industrialisation and poverty (Dickens); Gothic conventions and the Victorian anxiety about science (Stevenson, Shelley); class and marriage (Austen, Bronte); social reform movements.",
      "is_statutory": true
    },
    {
      "objective_id": "ELT-KS4-O010",
      "domain_id": "ELT-KS4-D002",
      "objective_text": "Explore how 19th-century writers construct character through narrative technique, including the use of narrative voice, dialogue, action, and other characters' perspectives.",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "ELT-KS4-O011",
      "domain_id": "ELT-KS4-D003",
      "objective_text": "Read, understand and respond to a modern prose fiction or drama text, developing an informed personal response that demonstrates close reading alongside understanding of the whole text.",
      "non_statutory_guidance": "AO1 — modern texts may require students to navigate more unconventional narrative structures, unreliable narrators, or fragmented timelines.",
      "examples": "Fiction: Of Mice and Men (Steinbeck), Lord of the Flies (Golding), The Kite Runner (Hosseini), Never Let Me Go (Ishiguro). Drama: Blood Brothers (Russell), The History Boys (Bennett), A View from the Bridge (Miller).",
      "is_statutory": true
    },
    {
      "objective_id": "ELT-KS4-O012",
      "domain_id": "ELT-KS4-D003",
      "objective_text": "Analyse how modern writers use language, structure, form and dramatic or narrative technique to create meaning and effects, applying appropriate subject terminology.",
      "non_statutory_guidance": "AO2 — for drama, this includes stage directions, dramatic irony, soliloquy equivalents, monologue, set design implications, and theatrical convention.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "ELT-KS4-O013",
      "domain_id": "ELT-KS4-D003",
      "objective_text": "Show understanding of the relationships between modern texts and their social, cultural and historical contexts, including how the concerns of the period shape writers' choices of subject, character and form.",
      "non_statutory_guidance": "AO3 — relevant contexts include post-war Britain, the Great Depression, decolonisation, Cold War anxieties, social realism and political theatre movements.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "ELT-KS4-O014",
      "domain_id": "ELT-KS4-D004",
      "objective_text": "Read, understand and respond to a selection of poems from a taught anthology, developing an informed critical response that demonstrates close reading and the ability to compare poems.",
      "non_statutory_guidance": "AO1 — students must develop a personal, critical response to individual poems and demonstrate the ability to compare two poems from the anthology in a comparative essay.",
      "examples": "AQA anthology clusters: Power and Conflict; Love and Relationships. Students must compare a named poem with one of their own choice from the cluster.",
      "is_statutory": true
    },
    {
      "objective_id": "ELT-KS4-O015",
      "domain_id": "ELT-KS4-D004",
      "objective_text": "Analyse how poets use language, form, structure and poetic convention to create meaning and effects, using subject terminology including terms for metre, rhyme, voice, stanza form and figurative language.",
      "non_statutory_guidance": "AO2 — students must go beyond identifying features to explaining the effect of specific choices, including the relationship between formal features (enjambment, caesura) and meaning.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "ELT-KS4-O016",
      "domain_id": "ELT-KS4-D004",
      "objective_text": "Compare two poems from the studied anthology, evaluating similarities and differences in theme, perspective, language and form, and developing a coherent comparative argument.",
      "non_statutory_guidance": "AO1 and AO2 — comparison should integrate both what poems say (theme, attitude, perspective) and how they say it (language, structure, form). Students should not discuss poems in isolation.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "ELT-KS4-O017",
      "domain_id": "ELT-KS4-D004",
      "objective_text": "Analyse an unseen poem encountered for the first time in the examination, applying transferable analytical skills to language, form, structure and meaning without prior preparation.",
      "non_statutory_guidance": "AO1 and AO2 — unseen poetry assessment tests independence. Students must demonstrate that analytical skills are not text-specific. A second unseen poem may require comparison in some specifications.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "ELT-KS4-O018",
      "domain_id": "ELT-KS4-D004",
      "objective_text": "Show understanding of how poems relate to their social, cultural and historical contexts and how these contexts shape the poet's perspective and choices.",
      "non_statutory_guidance": "AO3 — contextual knowledge enriches poetry analysis but should always be tied to specific textual evidence. Students who include context without textual support will not gain marks.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "ELT-KS4-O019",
      "domain_id": "ELT-KS4-D001",
      "objective_text": "Demonstrate whole-text knowledge of the Shakespeare play studied, connecting specific moments and quotations to broader thematic and structural concerns across the full work.",
      "non_statutory_guidance": "Questions in the closed-book examination require students to write about both an extract and the wider play. Quotations must be memorised.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "ELT-KS4-O020",
      "domain_id": "ELT-KS4-D002",
      "objective_text": "Demonstrate whole-text knowledge of the 19th-century text studied, selecting relevant evidence from across the full work and connecting textual moments to the overall narrative arc and thematic development.",
      "non_statutory_guidance": "Closed-book examination — students must have memorised sufficient quotations from across the text to support analysis of whole-text questions.",
      "examples": null,
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "ELT-KS4-C001",
      "domain_id": "ELT-KS4-D001",
      "concept_name": "Shakespearean Dramatic Conventions",
      "description": "The theatrical conventions of Elizabethan and Jacobean drama that Shakespeare employs: blank verse (unrhymed iambic pentameter) versus prose, soliloquy, the aside, dramatic irony, the five-act structure, the role of the chorus, disguise and mistaken identity. Students must understand how these conventions create specific theatrical effects.",
      "teaching_guidance": "AO2 responses to Shakespeare must engage with form as well as language. Teach students to identify when Shakespeare shifts between verse and prose (prose typically signals lower-class characters, heightened emotion, or madness) and why. Soliloquy analysis should consider what it reveals (inner life, true motive) versus what is concealed from other characters (dramatic irony). The five-act structure provides a framework for understanding dramatic pace — Acts 3 and 4 typically contain the crisis and turning point. Students should be able to explain how a specific formal or structural choice creates a specific effect on the audience. Examination command words: 'explore', 'analyse', 'how does Shakespeare present'.",
      "key_vocabulary": "blank verse, iambic pentameter, prose, soliloquy, aside, dramatic irony, five-act structure, prologue, chorus, tragedy, comedy, history, protagonist, antagonist, tragic flaw, hubris, catharsis, stagecraft",
      "common_misconceptions": "Students often describe what a character does or says without analysing how Shakespeare constructs that character through specific language and dramatic choices. Students frequently write about Shakespeare's characters as real people rather than dramatic constructions. Many students ignore the theatrical context, writing literary analyses that do not consider the effect on an audience in a theatre.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "ELT-KS4-C002",
      "domain_id": "ELT-KS4-D001",
      "concept_name": "Shakespearean Language Analysis",
      "description": "Close analysis of Shakespeare's lexical, syntactic and figurative choices, including his use of imagery (particularly extended metaphors and metaphorical clusters), puns, wordplay, rhetorical structures, inverted syntax, archaisms, and the semantic range of Early Modern English vocabulary.",
      "teaching_guidance": "Teach students to treat Shakespeare's language as highly wrought and deliberate. Every word choice and syntactic inversion carries significance. Encourage students to consider multiple layers of meaning — puns often operate on literal, sexual and metaphorical levels simultaneously. Students should identify key image clusters (for example, light and dark in Romeo and Juliet; blood and water in Macbeth; appearance and reality in Much Ado) and trace these across the whole play. Archaisms ('thee', 'thou', 'dost', 'hath') should not be treated as barriers but as opportunities to consider register, social distance and intimacy. AO2 high-grade responses zoom into one or two words and explore their range of effects rather than surveying many features superficially.",
      "key_vocabulary": "imagery, metaphor, extended metaphor, motif, pun, wordplay, rhetorical question, antithesis, oxymoron, personification, apostrophe, alliteration, assonance, archaism, register, connotation, semantic field, syntactic inversion",
      "common_misconceptions": "Students frequently identify a metaphor without explaining its effect or linking it to theme. Students often pick obvious or frequently quoted lines rather than engaging with less familiar but equally revealing moments. Many students misread Early Modern English syntax as error rather than deliberate grammatical choice.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "ELT-KS4-C003",
      "domain_id": "ELT-KS4-D001",
      "concept_name": "Elizabethan and Jacobean Context",
      "description": "The social, political, religious and theatrical contexts that shaped Shakespeare's plays: the Elizabethan world picture (Great Chain of Being), attitudes to gender, kingship, witchcraft, race and class, the construction of the public playhouse, the role of patronage, and the political sensitivities of staging histories and tragedies.",
      "teaching_guidance": "AO3 context is worth marks only when it directly illuminates a textual choice. Teach students the 'sandwich' technique: make a language point (AO2), embed context that explains why that choice resonates in its historical moment (AO3), return to the text and effect. Avoid 'bolt-on' context paragraphs that narrate historical facts without connecting them to specific language choices. Key contextual ideas: the Divine Right of Kings (Macbeth, Richard III); Elizabethan attitudes to witches and the supernatural; Elizabethan gender roles and the boy actor convention; attitudes to race and Otherness (Othello, The Merchant of Venice). Context should be specific, not vague: not 'in the Elizabethan era, women had few rights' but 'Shakespeare's original audience would have expected...'",
      "key_vocabulary": "Elizabethan, Jacobean, Great Chain of Being, Divine Right of Kings, patriarchy, witchcraft, superstition, the Globe Theatre, patronage, humours, religious context, political allegory",
      "common_misconceptions": "Students frequently include contextual information as a separate paragraph that does not connect to specific textual evidence. Students may oversimplify complex historical attitudes — not all Elizabethans held identical views. Some students confuse Elizabethan with Jacobean contexts, applying the wrong historical moment to a specific play.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "ELT-KS4-C004",
      "domain_id": "ELT-KS4-D002",
      "concept_name": "Victorian Narrative Fiction — Genre and Form",
      "description": "The conventions of 19th-century prose fiction genres including the realist novel, the Gothic novel, the sensation novel, the bildungsroman and the novella. Students must understand how genre conventions shape readers' expectations and how specific writers work within, extend or subvert those conventions.",
      "teaching_guidance": "Understanding genre convention allows students to make sophisticated AO2 and AO3 points. Realist fiction creates verisimilitude through detailed social observation, psychological characterisation and plausible causal narrative — students can then analyse when a specific moment departs from realism and why. Gothic fiction employs darkness, the uncanny, physical setting as psychological externalisation, doubles and transgression — understanding this allows analysis of specific Gothic effects. The bildungsroman tracks a protagonist's moral and social development — students should trace the arc of change across the whole text. The novella form (A Christmas Carol, Jekyll and Hyde) makes structural analysis possible even in examination: its compactness means that opening and ending can be compared in a single response.",
      "key_vocabulary": "realism, Gothic, bildungsroman, novella, sensation fiction, social realism, melodrama, narrative voice, first-person narrator, third-person omniscient, free indirect discourse, verisimilitude, characterisation, setting, atmosphere",
      "common_misconceptions": "Students often describe narrative events without analysing the narrative technique through which they are presented. Students may not distinguish between the author, the narrator and the character, leading to confused analysis. Some students treat Gothic elements as simply 'spooky' without understanding their function within the ideological concerns of the period.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "ELT-KS4-C005",
      "domain_id": "ELT-KS4-D002",
      "concept_name": "Victorian Social and Historical Context",
      "description": "The social, economic and historical conditions of the Victorian era that shape 19th-century literary texts: industrialisation, poverty, class stratification, the role of women, the British Empire, religious doubt, the rise of science, the workhouse, child labour, philanthropy and social reform movements.",
      "teaching_guidance": "Victorian contextual knowledge dramatically enriches AO3 responses. Teach students to understand the specific concerns of the text's moment: Dickens in the 1840s is responding to the New Poor Law and the conditions of industrial Manchester; Stevenson in 1886 is responding to anxieties about evolution, degeneration theory and respectable hypocrisy. Students should be able to explain how a specific narrative choice — a character's fate, the use of a particular setting — reflects or challenges Victorian social attitudes. Good AO3 responses show how the writer both reflects their context and shapes it — writers like Dickens and Bronte were agents of social change, not just mirrors of their time.",
      "key_vocabulary": "Victorian, industrialisation, class, poverty, workhouse, Empire, patriarchy, philanthropy, social reform, Gothic anxiety, scientific rationalism, religious doubt, degeneration, respectability, hypocrisy",
      "common_misconceptions": "Students frequently confuse Victorian social conditions with the views of specific characters — a character may express views the author challenges. Students sometimes treat all Victorian literature as sharing identical concerns, not distinguishing between early, mid and late Victorian periods. Some students include historical context as a first paragraph rather than weaving it into textual analysis.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "ELT-KS4-C006",
      "domain_id": "ELT-KS4-D002",
      "concept_name": "Characterisation and Narrative Voice",
      "description": "How writers construct character through multiple techniques: physical description, dialogue, action, the responses of other characters, narrative commentary, and the reliability or unreliability of the narrative voice. Students must distinguish between the author's implied values and those of the characters and narrator.",
      "teaching_guidance": "AO2 characterisation analysis should focus on construction rather than description. Teach students to ask: how does the writer present X, not just what is X like? Useful analytical frames: what does X say, do, think, and how do others respond to them? Students should note how writers control sympathy — a narrator may invite sympathy for an apparently unsympathetic character, or undercut a superficially admirable one. Free indirect discourse (Austen, Bronte) blends narrator and character voice — students should understand when this occurs and what effect it creates. Unreliable narrators (Pip in Great Expectations) require students to read critically: what does the narrator fail to see about themselves?",
      "key_vocabulary": "characterisation, protagonist, antagonist, foil, narrative voice, first person, third person, omniscient narrator, free indirect discourse, unreliable narrator, dialogue, action, dramatic irony, sympathy, empathy, implicit characterisation, explicit characterisation",
      "common_misconceptions": "Students frequently treat characters as real people and comment on what they 'would have done' rather than analysing the writer's choices. Students often discuss only explicit characterisation (direct description) without noticing how dialogue and action imply character. Many students confuse the narrator with the author, attributing narrator values directly to the author without acknowledging narrative distance.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": true
    },
    {
      "concept_id": "ELT-KS4-C007",
      "domain_id": "ELT-KS4-D003",
      "concept_name": "Modern Drama — Theatrical Technique and Stagecraft",
      "description": "How modern playwrights use dramatic technique — stage directions, dialogue, dramatic irony, monologue, staging, symbol and set — to create meaning and effect. Students must understand the relationship between written dramatic text and theatrical performance, and how different production choices affect interpretation.",
      "teaching_guidance": "AO2 responses to modern drama must engage with theatrical as well as literary techniques. Teach students to treat stage directions as significant meaning-making choices: an expressionist set design signals something about the playwright's intentions that differs from a naturalist one. Dramatic irony in modern drama often operates as social or political critique — the audience knows something the character refuses to acknowledge. Teach students how Miller, Priestly and Russell use the form of well-made play, drawing room drama or musical theatre to create specific expectations and then subvert them. Questions about drama should always consider the effect on an audience, not just a reader.",
      "key_vocabulary": "stage directions, stagecraft, dramatic irony, soliloquy, monologue, aside, naturalism, expressionism, set design, symbolism, tragic hero, social realism, political theatre, theatre of the absurd, tension, climax, denouement",
      "common_misconceptions": "Students often analyse modern drama as if it were prose fiction, ignoring theatrical conventions and the relationship between text and performance. Students may treat stage directions as stage management instructions rather than as deliberate authorial choices that carry meaning. Some students fail to consider the effect of theatrical decisions on an audience, writing only about the reader.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "ELT-KS4-C008",
      "domain_id": "ELT-KS4-D003",
      "concept_name": "Modern Fiction — Narrative Technique",
      "description": "How modern prose fiction writers use narrative technique — including unreliable narration, multiple perspectives, non-linear structure, stream of consciousness, free indirect discourse, and shifts in time, place and point of view — to create specific effects on a reader and to reflect the complexity of modern experience.",
      "teaching_guidance": "AO2 analysis of modern fiction should engage with narrative form rather than treating prose as a neutral vehicle for story. Teach students to identify the narrative perspective (who tells the story, what they know and do not know, what they may conceal or distort) and to analyse how this shapes the reader's experience. Non-linear narrative creates retrospection, dramatic irony and thematic echoing — students should explain why a writer chooses to arrange events non-chronologically rather than simply noting that they do so. Stream of consciousness and interior monologue allow direct access to a character's mind, with implications for how readers are positioned relative to that character.",
      "key_vocabulary": "narrative voice, perspective, first person, third person, omniscient, unreliable narrator, non-linear narrative, stream of consciousness, free indirect discourse, interior monologue, retrospection, foreshadowing, prolepsis, analepsis, frame narrative",
      "common_misconceptions": "Students frequently retell plot rather than analysing narrative technique. Students may not recognise an unreliable narrator, accepting the narrator's perspective at face value. Some students treat non-linear narrative as a quirk of form without analysing its thematic or emotional function.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "ELT-KS4-C009",
      "domain_id": "ELT-KS4-D004",
      "concept_name": "Poetic Form and Structure",
      "description": "The formal elements of poetry including stanza form, rhyme scheme, metre (particularly iambic pentameter and common metre), free verse, the sonnet, the dramatic monologue, the elegy, the ode, enjambment and caesura. Students must understand how formal choices create or reinforce meaning.",
      "teaching_guidance": "AO2 in poetry is heavily weighted and includes form and structure as well as language. Teach students to always begin their analysis of a poem by noticing its form: how many stanzas, is there a rhyme scheme, is the metre regular or disrupted? These observations should generate analytical questions: why does the poet use regular rhyme here — does it create control or tension? Why does the enjambment break the expected pause — what idea spills over? A disrupted metrical foot (a stressed syllable where a weak one is expected) can carry enormous analytical weight. Teach students that form is meaning: free verse signals freedom, chaos or informality; the sonnet conventionally addresses love but can be subverted; the dramatic monologue positions the reader uncomfortably inside a specific consciousness.",
      "key_vocabulary": "stanza, quatrain, tercet, couplet, sonnet, volta, octave, sestet, iambic pentameter, free verse, dramatic monologue, elegy, ode, ballad, rhyme scheme, metre, enjambment, caesura, end-stopped line, rhythm, refrain",
      "common_misconceptions": "Students frequently identify rhyme scheme without commenting on its effect. Students may describe enjambment as 'flowing' without explaining what the run-on creates in terms of urgency, breathlessness or syntactic ambiguity. Many students confuse metre with rhythm — metre is the abstract pattern, rhythm is how it is realised in reading.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "ELT-KS4-C010",
      "domain_id": "ELT-KS4-D004",
      "concept_name": "Poetic Voice and Perspective",
      "description": "Understanding who speaks in a poem — the poetic speaker or persona — and how the poet constructs a voice through pronoun choice, register, tone and the implied audience of the address. Students must distinguish between the poet and the speaker, particularly in dramatic monologues.",
      "teaching_guidance": "Teach students not to assume the speaker and the poet are the same — the dramatic monologue deliberately creates a persona that may be unreliable, morally compromised or dramatically ironic. Even in apparently personal lyric poetry, the speaker is a constructed voice, not a direct expression of the poet's private self. Students should analyse how the choice of 'I' versus 'we' versus 'you' positions the reader, how register (formal, colloquial, aggressive, tender) constructs the speaker's attitude, and how tone shifts across a poem might signal a change in the speaker's understanding. Poems that address a 'you' may create intimacy or accusation — students should consider who this implied interlocutor is and what relationship the speaker seeks to establish.",
      "key_vocabulary": "speaker, persona, poetic voice, dramatic monologue, lyric, first person, address, tone, register, irony, unreliable speaker, implied audience, interlocutor, attitude, shift, apostrophe",
      "common_misconceptions": "Students frequently refer to the poet as the speaker: 'the poet feels...' rather than 'the speaker conveys...'. Students may not recognise the ironic distance between poet and persona in dramatic monologues. Some students identify tone as a single quality throughout a poem, missing shifts in attitude that are often the poem's central movement.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "ELT-KS4-C011",
      "domain_id": "ELT-KS4-D004",
      "concept_name": "Poetic Imagery and Figurative Language",
      "description": "The use of images — primarily through metaphor, simile, personification, synecdoche, symbol and extended metaphor — to create meaning, evoke sensory experience, and express ideas that resist direct statement. Students must analyse specific images with precision, exploring denotation, connotation and the semantic fields they activate.",
      "teaching_guidance": "AO2 responses to poetry must demonstrate precise, detailed analysis of specific images. Teach the 'zoom in' method: choose one image and analyse it exhaustively rather than listing multiple features. Students should explore: literal meaning, connotations, what associations the image activates, why this image rather than another, what the image implies about theme or speaker attitude. Extended metaphors or conceits (where one comparison is sustained across a poem) should be tracked across the whole poem. Teach students to consider the interaction between images — do images form a semantic cluster? Do late images resolve or subvert early ones?",
      "key_vocabulary": "metaphor, simile, personification, extended metaphor, conceit, symbol, synecdoche, metonymy, imagery, sensory language, visual, auditory, tactile, olfactory, semantic field, connotation, denotation, figurative, literal",
      "common_misconceptions": "Students name figurative devices without explaining their specific effect: 'the poet uses a metaphor' rather than 'the metaphor of X creates an impression of Y'. Students may comment on every image superficially rather than selecting one or two for deep analysis. Some students treat all comparisons as metaphors, not distinguishing explicit (simile) from implicit (metaphor) comparisons.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "ELT-KS4-C012",
      "domain_id": "ELT-KS4-D004",
      "concept_name": "Comparative Poetry Analysis",
      "description": "The ability to compare two poems from a studied anthology, developing a coherent comparative argument that addresses theme, perspective, language and form simultaneously. Comparative analysis must be genuinely integrated, not sequential.",
      "teaching_guidance": "The anthology comparison question (AO1, AO2) is typically worth the most marks in the poetry section. Teach students to plan their comparison before writing: identify a clear point of similarity or difference, gather evidence from both poems, and consider how form reinforces the difference in approach. Students should use comparative discourse markers fluently and naturally throughout: 'In contrast to...', 'Both poets...', 'While X achieves X through..., Y uses a different approach...'. Teach students to compare at the level of method (how each poet treats the theme), not just content (what each poem is about). High-grade responses identify unexpected or nuanced comparisons rather than obvious surface similarities.",
      "key_vocabulary": "compare, contrast, similarly, whereas, conversely, both, while, in contrast, by comparison, theme, perspective, method, technique, form, structure, effect, attitude, tone, imagery, voice",
      "common_misconceptions": "Students write two separate mini-essays rather than an integrated comparison. Students compare only content (themes, what the poem is about) without comparing methods (form, language, structure). Students may produce unbalanced comparisons, spending 80% of their response on one poem.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "ELT-KS4-C013",
      "domain_id": "ELT-KS4-D004",
      "concept_name": "Unseen Poetry Analysis",
      "description": "The ability to analyse an unfamiliar poem encountered for the first time in the examination, applying transferable analytical skills independently. Students must demonstrate the ability to read and respond to any poem, using knowledge of form, structure, voice and imagery without prior preparation.",
      "teaching_guidance": "Unseen poetry assesses transferable skill rather than content knowledge. Teach students a systematic approach to any poem: first reading for overall impression and meaning; second reading for voice and speaker; third reading for form and structure; fourth reading for specific language choices. Teach students to trust their response — a genuine reader reaction ('this poem makes me feel unsettled because...') is a valid AO1 starting point, and the job of AO2 is to explain how that effect is achieved. Students should practise unseen analysis regularly throughout the course, building confidence with unfamiliar texts. Encourage students to annotate during reading time and to write from annotation rather than from memory.",
      "key_vocabulary": "unseen, transferable skills, close reading, annotation, first impression, sustained response, inference, contextual reading, tone, atmosphere, structure, imagery, voice, effect",
      "common_misconceptions": "Students panic when they do not recognise a poem and rush to identify features without establishing meaning. Students may produce a list of identified features (device-spotting) without developing a coherent analytical argument. Some students avoid engagement with difficult or ambiguous meaning, producing a superficial paraphrase followed by brief feature identification.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "ELT-KS4-C014",
      "domain_id": "ELT-KS4-D001",
      "concept_name": "Whole-Text Knowledge and Quotation Retention",
      "description": "The ability to demonstrate detailed knowledge of a complete literary text — novel, play or poetry selection — including the ability to recall and deploy relevant quotations accurately in a closed-book examination. Whole-text knowledge supports the ability to trace development of character, theme and technique across a complete work.",
      "teaching_guidance": "All GCSE English Literature examinations are closed-book. Students must memorise sufficient quotations from across each text to support whole-text responses. Teach students to prioritise quotations that are short, precise and richly analytical — one phrase that can generate multiple analytical points is worth more than three longer, vaguer passages. Organise quotation learning by theme and character rather than chronologically through the text — students need to be able to retrieve relevant material quickly under timed conditions. Students should also develop contextual knowledge (what happens before and after a specific moment) to support analysis of an extract within its narrative or dramatic context.",
      "key_vocabulary": "whole-text, closed book, quotation, memorise, evidence, support, reference, retrieve, context, theme, character development, narrative arc, structural development",
      "common_misconceptions": "Students sometimes rely on a small number of very familiar quotations (Act 1, Scene 1 of Macbeth; the opening of A Christmas Carol) and do not draw on the full text. Students may misquote under pressure, losing the precision that AO2 analysis requires. Some students avoid quoting and instead paraphrase the text, which is accepted but less effective than precise quotation for AO2.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": true
    },
    {
      "concept_id": "ELT-KS4-C015",
      "domain_id": "ELT-KS4-D002",
      "concept_name": "Literary Critical Writing Style",
      "description": "The ability to write in a sustained, formal analytical style appropriate to literary criticism: using a critical vocabulary, sustaining a coherent argument across an extended piece of writing, embedding quotations fluently, avoiding retelling plot, and developing an informed and individual perspective on a text.",
      "teaching_guidance": "AO4 (writing quality) and AO1 (critical style, personal response) both reward sustained analytical writing. Teach students the conventions of literary criticism: write in the present tense (the author presents..., the character seems...); embed quotations syntactically rather than dropping them in; use tentative but confident evaluative language ('arguably', 'perhaps', 'this suggests'); avoid beginning responses with 'In this essay I will...' or ending with 'In conclusion, therefore...'. Students should develop a personal and critical voice — the ability to agree with a critical interpretation, challenge it or add nuance to it distinguishes the highest grades from competent analytical writing.",
      "key_vocabulary": "critical style, analytical, argument, personal response, embed, quotation, tentative, evaluative, perspective, interpretation, voice, essay, sustained, coherent, continuous prose",
      "common_misconceptions": "Students frequently retell plot rather than developing analysis: 'Then Macbeth kills Duncan, which shows...' Students may write in bullet points or use subheadings, which is not appropriate for a literary essay. Some students fail to develop a personal perspective, instead summarising critical views without committing to a position.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": true
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "ELT-KS4-C006",
      "dependent_concept": "ELT-KS4-C001",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.85,
      "rationale": "Understanding characterisation and narrative voice is prerequisite for Shakespearean dramatic conventions — students need a general framework for how writers construct character before applying it specifically to the different and more complex conventions of Renaissance drama."
    },
    {
      "prerequisite_concept": "ELT-KS4-C006",
      "dependent_concept": "ELT-KS4-C004",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.85,
      "rationale": "Victorian fiction analysis builds directly on the generalised understanding of characterisation and narrative voice — students need the analytical framework before they can apply it to the specific conventions of the 19th-century novel."
    },
    {
      "prerequisite_concept": "ELT-KS4-C006",
      "dependent_concept": "ELT-KS4-C008",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.8,
      "rationale": "Modern fiction narrative technique is an extension of the foundational understanding of narrative voice and characterisation. Understanding basic narrative positions (first person, third person omniscient) precedes analysis of more complex modern techniques (unreliable narration, non-linear structure)."
    },
    {
      "prerequisite_concept": "ELT-KS4-C011",
      "dependent_concept": "ELT-KS4-C002",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.75,
      "rationale": "Shakespearean language analysis (particularly of imagery and extended metaphor) builds on the general skill of poetic imagery and figurative language analysis. Students who can analyse metaphor in poetry can apply this skill to Shakespeare's dramatic and lyric language."
    },
    {
      "prerequisite_concept": "ELT-KS4-C009",
      "dependent_concept": "ELT-KS4-C012",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.9,
      "rationale": "Comparative poetry analysis requires secure knowledge of poetic form and structure — students cannot compare how two poets use form unless they have a clear framework for understanding what formal choices are available and what effects they typically create."
    },
    {
      "prerequisite_concept": "ELT-KS4-C010",
      "dependent_concept": "ELT-KS4-C012",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.85,
      "rationale": "Comparative poetry analysis requires secure understanding of poetic voice and speaker — students must be able to characterise the speaker's perspective in each poem before they can meaningfully compare those perspectives."
    },
    {
      "prerequisite_concept": "ELT-KS4-C011",
      "dependent_concept": "ELT-KS4-C012",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.85,
      "rationale": "Comparing poetry requires independent facility with poetic imagery and figurative language — students must be able to analyse imagery in individual poems before they can compare how two poets use imagery to address a shared theme."
    },
    {
      "prerequisite_concept": "ELT-KS4-C009",
      "dependent_concept": "ELT-KS4-C013",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.9,
      "rationale": "Unseen poetry analysis transfers skills developed through the anthology. Students must have a secure analytical framework (form, structure, voice, imagery) before they can apply it independently to an unfamiliar poem in timed conditions."
    },
    {
      "prerequisite_concept": "ELT-KS4-C010",
      "dependent_concept": "ELT-KS4-C013",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.85,
      "rationale": "Unseen poetry analysis requires secure understanding of poetic voice and speaker, as establishing who speaks and what their attitude is provides the interpretive foundation for further analytical work on any poem."
    },
    {
      "prerequisite_concept": "ELT-KS4-C015",
      "dependent_concept": "ELT-KS4-C001",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.7,
      "rationale": "Literary critical writing style underpins all examination responses across all domains. Students must develop the conventions of the critical essay form before they can demonstrate their analytical skills effectively in Shakespeare or any other domain."
    },
    {
      "prerequisite_concept": "ELT-KS4-C015",
      "dependent_concept": "ELT-KS4-C012",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.75,
      "rationale": "Comparative poetry analysis requires sustained writing in a critical analytical style. Students must control the conventions of literary essay writing before they can construct a coherent extended comparison under timed examination conditions."
    },
    {
      "prerequisite_concept": "ELT-KS4-C005",
      "dependent_concept": "ELT-KS4-C004",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.8,
      "rationale": "Victorian genre knowledge and Victorian social/historical context are mutually dependent — understanding the genre conventions of 19th-century fiction is enriched by contextual knowledge of the period's concerns, and context alone is insufficient without a framework for understanding generic form."
    },
    {
      "prerequisite_concept": "ELT-KS4-C003",
      "dependent_concept": "ELT-KS4-C002",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.7,
      "rationale": "Shakespearean language analysis is enriched by contextual knowledge — understanding why specific language choices resonate in their historical and theatrical context supports more precise and insightful AO2 analysis."
    },
    {
      "prerequisite_concept": "ELT-KS4-C014",
      "dependent_concept": "ELT-KS4-C001",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.85,
      "rationale": "Whole-text knowledge and quotation retention are prerequisites for effective Shakespeare examination responses — students cannot write convincingly about the whole play or respond to extracts without having memorised sufficient textual evidence."
    },
    {
      "prerequisite_concept": "ELT-KS4-C014",
      "dependent_concept": "ELT-KS4-C004",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.85,
      "rationale": "Effective 19th-century text responses in closed-book examinations require whole-text knowledge and memorised quotations. Students who only know the opening chapters cannot write convincingly about character development or structural choices across the whole text."
    },
    {
      "prerequisite_concept": "ELT-KS4-C007",
      "dependent_concept": "ELT-KS4-C008",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.65,
      "rationale": "Some students study both modern drama and modern fiction. Understanding theatrical technique in drama provides a complementary framework to narrative technique in fiction — both require students to analyse how the form of a text shapes its meaning."
    }
  ]
}
