{
  "metadata": {
    "subject": "Food Preparation and Nutrition",
    "key_stage": "KS4",
    "years_covered": [10, 11],
    "document_reference": "DFE-00283-2015",
    "extraction_date": "2026-02-21",
    "structure_rating": 9
  },
  "domains": [
    {
      "domain_id": "FP-KS4-D001",
      "domain_name": "Food, Nutrition and Health",
      "description": "Understanding the nutrients required for a healthy diet, their functions in the body, the consequences of nutritional deficiency or excess, and how to plan and evaluate diets for different groups across the life stages.",
      "curriculum_context": "This is the central scientific and health domain of GCSE Food Preparation and Nutrition. Pupils must develop a thorough understanding of the seven nutrient groups (carbohydrates, proteins, lipids, vitamins, minerals, fibre and water), their specific functions, the foods that provide them and the consequences of dietary imbalance. The life stages approach — recognising that nutritional requirements change from infancy through childhood, adolescence, adulthood to older age — connects nutritional knowledge to the practical planning of appropriate diets. Diet-disease relationships are explicitly required: understanding how dietary patterns contribute to or protect against conditions including cardiovascular disease, type 2 diabetes, obesity, osteoporosis, anaemia and dental decay. The ability to analyse a diet nutritionally — using percentages of reference nutrient intakes (RNIs) — connects knowledge to practical dietary assessment skills.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "FP-KS4-D002",
      "domain_name": "Food Science",
      "description": "Understanding the scientific principles underlying food preparation and cooking, including the functional properties of ingredients (proteins, fats, carbohydrates) and how heat, acid, alkali and other physical and chemical agents affect food during preparation and cooking.",
      "curriculum_context": "Food science at GCSE moves food preparation understanding beyond technique to scientific explanation: not just how to make a sauce, but why starch granules swell and burst when heated in water (gelatinisation), why egg proteins coagulate on heating (denaturation), why fat aerates when beaten (plasticity and aeration), why bread rises (fermentation and the Maillard reaction). The functional properties of major food components — proteins, fats, carbohydrates, water — determine how ingredients behave in cooking and explain both successes and failures. Understanding these principles enables cooks to adapt recipes intelligently, diagnose problems scientifically, and innovate. Food science also encompasses the physical and chemical changes associated with different cooking methods, the effect of pH on food behaviour, emulsification, and the role of raising agents.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "FP-KS4-D003",
      "domain_name": "Food Safety",
      "description": "Understanding the principles of food hygiene and safety, including the conditions required for bacterial growth, the causes and prevention of food poisoning, correct food storage and food handling procedures, and HACCP principles.",
      "curriculum_context": "Food safety is both a legal requirement for food businesses and a practical life skill for all food handlers. At GCSE, pupils must understand the science underlying food safety: the conditions (temperature, time, moisture, pH, oxygen level, nutrient availability) that support or inhibit bacterial growth; the specific bacteria responsible for common cases of food poisoning (Salmonella, Listeria, E. coli, Campylobacter, Staphylococcus aureus, Clostridium perfringens) and their characteristics; and the chain of contamination that must be broken to prevent illness. HACCP (Hazard Analysis and Critical Control Points) is the systematic approach to food safety management used in commercial food production, and pupils must understand its principles and application. Personal hygiene, cross-contamination prevention, correct storage temperatures and food labelling requirements complete the food safety curriculum.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "FP-KS4-D004",
      "domain_name": "Food Choice",
      "description": "Understanding the range of factors that influence food choice — cultural, religious, ethical, social, economic, environmental and sensory — and how these factors shape dietary patterns in individuals and populations.",
      "curriculum_context": "Food choice is inherently multi-factorial, and GCSE Food Preparation and Nutrition must address the full range of influences that shape what people eat. Cultural and religious factors determine dietary restrictions and preferences: the kashrut laws of Judaism, the halal requirements of Islam, the vegetarianism associated with many Hindu and Buddhist traditions, and the fasting practices of multiple traditions. Ethical factors include animal welfare concerns, environmental sustainability and fair trade. Economic factors shape food access, with socioeconomic inequality a significant driver of dietary inequality. Sensory factors (appearance, aroma, flavour, texture) determine what people find acceptable or attractive in food. Social factors include peer influence, food advertising and changing patterns of eating (the shift from formal family meals to snacking and eating out). The relationship between food choice and health outcomes — including the social determinants of health — places this domain in a broader public health context.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "FP-KS4-D005",
      "domain_name": "Food Provenance and Sustainability",
      "description": "Understanding where food comes from, how it is produced, and the environmental, ethical and health implications of different food production systems. Including the food supply chain, seasonal and local food, sustainability of food sources and the environmental impact of food production.",
      "curriculum_context": "Food provenance addresses the journey of food from primary production to consumer plate, including farming methods (intensive, organic, free-range), food processing and manufacturing, the global food supply chain, and the environmental and social implications of different production systems. Understanding the impact of food choices on the environment — carbon footprint of different foods and food systems, food miles, packaging waste, water use in agriculture — connects food education to environmental literacy. The sustainability of different protein sources (plant vs animal protein; cultured meat; insects) is an increasingly important area given the environmental impact of livestock farming. The food supply chain connects agriculture, processing, distribution and retail in ways that determine cost, quality, accessibility and environmental impact. Pupils must be able to evaluate food production systems against nutritional, environmental, economic and ethical criteria.",
      "is_cross_cutting": true,
      "structure_type": "knowledge"
    }
  ],
  "objectives": [
    {
      "objective_id": "FP-KS4-O001",
      "domain_id": "FP-KS4-D001",
      "objective_text": "demonstrate knowledge and understanding of the macronutrients (carbohydrates, proteins and fats/lipids) and micronutrients (vitamins and minerals), their functions, sources and reference nutrient intakes",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "FP-KS4-O002",
      "domain_id": "FP-KS4-D001",
      "objective_text": "understand the nutritional needs of different population groups across the life stages and plan appropriate diets to meet those needs",
      "non_statutory_guidance": null,
      "examples": "Infants, children, adolescents, adults, older adults, pregnant and lactating women, athletes.",
      "is_statutory": true
    },
    {
      "objective_id": "FP-KS4-O003",
      "domain_id": "FP-KS4-D001",
      "objective_text": "understand the relationship between diet and health, including the role of diet in non-communicable disease prevention and management",
      "non_statutory_guidance": null,
      "examples": "Cardiovascular disease, type 2 diabetes, obesity, osteoporosis, iron deficiency anaemia, dental decay.",
      "is_statutory": true
    },
    {
      "objective_id": "FP-KS4-O004",
      "domain_id": "FP-KS4-D002",
      "objective_text": "understand the functional properties of food components, including the effect of heat and other processes on proteins, fats, carbohydrates and other components",
      "non_statutory_guidance": null,
      "examples": "Denaturation and coagulation of proteins; gelatinisation and dextrinisation of starches; aeration, shortening and emulsification properties of fats.",
      "is_statutory": true
    },
    {
      "objective_id": "FP-KS4-O005",
      "domain_id": "FP-KS4-D002",
      "objective_text": "explain the science behind cooking methods and food processing techniques with reference to the functional properties of ingredients",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "FP-KS4-O006",
      "domain_id": "FP-KS4-D003",
      "objective_text": "understand the conditions that promote bacterial growth and the principles of food hygiene and safety, including personal hygiene and kitchen hygiene",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "FP-KS4-O007",
      "domain_id": "FP-KS4-D003",
      "objective_text": "understand the causes, symptoms and prevention of food poisoning and food-borne illness",
      "non_statutory_guidance": null,
      "examples": "Salmonella, Listeria, E. coli O157, Campylobacter, Staphylococcus aureus.",
      "is_statutory": true
    },
    {
      "objective_id": "FP-KS4-O008",
      "domain_id": "FP-KS4-D003",
      "objective_text": "understand and apply HACCP principles to identify and control food safety hazards in food preparation and production",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "FP-KS4-O009",
      "domain_id": "FP-KS4-D004",
      "objective_text": "understand the range of factors that influence food choice, including cultural, religious, ethical, economic, social and sensory factors",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "FP-KS4-O010",
      "domain_id": "FP-KS4-D004",
      "objective_text": "demonstrate knowledge of special diets associated with specific cultural, religious and ethical perspectives",
      "non_statutory_guidance": null,
      "examples": "Vegetarian, vegan, halal, kosher, Hindu dietary requirements, coeliac disease, lactose intolerance.",
      "is_statutory": true
    },
    {
      "objective_id": "FP-KS4-O011",
      "domain_id": "FP-KS4-D005",
      "objective_text": "understand where food comes from and how it is produced, including the food supply chain and different farming and food production systems",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "FP-KS4-O012",
      "domain_id": "FP-KS4-D005",
      "objective_text": "evaluate the environmental, nutritional and ethical impact of different food production systems and food choices",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "FP-KS4-C001",
      "domain_id": "FP-KS4-D001",
      "concept_name": "Macronutrients, Micronutrients and Nutritional Analysis",
      "description": "Macronutrients are the energy-providing nutrients required in large quantities: carbohydrates (4 kcal/g), proteins (4 kcal/g) and fats (9 kcal/g). Micronutrients are vitamins and minerals required in small quantities but essential for specific metabolic functions. At GCSE, pupils must understand the specific functions of each nutrient, the primary food sources, the reference nutrient intakes (RNIs) for different population groups, and the consequences of deficiency or excess. Nutritional analysis involves calculating the nutrient content of meals or diets against RNIs, evaluating whether dietary patterns meet recommendations, and making justified suggestions for improvement. The Eatwell Guide provides the UK's population-level dietary guidance, which pupils must understand and be able to apply.",
      "teaching_guidance": "Teach nutrients as systems rather than lists: develop understanding of metabolic functions (why does the body need this nutrient? What happens if it is deficient or excessive?). Develop quantitative nutritional analysis skills: practice calculating percentage of RNI met by a meal or day's diet from provided data. Use the Eatwell Guide as a framework for dietary evaluation, and develop pupils' ability to justify dietary recommendations with reference to nutrient functions and RNIs. Connect nutritional knowledge to food science: how does cooking affect the nutritional content of food? For examination responses, practise explaining diet-disease links with precise reference to specific nutrients: saturated fat and LDL cholesterol; calcium and osteoporosis; fibre and bowel health. Develop pupils' ability to plan and evaluate diets for specific groups.",
      "key_vocabulary": "macronutrient, micronutrient, carbohydrate, protein, lipid, fat, vitamin, mineral, fibre, reference nutrient intake, Eatwell Guide, deficiency, excess, metabolic function, energy density",
      "common_misconceptions": "Students often confuse fat as a food category (lipids, including saturated and unsaturated fats) with fat as an energy store in the body (adipose tissue); these are distinct concepts requiring different explanations. The idea that fat is inherently unhealthy ignores the essential roles of fat-soluble vitamins (A, D, E, K) and essential fatty acids; teaching the difference between saturated and unsaturated fats in the context of cardiovascular health corrects this. Fibre is often omitted from consideration as a dietary component; its specific functions (promoting bowel health, slowing glucose absorption, contributing to satiety) need explicit teaching.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "FP-KS4-C002",
      "domain_id": "FP-KS4-D002",
      "concept_name": "Functional Properties of Food",
      "description": "Functional properties are the physical and chemical characteristics of food components that determine how they behave during preparation, cooking and storage. Key functional properties include: protein denaturation and coagulation (the irreversible unfolding and setting of protein molecules on heating, as in egg cooking, meat cooking and cheese-making); starch gelatinisation (the absorption of water and swelling of starch granules on heating, thickening sauces and gravies); fat aeration and plasticity (the ability of solid fats to trap air bubbles and create a light, aerated structure, as in cake-making and pastry); emulsification (the stabilisation of fat-water mixtures using emulsifiers such as lecithin in egg yolk, as in mayonnaise and hollandaise); and the Maillard reaction (the browning and flavour development occurring between amino acids and reducing sugars at high temperature).",
      "teaching_guidance": "Connect each functional property to specific food preparation contexts: gelatinisation in sauce-making; denaturation in egg dishes; aeration in creamed cake mixtures; emulsification in dressings. Set experimental investigations that test the effect of varying one factor (temperature, pH, fat content) on a functional property, developing scientific method alongside food knowledge. Develop scientific vocabulary for describing functional changes: distinguish between denaturation (change in protein structure) and coagulation (solidification following denaturation). For examination questions, practise explaining the science behind a specific cooking outcome: why does bread rise? Why does mayonnaise emulsify? Why does boiling an egg produce a solid white? Connect food science to food safety: denaturation on heating is the basis of pasteurisation and cooking as pathogen control.",
      "key_vocabulary": "denaturation, coagulation, gelatinisation, dextrinisation, Maillard reaction, aeration, emulsification, plasticity, lecithin, gluten, fermentation, caramelisation, syneresis, enzymatic browning, pectin",
      "common_misconceptions": "Students often describe cooking changes without explaining the underlying science: 'the egg goes hard when cooked' rather than 'heat denatures egg proteins, which then coagulate into a solid network'. Developing the habit of scientific explanation rather than description is the key challenge. The distinction between gelatinisation (starch thickening with water) and gelation (setting of collagen-derived gelatin) is frequently confused; using precise vocabulary consistently prevents this. Students may not understand that the Maillard reaction and caramelisation, although both involve browning, are chemically distinct processes with different requirements and products.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "FP-KS4-C003",
      "domain_id": "FP-KS4-D003",
      "concept_name": "Food Microbiology and HACCP",
      "description": "Food microbiology at GCSE encompasses understanding of the microorganisms responsible for food spoilage and food-borne illness, the conditions that promote or inhibit their growth (temperature, time, water activity, pH, oxygen, nutrients), and the control measures that prevent contamination and unsafe microbial growth. The key pathogenic bacteria in food safety are Salmonella, Campylobacter, E. coli O157, Listeria monocytogenes, Staphylococcus aureus and Clostridium perfringens, each with specific foods, temperatures and risks. HACCP (Hazard Analysis and Critical Control Points) is the systematic preventive approach to food safety used in commercial food production, identifying specific hazards at each production stage and implementing control measures with defined critical control points, critical limits and monitoring procedures.",
      "teaching_guidance": "Teach bacterial growth conditions using the mnemonic FAT TOM (Food, Acidity, Time, Temperature, Oxygen, Moisture) as a systematic framework. Develop understanding of the temperature danger zone (8°C–63°C) and the role of refrigeration (below 8°C) and cooking (above 75°C for 30 seconds) in microbial control. Connect each major food-borne pathogen to its characteristic foods, risk factors and symptoms. For HACCP, practise applying the principles to a specific food production context: what are the hazards at each stage? What are the critical control points? What monitoring is required? Develop understanding of cross-contamination as a mechanism of food-borne illness: physical (equipment contamination), microbial (raw-to-cooked transfer), and chemical (cleaning product residues). For examination questions, practise explaining specific food safety measures in scientific terms rather than just listing them.",
      "key_vocabulary": "bacteria, pathogen, contamination, cross-contamination, food poisoning, temperature danger zone, HACCP, critical control point, critical limit, monitoring, Salmonella, Campylobacter, Listeria, E. coli, pasteurisation, sterilisation",
      "common_misconceptions": "Many students believe food looks and smells unsafe when it contains dangerous levels of bacteria; in fact, food contaminated with pathogens like Salmonella may show no sign of spoilage, and the most dangerous pathogens (Listeria, Campylobacter) often produce no detectable change in the food. The misconception that reheating food makes it safe regardless of previous handling is particularly dangerous; explaining that cooking kills bacteria but may not destroy heat-stable toxins (e.g. Staphylococcal enterotoxins) is essential. Students often confuse food spoilage (making food unpalatable due to organoleptic change) with food poisoning (illness caused by pathogens or their toxins); these involve different microorganisms and different risks.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "FP-KS4-C004",
      "domain_id": "FP-KS4-D004",
      "concept_name": "Sensory Evaluation and Food Choice",
      "description": "Sensory evaluation is the scientific assessment of food using the five senses: appearance (visual appeal, colour, presentation), aroma (the volatile compounds that create smell), taste (detected by taste receptors for sweet, sour, salt, bitter and umami), texture (mouthfeel, crunchiness, creaminess) and sound (the auditory dimension of eating, especially with crisp or crunchy foods). In food product development, sensory evaluation methods — including paired comparison tests, ranking tests, triangle tests, star diagram profiles and hedonic rating scales — are used to assess and compare products. Food choice is shaped by complex interactions between sensory appeal, cultural experience, habit, social context, nutritional knowledge and economic constraints.",
      "teaching_guidance": "Conduct sensory evaluation practically throughout the course: establish a vocabulary for describing sensory characteristics using structured frameworks. Develop pupils' ability to conduct and evaluate formal sensory tests: design a triangle test to assess whether a new recipe is distinguishable from an original; use a hedonic scale to assess consumer preference; create a star profile to compare two products. Connect sensory evaluation to product development: how do sensory test results guide reformulation decisions? Develop understanding of how cultural experience shapes sensory preferences: why do some flavour combinations seem natural or desirable to one culture but strange to another? For examination questions, practise evaluating the suitability of different sensory test methods for specific purposes.",
      "key_vocabulary": "sensory evaluation, appearance, aroma, taste, texture, mouthfeel, umami, hedonic scale, triangle test, star diagram, ranking test, paired comparison, palatability, flavour profile, consumer preference",
      "common_misconceptions": "Students often describe sensory characteristics vaguely ('it tasted nice') rather than using precise vocabulary; developing a technical descriptive language for each sensory dimension produces more reliable and useful evaluation data. The distinction between 'flavour' (the combined sensory experience of taste and aroma) and 'taste' (only the basic taste qualities detected by taste receptors) is frequently missed; using these terms precisely models scientific accuracy. Pupils may not understand that sensory preferences are culturally and experientially acquired rather than biologically fixed; connecting sensory science to cultural food study broadens this understanding.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "FP-KS4-C005",
      "domain_id": "FP-KS4-D005",
      "concept_name": "Sustainability of Food Sources and Food Provenance",
      "description": "Food provenance refers to the origin and production history of food — where it was grown or raised, how it was produced, processed and transported, and by whom. Provenance affects food quality (locally grown seasonal produce may be fresher and more nutritious), environmental impact (food miles, greenhouse gas emissions from livestock, water use in irrigation), social justice (fair pay and working conditions in the food supply chain), and cultural connection (the relationship between communities and their traditional food cultures). Sustainability of food sources addresses the long-term viability of different food production systems: whether current agricultural practices can continue without depleting soil, water and biodiversity, and what dietary shifts might reduce the environmental impact of food systems.",
      "teaching_guidance": "Develop understanding of food provenance through mapping exercises: trace the journey of a specific food product from primary production to the consumer's plate, identifying all the inputs, processes, transportation stages and environmental impacts involved. Study different farming systems comparatively: intensive vs organic; free-range vs battery; monoculture vs polyculture. Develop understanding of the environmental impact of different food choices: compare the carbon footprint of plant and animal proteins; assess the water footprint of different agricultural products. Connect sustainability to food choice: how can individual dietary choices reduce environmental impact? Connect to public health: local, seasonal, less processed food is often also healthier. For examination questions, practise evaluating the sustainability credentials of different food production systems against multiple criteria.",
      "key_vocabulary": "provenance, sustainability, food miles, carbon footprint, water footprint, organic, free-range, intensive farming, monoculture, biodiversity, fair trade, seasonal, local, supply chain, food waste",
      "common_misconceptions": "The assumption that 'food miles' is the primary determinant of food environmental impact is oversimplistic; the greenhouse gas emissions associated with food production (especially livestock production) often exceed those of transportation by a large margin. 'Organic' is often assumed to be synonymous with 'sustainable', but organic production can have high land requirements; the relationship between organic farming and environmental sustainability is complex and context-dependent. Students may not understand the scale of food waste as an environmental and economic problem; food waste at household level accounts for a significant proportion of total food system carbon emissions.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": true
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "FP-KS4-C001",
      "dependent_concept": "FP-KS4-C002",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.75,
      "rationale": "Understanding macronutrient chemistry (protein structure, fat composition, starch structure) provides the molecular basis for understanding how these nutrients behave during cooking — their functional properties are expressions of their chemical nature."
    },
    {
      "prerequisite_concept": "FP-KS4-C003",
      "dependent_concept": "FP-KS4-C002",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.6,
      "rationale": "Food safety considerations (particularly temperature control and pathogen management) are integral to food science at GCSE: understanding why cooking temperatures matter and why certain functional changes (denaturation) also destroy pathogens connects the two domains."
    },
    {
      "prerequisite_concept": "FP-KS4-C001",
      "dependent_concept": "FP-KS4-C004",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.65,
      "rationale": "Nutritional knowledge informs sensory evaluation: understanding which nutrients and functional properties are associated with which sensory characteristics (fat = creaminess and flavour; sugar = sweetness; protein = umami and texture) enriches sensory analysis."
    },
    {
      "prerequisite_concept": "FP-KS4-C004",
      "dependent_concept": "FP-KS4-C005",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.65,
      "rationale": "Understanding food choice — including the cultural, economic and sensory factors that shape what people eat — is prerequisite to meaningful engagement with food provenance and sustainability: sustainable food systems must be acceptable and accessible to real consumers."
    },
    {
      "prerequisite_concept": "FP-KS4-C002",
      "dependent_concept": "FP-KS4-C003",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.7,
      "rationale": "Food science provides the biological basis for food safety: understanding how protein denaturation on heating kills pathogens, how pH affects microbial growth, and how water activity controls bacterial reproduction requires both food science and food microbiology knowledge."
    }
  ]
}
