{
  "metadata": {
    "subject": "History",
    "key_stage": "KS4",
    "years_covered": [
      10,
      11
    ],
    "document_reference": "DFE-00443-2014",
    "extraction_date": "2026-02-21",
    "structure_rating": 8
  },
  "domains": [
    {
      "domain_id": "HI-KS4-D001",
      "domain_name": "Thematic Studies",
      "description": "Long-sweep thematic studies tracing a significant historical theme across at least 500 years, drawing on examples from all three required eras: medieval, early modern, and modern. Topics include crime and punishment, medicine, warfare, and migration in Britain.",
      "curriculum_context": "Thematic studies are the distinctive long-view component of GCSE History, requiring pupils to understand change and continuity across five or more centuries rather than in a single period. By tracing a theme such as crime and punishment, medicine in Britain, or the experience of migrants from c800 to the present, pupils develop a qualitatively different kind of historical understanding: the ability to identify patterns of change, turning points, periods of stagnation, and the complex factors that drive or inhibit change over the long term. The DfE requirement (History GCSE subject content 2014) specifies that thematic studies must span all three eras, ensuring that pupils engage with medieval, early modern, and modern history within a single coherent enquiry. This also develops chronological knowledge and the ability to select relevant examples to support analytical arguments. Paired with the historic environment study, the thematic study connects abstract historical patterns to specific places and physical evidence.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "HI-KS4-D002",
      "domain_name": "British Depth Studies",
      "description": "In-depth study of a defined period of British history, typically spanning 50-80 years, with detailed knowledge of key events, individuals, turning points, and the interplay of political, social, economic and cultural factors.",
      "curriculum_context": "British depth studies require the detailed, intensive study of a specific period of British history in ways that develop rich contextual knowledge and sophisticated causal analysis. The DfE specification requires that British history forms at least 40% of the assessed content of any GCSE History qualification. Depth study options typically focus on periods of significant change or challenge in British history: Early Elizabethan England (1558-1588), Britain under Henry VIII, or Norman England represent examples from the medieval and early modern eras. The depth study format develops pupils' ability to explain complex causation, understand the significance of individuals and events within their wider context, and analyse how different factors interacted to produce historical outcomes. Source analysis is central to the depth study, requiring pupils to evaluate contemporary evidence both as historical information and as a product of its time. The historic environment element is embedded within the British depth study, connecting knowledge of the period to a specific site or locality.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "HI-KS4-D003",
      "domain_name": "Period Studies",
      "description": "Broader study of a period of at least 50 years in European or wider world history, developing understanding of the key features and characteristics of the period across political, social, economic and cultural dimensions.",
      "curriculum_context": "Period studies provide the medium-timescale, broader geographical scope element of GCSE History, situating pupils within a European or wider world historical context that contrasts with the British-focused depth study. The DfE specification requires period studies to cover at least 50 years and to include both British and wider European or world perspectives where relevant. Options include the American West (c1835-c1895), Weimar and Nazi Germany (1918-1939), and the Cold War in Europe (1945-1991). Period studies develop pupils' ability to construct overarching explanations of complex historical periods, understanding the interconnections between political events, ideological developments, social change, and economic conditions. Assessment emphasises the ability to explain and analyse using second-order concepts across an extended timeframe, selecting and deploying detailed knowledge to support substantiated judgements about the period's key features and developments.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "HI-KS4-D004",
      "domain_name": "World Depth Studies",
      "description": "In-depth study of a non-European or non-British historical society or period, developing knowledge of its key features and characteristics and the ability to analyse it using historical concepts.",
      "curriculum_context": "World depth studies fulfil the DfE requirement that GCSE History specifications must include a non-European perspective alongside the British and European content. This ensures pupils develop a genuinely global historical awareness, understanding that significant historical societies and developments existed outside the British and European traditions that have historically dominated the school history curriculum. Options include early Elizabethan England from a global perspective, Superpower relations and the Cold War from a global standpoint, or other significant non-European historical societies. The depth study format develops the same skills as the British depth study - rich contextual knowledge, causal analysis, source evaluation, and interpretive judgement - but applied to an unfamiliar historical context that requires pupils to suspend assumptions derived from British or European history and engage with different historical traditions, structures of power, and social formations.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "HI-KS4-D005",
      "domain_name": "Historic Environment Study",
      "description": "Study of a specific historical site or locality in its historical context, connecting physical evidence to the historical period studied and developing understanding of how historians use the built and archaeological environment as historical evidence.",
      "curriculum_context": "The historic environment study is a distinctive component of GCSE History that connects classroom historical study to real physical spaces and material culture. Pupils study a specific historic site - a castle, battlefield, workhouse, street, or institution - in close relationship to one of their other study components, understanding how the physical environment both reflects and was shaped by the historical processes they are studying. This develops the ability to use the built and natural environment as historical evidence: to understand what a site reveals about the society that created it, how it has changed over time, and what questions historians can and cannot answer from physical evidence alone. Assessment of the historic environment (as part of AO1/AO2) requires detailed contextual knowledge of the site and its period, the ability to explain how specific features of the site reflect broader historical developments, and critical engagement with how the site has been interpreted and preserved.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "HI-KS4-D006",
      "domain_name": "Second Order Historical Concepts",
      "description": "The disciplinary thinking tools of historical enquiry: causation, consequence, change, continuity, significance, similarity, difference, evidence, and interpretation. Applied across all study components to develop sophisticated historical reasoning.",
      "curriculum_context": "Second order concepts are the analytical tools that historians use to make sense of the past, and their systematic development is central to the GCSE History curriculum. Unlike first-order concepts (which are substantive historical ideas like 'revolution' or 'parliament'), second-order concepts are procedural: they describe the kinds of questions historians ask and the ways they organise historical knowledge into explanations and arguments. AO2 (explaining and analysing using second-order historical concepts) accounts for 35% of the GCSE grade, reflecting the centrality of these thinking tools to historical understanding. Causation and consequence require pupils to identify, explain, and evaluate the relative importance of multiple causes and effects of historical events. Change and continuity require pupils to assess the nature, pace, and extent of historical change, identifying what remained constant even as other things transformed. Significance requires judgements about why certain events, individuals, or developments matter historically. Evidence and interpretation require critical engagement with both primary sources and historical accounts, understanding how and why historians construct different interpretations of the same past.",
      "is_cross_cutting": true,
      "structure_type": "skills"
    }
  ],
  "objectives": [
    {
      "objective_id": "HI-KS4-O001",
      "domain_id": "HI-KS4-D001",
      "objective_text": "Study a thematic topic covering at least 500 years of history, tracing change and continuity across the medieval, early modern, and modern eras.",
      "non_statutory_guidance": "Examples include: Crime and Punishment in Britain, c1000-present; Medicine in Britain, c1250-present; Warfare and British Society, c1250-present; Migrants in Britain, c800-present.",
      "examples": "Crime and Punishment in Britain; Medicine in Britain; Warfare and British Society; Migrants in Britain",
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS4-O002",
      "domain_id": "HI-KS4-D001",
      "objective_text": "Identify and explain turning points, periods of rapid change, and periods of continuity within the thematic study, using specific historical examples as evidence.",
      "non_statutory_guidance": "For example, in Medicine: germ theory as a turning point, the period 1250-1500 as relative stagnation, the 20th century as acceleration.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS4-O003",
      "domain_id": "HI-KS4-D001",
      "objective_text": "Explain how and why the theme changed across different eras, using causal analysis that considers factors such as technology, ideas, individuals, war, and government.",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS4-O004",
      "domain_id": "HI-KS4-D001",
      "objective_text": "Analyse the historic environment associated with the thematic study, connecting physical evidence from a specific site to the broader historical theme.",
      "non_statutory_guidance": "For example, Whitechapel c1870-1900 for Crime and Punishment; the Western Front for Medicine in Britain.",
      "examples": "Whitechapel c1870-1900; the Western Front 1914-1918",
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS4-O005",
      "domain_id": "HI-KS4-D002",
      "objective_text": "Demonstrate detailed knowledge and understanding of the key features and characteristics of a defined period of British history.",
      "non_statutory_guidance": "Options include: Norman England (1066-1100); Anglo-Saxon and Norman England (1060-1088); Early Elizabethan England (1558-1588); Elizabethan England (1568-1603); Henry VIII and His Ministers.",
      "examples": "Norman England 1066-1100; Early Elizabethan England 1558-1588; Elizabethan England 1568-1603",
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS4-O006",
      "domain_id": "HI-KS4-D002",
      "objective_text": "Explain the causes and consequences of key events and developments within the British depth study period, evaluating the relative importance of different factors.",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS4-O007",
      "domain_id": "HI-KS4-D002",
      "objective_text": "Analyse and evaluate sources contemporary to the period studied, making substantiated judgements about their usefulness and reliability as historical evidence.",
      "non_statutory_guidance": "Sources should be evaluated in their historical context: understanding who produced the source, for what purpose, and what this reveals about its value as evidence.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS4-O008",
      "domain_id": "HI-KS4-D002",
      "objective_text": "Analyse the historic environment associated with the British depth study, using detailed knowledge of a specific site to explain how it reflects and illuminates the broader historical period.",
      "non_statutory_guidance": "For example: Boscobel House for the Restoration; a Medieval castle for Norman England; the Globe Theatre for Elizabethan England.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS4-O009",
      "domain_id": "HI-KS4-D003",
      "objective_text": "Demonstrate knowledge and understanding of the key features and characteristics of a period of European or wider world history spanning at least 50 years.",
      "non_statutory_guidance": "Options include: the American West (c1835-c1895); Weimar and Nazi Germany (1918-1939); the Cold War in Europe (1945-1991); Superpower relations and the Cold War (1941-1991).",
      "examples": "Weimar and Nazi Germany 1918-1939; the American West c1835-c1895; the Cold War in Europe 1945-1991",
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS4-O010",
      "domain_id": "HI-KS4-D003",
      "objective_text": "Explain and analyse the connections between political, social, economic, and ideological developments within the period studied.",
      "non_statutory_guidance": "For example, in Weimar Germany: the relationship between economic instability, political extremism, social unrest, and the rise of the Nazi party.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS4-O011",
      "domain_id": "HI-KS4-D003",
      "objective_text": "Make substantiated judgements about change and continuity, significance, similarity and difference within the period, using detailed and accurate historical knowledge.",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS4-O012",
      "domain_id": "HI-KS4-D004",
      "objective_text": "Demonstrate detailed knowledge and understanding of the key features of a non-European or non-British historical society or period.",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS4-O013",
      "domain_id": "HI-KS4-D004",
      "objective_text": "Explain and analyse events and developments within the world depth study using second-order historical concepts, showing awareness of the specific historical and cultural context.",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS4-O014",
      "domain_id": "HI-KS4-D005",
      "objective_text": "Demonstrate knowledge of a specific historical site or locality and explain how its physical features reflect the historical period being studied.",
      "non_statutory_guidance": "Sites are specified in the exam specification and vary by topic. For example: Whitechapel for Crime and Punishment; Portchester Castle for the Norman period; the Western Front for Medicine.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS4-O015",
      "domain_id": "HI-KS4-D005",
      "objective_text": "Explain how the historic environment can be used as historical evidence, and evaluate what it reveals about and conceals about the past.",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS4-O016",
      "domain_id": "HI-KS4-D006",
      "objective_text": "Explain and analyse historical events and periods using causation and consequence, identifying multiple causes and evaluating their relative importance.",
      "non_statutory_guidance": "Students should distinguish between long-term, short-term, trigger, and underlying causes. They should consider why some consequences were more significant than others.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS4-O017",
      "domain_id": "HI-KS4-D006",
      "objective_text": "Analyse change and continuity across historical periods, identifying the nature, pace, extent, and significance of historical change.",
      "non_statutory_guidance": "Students should assess what changed, what stayed the same, how quickly change happened, and what drove or prevented change.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS4-O018",
      "domain_id": "HI-KS4-D006",
      "objective_text": "Make substantiated historical judgements about significance, similarity and difference, using criteria-based reasoning and detailed historical knowledge.",
      "non_statutory_guidance": "Significance should be assessed against explicit criteria such as: impact at the time, impact in the long-term, scale of effect, and influence on subsequent events.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS4-O019",
      "domain_id": "HI-KS4-D006",
      "objective_text": "Analyse and evaluate sources (contemporary to the period) to make substantiated judgements, placing them in their historical context (AO3).",
      "non_statutory_guidance": "Source evaluation should consider: content (what it says), provenance (who made it, when, why, for whom), nature (type of source), and the limitations of what sources can tell us.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS4-O020",
      "domain_id": "HI-KS4-D006",
      "objective_text": "Analyse and evaluate historical interpretations, making substantiated judgements about how and why interpretations differ and how convincing they are (AO4).",
      "non_statutory_guidance": "Interpretations should be evaluated by considering: the argument being made, the evidence used, the perspective or approach of the historian, and how the interpretation compares to other accounts.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS4-O021",
      "domain_id": "HI-KS4-D006",
      "objective_text": "Construct extended written responses using accurate historical knowledge organised to support a clear argument or analysis, with appropriate use of specialist historical terminology.",
      "non_statutory_guidance": "5% of marks across the specification must assess spelling, punctuation, grammar, and specialist terminology. Extended writing requires pupils to structure arguments, select relevant evidence, and deploy it in support of a thesis.",
      "examples": null,
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "HI-KS4-C001",
      "domain_id": "HI-KS4-D006",
      "concept_name": "Causation",
      "description": "The identification, explanation, and evaluation of the factors that caused historical events and developments. Causation involves distinguishing between multiple causes, assessing their relative importance, and understanding how causes interact over different timescales.",
      "teaching_guidance": "Teach students to categorise causes by type (political, economic, social, military, ideological) and by timescale (long-term underlying causes, short-term immediate triggers). The GCSE 'explain two causes' question (typically 4-8 marks) requires developed explanation of each cause, not merely listing. For the extended 'how far' and 'to what extent' questions, students must construct an argument about relative importance, not merely describe multiple causes. Command words to practise: 'explain', 'how far', 'to what extent', 'assess the importance of'. Common exam technique error: students often describe causes without explaining the mechanism by which they led to the outcome — push students to answer the implicit question 'how did this cause the event?'",
      "key_vocabulary": "causation, cause, consequence, trigger, underlying cause, long-term cause, short-term cause, contributing factor, catalyst, turning point, cumulative cause, ideological, political, economic, social",
      "common_misconceptions": "Students often confuse causes with background context, listing facts about the period without explaining how those facts led to the specific outcome. Students frequently identify only one or two causes when multiple interacting causes were involved, producing reductive single-factor explanations. Students confuse the most obvious or dramatic cause with the most important one, failing to consider longer-term structural factors.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true
    },
    {
      "concept_id": "HI-KS4-C002",
      "domain_id": "HI-KS4-D006",
      "concept_name": "Consequence",
      "description": "The identification, explanation, and evaluation of the outcomes and effects of historical events and developments. Consequence involves distinguishing between intended and unintended outcomes, immediate and long-term effects, and effects of different scale and significance.",
      "teaching_guidance": "Distinguish between short-term consequences (visible immediately after an event) and long-term consequences (effects that only became apparent years or decades later). Teach students that some consequences were intended by the historical agents involved, while others were unforeseen. The evaluation of consequences requires criteria: pupils should consider the scale of an effect, who was affected and how, and whether the consequence proved lasting or temporary. For 'significance' questions, the impact of consequences is central evidence. GCSE questions often ask students to assess whether a stated consequence was the most significant — students must both explain why it was significant and evaluate it against other consequences.",
      "key_vocabulary": "consequence, outcome, effect, impact, immediate, long-term, short-term, intended, unintended, significance, ripple effect, chain of events, historical significance",
      "common_misconceptions": "Students frequently focus only on immediate and dramatic consequences, overlooking slow-burning long-term effects that may have been more historically significant. Students confuse cause and consequence, particularly in complex situations where an event is simultaneously a consequence of earlier factors and a cause of later developments. Students often assert that a consequence was 'important' without specifying why, for whom, and for how long.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true
    },
    {
      "concept_id": "HI-KS4-C003",
      "domain_id": "HI-KS4-D006",
      "concept_name": "Change and Continuity",
      "description": "The analytical framework for assessing what changed and what remained constant across historical periods. Involves identifying the nature, pace, extent, and significance of change, and explaining what factors drove or prevented it.",
      "teaching_guidance": "Teach students to evaluate change across four dimensions: nature (what kind of change?), pace (how quickly?), extent (how much changed, how much stayed the same?), and significance (did the change matter, and to whom?). The thematic study at GCSE requires sustained analysis of change and continuity over very long periods — students must be able to identify turning points (moments of rapid change) and periods of stagnation (when expected change did not occur). For the AO2 extended writing questions, students should construct arguments about whether a given period represents genuine change or merely superficial transformation. Command words: 'how far did X change?', 'assess the extent of change', 'explain why change was slow/rapid in this period'.",
      "key_vocabulary": "change, continuity, transformation, turning point, revolution, evolution, stagnation, pace, extent, nature of change, catalyst for change, resistance to change, gradual, rapid, incremental",
      "common_misconceptions": "Students often treat change as binary (either complete change or no change) rather than assessing its extent on a spectrum. Students frequently neglect continuity — assuming that change is inherently more interesting or significant than what remained the same. In thematic studies, students sometimes incorrectly identify any new development as a turning point without evaluating whether it represents a fundamental transformation or only a surface-level shift.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true
    },
    {
      "concept_id": "HI-KS4-C004",
      "domain_id": "HI-KS4-D006",
      "concept_name": "Historical Significance",
      "description": "The criteria-based evaluation of why certain events, individuals, or developments matter historically. Significance is not inherent in events but is constructed by historians using explicit criteria relating to impact, scale, durability, and relevance to later developments.",
      "teaching_guidance": "Teach students that historical significance is not fixed — it depends on when you are judging, from whose perspective, and what criteria you apply. Standard criteria for significance assessment include: contemporary impact (how significant was it at the time?), scale of effect (how many people were affected, over how large an area?), duration (how long did the effects last?), and legacy (did it shape later events or attitudes?). GCSE questions on significance often present a stated claim and ask students to 'how far do you agree?' — this requires students to set up their own criteria and apply them to construct a reasoned argument. Students should practise constructing their own significance criteria rather than relying on the teacher's framework.",
      "key_vocabulary": "significance, historically significant, criteria, impact, scale, durability, legacy, contemporary significance, long-term significance, historical relevance, monument, milestone",
      "common_misconceptions": "Students frequently confuse fame or dramatic impact with historical significance — assuming that well-known events are automatically more historically significant than less familiar ones. Students often assess significance without stating the criteria they are using, making their arguments circular. Students sometimes confuse moral significance (was this event good or bad?) with historical significance (did this event have major effects on subsequent history?).",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": true
    },
    {
      "concept_id": "HI-KS4-C005",
      "domain_id": "HI-KS4-D006",
      "concept_name": "Source Analysis and Evaluation",
      "description": "The systematic analysis and evaluation of sources contemporary to the historical period, assessing their content, provenance, nature, and purpose to make substantiated judgements about their usefulness as historical evidence (AO3).",
      "teaching_guidance": "Teach the PANDA or CCNP framework: Content (what does the source say?), Context (what do we know about the period that helps us evaluate the source?), Nature (what type of source is this?), Purpose (why was this source created?), and provenance (who created it, when, and for whom?). GCSE AO3 questions typically present two sources and ask students to evaluate their usefulness for a given enquiry — students must engage with both content and provenance, using their own contextual knowledge to explain why each source's origin enhances or limits its value. Common command words: 'how useful is Source A for enquiry X?', 'study Sources A and B — how useful are they for an historian studying Y?'. Students must avoid simply cross-referencing sources without analysing provenance, or asserting that a source is 'biased' without explaining how and why this affects its historical value.",
      "key_vocabulary": "source, primary source, contemporary source, provenance, purpose, nature, content, reliability, usefulness, bias, perspective, corroboration, limitation, inference, interpretation",
      "common_misconceptions": "Students commonly dismiss sources as 'biased' and therefore useless, without recognising that bias itself is historically revealing (showing us what a person or group believed, wanted, or feared). Students often focus exclusively on the content of sources while ignoring provenance, or vice versa. Students confuse reliability (whether the source accurately reflects what happened) with usefulness (whether the source is valuable for a particular historical enquiry).",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": true
    },
    {
      "concept_id": "HI-KS4-C006",
      "domain_id": "HI-KS4-D006",
      "concept_name": "Historical Interpretations",
      "description": "The analysis and evaluation of historians' accounts and representations of the past, assessing how and why interpretations differ and how convincing each interpretation is given the available evidence (AO4).",
      "teaching_guidance": "Teach students to understand that historical interpretations differ for legitimate reasons: historians have access to different evidence, write from different theoretical perspectives, ask different questions of the past, and write at different times (meaning that new evidence or changing societal concerns may alter what historians emphasise). AO4 questions at GCSE present an historical interpretation and ask students to 'how far do you agree?' or 'how convincing is this interpretation?' — students must assess the argument by considering what evidence supports it, what evidence challenges it, and whether the interpretation is balanced or one-sided. Students should distinguish between primary sources (created at the time) and secondary interpretations (created afterwards by historians or others reflecting on the past).",
      "key_vocabulary": "interpretation, historian, historical debate, perspective, viewpoint, evidence-based, argument, convincing, one-sided, balanced, revisionist, orthodox interpretation, historiography, secondary source",
      "common_misconceptions": "Students frequently treat historical interpretations as simply matters of opinion, failing to assess them against available historical evidence. Students often confuse 'I agree/disagree with this interpretation' with 'this interpretation is convincing/unconvincing based on the evidence' — the GCSE requires evidence-based evaluation, not personal agreement. Students sometimes assume that the most recent interpretation is automatically the most reliable.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": true
    },
    {
      "concept_id": "HI-KS4-C007",
      "domain_id": "HI-KS4-D001",
      "concept_name": "Crime and Punishment in Britain",
      "description": "A thematic study tracing the development of crime, law enforcement, and punishment in Britain from c1000 to the present. Examines changing definitions of crime, evolving systems of policing and courts, changing philosophies of punishment, and continuities in criminal activity and justice.",
      "teaching_guidance": "Organise teaching around three eras: medieval (c1000-1500), early modern (c1500-1700), and modern (c1700-present). Within each era, use the same analytical categories: types of crime, methods of law enforcement, forms of punishment, and underlying factors (religious, social, economic, political). Teach students to evaluate whether developments such as the creation of the police force (1829) or the abolition of capital punishment (1965) represent genuine turning points or evolutionary steps within longer trends. The historic environment component (typically Whitechapel, c1870-1900) should be integrated to show how a specific urban environment shaped crime and policing in the Victorian period.",
      "key_vocabulary": "crime, punishment, law enforcement, capital punishment, deterrence, rehabilitation, reformation, retribution, policing, constable, magistrate, assize court, transportation, imprisonment, corporal punishment",
      "common_misconceptions": "Students often assume that punishment always became more humane over time, overlooking the persistence of harsh punishments and the complex relationship between punishment, social context, and penal philosophy. Students sometimes conflate legal change with social change, assuming that new laws immediately altered behaviour. Students in the Whitechapel component often present contextual knowledge without connecting it explicitly to how the environment shaped crime and policing.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "HI-KS4-C008",
      "domain_id": "HI-KS4-D001",
      "concept_name": "Medicine in Britain",
      "description": "A thematic study tracing the development of medicine, public health, and understanding of disease in Britain from c1250 to the present. Examines changing theories of disease, the development of medical treatments, surgery, and the role of government, war, and technology in driving medical progress.",
      "teaching_guidance": "The central analytical framework is the interplay between ideas (theories of disease), individuals (key medical figures), government (public health policy), science and technology, and war (as an accelerant of medical progress). Teach students to assess each development against this explanatory framework. Key turning points to evaluate: the Black Death and its impact on medical understanding; the Renaissance and the rejection of Galenic theory; the germ theory revolution (Pasteur and Koch); the development of antiseptic surgery (Lister); the impact of World War One on surgery and psychology; the NHS (1948). The Western Front as a historic environment component should be integrated to show medicine in wartime conditions.",
      "key_vocabulary": "germ theory, miasma, supernatural, anatomy, dissection, vaccination, antiseptic, anesthetic, public health, surgery, epidemiology, clinical trial, pharmaceutical, NHS, spontaneous generation",
      "common_misconceptions": "Students often present medical history as a linear story of continuous progress, overlooking periods of stagnation and the persistence of incorrect ideas (e.g., miasma theory survived well into the 19th century alongside germ theory). Students frequently credit individual genius without explaining the social, technological, and economic conditions that made discovery possible. Students confuse the discovery of a medical advance with its widespread adoption, which often lagged by decades.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "HI-KS4-C009",
      "domain_id": "HI-KS4-D002",
      "concept_name": "Early Elizabethan England 1558-1588",
      "description": "A British depth study examining the establishment and consolidation of Elizabethan rule, the religious settlement, challenges to Elizabeth's authority, and the social and economic features of Elizabethan society including exploration and the Armada.",
      "teaching_guidance": "Organise the depth study around four analytical strands: Elizabeth's court and government (the 'problem of a female ruler', marriage question, succession, key advisers such as Cecil); the religious settlement (the 1559 Acts, Puritanism, Catholicism, seminary priests and Jesuits, plots); challenges and threats (Mary Queen of Scots, Northern Rebellion, plots, Spain); and Elizabethan society (the poor, exploration, culture, Drake and the sea dogs). Source analysis should focus on sources that reveal Elizabethan attitudes to queenship, religion, and national identity. For the historic environment element, connect a specific site (e.g., the Globe Theatre site, a country house, a church) to the broad themes of the period.",
      "key_vocabulary": "Protestant, Catholic, Puritan, religious settlement, Acts of Supremacy and Uniformity, excommunication, seminary priest, recusant, Privy Council, patronage, Spanish Armada, succession, progresses, Drake, sea dogs",
      "common_misconceptions": "Students often assume Elizabeth's religious settlement was straightforward and popular, overlooking the significant religious tensions it created. Students frequently underestimate the serious nature of the succession question and its implications for stability. Students sometimes treat the Spanish Armada (1588) as the definitive end of the depth study rather than as one of several serious threats to Elizabeth's security across the period.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "HI-KS4-C010",
      "domain_id": "HI-KS4-D003",
      "concept_name": "Weimar and Nazi Germany 1918-1939",
      "description": "A period study examining the collapse of imperial Germany, the establishment and instability of the Weimar Republic, the rise of the Nazi Party, Hitler's consolidation of power, and the social, economic, and political features of the Third Reich.",
      "teaching_guidance": "Structure teaching chronologically across four phases: (1) the collapse of the Kaiser's Germany and establishment of Weimar (1918-1923); (2) the recovery and relative stability of the mid-Weimar period (1924-1929); (3) the descent into crisis and Nazi rise to power (1929-1933); (4) the Nazi consolidation of power and the nature of the Third Reich (1933-1939). Key analytical questions throughout: Why did Weimar democracy fail? Why did ordinary Germans support the Nazis? How did Hitler consolidate power so rapidly? What was life like for different groups in Nazi Germany (Jews, women, youth, political opponents)? For extended writing, practise 'how far was X the most important reason for Y?' questions with models that argue both for and against the stated factor.",
      "key_vocabulary": "Weimar Republic, hyperinflation, Stresemann, proportional representation, Nazi Party, NSDAP, Hitler, Reichstag, Enabling Act, SS, SA, Gestapo, antisemitism, Nuremberg Laws, Hitler Youth, propaganda, autarky",
      "common_misconceptions": "Students often present the rise of the Nazis as inevitable given Germany's post-WWI situation, underestimating the contingency of events and the role of individual decisions. Students frequently over-attribute Nazi success to hyperinflation (1923) when the decisive economic crisis was the Great Depression (1929-1933). Students confuse Weimar's constitution with its weakness in practice, and sometimes present life in the Third Reich as uniformly terrible for all Germans rather than recognising that many Germans benefited or were indifferent.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "HI-KS4-C011",
      "domain_id": "HI-KS4-D003",
      "concept_name": "The American West c1835-c1895",
      "description": "A period study examining the migration and settlement of the American West, the experience of the Plains Indians (including Sioux and other nations), conflicts over land and resources, the cattle industry, and the transformation of the West through government policy, railroads, and settlement.",
      "teaching_guidance": "Teach students to examine the West from multiple perspectives: Plains Indians (their way of life, beliefs, resistance, and experience of dispossession), settlers (motivations for migration, challenges of homesteading), ranchers and cowboys (cattle industry development), and the US government (reservation policy, wars, Dawes Act). The period has a clear narrative arc from early migration to the closing of the frontier (1890s) but should be taught thematically as well as chronologically, with explicit attention to why the Plains Indians' way of life was destroyed. Key analytical question: was the destruction of Plains Indian culture the result of deliberate genocide, economic necessity, or cultural misunderstanding? Practise evaluating historical interpretations of this question.",
      "key_vocabulary": "Plains Indians, Sioux, reservation, Treaty of Fort Laramie, Homestead Act, transcontinental railroad, cattle drive, longhorn, range wars, Dawes Act, Ghost Dance, Battle of Little Bighorn, manifest destiny, frontier",
      "common_misconceptions": "Students often present Plains Indian culture in a stereotyped and static way, missing its sophistication, diversity, and adaptability. Students sometimes treat the westward migration as naturally or inevitably leading to the displacement of Native Americans, without examining the specific policy choices and conflicts that produced this outcome. Students often conflate all Plains Indian nations rather than recognising significant cultural and political differences between groups.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "HI-KS4-C012",
      "domain_id": "HI-KS4-D005",
      "concept_name": "Historic Environment Evidence",
      "description": "The use of physical sites, buildings, and archaeological evidence as historical sources. Understanding what a site reveals about its historical period, how it has been modified over time, and how historians interpret the built and natural environment.",
      "teaching_guidance": "Teach students to read physical sites as historical texts: what does the design, scale, materials, and location of a building reveal about the society that created it? What functions did the site serve, and how can we tell? What has changed about the site since its historical period, and what does this tell us about subsequent attitudes to the past? For GCSE questions on the historic environment (typically the final question in the thematic study paper, testing AO1 and AO2), students need detailed factual knowledge of the specific site alongside ability to connect site features to broader historical themes. Common question formats: 'Explain how a knowledge of [site] helps us to understand [theme/period]'; 'How does the historic environment at [site] reflect the experience of [group] in [period]?'",
      "key_vocabulary": "historic environment, archaeological evidence, built environment, site, locality, physical evidence, preservation, reconstruction, interpretation, oral history, material culture, landscape, monument, artefact",
      "common_misconceptions": "Students often describe physical features of a site without explicitly connecting them to historical questions, producing narrative description rather than analytical argument. Students sometimes assume that preserved sites accurately represent their original state, without considering how sites have been modified, restored, or partially destroyed. Students confuse knowledge about a site's history with the ability to explain what the site tells us as historical evidence.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "HI-KS4-C013",
      "domain_id": "HI-KS4-D006",
      "concept_name": "Similarity and Difference",
      "description": "The systematic comparison of historical situations, societies, or periods to identify what they shared and how they differed, as a tool for historical analysis and for evaluating historical generalisations.",
      "teaching_guidance": "Teach students to use similarity and difference as an analytical tool rather than merely a descriptive exercise. Productive comparative questions include: How similar were the experiences of different social groups within the same period? How did the situation in Britain compare to the rest of Europe? How similar were two different historical events that are often compared (e.g., French Revolution and Russian Revolution)? At GCSE, similarity and difference questions often appear within 'describe' or 'explain' questions where students must show awareness that historical experience was varied and contested rather than uniform. Practise 'how similar were X and Y?' questions that require students to argue for a conclusion about degree of similarity rather than merely listing similarities and differences.",
      "key_vocabulary": "similarity, difference, comparison, contrast, parallel, divergence, convergence, common features, distinctive features, generalisation, nuance, variation, exception",
      "common_misconceptions": "Students often list similarities and differences without drawing a conclusion about the degree or significance of similarity. Students sometimes treat comparison as merely descriptive rather than as a tool for historical argument. Students frequently identify surface-level similarities while overlooking more fundamental differences in context, causation, or outcome.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true
    },
    {
      "concept_id": "HI-KS4-C014",
      "domain_id": "HI-KS4-D002",
      "concept_name": "Norman England 1066-1100",
      "description": "A British depth study examining the Norman Conquest, the consolidation of Norman control over England, the Domesday Book, the relationship between crown and church, and the experience of the English under Norman rule.",
      "teaching_guidance": "Structure teaching around the key questions: How did William conquer and then control England? How did Norman rule transform English society? What was the relationship between William and the Church? How did ordinary English people experience Norman rule? Key events and developments: Hastings (1066) and its causes; the harrying of the North; the feudal system and castle building; Domesday Book (1086); the Investiture Controversy; Norman culture and language. For source analysis, focus on the Bayeux Tapestry as a complex primary source that rewards analysis of perspective and purpose. Historic environment connections: Norman castles (e.g., Dover, Colchester, Tower of London) as physical evidence of conquest and control.",
      "key_vocabulary": "Norman Conquest, Battle of Hastings, feudalism, Domesday Book, knight, motte and bailey, castle, baron, vassal, homage, Witan, investiture, excommunication, harrying, Anglo-Saxon, Bayeux Tapestry",
      "common_misconceptions": "Students often treat the Norman Conquest as an abrupt break with Anglo-Saxon England rather than a gradual and contested process of cultural and administrative transformation. Students frequently underestimate the resistance to Norman rule, particularly in the North. Students sometimes assume that the feudal system was imposed immediately and uniformly after 1066 rather than developing gradually over decades.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "HI-KS4-C015",
      "domain_id": "HI-KS4-D001",
      "concept_name": "Migrants in Britain c800-present",
      "description": "A thematic study tracing the history of migration to and from Britain across more than a millennium, examining the push and pull factors driving migration, the varied experiences of migrants, the responses of host communities, and the contribution of migrants to British society.",
      "teaching_guidance": "Organise teaching around distinct waves of migration: Viking and Norman settlement; Jewish communities in medieval and early modern Britain; Huguenot refugees; the slave trade and early black British communities; Irish migration; Empire Windrush and post-war Commonwealth migration; recent European migration. For each wave, apply the same analytical framework: who migrated, why, how were they received, what was their experience, and what contribution did they make? Teach students to assess change and continuity in attitudes to migration across the period, and to evaluate interpretations of whether Britain has historically been a welcoming or hostile host society. The historic environment component (Notting Hill c1948-1970) should connect the thematic narrative to specific local evidence of post-war migration.",
      "key_vocabulary": "migration, emigration, immigration, refugee, asylum seeker, push factor, pull factor, integration, discrimination, multiculturalism, diaspora, Windrush, Commonwealth, Huguenot, pogrom, assimilation, host community",
      "common_misconceptions": "Students often present British history of migration as beginning in the 20th century, overlooking the long history of migration that shaped Britain from the medieval period onwards. Students sometimes treat all migrant experiences as uniform rather than recognising enormous variation by period, origin, class, and individual circumstance. Students frequently conflate political and legal attitudes to migration with the lived experience of migrants in local communities.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "HI-KS4-C001",
      "dependent_concept": "HI-KS4-C002",
      "confidence": "explicit",
      "relationship_type": "conceptual",
      "strength": 0.9,
      "rationale": "Causation and consequence are complementary analytical concepts that are typically taught together and applied simultaneously. Understanding causation (what caused X?) requires understanding what kinds of outcomes (consequences) matter historically, and vice versa. The DfE specification explicitly links these concepts as paired analytical tools."
    },
    {
      "prerequisite_concept": "HI-KS4-C001",
      "dependent_concept": "HI-KS4-C003",
      "confidence": "explicit",
      "relationship_type": "conceptual",
      "strength": 0.8,
      "rationale": "Change and continuity analysis requires causal reasoning: to explain why something changed, students must identify the causes of change. To explain why something remained continuous despite pressures for change, students must understand what factors prevented transformation. Causation is therefore a prerequisite for sophisticated change and continuity analysis."
    },
    {
      "prerequisite_concept": "HI-KS4-C003",
      "dependent_concept": "HI-KS4-C004",
      "confidence": "explicit",
      "relationship_type": "conceptual",
      "strength": 0.8,
      "rationale": "Historical significance judgements are partly based on the extent and nature of change that an event or individual produced. To evaluate significance, students must first be able to assess the nature and extent of change — a concept that depends on mastery of the change and continuity framework. The thematic study particularly requires integrated use of both concepts."
    },
    {
      "prerequisite_concept": "HI-KS4-C005",
      "dependent_concept": "HI-KS4-C006",
      "confidence": "explicit",
      "relationship_type": "conceptual",
      "strength": 0.85,
      "rationale": "Interpreting historical accounts (AO4) requires foundational understanding of how primary sources work (AO3). Students who cannot distinguish between primary and secondary sources, or who do not understand how provenance shapes historical accounts, cannot meaningfully evaluate why historians' interpretations differ or assess which interpretation is better supported by evidence."
    },
    {
      "prerequisite_concept": "HI-KS4-C007",
      "dependent_concept": "HI-KS4-C001",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.7,
      "rationale": "The Crime and Punishment thematic study provides the substantive historical content through which causation is applied and practised. Students cannot demonstrate causation in a GCSE context without adequate substantive knowledge of the topic they are explaining. The thematic study thus provides the knowledge base that gives causation and other second-order concepts their historical grounding."
    },
    {
      "prerequisite_concept": "HI-KS4-C008",
      "dependent_concept": "HI-KS4-C003",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.75,
      "rationale": "Medicine in Britain is the thematic study most explicitly designed to develop change and continuity analysis — the entire structure of the topic (turning points, periods of stagnation, the role of different factors in driving change) is organised around these concepts. Mastery of this topic context is practically necessary for students to demonstrate change and continuity analysis with the sophistication required at GCSE."
    },
    {
      "prerequisite_concept": "HI-KS4-C013",
      "dependent_concept": "HI-KS4-C004",
      "confidence": "explicit",
      "relationship_type": "conceptual",
      "strength": 0.75,
      "rationale": "Historical significance is often evaluated through comparison: an event is assessed as significant partly by comparing it with others. The ability to identify similarity and difference is therefore a constituent skill within significance judgements, particularly when students must argue that one factor was more significant than another."
    },
    {
      "prerequisite_concept": "HI-KS4-C009",
      "dependent_concept": "HI-KS4-C005",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.8,
      "rationale": "Source analysis requires contextual knowledge of the period from which the source comes. Students cannot evaluate a source's content and provenance without knowing enough about Elizabethan England (or whichever depth study period) to understand what the source reveals and what it conceals. The depth study provides the knowledge base for source analysis."
    },
    {
      "prerequisite_concept": "HI-KS4-C010",
      "dependent_concept": "HI-KS4-C006",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.85,
      "rationale": "Historical interpretations (AO4) about the rise of Nazism form a central assessment element of the Weimar and Nazi Germany period study. Students cannot evaluate the convincingness of historical interpretations about this period without detailed knowledge of Weimar Germany and the Nazi rise to power. The period study knowledge is the prerequisite for the AO4 evaluation skills."
    },
    {
      "prerequisite_concept": "HI-KS4-C012",
      "dependent_concept": "HI-KS4-C005",
      "confidence": "explicit",
      "relationship_type": "conceptual",
      "strength": 0.7,
      "rationale": "Understanding how physical sites function as historical evidence (historic environment study) is a specific application of the broader skill of source analysis. Students who understand how to evaluate what a primary source reveals about the past are better equipped to analyse what a physical site reveals. The general source evaluation skills of AO3 transfer to and deepen the historic environment component."
    },
    {
      "prerequisite_concept": "HI-KS4-C014",
      "dependent_concept": "HI-KS4-C003",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.7,
      "rationale": "Norman England provides rich historical content through which change and continuity can be examined: the transformation of English society, governance, language, and architecture after 1066, alongside important continuities in local administration and peasant life. The depth study context gives students the historical grounding to practise change and continuity analysis concretely."
    },
    {
      "prerequisite_concept": "HI-KS4-C015",
      "dependent_concept": "HI-KS4-C003",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.85,
      "rationale": "The Migrants in Britain thematic study is explicitly built around change and continuity across c1200 years of migration history. The analytical structure of the topic requires students to identify patterns of change and continuity in the scale of migration, in attitudes to migrants, and in migrants' experiences. Change and continuity is the dominant second-order concept for this thematic study."
    },
    {
      "prerequisite_concept": "HI-KS4-C001",
      "dependent_concept": "HI-KS4-C004",
      "confidence": "inferred",
      "relationship_type": "conceptual",
      "strength": 0.7,
      "rationale": "Causation analysis underpins significance judgements: to assess why an event was historically significant, students must understand what it caused, what chain of consequences it set in motion, and what it changed. Significance without causal understanding produces assertions rather than historical arguments."
    },
    {
      "prerequisite_concept": "HI-KS4-C002",
      "dependent_concept": "HI-KS4-C004",
      "confidence": "inferred",
      "relationship_type": "conceptual",
      "strength": 0.7,
      "rationale": "Historical significance is primarily assessed through consequences: an event is significant if its consequences were large in scale, long in duration, and wide in impact. Students cannot assess significance without being able to identify and evaluate consequences — consequence analysis is therefore a foundational prerequisite for significance judgements."
    },
    {
      "prerequisite_concept": "HI-KS4-C011",
      "dependent_concept": "HI-KS4-C013",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.65,
      "rationale": "The American West period study requires systematic comparison between Plains Indian cultures and settler cultures, examining what they understood differently about land ownership, violence, and civilisation. The topic's central tensions are most productively approached through similarity and difference analysis, making it a useful context for developing this second-order concept."
    },
    {
      "prerequisite_concept": "HI-KS4-C006",
      "dependent_concept": "HI-KS4-C004",
      "confidence": "inferred",
      "relationship_type": "conceptual",
      "strength": 0.65,
      "rationale": "Understanding how interpretations are constructed — what evidence historians select, what arguments they prioritise — helps students understand that historical significance is itself constructed rather than inherent. Interpretations analysis thus deepens students' understanding of significance by showing that which events are judged significant varies by historian, era, and perspective."
    }
  ]
}