{
  "metadata": {
    "subject": "Languages",
    "key_stage": "KS4",
    "years_covered": [
      10,
      11
    ],
    "document_reference": "DFE-00348-2014",
    "extraction_date": "2026-02-21",
    "structure_rating": 9
  },
  "domains": [
    {
      "domain_id": "LA-KS4-D001",
      "domain_name": "Listening and Responding",
      "description": "Understanding and responding to the spoken target language in a range of contexts, registers and varieties, including extended and authentic speech at near-natural speed, processing detailed and complex meaning and responding appropriately.",
      "curriculum_context": "Listening at GCSE represents a substantial increase in complexity and pace compared to KS3. Pupils must be able to process extended speech at near-natural speed, including authentic materials produced for native speakers rather than simplified or pedagogically adapted recordings. The range of contexts extends across all thematic areas of the specification, and pupils must handle a range of accents and varieties of the target language. The assessment of listening requires pupils to demonstrate comprehension at multiple levels: literal understanding of explicit content; inferential understanding of implied meaning; and understanding of attitude, opinion and purpose. Discriminating between near-homophonous words and understanding connected speech phenomena (reduction, assimilation, elision) are specific challenges at this level.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "LA-KS4-D002",
      "domain_name": "Speaking: Individual Presentation and Interaction",
      "description": "Communicating spontaneously and fluently in the target language in both prepared individual contexts (role play, presentation) and unprepared spontaneous interaction (conversation, discussion), with grammatical accuracy, appropriate register and communicative effectiveness.",
      "curriculum_context": "Speaking at GCSE requires pupils to engage in two distinct modes: prepared individual presentation (describing, narrating, expressing and justifying personal opinions) and unprepared spontaneous conversation and interaction. The spontaneous dimension demands genuine flexibility of language use rather than reproduction of memorised content. Grammatical accuracy is assessed, but communicative effectiveness — the ability to make oneself understood and to respond appropriately to an interlocutor — is the primary criterion. Pupils must demonstrate control over a range of tenses and structures, the ability to cope with unknown vocabulary through circumlocution and paraphrase, and the register awareness to adjust language use to formal and informal contexts. The 2014 MFL reform placed increased emphasis on spontaneous interaction and the ability to cope with the unexpected in conversation.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "LA-KS4-D003",
      "domain_name": "Reading and Responding",
      "description": "Understanding and responding to a range of written texts in the target language, including authentic materials of varying length and complexity, demonstrating comprehension at literal and inferential levels and understanding of grammar and vocabulary in context.",
      "curriculum_context": "Reading at GCSE requires pupils to engage with authentic written texts produced for native speakers, including literary extracts, journalistic texts, online content, advertising and functional documents. The range of genres and text types demands flexibility of reading strategy: pupils must be able to skim for gist, scan for specific information, and read intensively for detailed understanding. Inferential comprehension — understanding implied meaning, identifying the writer's purpose and attitude, and making justified inferences from textual evidence — is assessed at GCSE. The ability to work out the meaning of unfamiliar vocabulary from context and morphological knowledge (prefixes, suffixes, cognates) is an explicitly required skill that reduces dependence on vocabulary memorisation in isolation.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "LA-KS4-D004",
      "domain_name": "Writing",
      "description": "Producing accurate and effective written texts in the target language, including transactional writing (emails, letters, forms), creative and descriptive writing, and analytical and argumentative writing, across a range of lengths and levels of formality.",
      "curriculum_context": "Writing at GCSE requires the production of extended written texts in a range of genres and for a range of purposes, demonstrating grammatical accuracy, range of vocabulary, structural coherence and appropriate register. The emphasis on extended writing (typically 90–150 words for shorter tasks, 130–200 words for longer tasks in current specifications) demands sustained grammatical control over a longer text span. The range of text types — transactional (formal letters, emails), personal (diary entries, social media posts), creative (stories, descriptions) and analytical (essays, reports) — requires register flexibility. Accurate use of complex grammar — including subjunctive (in applicable languages), complex tense sequences, adverbial clauses and relative clauses — is a differentiating feature at the higher grades.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "LA-KS4-D005",
      "domain_name": "Grammar, Vocabulary and Cultural Understanding",
      "description": "Command of target language grammar, including complex structures appropriate to GCSE level; breadth and depth of active and passive vocabulary; and understanding of the culture, society and perspectives of target language communities.",
      "curriculum_context": "Grammar and vocabulary are not separate domains in language learning but underpin all four skills. At GCSE, the grammatical range required includes the tense and mood systems appropriate to the language (for French: present, perfect, imperfect, future, conditional, and for some specifications subjunctive; for German: similar plus case system; for Spanish: similar plus progressive aspects). Vocabulary at GCSE spans the thematic areas of the specification, which typically include: identity and culture, local area and travel, school and future aspirations, global issues, and work and careers. Cultural understanding — knowledge of the societies, histories, cultural products and everyday lives of communities where the target language is spoken — is both an intrinsically valuable component of MFL education and a practical resource for comprehension and production.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    }
  ],
  "objectives": [
    {
      "objective_id": "LA-KS4-O001",
      "domain_id": "LA-KS4-D001",
      "objective_text": "understand and respond to spoken language in the target language, including extended texts at natural speed and in a range of registers and accents",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS4-O002",
      "domain_id": "LA-KS4-D001",
      "objective_text": "identify main points, details, opinions and attitudes in spoken texts, making justified inferences where necessary",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS4-O003",
      "domain_id": "LA-KS4-D002",
      "objective_text": "communicate in speech for different purposes, including individual presentation, role play and spontaneous conversation in the target language",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS4-O004",
      "domain_id": "LA-KS4-D002",
      "objective_text": "speak with sufficient grammatical accuracy and fluency to be understood by a competent speaker of the target language",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS4-O005",
      "domain_id": "LA-KS4-D002",
      "objective_text": "initiate and develop conversation, respond spontaneously to questions and unpredictable prompts, and use communication strategies to maintain interaction",
      "non_statutory_guidance": null,
      "examples": "Circumlocution, paraphrase, fillers, requests for clarification.",
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS4-O006",
      "domain_id": "LA-KS4-D003",
      "objective_text": "read and understand a range of texts in the target language, including authentic materials of varying length and complexity",
      "non_statutory_guidance": null,
      "examples": "Literary extracts, newspaper and magazine articles, online texts, functional documents, advertising.",
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS4-O007",
      "domain_id": "LA-KS4-D003",
      "objective_text": "identify main points, details, opinions and attitudes in written texts, making justified inferences about implied meaning and the writer's purpose",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS4-O008",
      "domain_id": "LA-KS4-D003",
      "objective_text": "use contextual and morphological clues to deduce the meaning of unfamiliar vocabulary and structures in written texts",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS4-O009",
      "domain_id": "LA-KS4-D004",
      "objective_text": "write with grammatical accuracy, range of vocabulary and appropriate register for a range of purposes and audiences",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS4-O010",
      "domain_id": "LA-KS4-D004",
      "objective_text": "translate short passages from English into the target language and from the target language into English with accuracy",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS4-O011",
      "domain_id": "LA-KS4-D005",
      "objective_text": "use a range of grammatical structures with accuracy, including tense and mood systems appropriate to the language studied",
      "non_statutory_guidance": null,
      "examples": "Present, perfect, imperfect, future and conditional tenses; complex sentence structures; subordinating conjunctions.",
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS4-O012",
      "domain_id": "LA-KS4-D005",
      "objective_text": "demonstrate knowledge and understanding of the culture and society of countries and communities where the target language is spoken",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "LA-KS4-C001",
      "domain_id": "LA-KS4-D005",
      "concept_name": "Tense and Aspect Systems",
      "description": "The tense and aspect system of a language is the grammatical means by which speakers locate events in time (past, present, future) and characterise the nature of their unfolding (completed, ongoing, habitual). At GCSE, pupils must command a range of tenses appropriate to the language studied and use them accurately in both production and comprehension. In French, this includes the présent, passé composé, imparfait, futur simple, conditionnel présent and for higher-level work the subjonctif. In Spanish, the preterito indefinido and imperfecto distinction is a particular challenge. In German, the case system interacts with tense in complex ways. The accurate manipulation of multiple tenses in extended writing is a principal differentiator between grade bands.",
      "teaching_guidance": "Teach tenses as systems with consistent internal logic rather than as arbitrary sets of forms to be memorised. Develop understanding of the meaning distinction between tenses (e.g. in Spanish, the indefinido vs imperfecto distinction is semantic, not just structural). Practise active use of all required tenses in speaking and writing throughout the course, not just in dedicated grammar units. For writing, develop the habit of using three tenses in every extended response: describing the present, narrating in the past, expressing future intentions. Teach time adverbials that signal tense choice. For examination preparation, practise spotting and correcting systematic tense errors as a self-editing skill.",
      "key_vocabulary": "present tense, past tense, imperfect, perfect, future, conditional, subjunctive, tense agreement, auxiliary verb, infinitive, participle, conjugation, aspect, aspect, irregular verb",
      "common_misconceptions": "The distinction between the passé composé and imparfait in French (or the equivalent distinction in Spanish and other languages) is the single most pervasive grammatical confusion at GCSE level; consistent semantic teaching (completed event vs ongoing state) rather than rule-based teaching reduces error. Pupils often avoid tenses they are uncertain of, leading to restricted tense use even when wider use is intended; encouraging ambitious tense use with regular error correction builds repertoire. The idea that more complex tenses (conditional, subjunctive) are inherently harder to acquire is sometimes self-fulfilling; students who encounter them early and regularly develop control more reliably.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "teaching_weight": 6,
      "co_teach_hints": []
    },
    {
      "concept_id": "LA-KS4-C002",
      "domain_id": "LA-KS4-D005",
      "concept_name": "Grammatical Accuracy and Range",
      "description": "Grammatical accuracy refers to the correct application of grammatical rules including agreement (noun-adjective, subject-verb, gender), case (in German), tense formation, negation, interrogation and the full range of morphological and syntactic conventions of the target language. Grammatical range refers to the breadth of structures a learner can deploy with confidence: limited range may produce accurate but restricted language, while ambitious range allows more effective communication of complex ideas. At GCSE, both accuracy and range are assessed, with higher marks requiring both — a wide range of structures used without consistent accuracy is penalised, as is a narrow range that is consistently accurate.",
      "teaching_guidance": "Develop grammatical accuracy through consistent correction and self-correction habits, not through rules-only instruction. Teach grammar inductively where possible: expose pupils to many examples, then draw out the pattern. Develop pupils' range by teaching more complex structures and requiring their use: relative clauses, adverbial clauses, indirect speech, complex negation. Practise stretching simple sentences: 'I play football' becomes 'Although I prefer swimming, I often play football with my friends at the weekend because it is sociable.' For examination preparation, develop a systematic self-editing checklist covering the highest-frequency error types: agreement, tense, negation, word order.",
      "key_vocabulary": "agreement, gender, case, negation, word order, subordinating conjunction, relative clause, adjective, adverb, syntax, morphology, clause, phrase, sentence, structure",
      "common_misconceptions": "Pupils frequently transfer English word order to the target language, particularly in German where verb-second and verb-final rules are systematically different from English; extensive practice with word order through speaking and writing is the most reliable correction. Gender agreement in French and Spanish is a persistent source of error; systematic exposure and explicit teaching of noun gender with vocabulary learning reduces this. The idea that grammatical accuracy is more important than communicative effectiveness can cause pupils to produce restricted but accurate language that penalises range; teaching the balance between accuracy and ambition is essential.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "LA-KS4-C003",
      "domain_id": "LA-KS4-D002",
      "concept_name": "Spontaneous Interaction and Communication Strategies",
      "description": "Spontaneous interaction is the ability to engage in unprepared, real-time conversation in the target language, responding appropriately to unpredictable prompts, initiating topics, asking questions and developing ideas beyond memorised content. Communication strategies are the resources speakers use to maintain interaction when linguistic knowledge is insufficient: circumlocution (describing something when the precise word is unknown), paraphrase, requests for clarification, use of general vocabulary as a placeholder, and repair strategies. At GCSE, the ability to cope with the unexpected and maintain communicative flow is assessed in the spoken component.",
      "teaching_guidance": "Develop spontaneous speaking through regular unscripted conversation practice from the beginning of the course. Explicitly teach and practise communication strategies: model circumlocution and paraphrase, and require pupils to use these strategies rather than code-switching to English when stuck. Develop fillers and hesitation devices that maintain conversational flow in the target language. Practise responding to unexpected questions and developing topics beyond the first predictable response. For examination preparation, practise the photograph description task (where pupils must describe an image and respond to follow-up questions) and the role-play element. Develop the habit of asking questions of the examiner/interlocutor as well as responding.",
      "key_vocabulary": "spontaneous, interaction, circumlocution, paraphrase, filler, hesitation, repair, initiate, respond, develop, unexpected, register, formal, informal, fluency",
      "common_misconceptions": "Pupils often memorise large amounts of content for speaking examination, attempting to reproduce it regardless of what they are asked; developing the ability to adapt and use language flexibly produces better outcomes than extensive memorisation. The belief that preparation must be explicit (memorised sentences) rather than procedural (automatised grammar and vocabulary that can be deployed flexibly) produces performance that breaks down under unpredictable conditions. Students may believe that making errors in speaking indicates failure; developing tolerance for error and recovery strategies (self-correction, repair) produces more confident and communicatively effective speakers.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "teaching_weight": 4,
      "co_teach_hints": []
    },
    {
      "concept_id": "LA-KS4-C004",
      "domain_id": "LA-KS4-D003",
      "concept_name": "Reading Strategies and Authentic Text Comprehension",
      "description": "Reading strategies are the purposeful cognitive approaches readers use to extract meaning from texts efficiently and effectively. Key strategies include: skimming (reading quickly for overall gist and main ideas); scanning (searching quickly for specific information); intensive reading (careful, detailed reading for precise comprehension); inferencing (drawing meaning from context, collocation and morphology when encountering unfamiliar vocabulary); and evaluative reading (assessing the writer's purpose, attitude and credibility). At GCSE, pupils must demonstrate flexibility of reading strategy across authentic texts of varying length, genre and complexity.",
      "teaching_guidance": "Teach reading strategies explicitly and practise them separately before integrating them. Develop vocabulary learning strategies that reduce dependence on word-for-word comprehension: morphological analysis (recognising prefixes, suffixes, stems); cognate recognition (identifying similarities to English and other known languages); contextual inferencing (using surrounding words and knowledge of topic to guess meaning). Practise reading for gist before reading for detail: always establish the overall meaning before attempting to understand every word. For examination preparation, practise the translation task as a test of precise comprehension. Develop the habit of reading widely in the target language to build vocabulary and authentic text exposure.",
      "key_vocabulary": "skim, scan, inference, gist, cognate, morphology, authentic text, register, genre, comprehension, vocabulary, context, deduce, literary, journalistic",
      "common_misconceptions": "Many pupils read foreign language texts word-by-word, attempting to translate everything before moving on; teaching gist reading as the first step breaks this unproductive habit. The assumption that encountering an unknown word means the text cannot be understood significantly underestimates the inferential resources available; teaching vocabulary deduction strategies builds confidence with authentic texts. Students may not distinguish between the reading strategies appropriate to different task types; developing task awareness (what level of comprehension is this question testing?) improves performance.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "LA-KS4-C005",
      "domain_id": "LA-KS4-D005",
      "concept_name": "Register, Cultural Understanding and Intercultural Awareness",
      "description": "Register refers to the appropriate level of formality for a given communicative context, determined by the relationship between participants, the purpose of the communication and the social conventions of the target language community. Cultural understanding encompasses knowledge of the societies, histories, cultural products and everyday lives of communities where the target language is spoken. Intercultural awareness is the capacity to recognise that cultural norms, values and communicative conventions differ between communities, and to adjust one's communicative behaviour accordingly. At GCSE, cultural understanding is both an examinable component and a practical resource for producing appropriate and effective communication in the target language.",
      "teaching_guidance": "Teach register systematically: what linguistic features distinguish formal from informal register in the target language? (Tu/vous in French; du/Sie in German; tú/usted in Spanish; verb forms; vocabulary choices; sentence structures.) Connect cultural understanding to the thematic areas of the specification: the study of themes such as family, education, work and environment can be enriched by authentic cultural content. Use film, television, music, literature and social media from target language communities to develop authentic cultural exposure. Develop pupils' metacultural awareness: how do assumptions formed in their own cultural context affect their reading of target language cultural content? For examination preparation, develop the skills required for the cultural text and image tasks where these appear.",
      "key_vocabulary": "register, formal, informal, vous, Sie, usted, intercultural, cultural norm, convention, stereotype, authentic, identity, community, diaspora, bilingual",
      "common_misconceptions": "The assumption that cultures where the target language is spoken are monolithic and homogeneous ignores the diverse and plural nature of all linguistic communities; developing understanding of cultural diversity within target language communities challenges this. Pupils may apply a formal register to all written communication regardless of context, not understanding that informal register is appropriate in some tasks; teaching register flexibility addresses this. The conflation of cultural knowledge (facts about target language countries) with intercultural competence (the ability to navigate cultural difference) misses the deeper purpose of cultural study in language education.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "LA-KS4-C006",
      "domain_id": "LA-KS4-D001",
      "concept_name": "Listening to Authentic Spoken Language",
      "description": "Listening comprehension at GCSE requires processing the target language as spoken by native speakers in authentic contexts, at natural speed and in a range of accents and registers. This demands a set of cognitive skills beyond simple vocabulary recognition: the ability to tolerate incomplete comprehension while extracting key meaning; the ability to infer implied attitudes and opinions from tone, emphasis and choice of language; the ability to distinguish between literal and ironic or evaluative meaning; and the ability to retain and process information from an extended spoken text without the ability to re-read. At GCSE, pupils must demonstrate comprehension at literal, inferential and evaluative levels, matching the complexity of listening assessments to the demands of real-world listening situations.",
      "teaching_guidance": "Develop listening stamina and tolerance for ambiguity as explicit goals: pupils must learn that understanding 60-70% of a spoken text is sufficient to answer most comprehension questions. Use a range of listening sources including native speaker recordings, radio, film, podcasts and news content in the target language alongside examination-style recordings. Teach listening strategies explicitly: predicting content from context before listening; identifying key words on first listening before seeking detail; using second and third listens for increasingly fine-grained comprehension. Practise inferential listening: what attitude is the speaker expressing? How do you know? What is not said explicitly but is implied? Develop pupils' ability to process connected speech features (elision, liaison, reduction) that differ from classroom speech.",
      "key_vocabulary": "listening, authentic, spoken, comprehension, inference, attitude, opinion, register, accent, natural speed, main point, detail, gist, implied, evaluate, tolerate",
      "common_misconceptions": "Pupils may attempt to understand every word, producing anxiety and comprehension failure when encountering unfamiliar vocabulary; developing the ability to tolerate and work around unknown vocabulary is a fundamental listening skill. The belief that listening is a passive skill that improves automatically with exposure underestimates the importance of active listening strategies; teaching pupils how to listen purposefully and strategically produces faster improvement. Pupils may not realise that examination recordings are typically heard twice; teaching them how to use each listen differently (gist on first, detail on second) maximises the use of available opportunities.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "teaching_weight": 4,
      "co_teach_hints": []
    },
    {
      "concept_id": "LA-KS4-C007",
      "domain_id": "LA-KS4-D004",
      "concept_name": "Extended Written Production and Translation",
      "description": "Writing at GCSE encompasses two distinct but related competences: extended written production in the target language (producing texts of 90-200 words across a range of genres, purposes and registers with grammatical accuracy and lexical range) and translation (both into and from the target language, requiring precision and understanding of meaning transfer rather than word substitution). Extended writing at GCSE differentiates across grade bands by the range of structures used (limited range vs complex tenses, subordination, passive voice) and by the accuracy maintained across a longer text span. Translation into the target language is the most demanding written task, as it requires understanding the source meaning, selecting appropriate target language structures, and producing formally accurate output without the support of a scaffolded context.",
      "teaching_guidance": "Develop extended writing through consistent practice of full-length writing tasks under timed conditions. Teach pupils to use three tenses in every extended writing task: present for current situations, past for narrative and description, future or conditional for aspirations and hypothetical situations. Develop a self-editing routine: check gender agreement, verb conjugation accuracy, word order, tense sequence, negation, and spelling. For translation into the target language, practise identifying the grammatical challenge in each sentence before translating: what tense is required? What does this pronoun refer to? Is there a subjunctive trigger here? Develop pupils' ability to produce equivalent, natural-sounding target language rather than literal translations. Teach exam technique: shorter writing tasks require conciseness and precision; longer tasks require structural organisation with topic sentences, development, and conclusion.",
      "key_vocabulary": "write, extended, translate, accuracy, range, tense, agreement, register, genre, produce, paragraph, justify, structure, complex, precision, formal, informal",
      "common_misconceptions": "Pupils often spend more time on content than on accuracy in extended writing, producing texts with communicatively interesting content but significant grammatical errors; developing systematic self-editing as a final stage of the writing process prevents this. Translation into the target language is frequently approached as word-for-word substitution, producing literal translations that are grammatically incorrect or unnatural; understanding that translation is meaning transfer, not word transfer, is the key conceptual shift. Pupils may not differentiate their register for different writing task types, using the same informal vocabulary for a formal letter as for a personal diary entry; teaching register awareness with specific examples from different text types develops appropriate flexibility.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "teaching_weight": 4,
      "co_teach_hints": []
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "LA-KS4-C001",
      "dependent_concept": "LA-KS4-C002",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.9,
      "rationale": "Tense and aspect systems are the core component of the broader grammatical accuracy and range required at GCSE: command of the tense system is prerequisite to producing grammatically accurate and ambitious extended writing."
    },
    {
      "prerequisite_concept": "LA-KS4-C002",
      "dependent_concept": "LA-KS4-C003",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.8,
      "rationale": "Spontaneous interaction requires automatised grammatical knowledge that can be deployed in real-time under conversational pressure; grammatical accuracy and range must be sufficiently well-established to be available for spontaneous use without conscious attention."
    },
    {
      "prerequisite_concept": "LA-KS4-C004",
      "dependent_concept": "LA-KS4-C003",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.6,
      "rationale": "Reading strategies, particularly inferencing from context and morphological knowledge, transfer to listening and speaking contexts: the ability to use context to understand and produce language is a general skill that supports spontaneous interaction."
    },
    {
      "prerequisite_concept": "LA-KS4-C005",
      "dependent_concept": "LA-KS4-C003",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.7,
      "rationale": "Register awareness and cultural understanding are directly applied in spontaneous interaction: appropriate response to an interlocutor requires understanding of the social and cultural conventions governing that communicative context."
    },
    {
      "prerequisite_concept": "LA-KS4-C001",
      "dependent_concept": "LA-KS4-C004",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.65,
      "rationale": "Understanding the tense system of the target language supports reading comprehension of authentic texts by enabling pupils to identify when events occur, which is a prerequisite for accurate comprehension of narrative and argumentative texts."
    },
    {
      "prerequisite_concept": "LA-KS3-C002",
      "dependent_concept": "LA-KS4-C006",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "GCSE listening to authentic spoken language develops directly from KS3 extended oral communication skills, requiring the same fundamental phonological processing but at greater speed, with less pedagogical control, and with more complex comprehension tasks."
    },
    {
      "prerequisite_concept": "LA-KS3-C006",
      "dependent_concept": "LA-KS4-C007",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "GCSE extended written production and translation develops from KS3 extended writing and translation, requiring the same skills at greater length, with a wider grammatical range, across more genres, and with more demanding accuracy expectations."
    },
    {
      "prerequisite_concept": "LA-KS4-C001",
      "dependent_concept": "LA-KS4-C007",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.85,
      "rationale": "Command of the tense and aspect system is a prerequisite for GCSE extended writing, which is assessed on the range of tenses and structures used as well as their accuracy. Writing with restricted tense range cannot reach the higher grade bands regardless of other qualities."
    },
    {
      "prerequisite_concept": "LA-KS4-C002",
      "dependent_concept": "LA-KS4-C007",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.85,
      "rationale": "Grammatical accuracy and range are directly assessed in extended writing production; the range and accuracy of structures used are explicitly graded criteria. A secure grammatical foundation is therefore a direct prerequisite for high-quality extended written production."
    }
  ]
}
