{
  "metadata": {
    "subject": "Religious Studies",
    "key_stage": "KS4",
    "years_covered": [
      10,
      11
    ],
    "document_reference": "DFE-00045-2015",
    "extraction_date": "2026-02-21",
    "structure_rating": 8
  },
  "domains": [
    {
      "domain_id": "RS-KS4-D001",
      "domain_name": "Beliefs and Teachings",
      "description": "Understanding and evaluating the core beliefs, doctrines and teachings of at least two religions, including the diversity of belief within each tradition. Pupils must demonstrate knowledge of sacred texts and authoritative sources and the role they play in shaping religious belief.",
      "curriculum_context": "Beliefs and Teachings at GCSE requires a depth of theological understanding substantially beyond KS3 level. Pupils must study at least two religions in depth (commonly Christianity plus one of Islam, Judaism, Hinduism, Buddhism or Sikhism, depending on specification and centre choice) and within each religion must understand the diversity of belief and interpretation — recognising that religions are internally diverse rather than monolithic. The role of sacred texts and authoritative sources (scripture, tradition, reason, experience) in establishing and validating religious belief is a key analytical dimension. Pupils must be able to explain theological concepts with accuracy, using specialist religious vocabulary, and evaluate the significance and coherence of different beliefs from both insider and outsider perspectives.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "RS-KS4-D002",
      "domain_name": "Practices and Sources of Authority",
      "description": "Understanding and evaluating the key practices, rituals, rites of passage and forms of worship of at least two religions, and the sources of authority that govern and inform these practices, including the diversity of practice within each tradition.",
      "curriculum_context": "Religious practice at GCSE is studied in relation to the beliefs that motivate and give meaning to those practices, and in relation to the social and community functions that practices serve. Understanding the relationship between belief and practice — how theological commitments are expressed and reinforced through ritual, worship and ethical conduct — is central to this domain. Sources of authority (scripture, tradition, religious leadership, community, personal experience) vary significantly between and within religions, and pupils must understand how authority structures operate and how they are contested. The diversity of practice within traditions (e.g. Orthodox vs Progressive Judaism; Catholic vs Protestant Christianity; Sunni vs Shi'a Islam) is an important dimension that prevents oversimplified characterisations.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "RS-KS4-D003",
      "domain_name": "Religion and Ethics",
      "description": "Understanding, applying and evaluating ethical frameworks derived from religious traditions and secular ethical theories in relation to contemporary moral issues. Pupils must demonstrate the ability to construct and evaluate ethical arguments using religious and non-religious perspectives.",
      "curriculum_context": "Ethics at GCSE Religious Studies occupies a significant portion of the specification, requiring pupils to engage with a range of contemporary moral issues — including medical ethics (abortion, euthanasia, genetic engineering), crime and punishment, war and peace, equality and justice, environmental ethics and sexual ethics — from multiple religious and secular perspectives. Pupils must not simply describe what different religions say about ethical issues but must evaluate the reasoning underlying those positions, assessing the coherence, consistency and adequacy of different ethical frameworks. Key ethical frameworks — Natural Law, Situation Ethics, Utilitarianism, Kantian ethics — provide a structured basis for comparison with religious approaches. The development of pupils' own reasoned positions, supported by evidence and argument, is also required.",
      "is_cross_cutting": false,
      "structure_type": "process"
    },
    {
      "domain_id": "RS-KS4-D004",
      "domain_name": "Religion and Society",
      "description": "Understanding the relationship between religion and broader social, political and cultural life, including issues of religious identity and expression, the relationship between religion and the state, religious plurality and interfaith dialogue, and the changing role of religion in society.",
      "curriculum_context": "Religion and Society at GCSE addresses the lived social reality of religion in contemporary Britain and globally, moving beyond the doctrinal and ethical to consider the sociological, political and cultural dimensions of religious life. Topics typically include: the relationship between religion and science (creation and evolution; religious interpretations of scientific findings; the nature of religious and scientific truth claims); equality and discrimination (gender, race, disability, sexual orientation in religious context); religion and the state (religious law, secularism, faith schools, public expression of religion); and interfaith relations (dialogue, cooperation, conflict). These topics require pupils to understand multiple perspectives and to evaluate arguments about the appropriate role of religion in pluralistic societies.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    }
  ],
  "objectives": [
    {
      "objective_id": "RS-KS4-O001",
      "domain_id": "RS-KS4-D001",
      "objective_text": "demonstrate knowledge and understanding of the beliefs, teachings and practices of at least two religions",
      "non_statutory_guidance": "At least one religion studied must be Christianity. The second religion must be selected from Islam, Judaism, Hinduism, Buddhism or Sikhism.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "RS-KS4-O002",
      "domain_id": "RS-KS4-D001",
      "objective_text": "understand the diversity of belief and interpretation within each religion studied, and the role of sacred texts and sources of authority in shaping and justifying belief",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "RS-KS4-O003",
      "domain_id": "RS-KS4-D001",
      "objective_text": "use specialist religious vocabulary accurately to describe and explain theological concepts",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "RS-KS4-O004",
      "domain_id": "RS-KS4-D002",
      "objective_text": "demonstrate knowledge and understanding of the key practices, rituals and forms of worship of at least two religions and the sources of authority that govern them",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "RS-KS4-O005",
      "domain_id": "RS-KS4-D002",
      "objective_text": "explain how religious beliefs and teachings are expressed through practice, and evaluate the significance of practice for believers",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "RS-KS4-O006",
      "domain_id": "RS-KS4-D003",
      "objective_text": "apply religious and ethical frameworks to contemporary moral issues, explaining and evaluating the reasoning behind different ethical positions",
      "non_statutory_guidance": null,
      "examples": "Medical ethics (abortion, euthanasia), crime and punishment, war and peace, environmental ethics, sexual ethics.",
      "is_statutory": true
    },
    {
      "objective_id": "RS-KS4-O007",
      "domain_id": "RS-KS4-D003",
      "objective_text": "construct and evaluate ethical arguments, including consideration of non-religious ethical perspectives alongside religious ones",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "RS-KS4-O008",
      "domain_id": "RS-KS4-D003",
      "objective_text": "demonstrate knowledge of key ethical theories and their relationship to religious approaches to ethics",
      "non_statutory_guidance": null,
      "examples": "Utilitarianism, Natural Law, Situation Ethics, Kantian ethics.",
      "is_statutory": true
    },
    {
      "objective_id": "RS-KS4-O009",
      "domain_id": "RS-KS4-D004",
      "objective_text": "understand the relationship between religion and society, including issues of equality, discrimination, the relationship between religion and the state, and religious plurality",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "RS-KS4-O010",
      "domain_id": "RS-KS4-D004",
      "objective_text": "evaluate arguments about the appropriate relationship between religion and science, including the nature of religious and scientific truth claims",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "RS-KS4-O011",
      "domain_id": "RS-KS4-D001",
      "objective_text": "evaluate the significance of beliefs and teachings for individuals and communities, and their coherence with lived religious experience",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "RS-KS4-O012",
      "domain_id": "RS-KS4-D004",
      "objective_text": "understand and evaluate different perspectives on interfaith dialogue, religious pluralism and the claims of different religions to truth",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "RS-KS4-C001",
      "domain_id": "RS-KS4-D001",
      "concept_name": "Theological Belief and Doctrine",
      "description": "Theological belief encompasses the structured system of doctrines — formally established and authoritative teachings — that characterise a religious tradition's understanding of ultimate reality, the human condition, ethical obligation and salvation or liberation. At GCSE, pupils must understand core doctrines of each religion studied (e.g. the Christian doctrines of the Trinity, Incarnation, Atonement and Resurrection; the Islamic doctrines of Tawhid, prophethood and the Day of Judgement; the Jewish concepts of covenant, Torah and mitzvot) with sufficient theological depth to explain their significance for believers and evaluate their coherence. The diversity of belief within traditions — denomination, sect, movement — must also be understood.",
      "teaching_guidance": "Teach theological concepts with precision and appropriate specialist vocabulary. Develop pupils' ability to explain theological ideas from an informed, empathetic perspective (AT1) before evaluating their significance and coherence (AT2). Use primary source texts (scripture, creeds, catechisms) to connect doctrinal teaching to authoritative sources. Develop understanding of theological diversity within traditions: how do Catholic and Protestant Christians differ on Atonement? How do Sunni and Shi'a Muslims differ on religious authority? For examination responses, practise structuring answers that move from accurate description of a belief, through explanation of its significance for believers, to evaluation of its coherence and importance. Develop pupils' ability to use specialist vocabulary — grace, salvation, covenant, dharma, karma, ummah, mitzvot — accurately and appropriately.",
      "key_vocabulary": "doctrine, theology, Trinity, Incarnation, Atonement, Resurrection, Tawhid, covenant, mitzvot, dharma, karma, nirvana, samsara, salvation, liberation",
      "common_misconceptions": "Pupils frequently present religions as homogeneous, ignoring significant internal diversity; developing understanding of denominational and sectarian differences prevents oversimplification. The distinction between description of a belief and evaluation of its significance is often missed; pupils describe what believers believe without explaining what difference those beliefs make to how they live and understand their world. The idea that theological claims can be assessed by the same criteria as empirical claims misunderstands the nature of religious knowledge; developing pupils' understanding of different types of truth claims is important for mature engagement with religious studies.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "teaching_weight": 6,
      "co_teach_hints": []
    },
    {
      "concept_id": "RS-KS4-C002",
      "domain_id": "RS-KS4-D003",
      "concept_name": "Ethical Frameworks and Moral Reasoning",
      "description": "Ethical frameworks are systematic approaches to moral reasoning that provide structured methods for determining right and wrong action. Key frameworks studied at GCSE include: Utilitarianism (the greatest happiness principle — the right action maximises overall welfare); Natural Law (moral rules derived from human nature and rational reflection, associated with Aquinas and used in Catholic moral theology); Situation Ethics (the primacy of agape — unconditional love — over fixed rules, associated with Joseph Fletcher); and Kantian ethics (the categorical imperative — act only on principles you could will to be universal laws). Religious ethical approaches draw on and extend these frameworks, often with the addition of divine command, scriptural guidance and community tradition as sources of moral authority.",
      "teaching_guidance": "Introduce each ethical framework through a concrete case study before teaching its principles and structure. Develop pupils' ability to apply frameworks consistently: given this ethical framework, what conclusion does it reach about this issue and why? Practise comparing frameworks: how does a utilitarian approach to abortion differ from a Natural Law approach? Develop understanding of the relationship between religious and secular ethical frameworks: how does Christian ethics relate to Natural Law? How does Islamic ethics relate to divine command theory? For examination responses, practise the four-mark 'explain two...' format and the twelve-mark extended evaluative response using the formula: present multiple perspectives, evaluate each with reasoning, reach a justified conclusion while acknowledging counter-arguments.",
      "key_vocabulary": "Utilitarianism, Natural Law, Situation Ethics, Kantian ethics, categorical imperative, agape, divine command, sanctity of life, human dignity, conscience, moral relativism, absolute, relative, teleological, deontological",
      "common_misconceptions": "Pupils often confuse 'situation ethics' as an approach (making ethical decisions based on circumstances and love) with situational relativism (the view that all moral judgements are relative); Situation Ethics is in fact a principled framework, not an anything-goes relativism. The difference between teleological ethical theories (judged by outcomes — Utilitarianism) and deontological theories (judged by the nature of the act — Kant, Natural Law) is a fundamental distinction that structures much of ethical debate; developing this distinction early prevents conflation. Students may think that religious ethics simply means 'following what religion says' without understanding the sophisticated ethical reasoning that characterises most religious moral traditions.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "teaching_weight": 5,
      "co_teach_hints": []
    },
    {
      "concept_id": "RS-KS4-C003",
      "domain_id": "RS-KS4-D001",
      "concept_name": "Scriptural Authority and Sources of Moral Guidance",
      "description": "Scriptural authority refers to the status and weight given to sacred texts as a source of religious knowledge, moral guidance and spiritual insight. Different religious traditions hold their scriptures in different relationships to divine authority: some traditions regard scripture as the direct, unmediated word of God (Muslim understanding of the Qur'an; some Protestant understandings of the Bible); others regard scripture as divinely inspired but humanly mediated (mainstream Christian view of the Bible); others regard texts as records of enlightened teaching rather than divine revelation (Theravada Buddhism). Beyond scripture, religious moral guidance is drawn from tradition (the accumulated wisdom of the community over time), reason (rational reflection on moral principles) and experience (personal and communal encounter with the divine or the transcendent).",
      "teaching_guidance": "Teach the concept of scriptural authority carefully, avoiding the assumption that all religions relate to their texts in the same way. Develop pupils' understanding of the hermeneutic question: how should scripture be interpreted? What role do context, tradition, reason and experience play in interpretation? Use specific examples of how different religious communities interpret the same text differently to illustrate the hermeneutic diversity within traditions. For examination questions about sources of authority, develop precise responses that specify the source, explain how it functions as authority, and evaluate the significance and limitations of that source. Develop understanding of the relationship between the four sources (scripture, tradition, reason, experience) as a framework for comparing religious approaches.",
      "key_vocabulary": "scripture, revelation, inspiration, authority, Qur'an, Bible, Torah, Hadith, tradition, hermeneutics, interpretation, literalist, liberal, contextual, canonical",
      "common_misconceptions": "The assumption that all religious people read their scriptures literally is incorrect; most religious traditions have rich traditions of allegorical, typological and contextual interpretation. Students may not understand the difference between a text being authoritative (carrying weight in moral reasoning) and being read literally (taken at face value in its plain meaning). The relationship between scripture and tradition is complex in many religious traditions; in Catholicism, for example, tradition is a co-equal source of revelation alongside scripture, which is quite different from the Protestant 'scripture alone' position.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "RS-KS4-C004",
      "domain_id": "RS-KS4-D004",
      "concept_name": "Religious Pluralism and Interfaith Dialogue",
      "description": "Religious pluralism refers to the coexistence of multiple religious traditions within a society, and to the theological question of how different religions relate to each other's claims to truth and salvation. Three theological positions are commonly distinguished: exclusivism (one religion alone has saving truth); inclusivism (one religion is normatively true, but other religions may participate in that truth imperfectly); and pluralism (all major religions are different but equally valid paths to the same ultimate reality or goal). Interfaith dialogue refers to structured conversation between representatives of different religious traditions, aiming at mutual understanding, cooperation and in some cases theological convergence. Issues of religious identity, community cohesion and the limits of tolerance are also addressed in this domain.",
      "teaching_guidance": "Develop pupils' understanding of the three positions on religious pluralism through specific religious examples: traditional Catholic inclusivism; exclusivist strands in Protestant Christianity and Salafi Islam; philosophical pluralism associated with John Hick. Avoid presenting pluralism as the obviously correct or more enlightened position; all three positions have sophisticated theological defences and genuine challenges. Develop understanding of interfaith dialogue through concrete examples: the Council of Christians and Jews; the Christian-Muslim Forum; Scriptural Reasoning. For examination questions on religious plurality, practise structured responses that acknowledge multiple perspectives without collapsing into relativism. Develop pupils' ability to distinguish between political tolerance (respecting others' rights to hold different beliefs) and theological pluralism (believing all religions are equally valid).",
      "key_vocabulary": "pluralism, exclusivism, inclusivism, interfaith dialogue, tolerance, religious identity, diversity, secular, ecumenism, truth claim, salvation, enlightenment, community cohesion, relativism, syncretism",
      "common_misconceptions": "The conflation of religious tolerance (a political commitment) with religious relativism (a theological position) is extremely common; developing the distinction prevents serious misunderstanding of what religious tolerance requires. The assumption that interfaith dialogue necessarily involves compromising one's own beliefs is incorrect; dialogue can be conducted from a position of firm conviction. Students may assume that secular liberal societies are neutral between religious positions, not understanding that secularism itself embodies a specific set of commitments about the proper relationship between religion and public life.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": true,
      "teaching_weight": 5,
      "co_teach_hints": []
    },
    {
      "concept_id": "RS-KS4-C005",
      "domain_id": "RS-KS4-D003",
      "concept_name": "Sanctity of Life and Human Dignity",
      "description": "The sanctity of life is the principle that all human life has intrinsic and inviolable value, typically grounded in religious claims about the divine origin or purpose of human life. In Christian, Jewish and Islamic thought, human life is sacred because humans are created in the image of God (imago Dei in Christianity and Judaism; khalifah — stewardship — in Islam). The concept of human dignity is the secular philosophical correlate, grounding the inviolable value of persons in their rational nature (Kantian) or their capacity for experience and relationship. Both principles generate strong prima facie obligations not to take human life and are invoked in ethical debates about abortion, euthanasia, capital punishment, war, genetic engineering and suicide.",
      "teaching_guidance": "Teach the sanctity of life principle with precision: what does it claim, on what grounds, and what does it require? Develop understanding of how the principle functions differently in different religious traditions and how it generates different conclusions in specific cases. Apply the principle to a range of ethical case studies: how does the sanctity of life principle bear on the ethics of abortion (from when does human life acquire full value?)? On euthanasia (does sanctity of life require that life be prolonged in all circumstances?)? On war (how can the killing of enemies be reconciled with the sanctity of their lives?)? For examination responses, develop the ability to explain the principle, apply it to a specific issue, consider objections (including religious objections from within the tradition) and evaluate its adequacy.",
      "key_vocabulary": "sanctity of life, imago Dei, human dignity, inviolable, intrinsic value, abortion, euthanasia, capital punishment, stewardship, quality of life, personhood, viability, proportionality, just war, rights",
      "common_misconceptions": "Students often present the sanctity of life as an absolute prohibition on killing in all circumstances, not understanding that most religious traditions have developed sophisticated accounts of exceptional circumstances (just war theory; capital punishment in some traditions; self-defence). The distinction between the sanctity of life as a principle and quality of life as an alternative framework for medical ethics is frequently confused; both principles need to be understood on their own terms. The assumption that the sanctity of life principle is exclusively religious ignores the secular philosophical tradition of human dignity grounded in Kantian ethics and human rights theory.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": true,
      "teaching_weight": 5,
      "co_teach_hints": []
    },
    {
      "concept_id": "RS-KS4-C006",
      "domain_id": "RS-KS4-D002",
      "concept_name": "Religious Practices, Worship and Sources of Authority",
      "description": "Religious practices are the ritualised actions, ceremonies, forms of worship and rites of passage through which believers express and enact their faith, build community and mark significant life events. These include collective worship (prayer, services, ceremonies), individual devotional practices (meditation, private prayer, fasting), rites of passage (birth ceremonies, coming of age rituals, marriage, death rites) and seasonal observances and festivals. Sources of authority are the texts, institutions, leaders and traditions that give guidance on how adherents should believe and practise: these may include sacred scriptures, religious leaders (priests, imams, rabbis), councils and institutions, and the accumulated tradition of the faith community. At GCSE, pupils study practices and authority in at least two religions, comparing how different traditions approach these questions and examining the diversity of practice within each tradition.",
      "teaching_guidance": "Teach practices and authority together, since practices are typically justified by and governed through specific sources of authority. For each religion studied, develop understanding of the specific practices, their meaning and purpose for believers, their scriptural or traditional basis, and the diversity of practice across denominations, sects and individual believers. Use primary sources: video of worship, interviews with believers, visits to places of worship. Avoid stereotyping by showing the diversity within religious traditions: a Christian service in a charismatic evangelical church differs profoundly from a High Anglican Eucharist. Develop pupils' understanding that religious practices are not merely external performances but expressions of belief, identity and community. For GCSE evaluation questions, develop the ability to assess whether religious practice remains significant in contemporary secular societies.",
      "key_vocabulary": "worship, prayer, ritual, ceremony, rite of passage, devotion, pilgrimage, festival, sacrament, scripture, authority, tradition, denomination, diversity, practitioner, observance",
      "common_misconceptions": "Pupils may treat religious practices as mere superstition or performance without engaging with their meaning and significance for believers; developing empathetic understanding from within the tradition, while maintaining analytical distance, produces more respectful and accurate analysis. The diversity of practice within religions is frequently overlooked, leading to essentialised portrayals where all Muslims pray identically or all Christians hold the same beliefs; systematic attention to diversity prevents stereotyping. Pupils may confuse the source of authority with its content: the Bible as a source of authority raises different questions from the teachings it contains.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "RS-KS4-C001",
      "dependent_concept": "RS-KS4-C003",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.85,
      "rationale": "Understanding the content of theological beliefs is prerequisite to understanding how sacred texts function as authoritative sources for those beliefs: the relationship between scripture and doctrine can only be understood if the doctrinal content is already known."
    },
    {
      "prerequisite_concept": "RS-KS4-C002",
      "dependent_concept": "RS-KS4-C005",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.9,
      "rationale": "The sanctity of life concept is applied through ethical frameworks: understanding Natural Law, divine command and utilitarian approaches is prerequisite to applying them coherently to cases like abortion and euthanasia where sanctity of life is at stake."
    },
    {
      "prerequisite_concept": "RS-KS4-C001",
      "dependent_concept": "RS-KS4-C004",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.75,
      "rationale": "Understanding what each religion actually believes is prerequisite to evaluating the relationship between different religions' truth claims and the question of religious pluralism: pluralism debates presuppose knowledge of what the respective traditions teach."
    },
    {
      "prerequisite_concept": "RS-KS4-C003",
      "dependent_concept": "RS-KS4-C002",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.7,
      "rationale": "Understanding sources of religious moral authority (scripture, tradition, reason, experience) is necessary background for understanding how religious ethical frameworks are derived and justified: the grounding of religious ethics in authoritative sources shapes its character."
    },
    {
      "prerequisite_concept": "RS-KS4-C002",
      "dependent_concept": "RS-KS4-C004",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.65,
      "rationale": "Engagement with religious pluralism at a theologically sophisticated level requires understanding of the ethical dimensions of religious coexistence, including the ethics of tolerance, dialogue and respect for religious difference."
    },
    {
      "prerequisite_concept": "RS-KS4-C001",
      "dependent_concept": "RS-KS4-C006",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.85,
      "rationale": "Theological beliefs are the foundation for religious practices: understanding what a tradition believes about the nature of God, humanity and salvation is prerequisite to understanding why specific practices take the forms they do and what sources of authority are considered valid within that tradition."
    }
  ]
}
