{
  "metadata": {
    "subject": "Design and Technology",
    "key_stage": "KS2",
    "years_covered": [
      3,
      4,
      5,
      6
    ],
    "document_reference": "DFE-00172-2013",
    "extraction_date": "2026-02-17",
    "structure_rating": 8
  },
  "domains": [
    {
      "domain_id": "DT-KS2-D001",
      "domain_name": "Design",
      "description": "Using research and design criteria to generate and communicate ideas for innovative, functional and appealing products using advanced representations including annotated sketches, diagrams and computer-aided design.",
      "curriculum_context": "At KS2, the design domain requires pupils to conduct research to understand user needs and to use that research to inform the development of design criteria. Pupils move beyond simple drawing to use annotated sketches, cross-sectional and exploded diagrams, prototypes, pattern pieces and computer-aided design as communication tools. The progression from KS1 is marked by the introduction of research, the explicit consideration of specific target users or groups, and the use of more sophisticated visual communication methods. Pupils learn that effective design is evidence-based and user-centred, and that design ideas need to be communicated clearly enough to be made by others.",
      "is_cross_cutting": false,
      "structure_type": "process"
    },
    {
      "domain_id": "DT-KS2-D002",
      "domain_name": "Make",
      "description": "Selecting from and accurately using a wider range of tools, equipment and materials including those with specific functional properties and aesthetic qualities.",
      "curriculum_context": "The make domain at KS2 extends pupils' practical skills to include more complex tools, equipment and processes, and introduces the concept of accuracy as a design requirement. Pupils select from a wider range of materials considering both their functional properties (strength, flexibility, conductivity) and their aesthetic qualities (colour, texture, pattern), demonstrating more sophisticated material knowledge. The emphasis on accuracy reflects the increased complexity of KS2 products and the expectation that pupils can execute their designs with precision. Practical skills are developed in the context of purposeful making across different material areas.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "DT-KS2-D003",
      "domain_name": "Evaluate",
      "description": "Investigating and analysing existing products, evaluating their own work against design criteria, considering others' views, and understanding how key events and individuals have shaped design and technology.",
      "curriculum_context": "The evaluate domain at KS2 becomes more analytically rigorous, requiring pupils to investigate and analyse existing products in depth. Pupils evaluate their own work against design criteria and also consider the views of others, introducing the concept of user feedback as part of the design process. A distinctive addition at KS2 is the requirement to understand how key events and individuals in design and technology have helped shape the world, giving pupils historical and cultural perspective on the subject. This domain develops pupils' ability to think critically about products, processes and the broader impact of design and technology on society.",
      "is_cross_cutting": false,
      "structure_type": "process"
    },
    {
      "domain_id": "DT-KS2-D004",
      "domain_name": "Technical Knowledge",
      "description": "Understanding and applying principles of structural engineering, mechanical and electrical systems, and computing control in the design and making of complex products.",
      "curriculum_context": "Technical knowledge at KS2 becomes substantially more complex, building on KS1 structural and mechanical exploration to include electrical systems and computing control. Pupils apply understanding of how to strengthen, stiffen and reinforce complex structures, and learn to use mechanical systems including gears, pulleys, cams, levers and linkages. The introduction of electrical systems - series circuits incorporating switches, bulbs, buzzers and motors - enables pupils to create products with active components. The requirement to apply understanding of computing to program, monitor and control products connects design and technology to the computing curriculum and introduces pupils to the principle of embedded intelligence in designed objects.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "DT-KS2-D005",
      "domain_name": "Cooking and Nutrition",
      "description": "Understanding and applying the principles of a healthy and varied diet through cooking and learning about seasonality and ingredient sources.",
      "curriculum_context": "At KS2, the cooking and nutrition domain deepens pupils' knowledge of nutrition and their practical cooking skills. Pupils understand and apply the principles of a healthy and varied diet to make informed food choices, and they prepare and cook a variety of predominantly savoury dishes using a range of cooking techniques. Understanding seasonality is introduced, helping pupils to connect food production to environmental and agricultural cycles and to understand why certain foods are only available at certain times of year. Knowledge of where and how ingredients are grown, reared, caught and processed gives pupils a more complete picture of the food system from production to consumption.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    }
  ],
  "objectives": [
    {
      "objective_id": "DT-KS2-O001",
      "domain_id": "DT-KS2-D001",
      "objective_text": "use research and develop design criteria to inform the design of innovative, functional, appealing products that are fit for purpose, aimed at particular individuals or groups",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS2-O002",
      "domain_id": "DT-KS2-D001",
      "objective_text": "generate, develop, model and communicate their ideas through discussion, annotated sketches, cross-sectional and exploded diagrams, prototypes, pattern pieces and computer-aided design",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS2-O003",
      "domain_id": "DT-KS2-D002",
      "objective_text": "select from and use a wider range of tools and equipment to perform practical tasks [for example, cutting, shaping, joining and finishing], accurately",
      "non_statutory_guidance": null,
      "examples": "cutting, shaping, joining and finishing",
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS2-O004",
      "domain_id": "DT-KS2-D002",
      "objective_text": "select from and use a wider range of materials and components, including construction materials, textiles and ingredients, according to their functional properties and aesthetic qualities",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS2-O005",
      "domain_id": "DT-KS2-D003",
      "objective_text": "investigate and analyse a range of existing products",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS2-O006",
      "domain_id": "DT-KS2-D003",
      "objective_text": "evaluate their ideas and products against their own design criteria and consider the views of others to improve their work",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS2-O007",
      "domain_id": "DT-KS2-D003",
      "objective_text": "understand how key events and individuals in design and technology have helped shape the world",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS2-O008",
      "domain_id": "DT-KS2-D004",
      "objective_text": "apply their understanding of how to strengthen, stiffen and reinforce more complex structures",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS2-O009",
      "domain_id": "DT-KS2-D004",
      "objective_text": "understand and use mechanical systems in their products [for example, gears, pulleys, cams, levers and linkages]",
      "non_statutory_guidance": null,
      "examples": "gears, pulleys, cams, levers and linkages",
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS2-O010",
      "domain_id": "DT-KS2-D004",
      "objective_text": "understand and use electrical systems in their products [for example, series circuits incorporating switches, bulbs, buzzers and motors]",
      "non_statutory_guidance": null,
      "examples": "series circuits incorporating switches, bulbs, buzzers and motors",
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS2-O011",
      "domain_id": "DT-KS2-D004",
      "objective_text": "apply their understanding of computing to program, monitor and control their products",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS2-O012",
      "domain_id": "DT-KS2-D005",
      "objective_text": "understand and apply the principles of a healthy and varied diet",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS2-O013",
      "domain_id": "DT-KS2-D005",
      "objective_text": "prepare and cook a variety of predominantly savoury dishes using a range of cooking techniques",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS2-O014",
      "domain_id": "DT-KS2-D005",
      "objective_text": "understand seasonality, and know where and how a variety of ingredients are grown, reared, caught and processed",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "DT-KS2-C006",
      "domain_id": "DT-KS2-D002",
      "concept_name": "Accurate Making and Material Processing",
      "description": "Accurate making refers to the ability to execute practical tasks — measuring, marking out, cutting, shaping, joining and finishing — with precision so that a product matches the design intention and meets functional requirements. At KS2, pupils develop accuracy as a deliberate goal, understanding that imprecise making produces products that do not work correctly or are of poor quality. Material processing knowledge — understanding how different materials respond to cutting, bending, folding, sewing or mixing — enables pupils to select and apply the most effective technique for the material and task at hand.",
      "teaching_guidance": "Teach measuring and marking out as essential precursors to cutting: measure twice, cut once. Provide opportunities to practise cutting accurately to a marked line with different tools on different materials. Introduce the concept of tolerance: how close to the intended dimension does a measurement need to be for the product to function? Compare products made with and without careful measuring to demonstrate the importance of accuracy. Develop vocabulary for processing different materials: score and fold (card), cut and sew (fabric), chop and mix (food), drill and screw (wood and plastic).",
      "key_vocabulary": "accuracy, measure, mark out, cut, shape, join, finish, tolerance, material, process, technique, precision, tool, equipment, quality",
      "common_misconceptions": "Pupils may rush the measuring and marking stage, leading to cumulative inaccuracies in the finished product. Establishing that time spent measuring carefully is recovered by avoiding mistakes during making is an important lesson. Some pupils equate more material or more joins with a stronger or better product, rather than understanding that precision in fewer, well-executed joins is more effective.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "DT-KS2-C007",
      "domain_id": "DT-KS2-D002",
      "concept_name": "Functional and Aesthetic Material Properties",
      "description": "Materials have both functional properties — characteristics that determine how they perform in use, such as strength, flexibility, conductivity and waterproofness — and aesthetic properties — characteristics that determine how they appear and feel, such as colour, texture, pattern, translucency and surface quality. At KS2, pupils learn to consider both dimensions when selecting materials for a design task, understanding that a material must be both functionally suitable and appropriately appealing for the product to succeed. This concept extends KS1 material knowledge by making the functional/aesthetic distinction explicit.",
      "teaching_guidance": "Present materials selection tasks that require pupils to balance functional and aesthetic considerations: a container for a child's lunchbox must be both waterproof and visually appealing. Develop systematic material analysis using both dimensions as headings. Discuss real products where functional and aesthetic considerations are in tension — why is medical equipment often plain white rather than brightly coloured? Practise explaining material choices in terms of both functional performance and aesthetic suitability. Investigate how surface finishing techniques can modify aesthetic properties without changing functional ones.",
      "key_vocabulary": "functional, aesthetic, property, material, strength, flexibility, conductivity, waterproof, texture, colour, pattern, translucent, opaque, surface, finish",
      "common_misconceptions": "Pupils may select materials primarily for their aesthetics (choosing the prettiest fabric) without considering functional requirements. They may also go to the opposite extreme and choose only on functional grounds, producing products that work but are unappealing. Teaching that effective material selection balances both dimensions addresses either tendency.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "DT-KS2-C008",
      "domain_id": "DT-KS2-D003",
      "concept_name": "Product Investigation and Analysis",
      "description": "Product investigation involves systematically examining existing products to understand their purpose, intended users, materials, construction methods, mechanisms, aesthetics and how successfully they fulfil their design intent. At KS2, investigation is more structured and analytical than at KS1: pupils use frameworks to compare products, consider both strengths and limitations, and relate findings to their own design work. Understanding how existing products solve design problems is a valuable source of design inspiration and technical knowledge.",
      "teaching_guidance": "Provide a range of products for pupils to disassemble, examine and discuss. Use a consistent analytical framework: purpose, user, materials, construction, mechanisms, aesthetics, fitness for purpose, cost, sustainability. Encourage comparison between similar products: how does product A solve the problem differently from product B? Connect product analysis to design: what can we learn from this product that will inform our own design? Invite pupils to evaluate how well each product meets its intended purpose and to suggest improvements. Use products from different periods and cultures to build historical and cultural awareness.",
      "key_vocabulary": "investigate, analyse, existing product, purpose, user, material, construction, mechanism, aesthetic, fitness for purpose, evaluate, compare, strength, limitation, improvement",
      "common_misconceptions": "Pupils may describe products superficially (colour, size, shape) without analysing function, materials or construction. Teaching structured analytical frameworks develops deeper investigation. Some pupils equate 'analyse' with criticise; framing investigation as learning from the solutions others have found is more productive and more accurate.",
      "concept_type": "process",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "DT-KS2-C009",
      "domain_id": "DT-KS2-D003",
      "concept_name": "History and Influence of Design and Technology",
      "description": "Design and technology has been shaped by key individuals, inventions, events and movements that have transformed how people live, work and communicate. Understanding the historical development of design and technology — from Isambard Kingdom Brunel's engineering to the Apple Macintosh, from the spinning jenny to the Internet — gives pupils perspective on design as a human activity with cultural significance and social impact. At KS2, pupils are introduced to significant moments and people in the history of design and technology and consider how these have influenced the products and systems we use today.",
      "teaching_guidance": "Introduce significant figures in design and technology history with a focus on the problems they were solving and how their solutions changed the world. Connect historical design to contemporary products: how is a modern bridge or bicycle derived from earlier designs? Use timelines to situate developments in historical context. Investigate how design and technology reflects the values and needs of different historical periods. Discuss how design has also created problems: pollution, obsolescence, inequality — alongside its benefits.",
      "key_vocabulary": "history, inventor, innovation, influence, designer, engineer, industrial revolution, patent, legacy, technology, development, impact, society, culture, evolution",
      "common_misconceptions": "Pupils may think of design and technology history as a simple story of progress from primitive to advanced. Understanding that design always reflects its cultural context, and that some past innovations created new problems, gives a more nuanced picture. Pupils may not understand the difference between invention (creating something new) and innovation (improving or applying existing ideas); most design and technology history involves both.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_weight": 2,
      "co_teach_hints": [
        "DT-KS2-C008"
      ]
    },
    {
      "concept_id": "DT-KS2-C010",
      "domain_id": "DT-KS2-D005",
      "concept_name": "Cooking Techniques and Food Preparation",
      "description": "Cooking techniques are the methods used to prepare and transform food ingredients into dishes: chopping, peeling, grating, mixing, boiling, baking, frying, steaming and so on. Each technique requires specific skills and tools and produces different effects on the food in terms of flavour, texture, colour and nutritional content. At KS2, pupils learn a range of predominantly savoury cooking techniques and apply them to prepare dishes that are balanced, nutritious and appropriately presented. Practical cooking competence supports pupils' ability to feed themselves and others a healthy diet.",
      "teaching_guidance": "Teach cooking techniques progressively, adding complexity as pupils develop competence. Practise knife skills, food hygiene and safety procedures consistently. Connect cooking to design and technology through the design-make-evaluate cycle: plan a dish, cook it, evaluate it. Discuss how different cooking methods affect the same ingredient: what happens to an onion when it is raw, fried, boiled or roasted? Make predominantly savoury dishes to reflect the curriculum emphasis, covering a range of cooking methods across different projects.",
      "key_vocabulary": "technique, cook, prepare, ingredient, chop, mix, boil, bake, fry, steam, blend, season, hygiene, safety, nutrition, recipe",
      "common_misconceptions": "Pupils may think that only baking counts as cooking, missing the wide range of cooking methods available. Broadening experience across different techniques challenges this assumption. Food hygiene may seem less interesting than cooking itself; making clear connections between specific hygiene practices and specific risks (cross-contamination, bacteria growth) makes the rationale concrete.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "DT-KS2-C011",
      "domain_id": "DT-KS2-D005",
      "concept_name": "Seasonality and Ingredient Sourcing",
      "description": "Seasonality refers to the natural cycles by which different foods are available at different times of year. Seasonal ingredients are typically fresher, more nutritious, more economical and have a lower environmental impact because they require less energy-intensive production or long-distance transport. Understanding where and how ingredients are grown, reared, caught and processed — from field to fork — connects pupils to the food system and to issues of environmental and social sustainability in food production.",
      "teaching_guidance": "Create a seasonal food calendar with pupils, investigating when different fruits and vegetables are in season in the UK. Compare seasonal and out-of-season produce in terms of cost, flavour and food miles. Investigate a food product from shop shelf back to its origin: where was it grown, how was it transported, what processes did it go through? Visit a farm, market or food producer if possible. Cook seasonal dishes using locally sourced ingredients to demonstrate seasonal eating in practice. Connect to science through plant growth cycles and geography through food trade routes.",
      "key_vocabulary": "season, seasonal, local, imported, food miles, grow, rear, catch, process, harvest, origin, supply chain, sustainability, fresh, organic",
      "common_misconceptions": "Pupils may not realise that many supermarket products are available year-round because they are imported from other countries or grown in heated greenhouses, both of which have environmental costs. Pupils may equate 'imported' with 'worse' without understanding the complex trade-offs involved; nuanced discussion is more valuable than simple judgements.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": [
        "DT-KS2-C010"
      ]
    },
    {
      "concept_id": "DT-KS2-C001",
      "domain_id": "DT-KS2-D001",
      "concept_name": "Research-Informed Design",
      "description": "At KS2, effective design is grounded in research that identifies the needs, preferences and constraints relevant to a product. Research may involve interviewing potential users, examining existing products, investigating materials, or exploring relevant contexts. The findings from research are used to develop design criteria that shape the design process and provide the basis for evaluation.",
      "teaching_guidance": "Teach pupils to conduct structured research before designing - this could include interviews with target users, surveys, product analysis or contextual investigation. Model how to translate research findings into design criteria. Show examples of real product development processes where research has informed design. Provide structured templates that connect research findings to design decisions. Discuss what makes a product 'fit for purpose' in terms of user needs.",
      "key_vocabulary": "research, user need, target user, design brief, design criteria, fit for purpose, context, investigate, analyse, inform",
      "common_misconceptions": "Pupils may begin designing before completing meaningful research. Establishing the design brief and research phase as required steps prevents this. Some pupils conflate research with simply looking at existing products without identifying specific needs or constraints.",
      "concept_type": "process",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "DT-KS2-C002",
      "domain_id": "DT-KS2-D001",
      "concept_name": "Technical Drawing and Design Communication",
      "description": "Technical drawing involves representing design ideas using conventions that communicate information about how a product looks, how it is constructed and how its parts relate to each other. At KS2, pupils learn to use annotated sketches, cross-sectional diagrams, exploded diagrams, pattern pieces and computer-aided design to communicate their ideas clearly and accurately to others who will make or evaluate the product.",
      "teaching_guidance": "Teach specific drawing conventions including labelling, dimensioning and cross-sections. Practice exploded diagrams to show how components fit together. Introduce appropriate computer-aided design tools for generating and presenting design ideas. Discuss why designers need to communicate their ideas clearly to others, such as when a design is made by someone other than the designer. Compare technical drawings with artistic drawings to highlight different purposes.",
      "key_vocabulary": "annotated sketch, cross-section, exploded diagram, prototype, pattern piece, computer-aided design, dimension, label, scale, proportion",
      "common_misconceptions": "Pupils may treat all drawing in DT as artistic expression rather than technical communication. Establishing that technical drawing has specific conventions and purposes helps. Some pupils may find exploded and cross-sectional diagrams conceptually challenging; building up from physical disassembly of real objects helps develop the mental model.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "DT-KS2-C003",
      "domain_id": "DT-KS2-D004",
      "concept_name": "Advanced Mechanical Systems",
      "description": "Mechanical systems use physical components to transmit, redirect or transform motion and force. At KS2, pupils extend their KS1 knowledge of levers, sliders and wheels to include gears, pulleys, cams and linkages, understanding how these more complex mechanisms change the speed, direction and type of movement in a product. Pupils apply this knowledge by incorporating appropriate mechanisms into their own designed products.",
      "teaching_guidance": "Use construction kits with gear systems to explore how gear ratios affect speed. Investigate pulley systems to explore how they multiply force. Examine cams of different shapes and how they produce different patterns of movement. Study real products that use these mechanisms - clocks, bicycles, engines. Challenge pupils to design products that require a specific type of movement and to select an appropriate mechanism to achieve it.",
      "key_vocabulary": "gear, pulley, cam, linkage, lever, rotation, linear motion, oscillation, gear ratio, input motion, output motion, crank, mechanism",
      "common_misconceptions": "Pupils may confuse gears of different sizes without understanding that larger gears rotate more slowly than smaller ones when meshed. Hands-on investigation with real gear systems is essential. Pupils may not understand that cams produce different patterns of movement depending on their shape - this requires practical investigation of various cam profiles.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "DT-KS2-C004",
      "domain_id": "DT-KS2-D004",
      "concept_name": "Electrical Systems and Series Circuits",
      "description": "Electrical systems use the flow of electrical current through components to produce light, sound, heat or movement. At KS2, pupils learn to design and build series circuits incorporating switches, bulbs, buzzers and motors, understanding how these can be used to add active functionality to a designed product. This concept bridges design and technology with science, as understanding of circuits is developed in both subjects.",
      "teaching_guidance": "Connect to science circuits work by applying electrical knowledge in DT contexts. Build working series circuits as part of product designs - a lit-up toy, a burglar alarm, a motorised vehicle. Teach pupils to represent circuits using standard circuit symbols and to plan their circuits before building. Investigate the effect of adding more bulbs in series. Discuss how electrical components are incorporated in real products and what safety considerations apply.",
      "key_vocabulary": "circuit, series, component, switch, bulb, buzzer, motor, battery, current, conductor, insulator, symbol, diagram",
      "common_misconceptions": "Pupils may not understand that all components in a series circuit must be connected for current to flow, leading to confusion when a broken circuit does not work. Physical construction of circuits reinforces this concept better than diagrams alone. Pupils may confuse the functions of different output components (bulb gives light, buzzer gives sound, motor gives movement).",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "DT-KS2-C005",
      "domain_id": "DT-KS2-D004",
      "concept_name": "Computing Control in Products",
      "description": "Computing can be applied to design and technology to create products that sense inputs, process information and control outputs. At KS2, pupils apply their understanding of programming to program, monitor and control their products, using components such as sensors, microcontrollers and actuators. This concept introduces the idea that modern products often contain embedded software that makes them intelligent and responsive.",
      "teaching_guidance": "Use programmable microcontrollers such as micro:bit, Arduino or similar platforms suited to primary pupils. Set projects where pupils program a device to respond to sensor input - lighting an LED when it gets dark, making a motor stop when a button is pressed. Connect programming tasks to the DT design process - pupils should design what their product will do, then program it to achieve that function. Evaluate how well the program meets the design criteria.",
      "key_vocabulary": "program, control, sensor, actuator, microcontroller, input, output, condition, sequence, monitor, automate, code",
      "common_misconceptions": "Pupils may see computing control as separate from DT rather than as an integrated part of product design. Framing programming tasks as part of the design-make-evaluate cycle maintains this connection. Some pupils may struggle with the abstraction of programming; physical computing with immediate, visible outputs (LEDs, motors) helps make the logic concrete.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "teaching_weight": 3,
      "co_teach_hints": []
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "DT-KS1-C001",
      "dependent_concept": "DT-KS2-C001",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS2 research-informed design builds directly on the iterative design process introduced at KS1, extending it with the explicit research and user analysis phase."
    },
    {
      "prerequisite_concept": "DT-KS1-C005",
      "dependent_concept": "DT-KS2-C003",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS2 advanced mechanical systems directly extend the KS1 knowledge of levers, sliders, wheels and axles with more complex mechanisms such as gears, pulleys and cams."
    },
    {
      "prerequisite_concept": "DT-KS2-C003",
      "dependent_concept": "DT-KS2-C004",
      "confidence": "inferred",
      "relationship_type": "logical",
      "strength": 0.5,
      "rationale": "Both mechanical and electrical systems are used to add functionality to products; understanding mechanical systems provides a conceptual framework for understanding how other systems transform inputs to outputs."
    },
    {
      "prerequisite_concept": "DT-KS2-C004",
      "dependent_concept": "DT-KS2-C005",
      "confidence": "inferred",
      "relationship_type": "logical",
      "strength": 0.7,
      "rationale": "Computing control often operates by switching electrical components on and off; understanding how electrical circuits work provides the physical context for understanding what a program is controlling."
    },
    {
      "prerequisite_concept": "DT-KS1-C008",
      "dependent_concept": "DT-KS2-C006",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS2 accurate making directly extends the KS1 tool skills foundation, adding the concept of precision and tolerance as explicit goals that go beyond basic safe tool handling."
    },
    {
      "prerequisite_concept": "DT-KS1-C003",
      "dependent_concept": "DT-KS2-C007",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS2 material properties extends KS1 material characteristics knowledge by making the functional/aesthetic distinction explicit and requiring pupils to balance both dimensions in material selection."
    },
    {
      "prerequisite_concept": "DT-KS1-C010",
      "dependent_concept": "DT-KS2-C008",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS2 product investigation and analysis directly extends KS1 product analysis, adding more structured frameworks, comparative analysis and deeper consideration of construction and mechanisms."
    },
    {
      "prerequisite_concept": "DT-KS2-C008",
      "dependent_concept": "DT-KS2-C009",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.65,
      "rationale": "Understanding how existing products are designed and constructed is a foundation for understanding how design has developed historically; product analysis skills make the study of design history practically grounded."
    },
    {
      "prerequisite_concept": "DT-KS1-C006",
      "dependent_concept": "DT-KS2-C010",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "KS2 cooking techniques builds on KS1 healthy diet knowledge, applying nutritional principles through the practical preparation of balanced savoury dishes using a range of cooking methods."
    },
    {
      "prerequisite_concept": "DT-KS1-C007",
      "dependent_concept": "DT-KS2-C011",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS2 seasonality and ingredient sourcing directly extends KS1 knowledge of where food comes from, adding the concept of seasonal variation and the environmental dimensions of food sourcing."
    }
  ]
}
