{
  "metadata": {
    "subject": "Design and Technology",
    "key_stage": "KS1",
    "years_covered": [
      1,
      2
    ],
    "document_reference": "DFE-00172-2013",
    "extraction_date": "2026-02-17",
    "structure_rating": 8
  },
  "domains": [
    {
      "domain_id": "DT-KS1-D001",
      "domain_name": "Design",
      "description": "Generating and communicating ideas for purposeful, functional and appealing products through a variety of means.",
      "curriculum_context": "The design domain at KS1 introduces pupils to the concept that products are created to solve problems and meet specific needs and wants. Pupils learn to generate ideas and communicate them through drawing, talking, templates and mock-ups before committing to making, establishing the principle that design precedes construction. This domain develops pupils' ability to think about who will use a product and what it needs to do, introducing the concept of design criteria as a way of establishing success measures. By engaging with design at this foundational stage, pupils learn that creativity and imagination can be channelled purposefully to create products that work and appeal to others.",
      "is_cross_cutting": false,
      "structure_type": "process"
    },
    {
      "domain_id": "DT-KS1-D002",
      "domain_name": "Make",
      "description": "Selecting and using tools, equipment and materials to build and construct products through practical making activities.",
      "curriculum_context": "The make domain at KS1 develops pupils' practical skills and ability to select appropriate tools and materials for a given task. Pupils learn to handle tools safely and with increasing control, and to choose from a range of materials including construction materials, textiles and food ingredients based on their characteristics and suitability. Making at KS1 is intentionally hands-on and practical, building physical dexterity, problem-solving skills and confidence in working with tools. The domain establishes that making is a skilled activity requiring planning, precision and persistence, and that the quality of the process affects the quality of the outcome.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "DT-KS1-D003",
      "domain_name": "Evaluate",
      "description": "Exploring existing products and evaluating one's own designs and products against stated design criteria.",
      "curriculum_context": "The evaluate domain at KS1 introduces pupils to the critical thinking skills needed to assess products, both those made by others and those they have made themselves. Pupils explore a range of existing products to understand how they work, what materials they use, how they are made and how well they meet their intended purpose. They also evaluate their own work against design criteria, building the habit of reflective self-assessment that is central to iterative design practice. This domain establishes that evaluation is not just a final check but a continuous process that informs design decisions throughout a project.",
      "is_cross_cutting": false,
      "structure_type": "process"
    },
    {
      "domain_id": "DT-KS1-D004",
      "domain_name": "Technical Knowledge",
      "description": "Understanding structural principles and mechanisms, including how structures can be strengthened and how mechanisms such as levers and wheels work.",
      "curriculum_context": "Technical knowledge at KS1 introduces pupils to foundational engineering principles in an age-appropriate, exploratory way. Pupils investigate how structures can be made stronger, stiffer and more stable through hands-on building activities, discovering principles of bracing, triangulation and form through practical investigation. They also explore simple mechanisms including levers, sliders, wheels and axles, learning how these enable movement and function in products. This domain connects design and technology to science and mathematics, developing pupils' understanding of the physical world and how it can be harnessed to create useful products.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "DT-KS1-D005",
      "domain_name": "Cooking and Nutrition",
      "description": "Learning basic principles of a healthy and varied diet and understanding where food comes from.",
      "curriculum_context": "The cooking and nutrition domain at KS1 introduces pupils to food as a material and cooking as a form of design and technology. Pupils learn the basic principles of a healthy and varied diet, developing awareness of different food groups and why variety matters for good health. They also learn where food comes from, connecting the food on their plate to plants, animals and agricultural processes, building foundational understanding of the food chain and food production. This domain contributes to pupils' life skills and health awareness, as well as to their understanding of design and technology as a subject that encompasses food production and preparation.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    }
  ],
  "objectives": [
    {
      "objective_id": "DT-KS1-O001",
      "domain_id": "DT-KS1-D001",
      "objective_text": "design purposeful, functional, appealing products for themselves and other users based on design criteria",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS1-O002",
      "domain_id": "DT-KS1-D001",
      "objective_text": "generate, develop, model and communicate their ideas through talking, drawing, templates, mock-ups and, where appropriate, information and communication technology",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS1-O003",
      "domain_id": "DT-KS1-D002",
      "objective_text": "select from and use a range of tools and equipment to perform practical tasks [for example, cutting, shaping, joining and finishing]",
      "non_statutory_guidance": null,
      "examples": "cutting, shaping, joining and finishing",
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS1-O004",
      "domain_id": "DT-KS1-D002",
      "objective_text": "select from and use a wide range of materials and components, including construction materials, textiles and ingredients, according to their characteristics",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS1-O005",
      "domain_id": "DT-KS1-D003",
      "objective_text": "explore and evaluate a range of existing products",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS1-O006",
      "domain_id": "DT-KS1-D003",
      "objective_text": "evaluate their ideas and products against design criteria",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS1-O007",
      "domain_id": "DT-KS1-D004",
      "objective_text": "build structures, exploring how they can be made stronger, stiffer and more stable",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS1-O008",
      "domain_id": "DT-KS1-D004",
      "objective_text": "explore and use mechanisms [for example, levers, sliders, wheels and axles], in their products",
      "non_statutory_guidance": null,
      "examples": "levers, sliders, wheels and axles",
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS1-O009",
      "domain_id": "DT-KS1-D005",
      "objective_text": "use the basic principles of a healthy and varied diet to prepare dishes",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS1-O010",
      "domain_id": "DT-KS1-D005",
      "objective_text": "understand where food comes from",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "DT-KS1-C008",
      "domain_id": "DT-KS1-D002",
      "concept_name": "Tools, Equipment and Safe Making",
      "description": "Tools and equipment are the instruments used to cut, shape, join and finish materials during making. At KS1, pupils learn to identify and use a range of appropriate tools including scissors, hole punches, hand saws, needles and mixing equipment, developing control and precision in their handling. Safe use of tools is an essential component of making: pupils must understand and apply basic safety rules for each tool they use, including how to hold it, how to protect themselves and others, and how to store it correctly when not in use.",
      "teaching_guidance": "Introduce tools progressively, modelling safe handling before pupils use them independently. Establish clear routines for tool use, storage and carrying in the classroom. Practice specific tool skills in isolation before applying them in a making project. Provide sufficient working space so that pupils are not in danger from one another's tools. Discuss why safety rules exist for each tool through reference to what the tool is designed to cut or penetrate. Offer tools in a range of sizes to accommodate different hand sizes and levels of dexterity.",
      "key_vocabulary": "tool, equipment, scissors, saw, needle, join, cut, shape, finish, safe, handle, control, precision, storage, material",
      "common_misconceptions": "Pupils may rush tool use and lose control, leading to inaccurate cutting or safety risks. Slowing down and demonstrating the value of deliberate, careful tool use is a key habit to establish. Some pupils may not distinguish between tools designed for different materials (e.g. trying to use fabric scissors on card); building tool literacy from the start avoids this.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false
    },
    {
      "concept_id": "DT-KS1-C009",
      "domain_id": "DT-KS1-D002",
      "concept_name": "Joining and Finishing Techniques",
      "description": "Joining techniques are methods used to connect materials and components together so that a product holds its shape and structure. At KS1, pupils explore a range of joining methods including adhesives (glue, tape, staples), mechanical fixings (split pins, treasury tags, stitching) and construction techniques (folding tabs, slots). Finishing refers to the processes applied to the surface of a product after it has been assembled, such as painting, colouring or adding surface decoration, to improve its appearance and protect it.",
      "teaching_guidance": "Provide a range of joining materials and methods for pupils to test and compare. Pose design challenges that require different joining solutions: what would hold this flap firmly? What would allow this part to move? Teach pupils to consider whether a joint needs to be permanent or temporary. Practise finishing techniques separately before applying them to final products. Discuss why finishing is important in commercial products: protection, aesthetics, branding.",
      "key_vocabulary": "join, adhesive, glue, tape, stitch, staple, fold, slot, tab, fix, permanent, temporary, finish, paint, decorate, surface, appearance",
      "common_misconceptions": "Pupils often use excessive amounts of glue, which weakens joints rather than strengthening them. Teaching that the right amount of adhesive applied to the right surfaces makes a stronger joint is a key practical lesson. Some pupils may not understand that different joining methods suit different materials: stitching works for fabric but not card.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false
    },
    {
      "concept_id": "DT-KS1-C010",
      "domain_id": "DT-KS1-D003",
      "concept_name": "Product Analysis and Evaluation",
      "description": "Product analysis involves examining an existing product to understand its purpose, how it works, what it is made from and how well it achieves its intended function. At KS1, pupils develop the habit of looking critically at products, both those made by others and those they have made themselves, asking structured questions about purpose, materials, function and user. Evaluation against design criteria develops the principle that a product's success can be measured objectively rather than assessed through preference alone.",
      "teaching_guidance": "Provide a collection of familiar products for pupils to handle, examine and discuss. Use structured questions to guide analysis: Who is this for? What does it do? What is it made from? How is it made? Does it do its job well? Record evaluations in simple formats that pupils can complete independently. When evaluating their own products, return explicitly to the design criteria written before making began. Encourage pupils to suggest improvements, framing evaluation as a positive, forward-looking process rather than criticism.",
      "key_vocabulary": "evaluate, analyse, product, purpose, function, user, material, criterion, criteria, strength, weakness, improve, assess, compare, opinion",
      "common_misconceptions": "Pupils may evaluate products based purely on aesthetic preference ('I like the colour') rather than functional effectiveness. Teaching pupils to separate personal taste from functional judgement is a key evaluation skill. Some pupils may be reluctant to identify weaknesses in their own work; framing evaluation as 'what would make this even better?' rather than 'what is wrong with this?' supports a growth mindset approach.",
      "concept_type": "process",
      "complexity_level": 1,
      "is_cross_cutting": false
    },
    {
      "concept_id": "DT-KS1-C001",
      "domain_id": "DT-KS1-D001",
      "concept_name": "Iterative Design Process",
      "description": "The iterative design process involves cyclical stages of designing, making and evaluating, where each stage informs the others and products are progressively improved. At KS1, pupils are introduced to this process in a simplified form, learning that good products emerge from planning, making and reflection rather than a single attempt. The iterative nature of design means that problems discovered during making can lead to redesign, and evaluation can trigger further improvement.",
      "teaching_guidance": "Structure projects clearly around the design-make-evaluate cycle, making each stage visible to pupils. Use simple design sheets that prompt pupils to draw their ideas before making. Build in time for evaluation during and after making, asking pupils what is working well and what they would change. Use pupils' evaluations to inform improved versions of their products. Model the process explicitly by demonstrating how professional designers revise their ideas.",
      "key_vocabulary": "design, make, evaluate, improve, plan, criterion, criteria, purpose, function, user, product, iterate, prototype",
      "common_misconceptions": "Pupils often think of design and technology as simply making things without planning. Establishing the design phase as a necessary precursor to making is important. Some pupils may see evaluation as only happening at the end of a project; teaching that evaluation is continuous throughout the making process is a key pedagogical goal.",
      "concept_type": "process",
      "complexity_level": 1,
      "is_cross_cutting": false
    },
    {
      "concept_id": "DT-KS1-C002",
      "domain_id": "DT-KS1-D001",
      "concept_name": "Design Criteria",
      "description": "Design criteria are the specific requirements that a product must meet to be considered successful. They define what the product must do (function), who it is for (user), how it should look (aesthetics) and sometimes what it should be made of (materials). At KS1, pupils are introduced to design criteria as a way of setting goals before making and checking success after making.",
      "teaching_guidance": "Help pupils to generate simple design criteria with prompts such as 'Who is this for?', 'What must it do?', 'What should it look like?'. Record criteria in simple formats that pupils can refer to during making. Discuss existing products in terms of how well they meet imagined design criteria. After making, return explicitly to the criteria to evaluate the product. Keep criteria simple and achievable at KS1 - typically two or three clear requirements.",
      "key_vocabulary": "criteria, requirement, purpose, function, user, appealing, strong, safe, suitable",
      "common_misconceptions": "Pupils may create criteria that are too vague (e.g. 'it must be good') or too prescriptive. Teaching pupils to write criteria that can be checked - 'it must hold at least five books' rather than 'it must be strong' - develops their understanding. Pupils may also not refer back to criteria during or after making; building this habit takes time and consistent reinforcement.",
      "concept_type": "process",
      "complexity_level": 1,
      "is_cross_cutting": false
    },
    {
      "concept_id": "DT-KS1-C003",
      "domain_id": "DT-KS1-D004",
      "concept_name": "Materials and Their Characteristics",
      "description": "Different materials have different physical properties that make them suitable for different purposes. At KS1, pupils learn to identify and describe the properties of a range of materials including construction materials such as card, wood and plastic, textiles and food ingredients, and to make informed choices about which material to use based on what the product needs to do.",
      "teaching_guidance": "Provide opportunities to handle and explore a wide range of materials before asking pupils to select. Use sorting and comparing activities to build awareness of material properties such as rigidity, flexibility, waterproof, absorbent, rough, smooth. Discuss why certain materials are used in real products - why a raincoat is made from waterproof fabric, why a cardboard box cannot hold water. Build vocabulary for material properties through explicit teaching and practical exploration.",
      "key_vocabulary": "material, property, rigid, flexible, waterproof, absorbent, smooth, rough, strong, fragile, wood, card, plastic, fabric, ingredient, suitable, characteristic",
      "common_misconceptions": "Pupils may choose materials based on aesthetics alone (e.g. choosing the prettiest colour) without considering functional suitability. Prompting with 'Will this work for our purpose?' during making helps. Some pupils may not understand that a material can have both advantageous and disadvantageous properties for a given task.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false
    },
    {
      "concept_id": "DT-KS1-C004",
      "domain_id": "DT-KS1-D004",
      "concept_name": "Structures and Stability",
      "description": "Structures are physical constructions that support loads or maintain a form. At KS1, pupils explore how structures can be made stronger, stiffer and more stable through practical building activities. They investigate how the shape of a structure, the way it is joined and the materials it is made from all affect its strength and stability. This concept introduces foundational engineering principles through hands-on investigation.",
      "teaching_guidance": "Set building challenges using reclaimed materials, construction kits and card. Investigate how tubes, triangles and other shapes resist bending. Explore different joining methods including adhesives, tape, folding tabs and fasteners. Challenge pupils to make a structure that can support a specific load - a bridge that holds toy cars, a tower that holds a book. Use questions to prompt investigation: 'What happens if you make the legs wider?', 'Which shape is stronger - a square or a triangle?'",
      "key_vocabulary": "structure, strong, stable, stiff, rigid, weak, collapse, support, load, base, joint, brace, triangle, beam",
      "common_misconceptions": "Pupils often attribute strength to the amount of material used rather than to structure and shape. Demonstrating that a triangulated structure is stronger than a square one with the same materials addresses this. Some pupils may not understand that stability is about balance and the distribution of weight as well as strength of materials.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false
    },
    {
      "concept_id": "DT-KS1-C005",
      "domain_id": "DT-KS1-D004",
      "concept_name": "Mechanisms: Levers, Sliders, Wheels and Axles",
      "description": "Mechanisms are devices that transmit and modify motion and force. At KS1, pupils explore simple mechanisms including levers, sliders, wheels and axles, learning how these can be used to create movement in their products. Pupils investigate how levers pivot around a fulcrum, how sliders create linear movement, and how wheels turning on axles enable rolling. This concept introduces the principle that mechanical systems convert one type of input into useful output.",
      "teaching_guidance": "Provide ready-made mechanical components such as split pins, card strips and wheels for exploring levers and pivots. Make simple moving pictures using levers and sliders that create movement when a card is pulled. Attach wheels to simple vehicles and investigate how the diameter of wheels affects how far they travel. Examine real products that use these mechanisms. Encourage pupils to describe the movement they observe using appropriate vocabulary.",
      "key_vocabulary": "mechanism, lever, slider, wheel, axle, pivot, fulcrum, rotate, linear, movement, force, input, output, motion",
      "common_misconceptions": "Pupils may confuse wheels (which rotate) with rollers or may not understand the function of an axle in keeping a wheel spinning. Practical investigation with real mechanisms is more effective than diagrammatic explanation at this stage. Pupils may not recognise that levers are found in everyday objects such as scissors, seesaws and door handles.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false
    },
    {
      "concept_id": "DT-KS1-C006",
      "domain_id": "DT-KS1-D005",
      "concept_name": "Healthy and Varied Diet",
      "description": "A healthy diet consists of a variety of foods from different food groups in appropriate proportions, providing the nutrients needed for growth, energy and good health. At KS1, pupils learn the basic principles of a healthy and varied diet, developing awareness that no single food provides everything the body needs, and that variety and balance are key to nutrition.",
      "teaching_guidance": "Use visual tools such as the Eatwell Guide to introduce food groups. Explore a wide variety of foods through tasting, sorting and classification activities. Discuss how different foods give us energy, help us grow and keep us healthy. Make simple dishes that combine foods from different groups. Connect food preparation to the wider design and technology curriculum through the design-make-evaluate cycle applied to food products.",
      "key_vocabulary": "healthy, varied, diet, nutrition, food group, balance, protein, carbohydrate, fruit, vegetable, dairy, fat, sugar, portion, ingredient",
      "common_misconceptions": "Pupils may have the misconception that certain foods are entirely 'bad' or 'good'. Teaching that balance and variety are more important than restriction is age-appropriate. Pupils may not connect the food they eat to where it comes from; building this understanding supports both nutrition and science learning.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false
    },
    {
      "concept_id": "DT-KS1-C007",
      "domain_id": "DT-KS1-D005",
      "concept_name": "Where Food Comes From",
      "description": "Food comes from a variety of sources including plants, animals and the sea. Understanding the origins of food connects pupils to the natural world and to the agricultural and industrial processes by which food is grown, raised, caught and processed before reaching shops and kitchens. At KS1, pupils develop foundational awareness of the food chain and the journey food makes from farm to plate.",
      "teaching_guidance": "Grow simple plants such as cress, beans or herbs in the classroom. Visit a farm or invite a farmer into school if possible. Sort foods by origin - plant, animal, or both. Use picture books and videos to show how different foods are produced. Visit a supermarket and discuss where different products come from. Connect to geography through maps showing where different foods are grown around the world.",
      "key_vocabulary": "grow, harvest, farm, animal, plant, crop, breed, catch, process, season, local, imported, organic, fresh",
      "common_misconceptions": "Many pupils believe that all food is simply produced in factories or supermarkets. Connecting foods to their plant or animal origin challenges this misconception. Pupils may not understand seasonal availability - that certain fruits and vegetables only grow at certain times of year in the UK.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "DT-KS1-C002",
      "dependent_concept": "DT-KS1-C001",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.85,
      "rationale": "Design criteria are the specific mechanism through which the iterative design process operates - pupils need to understand what criteria are before they can use them to guide and evaluate design."
    },
    {
      "prerequisite_concept": "DT-KS1-C003",
      "dependent_concept": "DT-KS1-C004",
      "confidence": "inferred",
      "relationship_type": "logical",
      "strength": 0.7,
      "rationale": "Understanding material properties is foundational to understanding structural behaviour - a structure's strength depends on both its shape and the properties of the materials from which it is made."
    },
    {
      "prerequisite_concept": "DT-KS1-C001",
      "dependent_concept": "DT-KS1-C004",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.65,
      "rationale": "Building and testing structures is best understood as an application of the design-make-evaluate process, so understanding the iterative cycle supports purposeful structural investigation."
    },
    {
      "prerequisite_concept": "DT-KS1-C001",
      "dependent_concept": "DT-KS1-C005",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.65,
      "rationale": "Exploring mechanisms in products is most meaningful when framed within the design process - pupils design products that incorporate mechanisms, requiring understanding of what the mechanism needs to do."
    },
    {
      "prerequisite_concept": "DT-KS1-C003",
      "dependent_concept": "DT-KS1-C008",
      "confidence": "inferred",
      "relationship_type": "logical",
      "strength": 0.75,
      "rationale": "Selecting appropriate tools depends on understanding material characteristics: different materials require different tools, so knowledge of material properties informs purposeful tool selection during making."
    },
    {
      "prerequisite_concept": "DT-KS1-C008",
      "dependent_concept": "DT-KS1-C009",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.8,
      "rationale": "Joining and finishing techniques require the controlled use of tools; safe and effective tool handling is therefore a prerequisite for successfully executing joining methods."
    },
    {
      "prerequisite_concept": "DT-KS1-C002",
      "dependent_concept": "DT-KS1-C010",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.85,
      "rationale": "Evaluating against design criteria requires pupils to understand what design criteria are; the concepts are directly related as criteria are the standard against which evaluation is performed."
    },
    {
      "prerequisite_concept": "DT-KS1-C009",
      "dependent_concept": "DT-KS1-C010",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.6,
      "rationale": "Meaningful product evaluation at KS1 requires pupils to have made something, which depends on competence with joining and finishing techniques; making experience grounds evaluation in practical understanding."
    }
  ]
}
