{
  "metadata": {
    "subject": "English",
    "key_stage": "KS1",
    "years_covered": [
      1,
      2
    ],
    "document_reference": "DFE-00181-2013",
    "extraction_date": "2026-02-16",
    "structure_rating": 7,
    "notes": "English KS1 has a clear hierarchical structure with systematic phonics progression, but comprehension and composition skills show more developmental than sequential patterns. Strong explicit prerequisites in phonics and spelling, but more implicit developmental progressions in reading comprehension and writing composition."
  },
  "domains": [
    {
      "domain_id": "EN-KS1-D001",
      "domain_name": "Spoken Language",
      "description": "Development of listening, speaking and communication skills across Years 1-6 (cross-key stage)",
      "is_cross_cutting": true,
      "structure_type": "developmental",
      "curriculum_context": "Spoken language is the foundation of all English learning at KS1 and underpins the development of reading and writing throughout schooling. The statutory curriculum requires that pupils speak clearly and convey their ideas confidently, using language imaginatively to give well-structured descriptions, explanations and narratives. Pupils are expected to listen carefully to what others say, ask relevant questions to extend understanding, and build vocabulary through exposure to a wide range of spoken language including poetry, stories and non-fiction. Opportunities for drama, role play and structured talk are essential at KS1 so that children develop the oral fluency that provides the basis for composition in writing. Spoken language objectives apply across all years of primary school and should be developed continuously."
    },
    {
      "domain_id": "EN-KS1-D002",
      "domain_name": "Reading - Word Reading",
      "description": "Phonics, decoding, word recognition and fluency development",
      "is_cross_cutting": false,
      "structure_type": "sequential",
      "curriculum_context": "Reading — word reading at KS1 focuses on teaching children the alphabetic code systematically through phonics, enabling them to decode unfamiliar words independently. Children learn the correspondences between sounds (phonemes) and letters or groups of letters (graphemes), applying this knowledge to blend sounds in order to read words and segment words for spelling. The statutory curriculum requires that by the end of Year 1, children pass the statutory Phonics Screening Check, demonstrating secure knowledge of the common grapheme-phoneme correspondences. In Year 2, pupils consolidate their phonic knowledge and develop fluency in reading high-frequency words and common exception words. The goal of word reading is automaticity — reading words accurately without conscious effort — which frees pupils' cognitive resources for comprehension."
    },
    {
      "domain_id": "EN-KS1-D003",
      "domain_name": "Reading - Comprehension",
      "description": "Understanding, inference, prediction and discussion of texts",
      "is_cross_cutting": false,
      "structure_type": "developmental",
      "curriculum_context": "Reading comprehension at KS1 develops pupils' ability to understand and interpret what they read — both words on the page and the deeper meanings, themes and ideas that texts contain. The statutory curriculum requires pupils to listen to and discuss a wide range of texts including stories, poetry and non-fiction, developing their pleasure in reading and their ability to predict what might happen, discuss the significance of the title and events, make inferences based on what they have read, and begin to check that texts make sense. Pupils learn to discuss words and phrases that capture their interest or imagination, and to recite poems by heart. Comprehension development requires a rich diet of carefully selected texts read aloud to children as well as texts children read independently."
    },
    {
      "domain_id": "EN-KS1-D004",
      "domain_name": "Writing - Transcription (Spelling)",
      "description": "Phoneme-grapheme correspondences, spelling patterns and exception words",
      "is_cross_cutting": false,
      "structure_type": "sequential",
      "curriculum_context": "Writing — transcription: spelling at KS1 involves teaching children the spelling patterns and rules that build on their phonic knowledge to encode words in writing. Pupils learn to spell common exception words (those that do not follow regular phonics patterns), the days of the week, and an increasing range of words with common suffixes and prefixes. The statutory curriculum requires pupils to apply the rules of adding common suffixes (-s, -es, -ing, -ed, -er, -est), to use apostrophes correctly for contractions, and to distinguish between homophones and near-homophones. Developing accurate spelling frees children's attention for the compositional aspects of writing, which is why transcription skills — spelling and handwriting — are given explicit statutory attention separate from composition."
    },
    {
      "domain_id": "EN-KS1-D005",
      "domain_name": "Writing - Transcription (Handwriting)",
      "description": "Letter formation, joining and presentation skills",
      "is_cross_cutting": false,
      "structure_type": "sequential",
      "curriculum_context": "Handwriting at KS1 is taught explicitly as a physical skill requiring the correct formation, orientation and sizing of letters. Pupils begin by forming lower-case letters correctly and learning the sequence of strokes required, and progress to joining letters using the school's adopted handwriting style. The statutory curriculum requires pupils to form capital letters correctly, write digits, and understand which letters are 'ascenders' and 'descenders'. By Year 2, pupils should begin to use joined handwriting where it is appropriate, and should sit correctly at the desk using the correct grip. Automaticity in handwriting — writing fluently without conscious attention to letter formation — is important because it frees children's cognitive resources for the compositional demands of writing."
    },
    {
      "domain_id": "EN-KS1-D006",
      "domain_name": "Writing - Composition",
      "description": "Planning, drafting, editing and writing for different purposes",
      "is_cross_cutting": false,
      "structure_type": "developmental",
      "curriculum_context": "Writing — composition at KS1 develops pupils' ability to write for different purposes and audiences, combining their developing transcription skills (phonics, spelling, handwriting) with the ability to express ideas clearly in writing. Pupils learn to plan their writing by talking about what they are going to write, to draft and evaluate writing against the purpose for writing, and to re-read their writing to check it makes sense. The statutory curriculum requires pupils to write sentences that are sequenced to form short narratives, and to use features of different text types including stories, poems, recounts and instructions. The teaching of composition draws heavily on high-quality reading materials that model excellent writing, and pupils are encouraged to adopt the language and structures they encounter in books they have read."
    },
    {
      "domain_id": "EN-KS1-D007",
      "domain_name": "Writing - Vocabulary, Grammar and Punctuation",
      "description": "Sentence construction, word classes and punctuation use",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "curriculum_context": "Vocabulary, grammar and punctuation at KS1 are taught in the context of reading and writing rather than as abstract rules, with pupils learning to use standard terminology to talk about their writing and to appreciate grammatical effects. Pupils learn to write sentences that make sense, use capital letters, full stops, question marks and exclamation marks, and understand the concepts of a word, sentence and paragraph. The statutory curriculum introduces pupils to the grammatical terms noun, noun phrase, adjective, verb, tense, adverb and conjunction, using these as metalinguistic tools to improve their writing. By Year 2, pupils are expected to use coordination and subordination to write complex sentences, and to use commas in lists and apostrophes for contraction. The teaching of grammar is always in service of writing improvement, not an end in itself."
    }
  ],
  "objectives": [
    {
      "objective_id": "EN-KS1-O001",
      "domain_id": "EN-KS1-D001",
      "objective_text": "listen and respond appropriately to adults and their peers",
      "is_statutory": true,
      "year": null,
      "notes": "Cross-key stage objective for Years 1-6",
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O002",
      "domain_id": "EN-KS1-D001",
      "objective_text": "ask relevant questions to extend their understanding and knowledge",
      "is_statutory": true,
      "year": null,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O003",
      "domain_id": "EN-KS1-D001",
      "objective_text": "use relevant strategies to build their vocabulary",
      "is_statutory": true,
      "year": null,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O004",
      "domain_id": "EN-KS1-D001",
      "objective_text": "articulate and justify answers, arguments and opinions",
      "is_statutory": true,
      "year": null,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O005",
      "domain_id": "EN-KS1-D001",
      "objective_text": "give well-structured descriptions, explanations and narratives for different purposes, including for expressing feelings",
      "is_statutory": true,
      "year": null,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O006",
      "domain_id": "EN-KS1-D001",
      "objective_text": "maintain attention and participate actively in collaborative conversations, staying on topic and initiating and responding to comments",
      "is_statutory": true,
      "year": null,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O007",
      "domain_id": "EN-KS1-D001",
      "objective_text": "use spoken language to develop understanding through speculating, hypothesising, imagining and exploring ideas",
      "is_statutory": true,
      "year": null,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O008",
      "domain_id": "EN-KS1-D001",
      "objective_text": "speak audibly and fluently with an increasing command of Standard English",
      "is_statutory": true,
      "year": null,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O009",
      "domain_id": "EN-KS1-D001",
      "objective_text": "participate in discussions, presentations, performances, role play, improvisations and debates",
      "is_statutory": true,
      "year": null,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O010",
      "domain_id": "EN-KS1-D001",
      "objective_text": "gain, maintain and monitor the interest of the listener(s)",
      "is_statutory": true,
      "year": null,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O011",
      "domain_id": "EN-KS1-D001",
      "objective_text": "consider and evaluate different viewpoints, attending to and building on the contributions of others",
      "is_statutory": true,
      "year": null,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O012",
      "domain_id": "EN-KS1-D001",
      "objective_text": "select and use appropriate registers for effective communication",
      "is_statutory": true,
      "year": null,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O013",
      "domain_id": "EN-KS1-D002",
      "objective_text": "apply phonic knowledge and skills as the route to decode words",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O014",
      "domain_id": "EN-KS1-D002",
      "objective_text": "respond speedily with the correct sound to graphemes (letters or groups of letters) for all 40+ phonemes, including, where applicable, alternative sounds for graphemes",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O015",
      "domain_id": "EN-KS1-D002",
      "objective_text": "read accurately by blending sounds in unfamiliar words containing GPCs that have been taught",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O016",
      "domain_id": "EN-KS1-D002",
      "objective_text": "read common exception words, noting unusual correspondences between spelling and sound and where these occur in the word",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O017",
      "domain_id": "EN-KS1-D002",
      "objective_text": "read words containing taught GPCs and –s, –es, –ing, –ed, –er and –est endings",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O018",
      "domain_id": "EN-KS1-D002",
      "objective_text": "read other words of more than one syllable that contain taught GPCs",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O019",
      "domain_id": "EN-KS1-D002",
      "objective_text": "read words with contractions [for example, I'm, I'll, we'll], and understand that the apostrophe represents the omitted letter(s)",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O020",
      "domain_id": "EN-KS1-D002",
      "objective_text": "read aloud accurately books that are consistent with their developing phonic knowledge and that do not require them to use other strategies to work out words",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O021",
      "domain_id": "EN-KS1-D002",
      "objective_text": "re-read these books to build up their fluency and confidence in word reading",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O022",
      "domain_id": "EN-KS1-D002",
      "objective_text": "continue to apply phonic knowledge and skills as the route to decode words until automatic decoding has become embedded and reading is fluent",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O023",
      "domain_id": "EN-KS1-D002",
      "objective_text": "read accurately by blending the sounds in words that contain the graphemes taught so far, especially recognising alternative sounds for graphemes",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O024",
      "domain_id": "EN-KS1-D002",
      "objective_text": "read accurately words of two or more syllables that contain the same graphemes as above",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O025",
      "domain_id": "EN-KS1-D002",
      "objective_text": "read words containing common suffixes",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O026",
      "domain_id": "EN-KS1-D002",
      "objective_text": "read further common exception words, noting unusual correspondences between spelling and sound and where these occur in the word",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O027",
      "domain_id": "EN-KS1-D002",
      "objective_text": "read most words quickly and accurately, without overt sounding and blending, when they have been frequently encountered",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O028",
      "domain_id": "EN-KS1-D002",
      "objective_text": "read aloud books closely matched to their improving phonic knowledge, sounding out unfamiliar words accurately, automatically and without undue hesitation",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O029",
      "domain_id": "EN-KS1-D002",
      "objective_text": "re-read these books to build up their fluency and confidence in word reading",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O030",
      "domain_id": "EN-KS1-D003",
      "objective_text": "listening to and discussing a wide range of poems, stories and non-fiction at a level beyond that at which they can read independently",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O031",
      "domain_id": "EN-KS1-D003",
      "objective_text": "being encouraged to link what they read or hear read to their own experiences",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O032",
      "domain_id": "EN-KS1-D003",
      "objective_text": "becoming very familiar with key stories, fairy stories and traditional tales, retelling them and considering their particular characteristics",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O033",
      "domain_id": "EN-KS1-D003",
      "objective_text": "recognising and joining in with predictable phrases",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O034",
      "domain_id": "EN-KS1-D003",
      "objective_text": "learning to appreciate rhymes and poems, and to recite some by heart",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O035",
      "domain_id": "EN-KS1-D003",
      "objective_text": "discussing word meanings, linking new meanings to those already known",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O036",
      "domain_id": "EN-KS1-D003",
      "objective_text": "drawing on what they already know or on background information and vocabulary provided by the teacher",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O037",
      "domain_id": "EN-KS1-D003",
      "objective_text": "checking that the text makes sense to them as they read and correcting inaccurate reading",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O038",
      "domain_id": "EN-KS1-D003",
      "objective_text": "discussing the significance of the title and events",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O039",
      "domain_id": "EN-KS1-D003",
      "objective_text": "making inferences on the basis of what is being said and done",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O040",
      "domain_id": "EN-KS1-D003",
      "objective_text": "predicting what might happen on the basis of what has been read so far",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O041",
      "domain_id": "EN-KS1-D003",
      "objective_text": "participate in discussion about what is read to them, taking turns and listening to what others say",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O042",
      "domain_id": "EN-KS1-D003",
      "objective_text": "explain clearly their understanding of what is read to them",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O043",
      "domain_id": "EN-KS1-D003",
      "objective_text": "listening to, discussing and expressing views about a wide range of contemporary and classic poetry, stories and non-fiction at a level beyond that at which they can read independently",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O044",
      "domain_id": "EN-KS1-D003",
      "objective_text": "discussing the sequence of events in books and how items of information are related",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O045",
      "domain_id": "EN-KS1-D003",
      "objective_text": "becoming increasingly familiar with and retelling a wider range of stories, fairy stories and traditional tales",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O046",
      "domain_id": "EN-KS1-D003",
      "objective_text": "being introduced to non-fiction books that are structured in different ways",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O047",
      "domain_id": "EN-KS1-D003",
      "objective_text": "recognising simple recurring literary language in stories and poetry",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O048",
      "domain_id": "EN-KS1-D003",
      "objective_text": "discussing and clarifying the meanings of words, linking new meanings to known vocabulary",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O049",
      "domain_id": "EN-KS1-D003",
      "objective_text": "discussing their favourite words and phrases",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O050",
      "domain_id": "EN-KS1-D003",
      "objective_text": "continuing to build up a repertoire of poems learnt by heart, appreciating these and reciting some, with appropriate intonation to make the meaning clear",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O051",
      "domain_id": "EN-KS1-D003",
      "objective_text": "drawing on what they already know or on background information and vocabulary provided by the teacher",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O052",
      "domain_id": "EN-KS1-D003",
      "objective_text": "checking that the text makes sense to them as they read and correcting inaccurate reading",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O053",
      "domain_id": "EN-KS1-D003",
      "objective_text": "making inferences on the basis of what is being said and done",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O054",
      "domain_id": "EN-KS1-D003",
      "objective_text": "answering and asking questions",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O055",
      "domain_id": "EN-KS1-D003",
      "objective_text": "predicting what might happen on the basis of what has been read so far",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O056",
      "domain_id": "EN-KS1-D003",
      "objective_text": "participate in discussion about books, poems and other works that are read to them and those that they can read for themselves, taking turns and listening to what others say",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O057",
      "domain_id": "EN-KS1-D003",
      "objective_text": "explain and discuss their understanding of books, poems and other material, both those that they listen to and those that they read for themselves",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O058",
      "domain_id": "EN-KS1-D004",
      "objective_text": "spell words containing each of the 40+ phonemes already taught",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O059",
      "domain_id": "EN-KS1-D004",
      "objective_text": "spell common exception words",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O060",
      "domain_id": "EN-KS1-D004",
      "objective_text": "spell the days of the week",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O061",
      "domain_id": "EN-KS1-D004",
      "objective_text": "naming the letters of the alphabet in order",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O062",
      "domain_id": "EN-KS1-D004",
      "objective_text": "using letter names to distinguish between alternative spellings of the same sound",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O063",
      "domain_id": "EN-KS1-D004",
      "objective_text": "using the spelling rule for adding –s or –es as the plural marker for nouns and the third person singular marker for verbs",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O064",
      "domain_id": "EN-KS1-D004",
      "objective_text": "using the prefix un–",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O065",
      "domain_id": "EN-KS1-D004",
      "objective_text": "using –ing, –ed, –er and –est where no change is needed in the spelling of root words [for example, helping, helped, helper, eating, quicker, quickest]",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O066",
      "domain_id": "EN-KS1-D004",
      "objective_text": "apply simple spelling rules and guidance, as listed in English Appendix 1",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O067",
      "domain_id": "EN-KS1-D004",
      "objective_text": "write from memory simple sentences dictated by the teacher that include words using the GPCs and common exception words taught so far",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O068",
      "domain_id": "EN-KS1-D004",
      "objective_text": "segmenting spoken words into phonemes and representing these by graphemes, spelling many correctly",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O069",
      "domain_id": "EN-KS1-D004",
      "objective_text": "learning new ways of spelling phonemes for which one or more spellings are already known, and learn some words with each spelling, including a few common homophones",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O070",
      "domain_id": "EN-KS1-D004",
      "objective_text": "learning to spell common exception words",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O071",
      "domain_id": "EN-KS1-D004",
      "objective_text": "learning to spell more words with contracted forms",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O072",
      "domain_id": "EN-KS1-D004",
      "objective_text": "learning the possessive apostrophe (singular) [for example, the girl's book]",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O073",
      "domain_id": "EN-KS1-D004",
      "objective_text": "distinguishing between homophones and near-homophones",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O074",
      "domain_id": "EN-KS1-D004",
      "objective_text": "add suffixes to spell longer words, including –ment, –ness, –ful, –less, –ly",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O075",
      "domain_id": "EN-KS1-D004",
      "objective_text": "apply spelling rules and guidance, as listed in English Appendix 1",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O076",
      "domain_id": "EN-KS1-D004",
      "objective_text": "write from memory simple sentences dictated by the teacher that include words using the GPCs, common exception words and punctuation taught so far",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O077",
      "domain_id": "EN-KS1-D005",
      "objective_text": "sit correctly at a table, holding a pencil comfortably and correctly",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O078",
      "domain_id": "EN-KS1-D005",
      "objective_text": "begin to form lower-case letters in the correct direction, starting and finishing in the right place",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O079",
      "domain_id": "EN-KS1-D005",
      "objective_text": "form capital letters",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O080",
      "domain_id": "EN-KS1-D005",
      "objective_text": "form digits 0-9",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O081",
      "domain_id": "EN-KS1-D005",
      "objective_text": "understand which letters belong to which handwriting 'families' (i.e. letters that are formed in similar ways) and to practise these",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O082",
      "domain_id": "EN-KS1-D005",
      "objective_text": "form lower-case letters of the correct size relative to one another",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O083",
      "domain_id": "EN-KS1-D005",
      "objective_text": "start using some of the diagonal and horizontal strokes needed to join letters and understand which letters, when adjacent to one another, are best left unjoined",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O084",
      "domain_id": "EN-KS1-D005",
      "objective_text": "write capital letters and digits of the correct size, orientation and relationship to one another and to lower case letters",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O085",
      "domain_id": "EN-KS1-D005",
      "objective_text": "use spacing between words that reflects the size of the letters",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O086",
      "domain_id": "EN-KS1-D006",
      "objective_text": "saying out loud what they are going to write about",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O087",
      "domain_id": "EN-KS1-D006",
      "objective_text": "composing a sentence orally before writing it",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O088",
      "domain_id": "EN-KS1-D006",
      "objective_text": "sequencing sentences to form short narratives",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O089",
      "domain_id": "EN-KS1-D006",
      "objective_text": "re-reading what they have written to check that it makes sense",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O090",
      "domain_id": "EN-KS1-D006",
      "objective_text": "discuss what they have written with the teacher or other pupils",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O091",
      "domain_id": "EN-KS1-D006",
      "objective_text": "read aloud their writing clearly enough to be heard by their peers and the teacher",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O092",
      "domain_id": "EN-KS1-D006",
      "objective_text": "writing narratives about personal experiences and those of others (real and fictional)",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O093",
      "domain_id": "EN-KS1-D006",
      "objective_text": "writing about real events",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O094",
      "domain_id": "EN-KS1-D006",
      "objective_text": "writing poetry",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O095",
      "domain_id": "EN-KS1-D006",
      "objective_text": "writing for different purposes",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O096",
      "domain_id": "EN-KS1-D006",
      "objective_text": "planning or saying out loud what they are going to write about",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O097",
      "domain_id": "EN-KS1-D006",
      "objective_text": "writing down ideas and/or key words, including new vocabulary",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O098",
      "domain_id": "EN-KS1-D006",
      "objective_text": "encapsulating what they want to say, sentence by sentence",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O099",
      "domain_id": "EN-KS1-D006",
      "objective_text": "evaluating their writing with the teacher and other pupils",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O100",
      "domain_id": "EN-KS1-D006",
      "objective_text": "re-reading to check that their writing makes sense and that verbs to indicate time are used correctly and consistently, including verbs in the continuous form",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O101",
      "domain_id": "EN-KS1-D006",
      "objective_text": "proof-reading to check for errors in spelling, grammar and punctuation [for example, ends of sentences punctuated correctly]",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O102",
      "domain_id": "EN-KS1-D006",
      "objective_text": "read aloud what they have written with appropriate intonation to make the meaning clear",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O103",
      "domain_id": "EN-KS1-D007",
      "objective_text": "leaving spaces between words",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O104",
      "domain_id": "EN-KS1-D007",
      "objective_text": "joining words and joining clauses using and",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O105",
      "domain_id": "EN-KS1-D007",
      "objective_text": "beginning to punctuate sentences using a capital letter and a full stop, question mark or exclamation mark",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O106",
      "domain_id": "EN-KS1-D007",
      "objective_text": "using a capital letter for names of people, places, the days of the week, and the personal pronoun 'I'",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O107",
      "domain_id": "EN-KS1-D007",
      "objective_text": "learning the grammar for year 1 in English Appendix 2",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O108",
      "domain_id": "EN-KS1-D007",
      "objective_text": "use the grammatical terminology in English Appendix 2 in discussing their writing",
      "is_statutory": true,
      "year": 1,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O109",
      "domain_id": "EN-KS1-D007",
      "objective_text": "learning how to use both familiar and new punctuation correctly (see English Appendix 2), including full stops, capital letters, exclamation marks, question marks, commas for lists and apostrophes for contracted forms and the possessive (singular)",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O110",
      "domain_id": "EN-KS1-D007",
      "objective_text": "sentences with different forms: statement, question, exclamation, command",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O111",
      "domain_id": "EN-KS1-D007",
      "objective_text": "expanded noun phrases to describe and specify [for example, the blue butterfly]",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O112",
      "domain_id": "EN-KS1-D007",
      "objective_text": "the present and past tenses correctly and consistently including the progressive form",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O113",
      "domain_id": "EN-KS1-D007",
      "objective_text": "subordination (using when, if, that, or because) and co-ordination (using or, and, or but)",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O114",
      "domain_id": "EN-KS1-D007",
      "objective_text": "the grammar for year 2 in English Appendix 2",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O115",
      "domain_id": "EN-KS1-D007",
      "objective_text": "some features of written Standard English",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-KS1-O116",
      "domain_id": "EN-KS1-D007",
      "objective_text": "use and understand the grammatical terminology in English Appendix 2 in discussing their writing",
      "is_statutory": true,
      "year": 2,
      "non_statutory_guidance": "",
      "examples": ""
    }
  ],
  "concepts": [
    {
      "concept_id": "EN-KS1-C001",
      "domain_id": "EN-KS1-D002",
      "concept_name": "Phoneme",
      "description": "The smallest unit of sound in spoken language (e.g., /c/ /a/ /t/)",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach phonemes through a systematic synthetic phonics programme (e.g., Letters and Sounds, Read Write Inc.). Begin with single-letter phonemes (/s/, /a/, /t/, /p/) before progressing to digraphs and trigraphs. Use oral segmenting games — say a word slowly and ask children to count the sounds on their fingers. Ensure children understand that a phoneme is a sound, not a letter, by demonstrating words where one sound is represented by more than one letter.",
      "key_vocabulary": "phoneme, sound, letter, mouth, listen, say, hear, word",
      "common_misconceptions": "Children often confuse phonemes with letters, believing that each letter always makes one sound. They may count letters rather than sounds when segmenting (e.g., thinking 'ship' has four sounds instead of three). Some children add a schwa sound to consonant phonemes (e.g., saying 'buh' instead of /b/).",
      "teaching_weight": 1,
      "co_teach_hints": [
        "EN-KS1-C005"
      ]
    },
    {
      "concept_id": "EN-KS1-C002",
      "domain_id": "EN-KS1-D002",
      "concept_name": "Grapheme",
      "description": "A letter or group of letters representing a phoneme (e.g., 'sh', 'ch', 'igh')",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_guidance": "Introduce graphemes alongside phonemes from the start of systematic phonics teaching. Use flashcards showing the grapheme with a picture cue (e.g., 'sh' with a picture of a ship). Teach children that a grapheme can be one letter (s), two letters (sh, ch, th), or three letters (igh, ear). Practise matching graphemes to phonemes using phoneme frames and magnetic letters. Display grapheme charts in the classroom for reference.",
      "key_vocabulary": "grapheme, letter, digraph, trigraph, sound, write, spell, read",
      "common_misconceptions": "Children may think that every letter is a separate grapheme, leading them to split digraphs incorrectly when reading (e.g., reading 'sh' as /s/ /h/). They may struggle to understand that the same phoneme can be represented by different graphemes (e.g., /ee/ can be 'ee', 'ea', 'e-e').",
      "teaching_weight": 1,
      "co_teach_hints": [
        "EN-KS1-C001",
        "EN-KS1-C003",
        "EN-KS1-C005",
        "EN-KS1-C009",
        "EN-KS1-C010",
        "EN-KS1-C011"
      ]
    },
    {
      "concept_id": "EN-KS1-C003",
      "domain_id": "EN-KS1-D002",
      "concept_name": "Grapheme-Phoneme Correspondence (GPC)",
      "description": "The relationship between letters and the sounds they represent",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach GPCs in a systematic order following the school's chosen phonics programme. Start with one-to-one correspondences (one letter, one sound) before introducing alternatives. Use a 'speed sounds' routine where children see the grapheme and say the phoneme rapidly. Revisit GPCs daily through flashcard practice. When children encounter a new GPC in reading, explicitly name it and add it to the class phonics display.",
      "key_vocabulary": "grapheme-phoneme correspondence, sound, letter, match, phonics, code, alphabetic code",
      "common_misconceptions": "Children often assume each letter makes only one sound and become confused when they encounter alternative pronunciations (e.g., 'c' in cat vs city). They may not realise that English has more phonemes (approximately 44) than letters (26), requiring some sounds to be represented by letter combinations.",
      "teaching_weight": 2,
      "co_teach_hints": [
        "EN-KS1-C001",
        "EN-KS1-C002"
      ]
    },
    {
      "concept_id": "EN-KS1-C004",
      "domain_id": "EN-KS1-D002",
      "concept_name": "Blending",
      "description": "Merging individual phonemes together to read whole words",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Model blending explicitly by pointing to each grapheme in a word, saying each phoneme, then sweeping a finger under the word while merging the sounds together. Use 'sound buttons' (dots under single graphemes, lines under digraphs) to support segmenting before blending. Start with CVC words (cat, sit, mop) and progress to CCVC (stop, frog) and CVCC (milk, help). Practise blending daily using decodable books matched to the GPCs taught so far.",
      "key_vocabulary": "blend, sound out, push together, read, phoneme, word, CVC, say the sounds",
      "common_misconceptions": "Children may say the individual phonemes correctly but fail to merge them into a recognisable word — they 'bark at print' without synthesising. Some children blend only the first two sounds and then guess the rest of the word from context or pictures. Others segment but cannot hold all the sounds in memory long enough to blend.",
      "teaching_weight": 2,
      "co_teach_hints": [
        "EN-KS1-C001",
        "EN-KS1-C002",
        "EN-KS1-C005"
      ]
    },
    {
      "concept_id": "EN-KS1-C005",
      "domain_id": "EN-KS1-D002",
      "concept_name": "Segmenting",
      "description": "Breaking spoken words into individual phonemes for spelling",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach segmenting as the reverse of blending — hearing a whole word and breaking it into its component phonemes. Use phoneme frames (Elkonin boxes) where children push a counter into each box as they say each sound. Practise with oral segmenting before writing: say a word, ask children to identify each sound, then write the corresponding grapheme for each. Progress from CVC words to longer words with adjacent consonants and digraphs.",
      "key_vocabulary": "segment, sound out, chop up, phoneme, spell, write, phoneme frame, count the sounds",
      "common_misconceptions": "Children often miss sounds in consonant clusters (writing 'sop' for 'stop') because adjacent consonants are harder to hear separately. They may segment by letter name rather than by sound, or struggle to identify the phonemes in words containing digraphs (e.g., treating 'ch' in 'chip' as two separate sounds).",
      "teaching_weight": 2,
      "co_teach_hints": [
        "EN-KS1-C001",
        "EN-KS1-C002",
        "EN-KS1-C004"
      ]
    },
    {
      "concept_id": "EN-KS1-C006",
      "domain_id": "EN-KS1-D002",
      "concept_name": "Decoding",
      "description": "Using phonic knowledge to read unfamiliar words",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Ensure children apply their phonic knowledge to read unfamiliar words rather than guessing from pictures or context. Model the decoding process explicitly: look at the word, identify the graphemes, say each phoneme, blend them together. Use decodable books that match the GPCs children have been taught. When a child encounters an unfamiliar word, prompt them to 'sound it out' rather than telling them the word. Gradually introduce words with more complex graphemes as phonic knowledge develops.",
      "key_vocabulary": "decode, sound out, blend, read, phonics, unfamiliar word, try, grapheme",
      "common_misconceptions": "Children may over-rely on picture cues or initial letter guessing instead of decoding the whole word. Some children decode accurately but too slowly to retain meaning. Others apply decoding to common exception words that cannot be fully decoded phonically, leading to mispronunciation.",
      "teaching_weight": 4,
      "co_teach_hints": [
        "EN-KS1-C001",
        "EN-KS1-C002"
      ]
    },
    {
      "concept_id": "EN-KS1-C007",
      "domain_id": "EN-KS1-D002",
      "concept_name": "Automatic word recognition",
      "description": "Reading familiar words without conscious decoding",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Build automatic word recognition through repeated exposure to high-frequency words in reading and writing. Use flashcard drills for rapid recognition of common words. Ensure children read decodable texts frequently so that regularly encountered words become automatic. Practise reading common exception words until they are recognised instantly. The goal is to free cognitive resources for comprehension by making word-level reading effortless.",
      "key_vocabulary": "sight word, recognise, read quickly, automatic, fluent, high-frequency word, know by sight",
      "common_misconceptions": "Children may believe that automatic recognition means memorising words as whole shapes rather than understanding their phonemic structure. Some children develop automatic recognition of a limited set of words but continue to guess at unfamiliar words rather than decoding them. Teachers sometimes prioritise sight word memorisation over phonic decoding, which limits long-term reading independence.",
      "teaching_weight": 3,
      "co_teach_hints": [
        "EN-KS1-C008"
      ]
    },
    {
      "concept_id": "EN-KS1-C008",
      "domain_id": "EN-KS1-D002",
      "concept_name": "Common exception words",
      "description": "High-frequency words with unusual spelling patterns that must be learned",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach common exception words (e.g., the, said, was, where, there, one, once) explicitly, drawing attention to the 'tricky' part of each word that does not follow regular phonics rules. Use a 'tricky word' wall and practise reading and spelling these words daily. Highlight which parts of the word are decodable and which must be learned by heart. Statutory exception words for Year 1 and Year 2 are listed in Appendix 1 of the National Curriculum.",
      "key_vocabulary": "exception word, tricky word, tricky part, high-frequency word, learn, remember, spell, read",
      "common_misconceptions": "Children may try to decode exception words fully using phonics rules and produce incorrect pronunciations (e.g., reading 'said' as /s-ay-d/). They may assume all high-frequency words are exception words, when in fact many common words are fully decodable. Some children learn to read exception words but cannot spell them, as reading recognition and spelling recall are different processes.",
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C009",
      "domain_id": "EN-KS1-D002",
      "concept_name": "Vowel digraphs",
      "description": "Two vowels together making one sound (e.g., 'ai', 'ee', 'oa')",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach vowel digraphs systematically within the phonics programme. Introduce each digraph with a key word and picture (e.g., 'ai' — rain, 'ee' — tree, 'oa' — boat, 'oo' — moon/book). Use phoneme frames to show that a digraph represents one phoneme, not two. Practise reading and spelling words containing each digraph. Teach alternative spellings for the same vowel phoneme (e.g., the /ee/ sound can be spelt 'ee', 'ea', 'e-e', 'ie', 'ey').",
      "key_vocabulary": "vowel digraph, two letters, one sound, ai, ee, oa, oo, ou, ow, long vowel",
      "common_misconceptions": "Children often try to sound out each letter in a digraph separately (e.g., reading 'oa' as /o/ /a/ instead of /oa/). They may confuse digraphs that look similar (e.g., 'ou' and 'ow', or 'ai' and 'ia'). Some children do not realise that the same vowel sound can have multiple spelling representations.",
      "teaching_weight": 2,
      "co_teach_hints": [
        "EN-KS1-C001"
      ]
    },
    {
      "concept_id": "EN-KS1-C010",
      "domain_id": "EN-KS1-D002",
      "concept_name": "Consonant digraphs",
      "description": "Two consonants together making one sound (e.g., 'sh', 'ch', 'th')",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach consonant digraphs (sh, ch, th, ng, wh, ck) early in the phonics programme, as they appear in many common words. Use picture cues and actions (e.g., finger to lips for 'sh'). Emphasise that two letters together make one new sound — it is not a blend of the two letter sounds. Teach the two pronunciations of 'th' (voiced as in 'this' and unvoiced as in 'thin'). Practise reading and writing words with consonant digraphs in initial and final positions.",
      "key_vocabulary": "consonant digraph, sh, ch, th, ng, ck, wh, two letters, one sound",
      "common_misconceptions": "Children commonly attempt to say each letter's individual sound rather than the digraph sound (e.g., /s/ /h/ instead of /sh/). They may confuse 'ch' and 'sh' or struggle to distinguish the voiced and unvoiced 'th' sounds. Some children find 'ng' particularly difficult because it never appears at the start of English words.",
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C011",
      "domain_id": "EN-KS1-D002",
      "concept_name": "Split digraph",
      "description": "Two letters separated by another letter making one sound (e.g., 'a-e' in 'make')",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach the split digraph pattern (a-e, e-e, i-e, o-e, u-e) by showing how the 'e' at the end of a word changes the vowel sound from short to long. Use word pairs to demonstrate the pattern (e.g., cap/cape, hop/hope, kit/kite, tub/tube). Explain that the two letters work together even though they are separated by a consonant — the 'e' is not silent but does a job of making the vowel say its name. Use phoneme frames with the split digraph marked as one unit.",
      "key_vocabulary": "split digraph, magic e, a-e, i-e, o-e, u-e, e-e, long vowel, bossy e",
      "common_misconceptions": "Children often think the final 'e' makes its own sound rather than modifying the preceding vowel. They may apply the split digraph rule to words where it does not apply (e.g., 'have', 'come', 'give'). The term 'magic e' can create a misconception that the 'e' appears randomly rather than being a systematic spelling pattern.",
      "teaching_weight": 2,
      "co_teach_hints": [
        "EN-KS1-C001"
      ]
    },
    {
      "concept_id": "EN-KS1-C012",
      "domain_id": "EN-KS1-D002",
      "concept_name": "Syllables",
      "description": "Beats or units of sound within words",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach syllables by clapping or tapping the beats in spoken words before connecting to reading and spelling. Use children's names as starting points (e.g., 'Sam' = 1 syllable, 'Emily' = 3 syllables). Explain that every syllable must contain a vowel sound. Use syllable segmenting as a strategy for reading and spelling longer words — break the word into syllables, read or spell each syllable, then put them back together.",
      "key_vocabulary": "syllable, beat, clap, vowel, part of a word, break up, multi-syllable",
      "common_misconceptions": "Children sometimes confuse syllables with phonemes, thinking each sound is a syllable. They may miscount syllables in words with adjacent vowels (e.g., thinking 'lion' has one syllable) or with silent 'e' endings (e.g., counting 'cake' as two syllables). Some children tap letters rather than beats when asked to count syllables.",
      "teaching_weight": 2,
      "co_teach_hints": [
        "EN-KS1-C001",
        "EN-KS1-C003",
        "EN-KS1-C004",
        "EN-KS1-C005",
        "EN-KS1-C006",
        "EN-KS1-C007",
        "EN-KS1-C008",
        "EN-KS1-C009",
        "EN-KS1-C010",
        "EN-KS1-C011",
        "EN-KS1-C013"
      ]
    },
    {
      "concept_id": "EN-KS1-C013",
      "domain_id": "EN-KS1-D002",
      "concept_name": "Reading fluency",
      "description": "Reading accurately and at a good pace with expression",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Develop reading fluency through regular practice reading familiar texts and rereading decodable books. Model fluent reading aloud daily, demonstrating appropriate pace, expression and phrasing. Use paired reading where a fluent reader (adult or peer) reads alongside the child. Teach children to read in 'chunks' or phrases rather than word by word. Once children can decode accurately, shift attention to pace and prosody through repeated readings of the same short text.",
      "key_vocabulary": "fluency, expression, pace, smooth, read aloud, practise, phrasing, intonation",
      "common_misconceptions": "Children may equate fast reading with fluent reading, reading rapidly without attention to meaning or expression. Some children read accurately but in a monotone, word-by-word manner. Others develop fluency with familiar texts but lose it completely when encountering new material, suggesting that decoding has not yet become fully automatic.",
      "teaching_weight": 3,
      "co_teach_hints": [
        "EN-KS1-C001",
        "EN-KS1-C003",
        "EN-KS1-C004",
        "EN-KS1-C006",
        "EN-KS1-C007",
        "EN-KS1-C008",
        "EN-KS1-C012"
      ]
    },
    {
      "concept_id": "EN-KS1-C014",
      "domain_id": "EN-KS1-D003",
      "concept_name": "Prediction",
      "description": "Using clues from text and pictures to anticipate what might happen next",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach prediction as an active reading strategy by modelling it during shared reading. Before reading, ask children to look at the cover, title and illustrations and say what they think the book will be about. During reading, pause at key moments and ask 'What do you think will happen next? What makes you think that?' Encourage children to use clues from the text and pictures to support their predictions. After reading, revisit predictions to confirm or revise them.",
      "key_vocabulary": "predict, guess, think, what next, clue, expect, because, I think",
      "common_misconceptions": "Children often make wild guesses unconnected to the text rather than using evidence from what they have read or seen. Some children are reluctant to predict because they fear being wrong — emphasise that predictions are not right or wrong but should be supported by evidence. Others make predictions but do not revisit them to check against what actually happens.",
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C015",
      "domain_id": "EN-KS1-D003",
      "concept_name": "Inference",
      "description": "Reading between the lines to understand what is implied but not stated",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Introduce inference at KS1 through picture books and illustrations, asking 'How do you think this character is feeling? How do you know?' Model the thinking process: 'The picture shows tears on her face and she is looking down, so I think she feels sad.' Use stories with clear emotional content. Ask questions that require children to think beyond the literal text, such as 'Why did the character do that?' Teach children to use the phrase 'I think... because...' to justify inferences.",
      "key_vocabulary": "inference, clue, think, feel, because, why, work out, between the lines",
      "common_misconceptions": "Young children often state what is explicitly shown rather than inferring meaning (e.g., 'She is crying' rather than 'She is sad because she lost her toy'). They may project their own feelings onto characters without evidence from the text. Some children do not understand the difference between what the text says and what it implies.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C016",
      "domain_id": "EN-KS1-D003",
      "concept_name": "Retrieval",
      "description": "Finding and extracting explicit information from text",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach retrieval by modelling how to find specific information in a text. Start with simple questions where the answer is stated explicitly (e.g., 'What colour was the dog?'). Teach children to scan the text to find the relevant part rather than rereading the entire text. Use shared reading to practise pointing to where in the text the answer can be found. Progress from finding single facts to finding and combining information from different parts of a short text.",
      "key_vocabulary": "find, look for, where does it say, answer, information, text, point to, show me",
      "common_misconceptions": "Children often answer retrieval questions from memory or general knowledge rather than checking the text. They may give the answer to a different question because they have not read the question carefully. Some children answer with a whole sentence copied from the text when a specific detail is required.",
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C017",
      "domain_id": "EN-KS1-D003",
      "concept_name": "Making connections to own experience",
      "description": "Linking what is read to personal knowledge and experiences",
      "concept_type": "process",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Encourage children to make personal connections to texts during shared and guided reading. Ask questions like 'Has anything like this ever happened to you?' or 'Does this remind you of another story you know?' Model making connections yourself: 'This reminds me of when I...' Ensure connections are relevant to the text and support comprehension rather than being purely anecdotal. Use texts that reflect children's real-life experiences to build this skill.",
      "key_vocabulary": "connect, remind, similar, like, experience, same as, different from, relate",
      "common_misconceptions": "Children sometimes share personal anecdotes that are tangential to the text rather than genuine connections that deepen understanding. They may make connections only to their own experience and not to other texts or wider knowledge. Some children struggle to explain how their connection helps them understand the text better.",
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C018",
      "domain_id": "EN-KS1-D003",
      "concept_name": "Story structure",
      "description": "Understanding narrative elements: beginning, middle, end, characters, setting, events",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach story structure using simple frameworks: beginning (who, where), middle (what happens, the problem) and end (how it is resolved). Use story maps and story mountains as visual scaffolds. Retell familiar stories together, identifying the key structural elements. During shared reading, pause to discuss where the story is in its structure. Use traditional tales with clear, repetitive structures as models before introducing more complex narratives.",
      "key_vocabulary": "beginning, middle, end, character, setting, problem, resolution, story, what happens",
      "common_misconceptions": "Children often think a story's beginning is just the first sentence, rather than the section that introduces characters and setting. They may confuse story events with story structure, listing 'then... then... then...' without identifying the key turning point or problem. Some children assume all stories follow the same structure.",
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C019",
      "domain_id": "EN-KS1-D003",
      "concept_name": "Vocabulary development",
      "description": "Learning and using new words in context",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_guidance": "Develop vocabulary through read-alouds, explicitly teaching 2-3 new words per text. When encountering unfamiliar words, use the context and illustrations to discuss meaning. Create a class 'word wall' or 'word of the day' display. Encourage children to use new words in their own speech and writing. Teach simple strategies for working out word meanings: look at the picture, read around the word, think about what would make sense.",
      "key_vocabulary": "word, meaning, new word, what does it mean, vocabulary, synonym, describe, interesting word",
      "common_misconceptions": "Children may assume they cannot understand a text if they encounter an unfamiliar word, rather than using context to work out its meaning. They may use familiar words to define new words inaccurately (e.g., saying 'enormous' means 'big' without understanding the degree). Some children passively skip unfamiliar words without noticing them.",
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C020",
      "domain_id": "EN-KS1-D003",
      "concept_name": "Discussing texts",
      "description": "Talking about books with others, sharing opinions and understanding",
      "concept_type": "process",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_guidance": "Create regular opportunities for structured discussion about books during shared reading, guided reading and class story time. Use open-ended questions that invite discussion rather than single-word answers: 'What did you think about...?' 'Why do you think the author chose...?' Model turn-taking and active listening in book discussions. Encourage children to respond to each other's ideas, not just the teacher. Use partner talk ('turn and tell your partner...') to ensure all children participate.",
      "key_vocabulary": "discuss, talk about, share, opinion, think, agree, disagree, favourite, because",
      "common_misconceptions": "Children may retell the plot rather than discussing their response to it. They may give one-word answers rather than explaining their thinking. Some children dominate discussions while others are reluctant to contribute — structured pair and group talk helps ensure all voices are heard.",
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C021",
      "domain_id": "EN-KS1-D003",
      "concept_name": "Reciting poetry",
      "description": "Learning and performing poems by heart with expression",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach a range of poems by heart across KS1, beginning with simple nursery rhymes and action rhymes in Year 1 and progressing to poems with more complex patterns and vocabulary in Year 2. Use performance techniques — clapping rhythms, adding actions, varying volume and pace. Recite poems together as a class before asking individuals to perform. Choose poems with strong rhythm and rhyme to support memorisation, and discuss how the poet's word choices create effects.",
      "key_vocabulary": "poem, rhyme, rhythm, verse, line, perform, recite, by heart, learn, poet",
      "common_misconceptions": "Children sometimes think poetry must rhyme, limiting their appreciation of free verse. They may memorise words without understanding meaning, reciting mechanically without expression. Some children confuse reciting a poem with reading it aloud from a page.",
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C022",
      "domain_id": "EN-KS1-D003",
      "concept_name": "Literary language patterns",
      "description": "Recognizing repetitive phrases, rhyme, and patterned language in stories and poems",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Draw attention to repeated language patterns, refrains, and literary language during shared reading of stories and poems. Use texts with predictable patterns (e.g., 'We're Going on a Bear Hunt', 'Each Peach Pear Plum') so children can join in and internalise the structures. Discuss how authors use language differently from everyday speech — 'Once upon a time', 'happily ever after', repeated phrases and refrains. Encourage children to use literary language patterns in their own storytelling and writing.",
      "key_vocabulary": "pattern, repeated, refrain, once upon a time, rhyme, rhythm, story language, phrase",
      "common_misconceptions": "Children may not distinguish between everyday language and literary language, using conversational register in story writing. They may think 'story language' means using complicated words rather than recognising specific structural and formulaic features. Some children learn formulaic openings and endings but struggle to use patterned language within the body of their writing.",
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C023",
      "domain_id": "EN-KS1-D003",
      "concept_name": "Sequencing events",
      "description": "Ordering story events in chronological order",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach sequencing through retelling stories in the correct order using visual supports such as picture cards, story maps and sequencing strips. Begin with stories that have a clear chronological structure. Ask children to identify 'What happened first? Then what? What happened at the end?' Use time connectives (first, then, next, after that, finally) to support oral and written sequencing. Practise sequencing events from children's own experiences before applying to texts.",
      "key_vocabulary": "first, then, next, after, finally, order, sequence, beginning, middle, end, what happened",
      "common_misconceptions": "Children often include excessive detail about one event while omitting others, resulting in unbalanced retellings. They may confuse the order of events, particularly in stories with flashbacks or parallel narratives. Some children struggle to distinguish between important plot events and minor details when sequencing.",
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C024",
      "domain_id": "EN-KS1-D003",
      "concept_name": "Self-correction while reading",
      "description": "Noticing and correcting reading errors to maintain meaning",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach children to monitor their own reading by noticing when something does not make sense. Model this during shared reading: 'That didn't sound right — let me go back and try again.' Encourage children to reread sentences that do not make sense, checking the sounds, the meaning and the grammar. Teach the three checking strategies: Does it look right? Does it sound right? Does it make sense? Praise children who self-correct rather than reading on regardless.",
      "key_vocabulary": "check, reread, try again, make sense, correct, does it look right, does it sound right",
      "common_misconceptions": "Children may read through errors without noticing because they are focused solely on decoding individual words rather than constructing meaning. Some children stop at an error but wait for an adult to correct them rather than attempting self-correction. Others correct pronunciation but do not reconsider meaning.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C025",
      "domain_id": "EN-KS1-D004",
      "concept_name": "Spelling using phonemes",
      "description": "Hearing sounds in words and choosing appropriate graphemes",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach spelling through phoneme segmentation — children say the word, identify each phoneme, and write the corresponding grapheme. Use phoneme frames and say-the-sounds mats. Begin with CVC words and progress to words with digraphs, adjacent consonants and longer structures. Encourage 'have a go' spelling using phonic knowledge rather than asking an adult for every word. Practise regular dictation of words and sentences using GPCs that have been taught.",
      "key_vocabulary": "spell, sound out, segment, phoneme, grapheme, write, say the sounds, have a go",
      "common_misconceptions": "Children may represent only the most prominent sounds in a word, omitting unstressed vowels or consonants in clusters (e.g., writing 'grl' for 'girl'). They may use letter names rather than phonemes when segmenting. Some children use a plausible but incorrect grapheme for a phoneme (e.g., 'rane' for 'rain') — this shows good phonic application and should be praised before teaching the correct spelling.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C026",
      "domain_id": "EN-KS1-D004",
      "concept_name": "Learning exception word spellings",
      "description": "Memorizing spellings of words that don't follow regular patterns",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach Year 1 and Year 2 exception word spellings through daily practice using look-say-cover-write-check routines. Highlight the 'tricky' part of each word that does not follow phonics rules (e.g., the 'o' in 'one', the 'w' in 'two'). Display exception words prominently and refer to them during writing. Group exception words by common features where possible (e.g., words with 'ould': could, would, should). Assess regularly through dictation and ensure children can spell these words in their independent writing.",
      "key_vocabulary": "exception word, tricky word, learn, remember, look-say-cover-write-check, practise, spell",
      "common_misconceptions": "Children often spell exception words phonetically (e.g., 'sed' for 'said', 'woz' for 'was') because their phonic knowledge overrides the irregular spelling. They may learn to read exception words but not be able to spell them from memory. Some children assume all frequently used words have tricky spellings, failing to recognise that many common words are fully decodable.",
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C027",
      "domain_id": "EN-KS1-D004",
      "concept_name": "Suffixes",
      "description": "Word endings that change meaning or function (e.g., -s, -ed, -ing, -er, -est)",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Introduce common suffixes systematically: -s, -es, -ing, -ed, -er, -est, -ly, -ful, -less, -ment, -ness. Teach the spelling rules that apply when adding suffixes (e.g., doubling the final consonant, dropping the final 'e', changing 'y' to 'i'). Use root word + suffix activities where children physically combine word cards. Teach the meaning each suffix adds (e.g., -er means 'more', -est means 'most', -ful means 'full of'). Ensure children practise using suffixed words in their writing.",
      "key_vocabulary": "suffix, ending, -s, -es, -ing, -ed, -er, -est, root word, add, change",
      "common_misconceptions": "Children frequently forget to apply spelling rules when adding suffixes (e.g., writing 'hopeing' instead of 'hoping' or 'runing' instead of 'running'). They may not recognise that the root word is preserved within the suffixed form. Some children add suffixes incorrectly to exception words (e.g., 'goed' for 'went').",
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C028",
      "domain_id": "EN-KS1-D004",
      "concept_name": "Prefixes",
      "description": "Word beginnings that change meaning (e.g., un-)",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Introduce the concept of a prefix as a group of letters added to the front of a word that changes its meaning. At KS1, the most common prefix is 'un-' (undo, unhappy, unfair, unlock). Teach children that the prefix changes the meaning to the opposite. Use matching activities: pair words with their 'un-' form. Show that the spelling of the root word does not change when a prefix is added. This lays the foundation for the wider range of prefixes taught in KS2.",
      "key_vocabulary": "prefix, un-, beginning, opposite, change meaning, root word, undo, unhappy",
      "common_misconceptions": "Children may confuse prefixes with the first letters of a word, thinking that any word beginning with 'un' has a prefix (e.g., 'under', 'uncle'). They may struggle to understand that 'un-' reverses meaning without changing the root word's spelling. Some children try to add 'un-' to words where it does not apply.",
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C029",
      "domain_id": "EN-KS1-D004",
      "concept_name": "Root words",
      "description": "Base words before suffixes or prefixes are added",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach root words as the base from which other words are built. Show children that adding suffixes or prefixes to a root word creates new words in the same word family (e.g., help → helps, helped, helping, helpful, unhelpful). Use word-building activities with cards or magnetic letters. When children encounter unfamiliar words in reading, prompt them to look for a root word they recognise. Display word families on classroom walls.",
      "key_vocabulary": "root word, base word, word family, build, add, prefix, suffix, related words",
      "common_misconceptions": "Children sometimes identify a root word incorrectly by removing letters that are actually part of the base word (e.g., thinking 'butter' is 'butt' + 'er'). They may not realise that the root word carries the core meaning. Some children confuse root words with rhyming words or words that share initial letters.",
      "teaching_weight": 2,
      "co_teach_hints": [
        "EN-KS1-C027",
        "EN-KS1-C028"
      ]
    },
    {
      "concept_id": "EN-KS1-C030",
      "domain_id": "EN-KS1-D004",
      "concept_name": "Plural formation",
      "description": "Adding -s or -es to make words plural",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach the rules for forming plurals systematically: add -s to most nouns (cat/cats), add -es to words ending in s, sh, ch, x, z (box/boxes, church/churches), change -y to -ies when 'y' follows a consonant (baby/babies), and some irregular plurals (child/children, mouse/mice). Use sorting activities where children categorise words by their plural rule. Practise both reading and spelling plurals. Connect to grammar work on singular and plural nouns.",
      "key_vocabulary": "plural, singular, one, more than one, -s, -es, -ies, add, change, noun",
      "common_misconceptions": "Children often apply the default -s rule to all words (e.g., 'boxs', 'churchs'). They may not change 'y' to 'i' before adding -es (e.g., 'babys'). Irregular plurals cause particular difficulty because they cannot be generated by rule (e.g., children may write 'mouses', 'sheeps', 'childs').",
      "teaching_weight": 2,
      "co_teach_hints": [
        "EN-KS1-C026",
        "EN-KS1-C027",
        "EN-KS1-C028",
        "EN-KS1-C029",
        "EN-KS1-C033",
        "EN-KS1-C034"
      ]
    },
    {
      "concept_id": "EN-KS1-C031",
      "domain_id": "EN-KS1-D004",
      "concept_name": "Contractions",
      "description": "Shortened forms of words using apostrophes (e.g., can't, I'm, we'll)",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach contractions by showing that the apostrophe represents the missing letter(s). Start with common contractions that children encounter frequently: can't (cannot), don't (do not), I'm (I am), it's (it is), didn't (did not), won't (will not). Use physical demonstrations: write both words, then show which letters are removed and replaced by the apostrophe. Display a contractions chart showing the full form and the shortened form side by side.",
      "key_vocabulary": "contraction, apostrophe, short form, missing letter, cannot/can't, do not/don't, I am/I'm",
      "common_misconceptions": "Children frequently place the apostrophe in the wrong position because they do not understand it marks where letters have been removed. They may confuse contractions with possessives (e.g., mixing up 'it's' and 'its'). Some children omit apostrophes entirely when writing contractions or insert them randomly into words.",
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C032",
      "domain_id": "EN-KS1-D004",
      "concept_name": "Possessive apostrophes (singular)",
      "description": "Using apostrophe + s to show ownership (e.g., the girl's book)",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Introduce the possessive apostrophe with singular nouns in Year 2. Teach that the apostrophe + s shows that something belongs to someone or something (e.g., 'the girl's bag' means the bag belonging to the girl). Use physical objects and labels to practise: hold up an item and ask 'Whose is this?' then write the possessive form. Contrast with plural -s to make the distinction clear. Practise in the context of sentence writing.",
      "key_vocabulary": "apostrophe, possessive, belongs to, 's, owner, whose, singular",
      "common_misconceptions": "Children frequently confuse the possessive apostrophe with the plural -s, omitting the apostrophe entirely or adding one to all words ending in -s. They may place the apostrophe after the 's' even for singular nouns. The distinction between 'the dog's bone' (possessive) and 'the dogs run' (plural) is a persistent source of error throughout primary school.",
      "teaching_weight": 3,
      "co_teach_hints": [
        "EN-KS1-C031",
        "EN-KS1-C033"
      ]
    },
    {
      "concept_id": "EN-KS1-C033",
      "domain_id": "EN-KS1-D004",
      "concept_name": "Homophones",
      "description": "Words that sound the same but have different spellings and meanings",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach homophones at KS1 by focusing on common pairs that children encounter in their reading and writing: there/their/they're, to/too/two, here/hear, see/sea, be/bee, no/know, right/write, night/knight, blue/blew. Present each pair with clear definitions, pictures, and example sentences. Use fill-in-the-gap activities where children choose the correct homophone for the sentence. Display homophone pairs on a working wall.",
      "key_vocabulary": "homophone, same sound, different meaning, different spelling, pair, which one, choose",
      "common_misconceptions": "Children commonly confuse 'there', 'their' and 'they're' because they sound identical. They may not understand why English has words that sound the same but are spelt differently. Some children learn one spelling and use it for all meanings. The apostrophe in 'they're' adds an additional complication.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C034",
      "domain_id": "EN-KS1-D004",
      "concept_name": "Spelling patterns and rules",
      "description": "Regular patterns in English spelling (e.g., doubling consonants, -tch endings)",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach spelling patterns and rules explicitly within the phonics programme and beyond. Key KS1 patterns include: the /dʒ/ sound spelt as 'ge' and 'dge' at the end of words, the /s/ sound spelt 'c' before 'e', 'i' and 'y', the /n/ sound spelt 'kn' and 'gn' at the beginning of words, and the /r/ sound spelt 'wr' at the beginning of words. Use word sorting activities to help children identify and apply patterns. Practise through regular dictation and spelling tests.",
      "key_vocabulary": "spelling rule, pattern, rule, sort, group, same sound, different spelling, silent letter",
      "common_misconceptions": "Children may overgeneralise a newly learned rule, applying it to words where it does not fit (e.g., using 'dge' in every word with a /dʒ/ sound). They may not recognise that some spelling patterns are position-dependent (e.g., 'ck' only appears after a short vowel). Some children learn rules in isolation but fail to apply them in independent writing.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C035",
      "domain_id": "EN-KS1-D005",
      "concept_name": "Pencil grip and posture",
      "description": "Holding writing implements correctly and sitting properly",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach correct pencil grip (tripod grip) from the very start of Reception and reinforce consistently in Year 1. Ensure children sit with feet flat on the floor, table at elbow height, paper slightly angled, and non-writing hand steadying the paper. Use pencil grips as physical aids if needed. Teach left-handed children with paper angled to the right and hand positioned below the writing line. Correct poor habits early before they become entrenched.",
      "key_vocabulary": "pencil grip, tripod grip, sit up straight, feet on floor, hold, position, steady, posture",
      "common_misconceptions": "Children may grip the pencil too tightly or too close to the point, causing fatigue and poor control. Some develop a fist grip or four-finger grip that limits fine motor movement. Left-handed children may adopt a 'hook' position to see their writing, which can be prevented by correct paper positioning.",
      "teaching_weight": 1,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C036",
      "domain_id": "EN-KS1-D005",
      "concept_name": "Letter formation",
      "description": "Forming letters correctly with proper start and finish points",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach letter formation systematically using the school's chosen handwriting programme. Group letters by formation family (e.g., 'c' family: c, a, d, g, o, q, s; 'l' family: l, i, t, u, j, y). Teach starting points and direction of strokes explicitly. Use multi-sensory approaches: forming letters in sand, in the air, with paint, and on lined paper. Ensure correct formation of all 26 lower-case letters before focusing on speed. Practise little and often rather than in long handwriting sessions.",
      "key_vocabulary": "letter, form, start, stroke, direction, line, tall letter, small letter, tail letter, write",
      "common_misconceptions": "Children commonly form letters from the bottom up instead of the top down, or start 'c'-based letters from the wrong position. They may reverse letters, particularly b/d, p/q, and s/z. Some children form letters correctly in isolation but revert to incorrect formation when writing at speed in sentences.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C037",
      "domain_id": "EN-KS1-D005",
      "concept_name": "Letter families",
      "description": "Groups of letters formed in similar ways",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach letter families based on shared formation patterns to make handwriting instruction systematic and efficient. Common groupings include: the anti-clockwise round letters (c, a, d, g, o, q, s), the down-stroke letters (l, i, t, u, j, y), the letters with a retrace (n, m, h, b, k, p, r), and the zigzag letters (v, w, x, z). Teach one family at a time, practising the shared movement pattern before individual letter formation. Use verbal prompts that describe the movement for each family.",
      "key_vocabulary": "letter family, group, round letters, tall letters, tail letters, pattern, same shape, formation",
      "common_misconceptions": "Children may not see the connection between letters in the same family, treating each letter as entirely unique. They may apply the formation pattern from one family to letters in another (e.g., starting 'n' like 'c' by going anticlockwise). Some children learn families in isolation but cannot apply the correct formation when writing words.",
      "teaching_weight": 1,
      "co_teach_hints": [
        "EN-KS1-C036"
      ]
    },
    {
      "concept_id": "EN-KS1-C038",
      "domain_id": "EN-KS1-D005",
      "concept_name": "Capital letter formation",
      "description": "Writing upper-case letters correctly",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach capital letter formation separately from lower-case letters, as all capitals start from the top and many use different strokes from their lower-case equivalents. Practise capital letters in functional contexts: writing names, days of the week, place names, and at the beginning of sentences. Ensure children understand that capitals and lower-case letters represent the same sound but look different. Use lined paper with clear ascender and baseline guides.",
      "key_vocabulary": "capital letter, upper case, lower case, big letter, name, sentence start, proper noun",
      "common_misconceptions": "Children often mix capital and lower-case letters within words, particularly for letters whose forms look similar in both cases (e.g., S/s, K/k, C/c). They may use capitals for emphasis or decoration rather than understanding their grammatical function. Some children form capitals that are the same size as lower-case letters.",
      "teaching_weight": 2,
      "co_teach_hints": [
        "EN-KS1-C036"
      ]
    },
    {
      "concept_id": "EN-KS1-C039",
      "domain_id": "EN-KS1-D005",
      "concept_name": "Digit formation",
      "description": "Writing numbers 0-9 correctly",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach digit formation (0-9) explicitly alongside letter formation in Year 1. Ensure children start each digit from the correct position and use consistent formation. Practise writing digits in number sentences, on number lines, and in maths activities. Use multi-sensory approaches as with letter formation. Pay particular attention to digits that are commonly reversed (5, 3, 7) and ensure consistent size and proportion.",
      "key_vocabulary": "digit, number, form, write, start, size, line, numeral, 0-9",
      "common_misconceptions": "Children commonly reverse digits, particularly 2, 3, 5, and 7. They may form digits inconsistently, using different starting points each time. Some children make digits too large or too small relative to their letter writing. Confusion between digit formation and letter formation can occur (e.g., confusing '9' and 'g', or '5' and 'S').",
      "teaching_weight": 1,
      "co_teach_hints": [
        "EN-KS1-C035",
        "EN-KS1-C036",
        "EN-KS1-C038",
        "EN-KS1-C040",
        "EN-KS1-C041",
        "EN-KS1-C042"
      ]
    },
    {
      "concept_id": "EN-KS1-C040",
      "domain_id": "EN-KS1-D005",
      "concept_name": "Letter sizing and proportion",
      "description": "Making letters the correct relative size to each other",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach children to control letter size using lined paper with clear guidelines showing the baseline, midline and ascender line. Ensure children understand that most lower-case letters sit on the baseline and reach the midline, ascenders (b, d, f, h, k, l, t) reach the top line, and descenders (g, j, p, q, y) drop below the baseline. Model consistent sizing and spacing in all teacher writing. Use tracing and copying activities on correctly lined paper.",
      "key_vocabulary": "size, ascender, descender, baseline, tall letter, tail letter, small letter, line, proportion",
      "common_misconceptions": "Children often write all letters the same size, failing to differentiate between ascenders, descenders and x-height letters. They may not use the lines on their paper as guides. Some children write increasingly small or large across a line as their hand position changes. Inconsistent letter sizing makes handwriting difficult to read.",
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C041",
      "domain_id": "EN-KS1-D005",
      "concept_name": "Joining letters",
      "description": "Beginning to use diagonal and horizontal strokes to join handwriting",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Introduce letter joining in Year 2 once children can form all letters correctly. Teach the four basic joins: diagonal join to letters without ascenders (in, un), diagonal join to letters with ascenders (ab, id), horizontal join to letters without ascenders (ou, we), and horizontal join to letters with ascenders (ol, wh). Practise joins within high-frequency words that children write regularly. Ensure that joining does not compromise letter formation accuracy — children who have not yet secured correct formation should continue practising individual letters.",
      "key_vocabulary": "join, joining, joined-up, cursive, stroke, diagonal, horizontal, flick, link",
      "common_misconceptions": "Children may try to join all letters, including those that do not join naturally from certain positions. They may sacrifice letter formation accuracy for the sake of joining, producing illegible writing. Some children join letters but leave gaps within the join, creating a 'broken' effect rather than a smooth connection.",
      "teaching_weight": 3,
      "co_teach_hints": [
        "EN-KS1-C036"
      ]
    },
    {
      "concept_id": "EN-KS1-C042",
      "domain_id": "EN-KS1-D005",
      "concept_name": "Word spacing",
      "description": "Leaving appropriate spaces between words",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach word spacing from the earliest stages of sentence writing. Use a 'finger space' between words — children place their index finger after each word to create a consistent gap. Model correct spacing in all teacher demonstrations. Use spacers (lollipop sticks or special spacing tools) for children who find finger spacing difficult. As children progress, they should internalise appropriate spacing without physical aids. Display examples of well-spaced and poorly-spaced writing for comparison.",
      "key_vocabulary": "finger space, gap, between words, space, spacing, clear, separate, word boundary",
      "common_misconceptions": "Children frequently run words together, particularly when writing quickly or concentrating on spelling. Some leave no spaces at all, while others leave inconsistent spaces — very large gaps between some words and none between others. A few children place spaces within words rather than between them, often at syllable boundaries.",
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C043",
      "domain_id": "EN-KS1-D006",
      "concept_name": "Oral rehearsal",
      "description": "Saying sentences out loud before writing them down",
      "concept_type": "process",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach oral rehearsal before writing by asking children to say their sentence aloud before putting pen to paper. In Year 1, children rehearse individual sentences: 'Tell me what you're going to write. Say it again. Now write it.' In Year 2, children rehearse sequences of sentences. Use partner talk so children practise their sentences with a peer. Oral rehearsal helps children hold the sentence in working memory, hear whether it makes sense grammatically, and focus on transcription (spelling and handwriting) during writing.",
      "key_vocabulary": "say it first, tell me, sentence, rehearse, practise, say your sentence, out loud, plan",
      "common_misconceptions": "Children sometimes change their sentence between rehearsing it orally and writing it down, losing the grammatical structure or key vocabulary. Some children resist oral rehearsal, wanting to write immediately, but then lose track of their sentence midway through writing. Others rehearse a complete sentence but write only the first few words because they cannot hold the whole sentence in memory.",
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C044",
      "domain_id": "EN-KS1-D006",
      "concept_name": "Sentence composition",
      "description": "Creating complete, meaningful sentences",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach sentence composition by building up from words to phrases to complete sentences. In Year 1, focus on writing simple sentences with a capital letter, finger spaces and a full stop. Use sentence stems ('I can see a...', 'The ___ is ___') to scaffold early sentence writing. In Year 2, extend to compound sentences using 'and', 'but', 'or', 'so' and begin subordination with 'when', 'if', 'because'. Model composing sentences through shared writing, thinking aloud about word choices and grammatical structures.",
      "key_vocabulary": "sentence, capital letter, full stop, word, finger space, write, compose, say, tell",
      "common_misconceptions": "Children may write sentence fragments (e.g., 'The big dog.') or run-on sentences without punctuation. They often forget capital letters at the start of sentences or full stops at the end because they are concentrating on spelling. Some children write phrases or lists rather than complete sentences with a subject and verb.",
      "teaching_weight": 3,
      "co_teach_hints": [
        "EN-KS1-C043",
        "EN-KS1-C045",
        "EN-KS1-C046",
        "EN-KS1-C047",
        "EN-KS1-C048",
        "EN-KS1-C049",
        "EN-KS1-C050",
        "EN-KS1-C051"
      ]
    },
    {
      "concept_id": "EN-KS1-C045",
      "domain_id": "EN-KS1-D006",
      "concept_name": "Narrative sequencing",
      "description": "Ordering sentences to create a coherent story",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach narrative sequencing by modelling how to write short stories or recounts in chronological order. Use time connectives (first, then, next, after that, finally) to structure the sequence. Provide picture prompts or story maps that children follow when writing. Start with retelling familiar stories before moving to original narratives. In Year 1, aim for 3-4 sequenced sentences; in Year 2, extend to 6-8 sentences with clear beginning, middle and end.",
      "key_vocabulary": "first, then, next, after, finally, beginning, middle, end, in order, story, what happened",
      "common_misconceptions": "Children often write narratives that are heavily front-loaded, with extensive detail about the beginning and very little about the middle or end. They may use 'and then' repeatedly instead of varying connectives. Some children struggle to maintain a consistent narrative thread, introducing unrelated events.",
      "teaching_weight": 3,
      "co_teach_hints": [
        "EN-KS1-C043",
        "EN-KS1-C044",
        "EN-KS1-C046",
        "EN-KS1-C047",
        "EN-KS1-C048",
        "EN-KS1-C049",
        "EN-KS1-C051"
      ]
    },
    {
      "concept_id": "EN-KS1-C046",
      "domain_id": "EN-KS1-D006",
      "concept_name": "Re-reading for sense",
      "description": "Reading back own writing to check it makes sense",
      "concept_type": "process",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach children to reread their writing as they go, checking that each sentence makes sense. Model this during shared writing: write a sentence, then read it back pointing to each word. In Year 1, focus on checking that the sentence sounds right and that no words have been missed. In Year 2, extend to checking spelling, punctuation and grammatical sense. Use a 'read it back' routine where children reread every sentence immediately after writing it and again at the end of the piece.",
      "key_vocabulary": "reread, check, make sense, read back, point, does it sound right, missing word, correct",
      "common_misconceptions": "Children often 'read' what they intended to write rather than what is actually on the page, missing errors. They may read too quickly to catch missing words or incorrect spellings. Some children see rereading as a separate activity done at the end rather than an ongoing part of the writing process.",
      "teaching_weight": 2,
      "co_teach_hints": [
        "EN-KS1-C043",
        "EN-KS1-C044",
        "EN-KS1-C045",
        "EN-KS1-C048",
        "EN-KS1-C049",
        "EN-KS1-C050",
        "EN-KS1-C051"
      ]
    },
    {
      "concept_id": "EN-KS1-C047",
      "domain_id": "EN-KS1-D006",
      "concept_name": "Writing for different purposes",
      "description": "Adapting writing for different text types (narrative, recount, poetry)",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Introduce different text types through reading before asking children to write them. Cover key purposes: narrative (stories), recount (retelling events), instruction (how to do something), information (facts about a topic), letters, and poetry. Discuss the features of each text type explicitly: 'Instructions use numbered steps and bossy verbs.' Provide model texts and writing frames to scaffold early attempts. Ensure children understand that the purpose of writing determines its form and language choices.",
      "key_vocabulary": "purpose, story, recount, instructions, information, letter, poem, audience, text type, for",
      "common_misconceptions": "Children may default to narrative structure for all writing, including instructions and information texts. They may not understand that different purposes require different language features (e.g., imperative verbs in instructions, past tense in recounts). Some children focus on content without considering who they are writing for.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C048",
      "domain_id": "EN-KS1-D006",
      "concept_name": "Planning writing",
      "description": "Thinking ahead and organizing ideas before writing",
      "concept_type": "process",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach planning as an essential step before writing, appropriate to the child's stage. In Year 1, planning is oral: 'Tell me what you're going to write about. What will happen first? Then what?' In Year 2, introduce simple written plans: boxing up (dividing the page into sections for each part of the text), story maps, bullet point lists, or pictorial plans. Ensure planning is quick and purposeful, not an elaborate task in itself. The plan should help children hold their ideas in sequence.",
      "key_vocabulary": "plan, think, ideas, what will happen, first, then, next, boxing up, story map, before you write",
      "common_misconceptions": "Children sometimes treat planning as a finished piece of writing in itself, spending more time on the plan than on the actual text. Some children plan but then ignore their plan when writing. Others resist planning because they want to start writing immediately, but then lose track of their ideas midway through.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C049",
      "domain_id": "EN-KS1-D006",
      "concept_name": "Evaluating own writing",
      "description": "Assessing effectiveness of writing with teacher and peers",
      "concept_type": "process",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach evaluation of own writing through guided questions: 'Does your writing make sense? Have you included the things on your plan? Does it have a beginning, middle and end? Have you used interesting words?' In Year 2, introduce peer evaluation where children read their writing to a partner and receive feedback. Use success criteria or a simple checklist so children know what to look for. Model self-evaluation during shared writing, showing how to identify strengths and areas for improvement.",
      "key_vocabulary": "evaluate, check, improve, good, better, success criteria, what went well, even better if",
      "common_misconceptions": "Children may evaluate their writing purely on neatness rather than content and structure. They may be reluctant to identify areas for improvement, seeing evaluation as criticism. Peer evaluation can become unfocused unless children are given specific criteria to consider.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C050",
      "domain_id": "EN-KS1-D006",
      "concept_name": "Proof-reading",
      "description": "Checking for errors in spelling, grammar and punctuation",
      "concept_type": "process",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach proof-reading as a final check of transcription accuracy — spelling, punctuation and handwriting. Distinguish proof-reading from editing (which changes content and vocabulary). In Year 1, focus on checking capital letters and full stops. In Year 2, add checking for spelling of common exception words and correct use of other punctuation. Teach children to use a coloured pencil to mark corrections neatly. Use a proof-reading checklist that children can follow independently.",
      "key_vocabulary": "proof-read, check, correct, mistake, spelling, punctuation, capital letter, full stop, fix",
      "common_misconceptions": "Children often confuse proof-reading with editing, wanting to rewrite whole sections rather than correcting transcription errors. They may skim-read too quickly and miss errors. Some children identify errors but do not know how to correct them. Others may 'correct' words that were actually right, introducing new errors.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C051",
      "domain_id": "EN-KS1-D006",
      "concept_name": "Reading aloud with expression",
      "description": "Performing own writing with appropriate intonation",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Provide regular opportunities for children to read their own writing aloud to a partner, a group or the class. Teach children to read with expression, varying their voice for questions, exclamations and dialogue. In Year 1, focus on reading clearly and audibly. In Year 2, develop attention to intonation, pace and expression that matches the meaning. Use shared reading of texts as models for expressive reading. Give feedback on performance as well as content.",
      "key_vocabulary": "read aloud, expression, voice, loud enough, clearly, perform, audience, listen, pace",
      "common_misconceptions": "Children may read their own writing in a monotone because they are focused on decoding their own handwriting and spelling. Some children read too quietly to be heard or too fast to be understood. Others may add expression that does not match the content because they are performing rather than communicating meaning.",
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C052",
      "domain_id": "EN-KS1-D007",
      "concept_name": "Sentence boundaries",
      "description": "Understanding where sentences begin and end",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach sentence boundaries explicitly by showing that a sentence is a complete thought with a subject and a verb, beginning with a capital letter and ending with a full stop, question mark or exclamation mark. Use physical activities: children stand up at the start of a sentence and sit down at the end. In shared reading, identify where sentences begin and end. During shared writing, model deciding where one sentence ends and the next begins. Dictation exercises build awareness of sentence boundaries.",
      "key_vocabulary": "sentence, capital letter, full stop, start, end, boundary, complete, idea, finish",
      "common_misconceptions": "Children frequently write sentences without clear boundaries, either running several sentences together or fragmenting sentences with premature full stops. They may think a sentence ends when they run out of space on a line. Some children use 'and' to join every idea into one continuous sentence rather than using full stops to separate distinct thoughts.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C053",
      "domain_id": "EN-KS1-D007",
      "concept_name": "Capital letters for sentence starts",
      "description": "Using capital letters to begin sentences",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach that every sentence begins with a capital letter through consistent modelling in shared writing and by drawing attention to capital letters at sentence starts during shared reading. Use editing activities where children find and correct sentences with missing capital letters. Provide regular dictation practice where children must apply the capital letter rule. Display the rule prominently and refer to it every time children write. Capital letters for sentence starts should be consistently expected from the earliest independent writing.",
      "key_vocabulary": "capital letter, upper case, sentence start, beginning, big letter, first letter",
      "common_misconceptions": "Children often use capital letters inconsistently — sometimes remembering for the first sentence but forgetting for subsequent ones. They may use capital letters in the middle of words or sentences for no grammatical reason. Some children write entirely in capitals because they find capital letter formation easier than lower-case.",
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C054",
      "domain_id": "EN-KS1-D007",
      "concept_name": "Full stops",
      "description": "Using full stops to end statements",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach the full stop as the most common sentence-ending punctuation mark. Model placing full stops consistently in shared writing and point them out during shared reading. Teach children that a full stop signals the reader to take a brief pause. Use oral activities: read a passage aloud and have children clap or stamp when they hear the full stop. Provide editing exercises where children insert missing full stops into unpunctuated text. Practise through daily dictation.",
      "key_vocabulary": "full stop, end of sentence, stop, pause, punctuation, finish, period, mark",
      "common_misconceptions": "Children often omit full stops because they are concentrating on the content and spelling of the next sentence. Some children place full stops at the end of every line rather than at the end of each sentence. Others use full stops after individual words or after headings. The full stop is the punctuation mark most commonly omitted by KS1 writers.",
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C055",
      "domain_id": "EN-KS1-D007",
      "concept_name": "Question marks",
      "description": "Using question marks to end questions",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach question marks alongside the concept of a question — a sentence that asks something and expects an answer. Identify questions in shared reading: 'How do we know this is a question? What word does it start with?' Teach common question words (who, what, where, when, why, how) and practise writing questions using these openings. Use partner activities where children write questions for each other to answer. Contrast questions with statements to make the function of the question mark clear.",
      "key_vocabulary": "question mark, question, ask, who, what, where, when, why, how, answer",
      "common_misconceptions": "Children may put question marks at the end of all sentences, not distinguishing between questions and statements. They may write sentences that look like statements but add a question mark (e.g., 'The cat sat on the mat?'). Some children confuse question marks with full stops because both appear at the end of a sentence.",
      "teaching_weight": 2,
      "co_teach_hints": [
        "EN-KS1-C052",
        "EN-KS1-C053",
        "EN-KS1-C054",
        "EN-KS1-C057",
        "EN-KS1-C058",
        "EN-KS1-C059",
        "EN-KS1-C060",
        "EN-KS1-C061",
        "EN-KS1-C063",
        "EN-KS1-C064",
        "EN-KS1-C065",
        "EN-KS1-C066",
        "EN-KS1-C067",
        "EN-KS1-C068",
        "EN-KS1-C069",
        "EN-KS1-C070",
        "EN-KS1-C071"
      ]
    },
    {
      "concept_id": "EN-KS1-C056",
      "domain_id": "EN-KS1-D007",
      "concept_name": "Exclamation marks",
      "description": "Using exclamation marks to show strong feeling",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach exclamation marks for sentences that express strong feelings — surprise, excitement, commands, or emphasis. Read texts with exclamation marks aloud, modelling the change in voice. Practise writing exclamations beginning with 'What' or 'How' (What a lovely day! How exciting!). Teach that exclamation marks should not be overused — discuss examples of writing with too many exclamation marks and how this reduces their impact. Distinguish exclamation marks from full stops and question marks.",
      "key_vocabulary": "exclamation mark, surprise, exciting, shout, strong feeling, emphasis, what a, how",
      "common_misconceptions": "Children often overuse exclamation marks, placing them at the end of every sentence for emphasis. They may not understand that an exclamation sentence has a specific grammatical form (beginning with 'What' or 'How' and containing a verb). Some children use multiple exclamation marks (!!!) for greater emphasis.",
      "teaching_weight": 2,
      "co_teach_hints": [
        "EN-KS1-C054",
        "EN-KS1-C055"
      ]
    },
    {
      "concept_id": "EN-KS1-C057",
      "domain_id": "EN-KS1-D007",
      "concept_name": "Capital letters for proper nouns",
      "description": "Using capitals for names, places, days, and pronoun 'I'",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach that capital letters are used for people's names, place names, days of the week, and the personal pronoun 'I'. Introduce the term 'proper noun' in Year 2. Use children's own names as the starting point — every child should write their name with a capital letter from the start. Extend to names of characters in stories, the school name, the town name, and days of the week. Practise identifying proper nouns in shared reading and correcting sentences where they are missing.",
      "key_vocabulary": "capital letter, proper noun, name, person, place, day, month, title, special name",
      "common_misconceptions": "Children may capitalise common nouns that they consider important (e.g., 'my Dog', 'the Park') while failing to capitalise actual proper nouns. They may not understand the distinction between a common noun and a proper noun. Some children capitalise only the first name of a person but not the surname.",
      "teaching_weight": 2,
      "co_teach_hints": [
        "EN-KS1-C052",
        "EN-KS1-C053",
        "EN-KS1-C054",
        "EN-KS1-C055",
        "EN-KS1-C058",
        "EN-KS1-C059",
        "EN-KS1-C060",
        "EN-KS1-C063",
        "EN-KS1-C066",
        "EN-KS1-C067",
        "EN-KS1-C069",
        "EN-KS1-C071"
      ]
    },
    {
      "concept_id": "EN-KS1-C058",
      "domain_id": "EN-KS1-D007",
      "concept_name": "Conjunction 'and'",
      "description": "Using 'and' to join words and clauses",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach 'and' as the first conjunction, used to join words, phrases or clauses. In Year 1, focus on using 'and' to join two ideas within a sentence (e.g., 'I like apples and bananas' or 'We went to the park and we played on the swings'). In Year 2, introduce 'but', 'or' and 'so' as additional coordinating conjunctions. Model using conjunctions in shared writing, showing how they combine short, choppy sentences into longer, more fluent ones. Discourage overuse of 'and' to chain multiple clauses together.",
      "key_vocabulary": "and, join, conjunction, link, connect, combine, sentence, two ideas",
      "common_misconceptions": "Children frequently overuse 'and' as their only conjunction, chaining many ideas into one long, run-on sentence. They may place 'and' at the start of a new sentence rather than using it within a sentence. Some children do not recognise that 'and' can join words ('red and blue') as well as clauses.",
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C059",
      "domain_id": "EN-KS1-D007",
      "concept_name": "Sentence types",
      "description": "Understanding statements, questions, exclamations and commands",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach the four main sentence types: statements (telling sentences), questions (asking sentences), exclamations (sentences expressing strong feeling, beginning with 'What' or 'How'), and commands (bossy sentences telling someone to do something). Use practical activities: give children a topic and ask them to write one of each type. Identify sentence types in shared reading. Discuss how the purpose of a sentence determines its type and punctuation. In Year 2, link to punctuation choices and verb forms.",
      "key_vocabulary": "statement, question, exclamation, command, sentence type, telling, asking, bossy, feeling",
      "common_misconceptions": "Children often struggle to distinguish between exclamations and statements with exclamation marks. They may classify any sentence ending with '!' as an exclamation, without understanding the specific grammatical structure. Some children think commands must be rude because they are 'bossy'.",
      "teaching_weight": 3,
      "co_teach_hints": [
        "EN-KS1-C052",
        "EN-KS1-C053",
        "EN-KS1-C054",
        "EN-KS1-C055",
        "EN-KS1-C056",
        "EN-KS1-C057",
        "EN-KS1-C058",
        "EN-KS1-C060",
        "EN-KS1-C063",
        "EN-KS1-C064",
        "EN-KS1-C066",
        "EN-KS1-C067",
        "EN-KS1-C069",
        "EN-KS1-C070",
        "EN-KS1-C071"
      ]
    },
    {
      "concept_id": "EN-KS1-C060",
      "domain_id": "EN-KS1-D007",
      "concept_name": "Expanded noun phrases",
      "description": "Adding adjectives to nouns for description (e.g., the blue butterfly)",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach expanded noun phrases in Year 2 by modelling how to add adjectives before a noun to give more detail (e.g., 'the dog' → 'the big, brown dog'). Start with simple adjective + noun combinations and progress to more complex noun phrases. Use picture description activities where children must add detail to make their descriptions more precise. Teach children to choose adjectives for effect rather than quantity — two well-chosen adjectives are better than four random ones.",
      "key_vocabulary": "noun phrase, adjective, describe, detail, expand, noun, add, more detail, the big red ball",
      "common_misconceptions": "Children may add adjectives that do not add meaningful information (e.g., 'the nice, good dog'). They may string together too many adjectives without considering their order or impact. Some children confuse expanded noun phrases with expanded sentences, thinking they need to make the whole sentence longer rather than adding detail to the noun.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C061",
      "domain_id": "EN-KS1-D007",
      "concept_name": "Present and past tense",
      "description": "Using correct verb forms to indicate when something happens",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach present and past tense through oral work before writing. Use the 'yesterday/today' frame: 'Today I walk to school. Yesterday I walked to school.' Practise regular past tense formation by adding -ed, teaching the three pronunciations (/t/ as in walked, /d/ as in played, /ɪd/ as in wanted). Introduce common irregular past tense verbs (went, saw, ran, said, made) as words that must be learned individually. Use shared writing to practise maintaining consistent tense throughout a piece.",
      "key_vocabulary": "tense, present tense, past tense, now, yesterday, today, -ed, happened, is happening, verb",
      "common_misconceptions": "Children commonly overgeneralise the -ed rule to irregular verbs (e.g., 'goed', 'runned', 'sayed'). They frequently switch tenses within a single piece of writing without realising, particularly moving from past to present tense mid-narrative. Some children confuse past tense with the time marker 'yesterday' and do not apply tense changes to the verb itself.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C062",
      "domain_id": "EN-KS1-D007",
      "concept_name": "Progressive verb forms",
      "description": "Using -ing forms to show ongoing actions (e.g., she is drumming)",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Introduce the progressive (continuous) form in Year 2 using the -ing ending with 'is/are' (present progressive: 'She is running') and 'was/were' (past progressive: 'She was running'). Contrast with the simple tense: 'She runs' vs 'She is running' — one describes a habitual action, the other an action in progress. Use pictures showing ongoing actions to elicit progressive forms. Practise converting between simple and progressive forms in oral and written activities.",
      "key_vocabulary": "progressive, -ing, is running, was running, happening now, continuous, verb, present, past",
      "common_misconceptions": "Children may use the progressive form without the auxiliary verb, writing 'She running' instead of 'She is running'. They may not understand the difference in meaning between 'I eat breakfast' (habitual) and 'I am eating breakfast' (right now). Some children over-apply the progressive to all verbs, including stative verbs that do not usually take this form.",
      "teaching_weight": 3,
      "co_teach_hints": [
        "EN-KS1-C061",
        "EN-KS1-C066",
        "EN-KS1-C067",
        "EN-KS1-C069",
        "EN-KS1-C071"
      ]
    },
    {
      "concept_id": "EN-KS1-C063",
      "domain_id": "EN-KS1-D007",
      "concept_name": "Subordination",
      "description": "Using when, if, that, or because to join clauses",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Introduce subordination in Year 2 using the conjunctions 'when', 'if', 'that' and 'because'. Teach that subordination joins a main clause to a subordinate clause that depends on it for meaning (e.g., 'I wore my coat because it was raining'). Model writing sentences with the subordinate clause in different positions: 'When it rained, we went inside' and 'We went inside when it rained.' Use sentence-combining activities where children join two short sentences using a subordinating conjunction.",
      "key_vocabulary": "because, when, if, that, conjunction, join, reason, clause, explain, time",
      "common_misconceptions": "Children often confuse subordination with coordination, using 'because' as they would use 'and' without understanding that it introduces a reason. They may write incomplete subordinate clauses as sentences (e.g., 'Because it was raining.' as a complete sentence). Some children struggle with the comma needed when the subordinate clause comes first.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C064",
      "domain_id": "EN-KS1-D007",
      "concept_name": "Co-ordination",
      "description": "Using or, and, or but to join clauses equally",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach co-ordination in Year 2 using the conjunctions 'and', 'but', 'or' and 'so'. Explain that co-ordination joins two equally important ideas. Teach the meaning each conjunction adds: 'and' adds information, 'but' shows contrast, 'or' offers a choice, 'so' shows a result. Use sentence-combining activities where children choose the appropriate conjunction to join two clauses. Contrast with subordination to build understanding of different clause relationships.",
      "key_vocabulary": "and, but, or, so, co-ordination, join, conjunction, two ideas, contrast, choice, result",
      "common_misconceptions": "Children often default to 'and' for all co-ordination, not appreciating that 'but', 'or' and 'so' carry different meanings. They may confuse 'but' and 'so', particularly when expressing cause and effect. Some children use co-ordinating conjunctions to start new sentences rather than to join clauses within a sentence.",
      "teaching_weight": 3,
      "co_teach_hints": [
        "EN-KS1-C052",
        "EN-KS1-C053",
        "EN-KS1-C054",
        "EN-KS1-C055",
        "EN-KS1-C058",
        "EN-KS1-C059",
        "EN-KS1-C060",
        "EN-KS1-C063",
        "EN-KS1-C065",
        "EN-KS1-C066",
        "EN-KS1-C067",
        "EN-KS1-C069"
      ]
    },
    {
      "concept_id": "EN-KS1-C065",
      "domain_id": "EN-KS1-D007",
      "concept_name": "Commas in lists",
      "description": "Using commas to separate items in a list",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach commas in lists as a way to separate three or more items in a sentence. Model with simple examples: 'I packed a hat, a scarf, some gloves and a coat.' Teach that the comma replaces the word 'and' between items, with 'and' used only before the final item. Practise with lists of nouns, adjectives and verbs. Use oral rehearsal — children say the sentence aloud with pauses at the comma positions before writing. Provide editing activities where children add commas to unpunctuated lists.",
      "key_vocabulary": "comma, list, separate, pause, items, and, between, in a list, three or more",
      "common_misconceptions": "Children may place commas randomly rather than between individual items. They may use 'and' between every item instead of commas (e.g., 'a hat and a scarf and gloves and a coat'). Some children place a comma before 'and' (the Oxford comma), which is not required in UK English conventions taught at KS1. Others forget commas entirely in lists.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C066",
      "domain_id": "EN-KS1-D007",
      "concept_name": "Word classes: nouns",
      "description": "Understanding that nouns are naming words for people, places, things",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach nouns as naming words — words that name a person, place, thing or idea. Use sorting activities: give children a set of words and ask them to identify which are nouns. Introduce the distinction between common nouns (dog, school, book) and proper nouns (Ben, London, Tuesday) with Year 2 pupils. Use sentence-level activities where children identify the nouns in a sentence. Connect noun recognition to expanded noun phrase work, showing that adjectives describe nouns.",
      "key_vocabulary": "noun, naming word, person, place, thing, common noun, proper noun, name",
      "common_misconceptions": "Children may think nouns are only concrete objects they can see and touch, not understanding that abstract nouns (happiness, idea) or collective nouns (team, flock) are also nouns. They may confuse nouns with adjectives when a word can function as either (e.g., 'a gold ring' — is 'gold' a noun or adjective here?).",
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C067",
      "domain_id": "EN-KS1-D007",
      "concept_name": "Word classes: verbs",
      "description": "Understanding that verbs are action or being words",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach verbs as doing words (action verbs: run, jump, eat) and being words (state verbs: is, am, was, have). Use physical activities: call out verbs and have children perform the action. In reading, identify the verb in each sentence — 'What is happening in this sentence?' Teach that every sentence must have a verb. In Year 2, connect verb knowledge to tense work, showing how the verb changes form to show when something happened.",
      "key_vocabulary": "verb, doing word, action, being word, is, am, was, happened, happening, tense",
      "common_misconceptions": "Children often identify only physical action verbs, failing to recognise verbs like 'is', 'have', 'know' and 'think' as verbs. They may confuse verbs with adverbs (particularly -ly words) or with nouns that can also be verbs (e.g., 'play', 'run', 'walk'). Some children think the verb must be the first word in a sentence.",
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C068",
      "domain_id": "EN-KS1-D007",
      "concept_name": "Word classes: adjectives",
      "description": "Understanding that adjectives describe nouns",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach adjectives as describing words that give more information about a noun. Start with observable qualities (colour, size, shape, texture) and progress to more abstract descriptions (scary, exciting, mysterious). Use real objects: ask children to describe them using adjectives. Play adjective games: 'Tell me three adjectives for this teddy bear.' Connect to expanded noun phrase work and to writing — encourage children to choose effective adjectives that help the reader picture what is being described.",
      "key_vocabulary": "adjective, describing word, what is it like, colour, size, shape, detail, noun, describe",
      "common_misconceptions": "Children may confuse adjectives with adverbs, particularly when both describe something. They may use vague adjectives (nice, good, big) rather than specific, vivid ones. Some children think that more adjectives always make writing better, producing lists of adjectives rather than carefully chosen ones.",
      "teaching_weight": 2,
      "co_teach_hints": [
        "EN-KS1-C055",
        "EN-KS1-C060",
        "EN-KS1-C061",
        "EN-KS1-C065",
        "EN-KS1-C066",
        "EN-KS1-C067",
        "EN-KS1-C069",
        "EN-KS1-C071"
      ]
    },
    {
      "concept_id": "EN-KS1-C069",
      "domain_id": "EN-KS1-D007",
      "concept_name": "Word classes: adverbs",
      "description": "Understanding that adverbs describe verbs (often ending in -ly)",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Introduce adverbs in Year 2 as words that describe how a verb is performed. Start with manner adverbs ending in -ly (slowly, quickly, quietly, carefully). Model adding adverbs to sentences to give more information about the action: 'She walked' → 'She walked slowly.' Use drama activities: perform an action in different ways and identify the adverb. Connect to writing, encouraging children to use adverbs to make their sentences more descriptive and precise.",
      "key_vocabulary": "adverb, how, -ly, slowly, quickly, carefully, quietly, loudly, describe the verb",
      "common_misconceptions": "Children may think all adverbs end in -ly, which is incorrect (e.g., 'fast', 'well', 'very'). They may confuse adverbs with adjectives, not understanding whether a word is describing a noun or a verb. Some children overstuff sentences with adverbs, writing 'She quickly quietly slowly walked' without understanding that adverbs should add precision, not quantity.",
      "teaching_weight": 3,
      "co_teach_hints": [
        "EN-KS1-C052",
        "EN-KS1-C054",
        "EN-KS1-C055",
        "EN-KS1-C057",
        "EN-KS1-C058",
        "EN-KS1-C059",
        "EN-KS1-C060",
        "EN-KS1-C061",
        "EN-KS1-C062",
        "EN-KS1-C063",
        "EN-KS1-C064",
        "EN-KS1-C066",
        "EN-KS1-C067",
        "EN-KS1-C068",
        "EN-KS1-C070",
        "EN-KS1-C071"
      ]
    },
    {
      "concept_id": "EN-KS1-C070",
      "domain_id": "EN-KS1-D007",
      "concept_name": "Compound words",
      "description": "Understanding words made from two words joined together",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach compound words as two words joined together to make a new word (e.g., football, bedroom, playground, sunflower, rainbow). Use word-building activities: give children two sets of word cards and ask them to combine them to make compound words. Discuss how the meaning of a compound word relates to its component parts. This builds understanding of morphology and helps children decode unfamiliar compound words in reading by identifying the two smaller words within them.",
      "key_vocabulary": "compound word, two words, join, together, football, bedroom, playground, make a new word",
      "common_misconceptions": "Children may try to create compound words from any two words, producing combinations that do not exist. They may not realise that both parts of a compound word contribute to its meaning. Some children write compound words as two separate words (e.g., 'foot ball') or attempt to split non-compound words (e.g., thinking 'carpet' is 'car' + 'pet').",
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C071",
      "domain_id": "EN-KS1-D007",
      "concept_name": "Grammatical terminology",
      "description": "Using correct terms: letter, word, sentence, noun, verb, adjective, etc.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Introduce grammatical terminology as specified in the National Curriculum Appendix 2 for each year group. Year 1 terms include: letter, capital letter, word, singular, plural, sentence, punctuation, full stop, question mark, exclamation mark. Year 2 adds: noun, noun phrase, statement, question, exclamation, command, compound, suffix, adjective, adverb, verb, tense (past, present), apostrophe, comma. Teach terms in context, using them when discussing reading and writing. Display terms with definitions and examples.",
      "key_vocabulary": "noun, verb, adjective, adverb, sentence, punctuation, singular, plural, tense, suffix, compound",
      "common_misconceptions": "Children may learn grammatical terms as definitions without understanding how to apply them. They may confuse similar terms (e.g., noun/noun phrase, adjective/adverb). Some children can identify word classes in isolation but not within sentences. Others may resist using technical vocabulary, preferring informal descriptions.",
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C072",
      "domain_id": "EN-KS1-D007",
      "concept_name": "Standard English",
      "description": "Using grammatically correct English in writing",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Begin raising awareness of Standard English in Year 2, focusing on common non-standard forms that children may use in speech. Address subject-verb agreement (e.g., 'we were' not 'we was'), consistent use of standard verb forms (e.g., 'I did' not 'I done', 'she went' not 'she goed'), and double negatives (e.g., 'I didn't do anything' not 'I didn't do nothing'). Approach sensitively: validate children's home language and dialect while teaching that Standard English is used in formal contexts and in writing.",
      "key_vocabulary": "Standard English, correct, grammar, writing, formal, we were, I did, she went, spoken, written",
      "common_misconceptions": "Children may feel their home dialect or spoken language is 'wrong' if Standard English is presented as the only correct form. They may not understand when Standard English is required (writing and formal speech) versus when dialect is appropriate (informal speech). Some children apply Standard English rules inconsistently, particularly with irregular verb forms.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C073",
      "domain_id": "EN-KS1-D001",
      "concept_name": "Listening skills",
      "description": "Attending to and understanding what others say",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_guidance": "Develop listening skills through focused listening activities: follow multi-step instructions, identify specific sounds or words in a spoken passage, and respond to what a partner has said. Use circle time to practise attentive listening with eye contact and still bodies. Teach children to show they are listening through body language and by asking follow-up questions. Play barrier games where children must listen carefully to instructions to complete a task they cannot see.",
      "key_vocabulary": "listen, hear, pay attention, eyes on the speaker, still body, what did they say, respond",
      "common_misconceptions": "Children may appear to be listening (sitting still, looking at the speaker) without actually processing what is being said. They may hear the first instruction but not subsequent ones. Some children equate listening with waiting for their turn to speak rather than genuinely attending to another person's contribution.",
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C074",
      "domain_id": "EN-KS1-D001",
      "concept_name": "Turn-taking in discussion",
      "description": "Taking appropriate turns when speaking in groups",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_guidance": "Teach explicit turn-taking strategies during class discussions and partner work. Use visual aids such as a talking stick or talking token to show whose turn it is to speak. Model waiting, listening to the speaker, and responding before making a new point. Teach children to build on what others have said: 'I agree with ___ because...', 'I think something different...' Practise in small groups before whole-class discussions so that all children have opportunities to contribute.",
      "key_vocabulary": "turn, wait, listen, your turn, my turn, speak, respond, take turns, share, one at a time",
      "common_misconceptions": "Children may interrupt others because they are eager to share their idea and fear forgetting it. They may wait for their turn without listening to what is being said. Some children are reluctant to take a turn at all, particularly in whole-class settings. Others may dominate the conversation without awareness of others' need to contribute.",
      "teaching_weight": 2,
      "co_teach_hints": [
        "EN-KS1-C073",
        "EN-KS1-C075",
        "EN-KS1-C076"
      ]
    },
    {
      "concept_id": "EN-KS1-C075",
      "domain_id": "EN-KS1-D001",
      "concept_name": "Relevant questioning",
      "description": "Asking questions that extend understanding",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "teaching_guidance": "Teach children to ask relevant questions that extend their understanding. Model questioning during shared reading: 'I wonder why the character did that? Let me ask a question.' Teach question starters (who, what, where, when, why, how) and practise generating questions about a topic or text. Use 'question of the day' routines and partner questioning activities. Distinguish between questions that have a single factual answer and questions that invite discussion and opinion.",
      "key_vocabulary": "question, ask, who, what, where, when, why, how, wonder, find out, I want to know",
      "common_misconceptions": "Children often make statements disguised as questions or ask questions that are not relevant to the topic. They may ask questions they already know the answer to rather than genuine enquiry questions. Some children are reluctant to ask questions because they fear appearing foolish.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C076",
      "domain_id": "EN-KS1-D001",
      "concept_name": "Justifying opinions",
      "description": "Giving reasons for views and answers",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "teaching_guidance": "Teach children to justify their opinions using the frame 'I think... because...' Start with simple preferences: 'Which character do you like best? Why?' Progress to justifying opinions about texts, events and ideas. Model the difference between stating an opinion ('I like this book') and justifying it ('I like this book because the pictures help me imagine the story'). Use talk partners so that all children practise justifying opinions orally before being asked to do so in front of the whole class.",
      "key_vocabulary": "because, I think, reason, why, explain, opinion, agree, disagree, evidence, justify",
      "common_misconceptions": "Children frequently state opinions without any justification. They may give circular reasons ('I like it because it's good'). Some children confuse opinions with facts, presenting subjective preferences as objective truths. Others find it difficult to disagree respectfully with a peer's opinion.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-KS1-C077",
      "domain_id": "EN-KS1-D001",
      "concept_name": "Drama and role-play",
      "description": "Taking on roles to explore characters and situations",
      "concept_type": "process",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_guidance": "Use drama and role-play activities to develop children's spoken language, imagination and understanding of texts. Strategies include hot-seating (interviewing a character), freeze-frame (creating still images of key moments), conscience alley (exploring a character's dilemma), and small-world play. Use role-play areas linked to the class topic or text being studied. Drama should be purposeful, developing language and understanding rather than being purely recreational. Follow up with writing in role or discussion of what was learned.",
      "key_vocabulary": "role-play, drama, character, pretend, imagine, act out, perform, hot-seat, freeze-frame",
      "common_misconceptions": "Children may see drama as 'just playing' rather than a structured learning activity. They may find it difficult to stay in character or to speak as someone other than themselves. Some children are reluctant to participate in drama activities due to shyness, requiring carefully scaffolded, low-stakes entry points such as partner work before group performance.",
      "teaching_weight": 2,
      "co_teach_hints": [
        "EN-KS1-C073",
        "EN-KS1-C075",
        "EN-KS1-C076"
      ]
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "EN-KS1-C001",
      "dependent_concept": "EN-KS1-C004",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 1.0,
      "rationale": "Children must understand what phonemes are before they can blend them together to read words"
    },
    {
      "prerequisite_concept": "EN-KS1-C002",
      "dependent_concept": "EN-KS1-C004",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 1.0,
      "rationale": "Children must understand what graphemes are before they can blend the sounds they represent"
    },
    {
      "prerequisite_concept": "EN-KS1-C003",
      "dependent_concept": "EN-KS1-C006",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 1.0,
      "rationale": "Knowledge of GPCs is essential for decoding unfamiliar words"
    },
    {
      "prerequisite_concept": "EN-KS1-C004",
      "dependent_concept": "EN-KS1-C006",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 1.0,
      "rationale": "Blending skill is the core mechanism for decoding words"
    },
    {
      "prerequisite_concept": "EN-KS1-C006",
      "dependent_concept": "EN-KS1-C007",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Children must decode words many times before recognition becomes automatic"
    },
    {
      "prerequisite_concept": "EN-KS1-C006",
      "dependent_concept": "EN-KS1-C013",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Accurate decoding is necessary before fluent reading can develop"
    },
    {
      "prerequisite_concept": "EN-KS1-C010",
      "dependent_concept": "EN-KS1-C006",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.8,
      "rationale": "Knowledge of consonant digraphs expands the range of words that can be decoded"
    },
    {
      "prerequisite_concept": "EN-KS1-C009",
      "dependent_concept": "EN-KS1-C006",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.8,
      "rationale": "Knowledge of vowel digraphs expands the range of words that can be decoded"
    },
    {
      "prerequisite_concept": "EN-KS1-C011",
      "dependent_concept": "EN-KS1-C006",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.8,
      "rationale": "Understanding split digraphs enables reading of words like 'make' and 'time'"
    },
    {
      "prerequisite_concept": "EN-KS1-C012",
      "dependent_concept": "EN-KS1-C006",
      "confidence": "inferred",
      "relationship_type": "cognitive",
      "strength": 0.7,
      "rationale": "Understanding syllables helps in breaking down longer words for decoding"
    },
    {
      "prerequisite_concept": "EN-KS1-C013",
      "dependent_concept": "EN-KS1-C015",
      "confidence": "inferred",
      "relationship_type": "cognitive",
      "strength": 0.8,
      "rationale": "Fluent reading frees cognitive resources for higher-level comprehension like inference"
    },
    {
      "prerequisite_concept": "EN-KS1-C016",
      "dependent_concept": "EN-KS1-C015",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Children typically retrieve explicit information before making inferences"
    },
    {
      "prerequisite_concept": "EN-KS1-C019",
      "dependent_concept": "EN-KS1-C015",
      "confidence": "inferred",
      "relationship_type": "cognitive",
      "strength": 0.7,
      "rationale": "Broader vocabulary enables deeper comprehension and inference"
    },
    {
      "prerequisite_concept": "EN-KS1-C018",
      "dependent_concept": "EN-KS1-C014",
      "confidence": "inferred",
      "relationship_type": "cognitive",
      "strength": 0.7,
      "rationale": "Understanding story structure helps children predict what might happen next"
    },
    {
      "prerequisite_concept": "EN-KS1-C016",
      "dependent_concept": "EN-KS1-C023",
      "confidence": "inferred",
      "relationship_type": "cognitive",
      "strength": 0.7,
      "rationale": "Children must retrieve events before they can sequence them"
    },
    {
      "prerequisite_concept": "EN-KS1-C001",
      "dependent_concept": "EN-KS1-C005",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 1.0,
      "rationale": "Understanding phonemes is essential for segmenting words into sounds for spelling"
    },
    {
      "prerequisite_concept": "EN-KS1-C005",
      "dependent_concept": "EN-KS1-C025",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 1.0,
      "rationale": "Segmenting is the core skill for spelling using phonics"
    },
    {
      "prerequisite_concept": "EN-KS1-C003",
      "dependent_concept": "EN-KS1-C025",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 1.0,
      "rationale": "Knowledge of GPCs is needed to choose correct graphemes when spelling"
    },
    {
      "prerequisite_concept": "EN-KS1-C029",
      "dependent_concept": "EN-KS1-C027",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Children must identify root words before adding suffixes"
    },
    {
      "prerequisite_concept": "EN-KS1-C029",
      "dependent_concept": "EN-KS1-C028",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Children must identify root words before adding prefixes"
    },
    {
      "prerequisite_concept": "EN-KS1-C027",
      "dependent_concept": "EN-KS1-C030",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.9,
      "rationale": "Understanding suffixes includes knowing how to add -s/-es for plurals"
    },
    {
      "prerequisite_concept": "EN-KS1-C025",
      "dependent_concept": "EN-KS1-C034",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Basic phonetic spelling develops before learning complex spelling patterns"
    },
    {
      "prerequisite_concept": "EN-KS1-C031",
      "dependent_concept": "EN-KS1-C032",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.7,
      "rationale": "Understanding contractions with apostrophes helps with possessive apostrophes"
    },
    {
      "prerequisite_concept": "EN-KS1-C025",
      "dependent_concept": "EN-KS1-C033",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.7,
      "rationale": "Secure phonetic spelling is needed before distinguishing homophones"
    },
    {
      "prerequisite_concept": "EN-KS1-C035",
      "dependent_concept": "EN-KS1-C036",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 1.0,
      "rationale": "Correct pencil grip and posture are essential for forming letters properly"
    },
    {
      "prerequisite_concept": "EN-KS1-C037",
      "dependent_concept": "EN-KS1-C036",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.8,
      "rationale": "Understanding letter families helps with efficient and correct letter formation"
    },
    {
      "prerequisite_concept": "EN-KS1-C036",
      "dependent_concept": "EN-KS1-C040",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Basic letter formation must be secure before focusing on relative sizing"
    },
    {
      "prerequisite_concept": "EN-KS1-C040",
      "dependent_concept": "EN-KS1-C041",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Letters must be correctly sized and formed before they can be joined"
    },
    {
      "prerequisite_concept": "EN-KS1-C036",
      "dependent_concept": "EN-KS1-C042",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.7,
      "rationale": "Letter formation skill relates to spatial awareness for word spacing"
    },
    {
      "prerequisite_concept": "EN-KS1-C052",
      "dependent_concept": "EN-KS1-C044",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Understanding sentence boundaries is essential for composing sentences"
    },
    {
      "prerequisite_concept": "EN-KS1-C043",
      "dependent_concept": "EN-KS1-C044",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.9,
      "rationale": "Oral rehearsal scaffolds written sentence composition for young writers"
    },
    {
      "prerequisite_concept": "EN-KS1-C044",
      "dependent_concept": "EN-KS1-C045",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Children must compose individual sentences before sequencing them into narratives"
    },
    {
      "prerequisite_concept": "EN-KS1-C018",
      "dependent_concept": "EN-KS1-C045",
      "confidence": "inferred",
      "relationship_type": "cognitive",
      "strength": 0.8,
      "rationale": "Understanding story structure helps with sequencing narrative sentences"
    },
    {
      "prerequisite_concept": "EN-KS1-C044",
      "dependent_concept": "EN-KS1-C046",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Children must compose sentences before they can re-read and evaluate them"
    },
    {
      "prerequisite_concept": "EN-KS1-C046",
      "dependent_concept": "EN-KS1-C049",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Re-reading for basic sense precedes more sophisticated evaluation"
    },
    {
      "prerequisite_concept": "EN-KS1-C046",
      "dependent_concept": "EN-KS1-C050",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Re-reading for sense develops into proof-reading for specific errors"
    },
    {
      "prerequisite_concept": "EN-KS1-C044",
      "dependent_concept": "EN-KS1-C047",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Basic sentence composition precedes adapting writing for different purposes"
    },
    {
      "prerequisite_concept": "EN-KS1-C045",
      "dependent_concept": "EN-KS1-C048",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.7,
      "rationale": "Children sequence sentences before learning to plan multi-paragraph writing"
    },
    {
      "prerequisite_concept": "EN-KS1-C052",
      "dependent_concept": "EN-KS1-C053",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Understanding sentence boundaries is necessary for using capital letters correctly"
    },
    {
      "prerequisite_concept": "EN-KS1-C052",
      "dependent_concept": "EN-KS1-C054",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Understanding sentence boundaries is necessary for using full stops correctly"
    },
    {
      "prerequisite_concept": "EN-KS1-C059",
      "dependent_concept": "EN-KS1-C055",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Understanding sentence types is needed to use question marks appropriately"
    },
    {
      "prerequisite_concept": "EN-KS1-C059",
      "dependent_concept": "EN-KS1-C056",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Understanding sentence types is needed to use exclamation marks appropriately"
    },
    {
      "prerequisite_concept": "EN-KS1-C058",
      "dependent_concept": "EN-KS1-C064",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Using 'and' for coordination precedes using other coordinating conjunctions"
    },
    {
      "prerequisite_concept": "EN-KS1-C058",
      "dependent_concept": "EN-KS1-C063",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.7,
      "rationale": "Simple coordination with 'and' typically precedes subordination"
    },
    {
      "prerequisite_concept": "EN-KS1-C066",
      "dependent_concept": "EN-KS1-C060",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Understanding nouns is necessary for expanding noun phrases"
    },
    {
      "prerequisite_concept": "EN-KS1-C068",
      "dependent_concept": "EN-KS1-C060",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Understanding adjectives is necessary for expanding noun phrases"
    },
    {
      "prerequisite_concept": "EN-KS1-C067",
      "dependent_concept": "EN-KS1-C061",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Understanding verbs is necessary for using tenses correctly"
    },
    {
      "prerequisite_concept": "EN-KS1-C061",
      "dependent_concept": "EN-KS1-C062",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Basic understanding of tense precedes using progressive forms"
    },
    {
      "prerequisite_concept": "EN-KS1-C067",
      "dependent_concept": "EN-KS1-C069",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.7,
      "rationale": "Understanding verbs precedes understanding how adverbs modify them"
    },
    {
      "prerequisite_concept": "EN-KS1-C073",
      "dependent_concept": "EN-KS1-C074",
      "confidence": "inferred",
      "relationship_type": "foundational",
      "strength": 0.8,
      "rationale": "Basic listening skills are necessary for effective turn-taking in discussion"
    },
    {
      "prerequisite_concept": "EN-KS1-C073",
      "dependent_concept": "EN-KS1-C075",
      "confidence": "inferred",
      "relationship_type": "cognitive",
      "strength": 0.8,
      "rationale": "Listening and understanding are prerequisites for asking relevant questions"
    },
    {
      "prerequisite_concept": "EN-KS1-C020",
      "dependent_concept": "EN-KS1-C076",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.7,
      "rationale": "Discussing texts develops the ability to justify opinions with evidence"
    },
    {
      "prerequisite_concept": "EN-KS1-C006",
      "dependent_concept": "EN-KS1-C024",
      "confidence": "inferred",
      "relationship_type": "cognitive",
      "strength": 0.8,
      "rationale": "Children must decode competently before they can notice and correct errors"
    },
    {
      "prerequisite_concept": "EN-KS1-C025",
      "dependent_concept": "EN-KS1-C050",
      "confidence": "inferred",
      "relationship_type": "cognitive",
      "strength": 0.8,
      "rationale": "Spelling competence is needed to identify spelling errors during proof-reading"
    },
    {
      "prerequisite_concept": "EN-KS1-C053",
      "dependent_concept": "EN-KS1-C050",
      "confidence": "inferred",
      "relationship_type": "cognitive",
      "strength": 0.8,
      "rationale": "Punctuation knowledge is needed to identify punctuation errors during proof-reading"
    },
    {
      "prerequisite_concept": "EN-KS1-C013",
      "dependent_concept": "EN-KS1-C051",
      "confidence": "inferred",
      "relationship_type": "cognitive",
      "strength": 0.7,
      "rationale": "Reading fluency relates to ability to read aloud with appropriate expression"
    },
    {
      "prerequisite_concept": "EN-KS1-C036",
      "dependent_concept": "EN-KS1-C025",
      "confidence": "inferred",
      "relationship_type": "cognitive",
      "strength": 0.6,
      "rationale": "Letter formation skill supports spelling, though they develop somewhat independently"
    },
    {
      "prerequisite_concept": "EN-KS1-C019",
      "dependent_concept": "EN-KS1-C020",
      "confidence": "inferred",
      "relationship_type": "cognitive",
      "strength": 0.7,
      "rationale": "Broader vocabulary enables richer discussion about texts"
    }
  ]
}
