{
  "metadata": {
    "subject": "English",
    "key_stage": "KS2",
    "years_covered": [
      5
    ],
    "document_reference": "DFE-00174-2013",
    "extraction_date": "2026-02-16",
    "structure_rating": 8,
    "notes": "Year 5 English is the first year of Upper Key Stage 2. The programme of study is published as a combined Years 5 and 6 document. Content in this extraction represents the Year 5 lens, with grammar specifically identified in Appendix 2 as Year 5 statutory content. Prerequisites reference Year 4 concepts (EN-Y4-C###). Source PDF: English_KS1-2_2014.pdf (September 2013 document)."
  },
  "domains": [
    {
      "domain_id": "EN-Y5-D001",
      "domain_name": "Spoken Language",
      "description": "Development of listening, speaking, communication, drama and debate skills across all contexts (statutory for all years 1–6).",
      "curriculum_context": "Spoken language is a statutory programme running across all six years of primary education and is not separated into year-group blocks. In Years 5 and 6, the curriculum specifically states that pupils' confidence, enjoyment and mastery of language should be extended through public speaking, performance and debate, marking a significant shift from the participatory discussion expected in lower KS2. Pupils are expected to consider and evaluate different viewpoints, to challenge views courteously, and to select appropriate registers for different purposes and audiences — skills that underpin academic writing and secondary school discourse. The spoken language programme also functions as a cross-curricular thread: pupils use talk to speculate, hypothesise, imagine and explore ideas across all subjects, not only in English lessons. By Year 5, pupils should be building on secure oral language foundations to engage with increasingly formal modes of communication, preparing them for the explicit demands of KS3 English and beyond.",
      "is_cross_cutting": true,
      "structure_type": "developmental"
    },
    {
      "domain_id": "EN-Y5-D002",
      "domain_name": "Reading - Word Reading",
      "description": "Applying growing knowledge of morphology and etymology (root words, prefixes, suffixes) to read aloud and understand new words.",
      "curriculum_context": "By Year 5 the curriculum states that for almost all pupils there should be no need for further direct teaching of word reading skills, meaning phonics instruction has served its primary purpose. The focus shifts entirely to morphology and etymology: pupils deploy their understanding of how words are constructed from roots, prefixes and suffixes to decode unfamiliar vocabulary and to understand its meaning, as listed in English Appendix 1. This represents a qualitative change from lower KS2, where root words and basic affixes were introduced; Year 5 pupils are now expected to use this knowledge with automaticity across all subjects. The non-statutory guidance emphasises that pupils should focus on all letters in a word — not guessing from initial letters — because accurate reading of individual words is critical to comprehension of sentences and paragraphs. Teachers are expected to draw attention to new vocabulary, including correct pronunciation, when reading aloud with or to pupils, modelling the process of decoding through morphological analysis.",
      "is_cross_cutting": false,
      "structure_type": "sequential"
    },
    {
      "domain_id": "EN-Y5-D003",
      "domain_name": "Reading - Comprehension",
      "description": "Advanced comprehension skills including wide reading across genres, inference, analysis of language and structure, evaluation of authorial choices, and formal discussion.",
      "curriculum_context": "Reading comprehension in Years 5 and 6 builds directly on the skills introduced in Years 3 and 4, but the key shift is that pupils now apply those skills to significantly more complex texts and are expected to work with increasing independence. The curriculum stresses that the knowledge and skills needed to comprehend are very similar at different ages but that the complexity of the writing increases the challenge, meaning Year 5 comprehension is fundamentally about deepening rather than replacing earlier learning. New demands in this phase include evaluating how authors use language (including figurative language such as metaphor, simile, analogy and imagery) and considering impact on the reader — a more analytical stance than simply identifying features. Pupils are also expected to distinguish between statements of fact and opinion, to engage with a wider literary heritage including myths, legends and literature from other cultures, and to use formal presentations and debates to share their understanding. The non-statutory guidance explicitly names the technical terms pupils should learn at this stage: metaphor, simile, analogy, imagery, style and effect, signalling the expectation of increasingly disciplinary metalanguage. These skills form the foundation for GCSE and A-level analytical reading.",
      "is_cross_cutting": false,
      "structure_type": "developmental"
    },
    {
      "domain_id": "EN-Y5-D004",
      "domain_name": "Writing - Transcription (Spelling)",
      "description": "Advanced spelling including further prefixes and suffixes, silent letters, complex homophones, morphology and etymology, and statutory word list for Years 5 and 6.",
      "curriculum_context": "Spelling in Year 5 marks a decisive move away from phonics-based rules towards morphological and etymological understanding. Pupils are expected to use their knowledge of how words are structured to make decisions about spelling rather than relying on phoneme-grapheme correspondence alone — for example, understanding that medicine is related to medical explains the /s/ sound spelt with 'c'. The statutory word list for Years 5 and 6 (100 words including accommodate, aggressive, conscience, exaggerate, prejudice and similar) is specifically identified in the curriculum as requiring attention to because these words are both frequently used and frequently misspelt. Year 5 introduces particularly complex spelling patterns: endings sounding like /ʃəs/ (spelt -cious or -tious), /ʃəl/ (spelt -cial or -tial), -ant/-ance/-ancy and -ent/-ence/-ency endings where choice depends on the presence of related words, -able/-ible endings, and the letter string 'ough' which can represent multiple sounds. Silent letters (knight, psalm, solemn) represent a historical perspective on language change. This domain directly feeds into writing quality and formal accuracy expected at secondary level.",
      "is_cross_cutting": false,
      "structure_type": "sequential"
    },
    {
      "domain_id": "EN-Y5-D005",
      "domain_name": "Writing - Transcription (Handwriting and Presentation)",
      "description": "Writing legibly, fluently and with increasing speed by making deliberate choices about letter shape, joining and writing implement.",
      "curriculum_context": "By Year 5 the emphasis in handwriting shifts from learning letter formation — which should be secure — to developing speed and personal style. The curriculum identifies two key new elements: choosing which shape of a letter to use when options exist, and selecting the writing implement best suited to a task, both of which require metacognitive awareness about writing as a physical and contextual act. The non-statutory guidance is explicit that pupils should be clear about what standard of handwriting is appropriate for a particular task — quick notes versus a final handwritten version — developing the professional judgement they will need in secondary school and beyond. Pupils are also taught that an unjoined style is appropriate for specific contexts (labelling diagrams, writing email addresses, algebra, capital letters in forms), preventing the misconception that joined handwriting is always superior. Handwriting fluency is positioned instrumentally: problems with forming letters must not obstruct the thinking required for composition.",
      "is_cross_cutting": false,
      "structure_type": "developmental"
    },
    {
      "domain_id": "EN-Y5-D006",
      "domain_name": "Writing - Composition",
      "description": "Planning, drafting and editing complex narrative and non-fiction writing with attention to audience, purpose, cohesion, grammar choices and performance.",
      "curriculum_context": "Writing composition in Year 5 consolidates and extends the plan-draft-evaluate-edit cycle established in lower KS2, but applies it to more sophisticated texts and with greater metacognitive demand. Pupils are now expected not only to plan with audience and purpose in mind but to use other writers' work as conscious models, drawing on what they have noticed about how authors develop characters, settings and atmosphere — a bridging move between reading as a consumer and reading as a writer. New compositional demands include précising longer passages (requiring the ability to identify essential information), using a wide range of devices to build cohesion within and across paragraphs (linking adverbials of time, place and number), and integrating dialogue purposefully to convey character and advance action rather than simply punctuating speech. The curriculum also introduces performing compositions with appropriate intonation, volume and movement, foregrounding the oral–written continuum. The non-statutory guidance emphasises that pupils should understand the skills and processes for writing — thinking aloud, drafting, re-reading — suggesting that the writing process itself is explicit curriculum content at this stage.",
      "is_cross_cutting": false,
      "structure_type": "developmental"
    },
    {
      "domain_id": "EN-Y5-D007",
      "domain_name": "Writing - Vocabulary, Grammar and Punctuation",
      "description": "Developing command of grammar including relative clauses, modal verbs, passive voice, perfect verb forms, cohesive devices, and a range of advanced punctuation including parenthesis, commas for clarity, hyphens, semi-colons and colons.",
      "curriculum_context": "Grammar and punctuation teaching in Year 5 introduces the most structurally complex content of any primary year group. The Year 5-specific grammar in Appendix 2 covers: relative clauses (beginning with who, which, where, when, whose, that or with an omitted relative pronoun); degrees of possibility expressed through modal verbs (might, should, will, must) or adverbs (perhaps, surely); cohesive devices within and across paragraphs; and parenthesis marked with brackets, dashes or commas. This content builds directly on Year 4's noun phrases and fronted adverbials by adding subordinating structures of greater complexity. The shared Years 5–6 VGP objectives also cover passive verbs, perfect verb forms, subjunctive forms, and advanced punctuation (semi-colons, colons, hyphens, bullet points), some of which are specifically Year 6 content in Appendix 2 but are statutory across the two-year phase. Pupils must use and understand an expanded set of grammatical terminology including modal verb, relative pronoun, relative clause, parenthesis, bracket, dash, cohesion and ambiguity — terms they are expected to deploy accurately in discussion of their reading and writing. This grammatical knowledge directly prepares pupils for the grammatical demands of KS3 and the explicit grammar teaching in secondary English.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical"
    }
  ],
  "objectives": [
    {
      "objective_id": "EN-Y5-O001",
      "domain_id": "EN-Y5-D001",
      "objective_text": "listen and respond appropriately to adults and their peers",
      "non_statutory_guidance": "Pupils should be taught to develop their competence in spoken language and listening to enhance the effectiveness with which they are able to communicate across a range of contexts and to a range of audiences. They should therefore have opportunities to work in groups of different sizes – in pairs, small groups, large groups and as a whole class.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O002",
      "domain_id": "EN-Y5-D001",
      "objective_text": "ask relevant questions to extend their understanding and knowledge",
      "non_statutory_guidance": "Pupils should understand how to take turns and when and how to participate constructively in conversations and debates.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O003",
      "domain_id": "EN-Y5-D001",
      "objective_text": "use relevant strategies to build their vocabulary",
      "non_statutory_guidance": "Attention should also be paid to increasing pupils' vocabulary, ranging from describing their immediate world and feelings to developing a broader, deeper and richer vocabulary to discuss abstract concepts and a wider range of topics, and to enhancing their knowledge about language as a whole.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O004",
      "domain_id": "EN-Y5-D001",
      "objective_text": "articulate and justify answers, arguments and opinions",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O005",
      "domain_id": "EN-Y5-D001",
      "objective_text": "give well-structured descriptions, explanations and narratives for different purposes, including for expressing feelings",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O006",
      "domain_id": "EN-Y5-D001",
      "objective_text": "maintain attention and participate actively in collaborative conversations, staying on topic and initiating and responding to comments",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O007",
      "domain_id": "EN-Y5-D001",
      "objective_text": "use spoken language to develop understanding through speculating, hypothesising, imagining and exploring ideas",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O008",
      "domain_id": "EN-Y5-D001",
      "objective_text": "speak audibly and fluently with an increasing command of Standard English",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O009",
      "domain_id": "EN-Y5-D001",
      "objective_text": "participate in discussions, presentations, performances, role play, improvisations and debates",
      "non_statutory_guidance": "In years 5 and 6, pupils' confidence, enjoyment and mastery of language should be extended through public speaking, performance and debate.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O010",
      "domain_id": "EN-Y5-D001",
      "objective_text": "gain, maintain and monitor the interest of the listener(s)",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O011",
      "domain_id": "EN-Y5-D001",
      "objective_text": "consider and evaluate different viewpoints, attending to and building on the contributions of others",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O012",
      "domain_id": "EN-Y5-D001",
      "objective_text": "select and use appropriate registers for effective communication",
      "non_statutory_guidance": "These statements apply to all years. The content should be taught at a level appropriate to the age of the pupils. Pupils should build on the oral language skills that have been taught in preceding years. Pupils should receive constructive feedback on their spoken language and listening, not only to improve their knowledge and skills but also to establish secure foundations for effective spoken language in their studies at primary school, helping them to achieve in secondary education and beyond.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O013",
      "domain_id": "EN-Y5-D002",
      "objective_text": "apply their growing knowledge of root words, prefixes and suffixes (morphology and etymology), as listed in English Appendix 1, both to read aloud and to understand the meaning of new words that they meet",
      "non_statutory_guidance": "At this stage, there should be no need for further direct teaching of word reading skills for almost all pupils. If pupils are struggling or failing in this, the reasons for this should be investigated. It is imperative that pupils are taught to read during their last two years at primary school if they enter year 5 not being able to do so. Pupils should be encouraged to work out any unfamiliar word. They should focus on all the letters in a word so that they do not, for example, read 'invitation' for 'imitation' simply because they might be more familiar with the first word. Accurate reading of individual words, which might be key to the meaning of a sentence or paragraph, improves comprehension. When teachers are reading with or to pupils, attention should be paid to new vocabulary – both a word's meaning(s) and its correct pronunciation.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O014",
      "domain_id": "EN-Y5-D003",
      "objective_text": "maintain positive attitudes to reading and understanding of what they read by: continuing to read and discuss an increasingly wide range of fiction, poetry, plays, non-fiction and reference books or textbooks",
      "non_statutory_guidance": "Even though pupils can now read independently, reading aloud to them should include whole books so that they meet books and authors that they might not choose to read themselves.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O015",
      "domain_id": "EN-Y5-D003",
      "objective_text": "maintain positive attitudes to reading and understanding of what they read by: reading books that are structured in different ways and reading for a range of purposes",
      "non_statutory_guidance": "The knowledge and skills that pupils need in order to comprehend are very similar at different ages. Pupils should continue to apply what they have already learnt to more complex writing.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O016",
      "domain_id": "EN-Y5-D003",
      "objective_text": "maintain positive attitudes to reading and understanding of what they read by: increasing their familiarity with a wide range of books, including myths, legends and traditional stories, modern fiction, fiction from our literary heritage, and books from other cultures and traditions",
      "non_statutory_guidance": "Pupils should be taught to recognise themes in what they read, such as loss or heroism. They should have opportunities to compare characters, consider different accounts of the same event and discuss viewpoints (both of authors and of fictional characters), within a text and across more than one text. They should continue to learn the conventions of different types of writing, such as the use of the first person in writing diaries and autobiographies.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O017",
      "domain_id": "EN-Y5-D003",
      "objective_text": "maintain positive attitudes to reading and understanding of what they read by: recommending books that they have read to their peers, giving reasons for their choices",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O018",
      "domain_id": "EN-Y5-D003",
      "objective_text": "maintain positive attitudes to reading and understanding of what they read by: identifying and discussing themes and conventions in and across a wide range of writing",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O019",
      "domain_id": "EN-Y5-D003",
      "objective_text": "maintain positive attitudes to reading and understanding of what they read by: making comparisons within and across books",
      "non_statutory_guidance": "Pupils should be shown how to compare characters, settings, themes and other aspects of what they read.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O020",
      "domain_id": "EN-Y5-D003",
      "objective_text": "maintain positive attitudes to reading and understanding of what they read by: learning a wider range of poetry by heart",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O021",
      "domain_id": "EN-Y5-D003",
      "objective_text": "maintain positive attitudes to reading and understanding of what they read by: preparing poems and plays to read aloud and to perform, showing understanding through intonation, tone and volume so that the meaning is clear to an audience",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O022",
      "domain_id": "EN-Y5-D003",
      "objective_text": "understand what they read by: checking that the book makes sense to them, discussing their understanding and exploring the meaning of words in context",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O023",
      "domain_id": "EN-Y5-D003",
      "objective_text": "understand what they read by: asking questions to improve their understanding",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O024",
      "domain_id": "EN-Y5-D003",
      "objective_text": "understand what they read by: drawing inferences such as inferring characters' feelings, thoughts and motives from their actions, and justifying inferences with evidence",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O025",
      "domain_id": "EN-Y5-D003",
      "objective_text": "understand what they read by: predicting what might happen from details stated and implied",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O026",
      "domain_id": "EN-Y5-D003",
      "objective_text": "understand what they read by: summarising the main ideas drawn from more than one paragraph, identifying key details that support the main ideas",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O027",
      "domain_id": "EN-Y5-D003",
      "objective_text": "understand what they read by: identifying how language, structure and presentation contribute to meaning",
      "non_statutory_guidance": "Pupils should be taught the technical and other terms needed for discussing what they hear and read, such as metaphor, simile, analogy, imagery, style and effect.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O028",
      "domain_id": "EN-Y5-D003",
      "objective_text": "discuss and evaluate how authors use language, including figurative language, considering the impact on the reader",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O029",
      "domain_id": "EN-Y5-D003",
      "objective_text": "distinguish between statements of fact and opinion",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O030",
      "domain_id": "EN-Y5-D003",
      "objective_text": "retrieve, record and present information from non-fiction",
      "non_statutory_guidance": "In using reference books, pupils need to know what information they need to look for before they begin and need to understand the task. They should be shown how to use contents pages and indexes to locate information. The skills of information retrieval that are taught should be applied, for example, in reading history, geography and science textbooks, and in contexts where pupils are genuinely motivated to find out information, for example, reading information leaflets before a gallery or museum visit or reading a theatre programme or review. Teachers should consider making use of any library services and expertise to support this.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O031",
      "domain_id": "EN-Y5-D003",
      "objective_text": "participate in discussions about books that are read to them and those they can read for themselves, building on their own and others' ideas and challenging views courteously",
      "non_statutory_guidance": "Pupils should have guidance about and feedback on the quality of their explanations and contributions to discussions.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O032",
      "domain_id": "EN-Y5-D003",
      "objective_text": "explain and discuss their understanding of what they have read, including through formal presentations and debates, maintaining a focus on the topic and using notes where necessary",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O033",
      "domain_id": "EN-Y5-D003",
      "objective_text": "provide reasoned justifications for their views",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O034",
      "domain_id": "EN-Y5-D004",
      "objective_text": "use further prefixes and suffixes and understand the guidance for adding them",
      "non_statutory_guidance": "As in earlier years, pupils should continue to be taught to understand and apply the concepts of word structure so that they can draw on their knowledge of morphology and etymology to spell correctly.",
      "examples": "Converting nouns or adjectives into verbs using suffixes [for example, –ate; –ise; –ify]. Verb prefixes [for example, dis–, de–, mis–, over– and re–].",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O035",
      "domain_id": "EN-Y5-D004",
      "objective_text": "spell some words with 'silent' letters [for example, knight, psalm, solemn]",
      "non_statutory_guidance": "Some letters which are no longer sounded used to be sounded hundreds of years ago: e.g. in knight, there was a /k/ sound before the /n/, and the gh used to represent the sound that 'ch' now represents in the Scottish word loch.",
      "examples": "doubt, island, lamb, solemn, thistle, knight",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O036",
      "domain_id": "EN-Y5-D004",
      "objective_text": "continue to distinguish between homophones and other words which are often confused",
      "non_statutory_guidance": "In the pairs of words opposite, nouns end –ce and verbs end –se. Advice and advise provide a useful clue as the word advise (verb) is pronounced with a /z/ sound – which could not be spelt c.",
      "examples": "advice/advise, device/devise, licence/license, practice/practise, prophecy/prophesy; farther/further; affect/effect; altar/alter; ascent/assent; bridal/bridle; cereal/serial; compliment/complement; descent/dissent; desert/dessert; draft/draught; principal/principle; stationary/stationery; steal/steel; wary/weary; who's/whose",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O037",
      "domain_id": "EN-Y5-D004",
      "objective_text": "use knowledge of morphology and etymology in spelling and understand that the spelling of some words needs to be learnt specifically, as listed in English Appendix 1",
      "non_statutory_guidance": "bicycle is cycle (from the Greek for wheel) with bi– (meaning 'two') before it. medicine is related to medical so the /s/ sound is spelt as c. opposite is related to oppose, so the schwa sound in opposite is spelt as o.",
      "examples": "accommodate, accompany, according, achieve, aggressive, amateur, ancient, apparent, appreciate, attached, available, average, awkward, bargain, bruise, category, cemetery, committee, communicate, community, competition, conscience, conscious, controversy, convenience, correspond, criticise, curiosity, definite, desperate, determined, develop, dictionary, disastrous, embarrass, environment, equip, especially, exaggerate, excellent, existence, explanation, familiar, foreign, forty, frequently, government, guarantee, harass, hindrance, identity, immediate, individual, interfere, interrupt, language, leisure, lightning, marvellous, mischievous, muscle, necessary, neighbour, nuisance, occupy, occur, phenomenon, prejudice, privilege, profession, programme, pronunciation, queue, recognise, recommend, relevant, restaurant, rhyme, rhythm, sacrifice, secretary, shoulder, signature, sincere(ly), soldier, stomach, sufficient, suggest, symbol, system, temperature, thorough, twelfth, variety, vegetable, vehicle, yacht",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O038",
      "domain_id": "EN-Y5-D004",
      "objective_text": "use dictionaries to check the spelling and meaning of words",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O039",
      "domain_id": "EN-Y5-D004",
      "objective_text": "use the first three or four letters of a word to check spelling, meaning or both of these in a dictionary",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O040",
      "domain_id": "EN-Y5-D004",
      "objective_text": "use a thesaurus",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O041",
      "domain_id": "EN-Y5-D005",
      "objective_text": "write legibly, fluently and with increasing speed by: choosing which shape of a letter to use when given choices and deciding whether or not to join specific letters",
      "non_statutory_guidance": "Pupils should continue to practise handwriting and be encouraged to increase the speed of it, so that problems with forming letters do not get in the way of their writing down what they want to say. They should be clear about what standard of handwriting is appropriate for a particular task, for example, quick notes or a final handwritten version. They should also be taught to use an unjoined style, for example, for labelling a diagram or data, writing an email address, or for algebra and capital letters, for example, for filling in a form.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O042",
      "domain_id": "EN-Y5-D005",
      "objective_text": "write legibly, fluently and with increasing speed by: choosing the writing implement that is best suited for a task",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O043",
      "domain_id": "EN-Y5-D006",
      "objective_text": "plan their writing by: identifying the audience for and purpose of the writing, selecting the appropriate form and using other similar writing as models for their own",
      "non_statutory_guidance": "Pupils should understand, through being shown, the skills and processes essential for writing: that is, thinking aloud to generate ideas, drafting, and re-reading to check that the meaning is clear.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O044",
      "domain_id": "EN-Y5-D006",
      "objective_text": "plan their writing by: noting and developing initial ideas, drawing on reading and research where necessary",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O045",
      "domain_id": "EN-Y5-D006",
      "objective_text": "plan their writing by: in writing narratives, considering how authors have developed characters and settings in what pupils have read, listened to or seen performed",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O046",
      "domain_id": "EN-Y5-D006",
      "objective_text": "draft and write by: selecting appropriate grammar and vocabulary, understanding how such choices can change and enhance meaning",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O047",
      "domain_id": "EN-Y5-D006",
      "objective_text": "draft and write by: in narratives, describing settings, characters and atmosphere and integrating dialogue to convey character and advance the action",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O048",
      "domain_id": "EN-Y5-D006",
      "objective_text": "draft and write by: précising longer passages",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O049",
      "domain_id": "EN-Y5-D006",
      "objective_text": "draft and write by: using a wide range of devices to build cohesion within and across paragraphs",
      "non_statutory_guidance": null,
      "examples": "Devices to build cohesion within a paragraph [for example, then, after that, this, firstly]. Linking ideas across paragraphs using adverbials of time [for example, later], place [for example, nearby] and number [for example, secondly] or tense choices [for example, he had seen her before].",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O050",
      "domain_id": "EN-Y5-D006",
      "objective_text": "draft and write by: using further organisational and presentational devices to structure text and to guide the reader [for example, headings, bullet points, underlining]",
      "non_statutory_guidance": null,
      "examples": "headings, bullet points, underlining",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O051",
      "domain_id": "EN-Y5-D006",
      "objective_text": "evaluate and edit by: assessing the effectiveness of their own and others' writing",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O052",
      "domain_id": "EN-Y5-D006",
      "objective_text": "evaluate and edit by: proposing changes to vocabulary, grammar and punctuation to enhance effects and clarify meaning",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O053",
      "domain_id": "EN-Y5-D006",
      "objective_text": "evaluate and edit by: ensuring the consistent and correct use of tense throughout a piece of writing",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O054",
      "domain_id": "EN-Y5-D006",
      "objective_text": "evaluate and edit by: ensuring correct subject and verb agreement when using singular and plural, distinguishing between the language of speech and writing and choosing the appropriate register",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O055",
      "domain_id": "EN-Y5-D006",
      "objective_text": "proof-read for spelling and punctuation errors",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O056",
      "domain_id": "EN-Y5-D006",
      "objective_text": "perform their own compositions, using appropriate intonation, volume, and movement so that meaning is clear",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O057",
      "domain_id": "EN-Y5-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by: recognising vocabulary and structures that are appropriate for formal speech and writing, including subjunctive forms",
      "non_statutory_guidance": "Pupils should continue to add to their knowledge of linguistic terms, including those to describe grammar, so that they can discuss their writing and reading.",
      "examples": "The difference between vocabulary typical of informal speech and vocabulary appropriate for formal speech and writing [for example, find out – discover; ask for – request; go in – enter]. The use of subjunctive forms such as If I were or Were they to come in some very formal writing and speech.",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O058",
      "domain_id": "EN-Y5-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by: using passive verbs to affect the presentation of information in a sentence",
      "non_statutory_guidance": null,
      "examples": "I broke the window in the greenhouse [active] versus The window in the greenhouse was broken (by me) [passive].",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O059",
      "domain_id": "EN-Y5-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by: using the perfect form of verbs to mark relationships of time and cause",
      "non_statutory_guidance": null,
      "examples": "he had seen her before [past perfect marking prior action]",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O060",
      "domain_id": "EN-Y5-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by: using expanded noun phrases to convey complicated information concisely",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O061",
      "domain_id": "EN-Y5-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by: using modal verbs or adverbs to indicate degrees of possibility",
      "non_statutory_guidance": null,
      "examples": "Indicating degrees of possibility using adverbs [for example, perhaps, surely] or modal verbs [for example, might, should, will, must].",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O062",
      "domain_id": "EN-Y5-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by: using relative clauses beginning with who, which, where, when, whose, that or with an implied (i.e. omitted) relative pronoun",
      "non_statutory_guidance": null,
      "examples": "Relative clauses beginning with who, which, where, when, whose, that, or an omitted relative pronoun.",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O063",
      "domain_id": "EN-Y5-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by: learning the grammar for years 5 and 6 in English Appendix 2",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O064",
      "domain_id": "EN-Y5-D007",
      "objective_text": "indicate grammatical and other features by: using commas to clarify meaning or avoid ambiguity in writing",
      "non_statutory_guidance": null,
      "examples": "Use of commas to clarify meaning or avoid ambiguity.",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O065",
      "domain_id": "EN-Y5-D007",
      "objective_text": "indicate grammatical and other features by: using hyphens to avoid ambiguity",
      "non_statutory_guidance": null,
      "examples": "How hyphens can be used to avoid ambiguity [for example, man eating shark versus man-eating shark, or recover versus re-cover].",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O066",
      "domain_id": "EN-Y5-D007",
      "objective_text": "indicate grammatical and other features by: using brackets, dashes or commas to indicate parenthesis",
      "non_statutory_guidance": null,
      "examples": "Brackets, dashes or commas to indicate parenthesis.",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O067",
      "domain_id": "EN-Y5-D007",
      "objective_text": "indicate grammatical and other features by: using semi-colons, colons or dashes to mark boundaries between independent clauses",
      "non_statutory_guidance": null,
      "examples": "Use of the semi-colon, colon and dash to mark the boundary between independent clauses [for example, It's raining; I'm fed up].",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O068",
      "domain_id": "EN-Y5-D007",
      "objective_text": "indicate grammatical and other features by: using a colon to introduce a list",
      "non_statutory_guidance": null,
      "examples": "Use of the colon to introduce a list and use of semi-colons within lists.",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O069",
      "domain_id": "EN-Y5-D007",
      "objective_text": "indicate grammatical and other features by: punctuating bullet points consistently",
      "non_statutory_guidance": null,
      "examples": "Punctuation of bullet points to list information.",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y5-O070",
      "domain_id": "EN-Y5-D007",
      "objective_text": "use and understand the grammatical terminology in English Appendix 2 accurately and appropriately in discussing their writing and reading",
      "non_statutory_guidance": "Pupils should continue to add to their knowledge of linguistic terms, including those to describe grammar, so that they can discuss their writing and reading.",
      "examples": "Year 5 terminology: modal verb, relative pronoun, relative clause, parenthesis, bracket, dash, cohesion, ambiguity.",
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "EN-Y5-C001",
      "domain_id": "EN-Y5-D004",
      "concept_name": "Morphology",
      "description": "Morphology is the study of word structure — how words are formed from roots, prefixes and suffixes and how those components carry meaning. At upper KS2 mastery means pupils can analyse an unfamiliar word by identifying its constituent parts, use that analysis to infer its meaning, and apply morphological knowledge when spelling it. Pupils move from applying rules taught explicitly to deploying morphological knowledge flexibly and automatically across all subjects.",
      "teaching_guidance": "Teach pupils to break unfamiliar words into roots, prefixes and suffixes before attempting pronunciation or meaning. Use etymology to show how meaning is carried in word parts (e.g., spectator, spectacle, spectacular all share the Latin root 'specere' meaning to look). Connect morphology explicitly to spelling choices, showing that knowing a root word often reveals the spelling of a related word.",
      "key_vocabulary": "morphology, root word, prefix, suffix, word family, base word, derivative",
      "common_misconceptions": "Pupils often treat each new word as entirely new rather than decomposing it into known parts. They may not realise that spelling is often motivated by meaning — for example, that 'medic' in medicine explains the /s/ sound spelt 'c'. Some pupils confuse morphological analysis with syllabification.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C002",
      "domain_id": "EN-Y5-D004",
      "concept_name": "Etymology",
      "description": "Etymology is the study of the origin and historical development of words and their meanings. At upper KS2, mastery means pupils understand that many English words derive from Latin, Greek, French or Old English roots, and that knowing a word's origin aids both spelling and comprehension. Pupils use etymological knowledge as a spelling strategy — for example, knowing 'cycle' comes from Greek for 'wheel' helps spell 'bicycle'.",
      "teaching_guidance": "Introduce word families with shared Greek or Latin roots (e.g., graph-, bio-, tele-, photo-). Use dictionaries with etymological information. Show how cognates in modern European languages reflect shared Latin or Greek roots. Connect to history lessons where appropriate (e.g., Anglo-Saxon and Norman French influences on English vocabulary).",
      "key_vocabulary": "etymology, origin, Latin, Greek, Anglo-Saxon, cognate, word history",
      "common_misconceptions": "Pupils may assume that all English words derive from one language. They may not connect etymological knowledge to spelling, treating etymology as a curiosity rather than a practical tool. Some pupils confuse etymology with morphology.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C003",
      "domain_id": "EN-Y5-D004",
      "concept_name": "Root words",
      "description": "Root words are the base forms from which other words are derived through the addition of prefixes and suffixes. At upper KS2, mastery means pupils can reliably identify the root within an unfamiliar word and use knowledge of that root to determine meaning and predict spelling. Pupils understand that the same root appears across multiple words in a word family.",
      "teaching_guidance": "Regularly sort words into word families around a shared root. Use word webs to show how a single root generates multiple related words. Highlight roots when encountering new vocabulary across the curriculum. Explicitly link root identification to the spelling strategy of thinking 'what word do I already know that looks like this?'",
      "key_vocabulary": "root word, word family, base word, derivative, stem",
      "common_misconceptions": "Pupils may misidentify the root when a prefix begins with a consonant that matches the first letter of the root (e.g., confusing 'mis-' + 'spell' vs 'mis-' + 'sing'). Some pupils try to find a root in words that are not morphologically complex.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C004",
      "domain_id": "EN-Y5-D004",
      "concept_name": "Verb prefixes",
      "description": "Verb prefixes (dis-, de-, mis-, over-, re-) are added to verbs or adjectives to change their meaning, typically indicating negation, reversal, wrongness, excess or repetition. At upper KS2 mastery, pupils use these prefixes productively when writing to add precision and variety, and recognise them reliably when reading to decode and comprehend unfamiliar words.",
      "teaching_guidance": "Teach each prefix with a clear meaning (re- = again; mis- = wrongly; dis- = not/opposite; over- = too much; de- = reverse). Practise using them to create antonyms or altered meanings (connect/disconnect; appear/disappear). Note that spelling of the root word does not change when a prefix is added.",
      "key_vocabulary": "prefix, verb prefix, dis-, de-, mis-, over-, re-, negation, reversal",
      "common_misconceptions": "Pupils sometimes double letters incorrectly when adding prefixes (e.g., 'dissappear' instead of 'disappear' — the root is 'appear' not 'ppear'). They may confuse de- and dis- in words where both seem plausible.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C005",
      "domain_id": "EN-Y5-D004",
      "concept_name": "Verb-forming suffixes (-ate, -ise, -ify)",
      "description": "The suffixes -ate, -ise/-ize and -ify convert nouns or adjectives into verbs (e.g., active → activate; memory → memorise; class → classify). At upper KS2 mastery, pupils use these suffixes productively to expand vocabulary in writing and to decode unfamiliar verbs encountered in reading. They understand the spelling rules that apply when adding these suffixes.",
      "teaching_guidance": "Teach each suffix alongside a set of high-frequency examples. Use the suffix as a vocabulary-building tool: starting from a noun or adjective pupils know, derive the verb form. Note that -ise is the standard British English spelling (organise, not organize in most UK contexts). Practise identifying these verbs in non-fiction text.",
      "key_vocabulary": "suffix, -ate, -ise, -ify, verb, conversion, word formation",
      "common_misconceptions": "Pupils may use -ize spelling (American English) rather than -ise in British English contexts. They sometimes apply the wrong suffix (e.g., 'classate' instead of 'classify').",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C006",
      "domain_id": "EN-Y5-D004",
      "concept_name": "Silent letters",
      "description": "Silent letters are letters present in a word's spelling but not represented in its pronunciation (e.g., the 'k' in knight, the 'b' in lamb, the 'p' in psalm). At upper KS2 mastery, pupils can spell a range of common words with silent letters and understand that these letters were once pronounced or reveal the word's etymology. This knowledge prevents common misspellings.",
      "teaching_guidance": "Present silent letters as historical or etymological evidence — many were pronounced in earlier English. Group words by the pattern of silence (silent k, silent b, silent h, etc.). Use mnemonics where helpful. Regular dictation and self-correction using a dictionary reinforces correct spelling.",
      "key_vocabulary": "silent letter, pronunciation, spelling, etymology, historical spelling",
      "common_misconceptions": "Pupils often omit silent letters entirely when writing because there is no phonetic cue for their inclusion. Some pupils over-generalise and insert silent letters where they do not belong.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C007",
      "domain_id": "EN-Y5-D004",
      "concept_name": "Homophones and commonly confused words (advanced)",
      "description": "At upper KS2, pupils extend their knowledge of homophones (words that sound the same but have different meanings and spellings) and other words commonly confused in writing, including noun/verb pairs ending in -ce/-se (advice/advise; practice/practise) and words that are frequently muddled (affect/effect; stationary/stationery). Mastery means pupils select the correct form reliably in their own writing.",
      "teaching_guidance": "Teach the distinction between noun forms (ending -ce) and verb forms (ending -se) as a systematic rule. Provide semantic cues to support memory (stationery = paper → both contain 'e'; principal = person → both can be used as adjectives of importance). Require pupils to use both words in sentences showing awareness of the distinction.",
      "key_vocabulary": "homophone, homograph, confusable words, noun, verb, -ce ending, -se ending",
      "common_misconceptions": "Pupils frequently confuse advice/advise and practice/practise because the pronunciation is identical in some dialects. The affect/effect pair is particularly challenging because 'affect' is usually a verb and 'effect' usually a noun, but each has an uncommon use in the other word class.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C008",
      "domain_id": "EN-Y5-D004",
      "concept_name": "Spelling pattern: -cious and -tious endings",
      "description": "Words ending in /ʃəs/ can be spelt -cious (vicious, precious, conscious) or -tious (ambitious, cautious, infectious). At upper KS2, mastery means pupils can identify the correct spelling by applying guidance about the root word: if the root ends in -ce, the ending is typically -cious; otherwise the spelling requires learning. Pupils spell a range of high-frequency words in this pattern correctly.",
      "teaching_guidance": "Teach the rule: root ending in '-ce' → -cious (grace → gracious; vice → vicious; malice → malicious). For -tious words, note that the root often contains '-tion' or '-t' (ambition → ambitious; caution → cautious). Provide a word sort activity. Note the exception: anxious.",
      "key_vocabulary": "-cious, -tious, /ʃəs/ sound, suffix, root word, spelling rule",
      "common_misconceptions": "Pupils may apply -cious as a default and write 'ambitcious' or 'cautioucious'. The 'suspicious' spelling confuses pupils who expect '-tious' from a '-t' root.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C009",
      "domain_id": "EN-Y5-D004",
      "concept_name": "Spelling pattern: -cial and -tial endings",
      "description": "Words ending in /ʃəl/ can be spelt -cial (official, special, artificial) or -tial (partial, confidential, essential). At upper KS2, mastery means pupils know the general rule (–cial after a vowel; -tial after a consonant) and can apply it with awareness of exceptions. Pupils spell a range of common words in this pattern correctly.",
      "teaching_guidance": "Teach the vowel/consonant rule and provide sorted lists. Highlight the exceptions (initial, financial, commercial, provincial — whose spelling relates to their root: finance, commerce, province). Use etymology to explain exceptions where possible.",
      "key_vocabulary": "-cial, -tial, /ʃəl/ sound, suffix, vowel letter, consonant letter",
      "common_misconceptions": "Pupils often default to -tial for all words in this pattern. The exceptions (initial, financial) cause confusion because they appear to contradict the rule.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C010",
      "domain_id": "EN-Y5-D004",
      "concept_name": "Spelling patterns: -ant/-ance/-ancy and -ent/-ence/-ency",
      "description": "The correct choice between -ant/-ance/-ancy and -ent/-ence/-ency depends on the root word and its related forms. At upper KS2, mastery means pupils can apply the guidance: use -ant/-ance/-ancy when a related word has a /æ/ or /eɪ/ sound in the right position (or an -ation ending); use -ent/-ence/-ency after soft c, soft g or qu, or when a related word has a clear /ɛ/ sound. Pupils also recognise that some words simply require memorisation.",
      "teaching_guidance": "Practise with related word pairs: observe/observant/observance (observation); hesitate/hesitant/hesitancy (hesitation); innocent/innocence. Create a table sorting words by rule into three columns: -ant/-ance/-ancy rule; -ent/-ence/-ency rule; must learn. Include the statutory word list words that exemplify these patterns.",
      "key_vocabulary": "-ant, -ance, -ancy, -ent, -ence, -ency, suffix, related word form",
      "common_misconceptions": "Pupils frequently guess between -ant and -ent because the spoken vowel in these unstressed endings sounds identical. The rules about related words are complex and require exposure to many examples before they become reliable.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C011",
      "domain_id": "EN-Y5-D004",
      "concept_name": "Spelling patterns: -able/-ibly and -ible/-ibly",
      "description": "The -able ending is far more common and used when a complete root word can be heard before it, especially when a related -ation word exists (adore/adorable/adoration). The -ible ending is used when a complete root word cannot be heard before it (possible, horrible) and in some other cases. At upper KS2 mastery, pupils apply this guidance systematically and spell a range of words in both patterns correctly.",
      "teaching_guidance": "Teach the -able default rule first: if you can hear a complete root word before the suffix, use -able (understandable, reasonable, enjoyable). Teach the -ation clue (adorable ← adoration). Introduce -ible words as a separate set to be learnt (possible, horrible, terrible, visible, incredible, sensible). Note that when -able follows -ce or -ge, the 'e' is retained: changeable, noticeable.",
      "key_vocabulary": "-able, -ible, -ably, -ibly, suffix, root word, adoration clue",
      "common_misconceptions": "Pupils often use -ible for all words because they see it frequently. The 'reliable' spelling confuses pupils as the root 'rely' changes to 'reli' before the suffix, following the 'y → i' rule.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C012",
      "domain_id": "EN-Y5-D004",
      "concept_name": "Dictionary skills (advanced)",
      "description": "Advanced dictionary use involves deploying knowledge of the first three or four letters of a word to locate it efficiently, checking both its spelling and its meaning, and using dictionary definitions to support comprehension of new vocabulary. At upper KS2 mastery, pupils use dictionaries independently and purposefully, not merely to confirm suspicions about spelling.",
      "teaching_guidance": "Practise locating words rapidly using first-letter, then second-letter, then third-letter alphabetical order. Teach pupils to read full definitions and to select the appropriate meaning when multiple senses are given. Pair dictionary use with vocabulary notebooks where pupils record new words with their definitions and example sentences.",
      "key_vocabulary": "dictionary, alphabetical order, entry, definition, headword, meaning, spelling",
      "common_misconceptions": "Pupils often look up words letter-by-letter rather than using the first three or four letters strategically to navigate sections of the dictionary. Some pupils copy the first definition without checking whether it fits their context.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C013",
      "domain_id": "EN-Y5-D004",
      "concept_name": "Thesaurus skills",
      "description": "A thesaurus provides synonyms and related words to help writers choose vocabulary that is more precise, more varied or more appropriate for a given context or register. At upper KS2 mastery, pupils use a thesaurus purposefully — selecting synonyms that fit the precise meaning and register of their writing rather than simply choosing the most impressive-sounding option.",
      "teaching_guidance": "Teach pupils to use a thesaurus systematically: look up the word, read the synonyms, consider which one fits the precise meaning and register of their writing, and check any unfamiliar synonym in a dictionary. Discuss the difference between near-synonyms (e.g., thin/slender/skinny) in terms of connotation and register. Caution against 'thesaurus substitution' that produces inappropriate or awkward word choices.",
      "key_vocabulary": "thesaurus, synonym, antonym, connotation, register, word choice, vocabulary",
      "common_misconceptions": "Pupils often select the longest or most impressive-looking synonym without checking whether it fits the intended meaning. They may use thesaurus words inappropriately for the register of their writing (e.g., replacing 'get' with 'procure' in informal narrative).",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C014",
      "domain_id": "EN-Y5-D003",
      "concept_name": "Reading widely across genres",
      "description": "At upper KS2, reading widely means engaging with an increasingly diverse range of fiction (including myths, legends, traditional stories, modern fiction, literary heritage, and texts from other cultures), poetry, plays, non-fiction and reference materials. Mastery means pupils read for both pleasure and information, selecting texts purposefully and reading books structured in different ways.",
      "teaching_guidance": "Ensure the reading curriculum includes genuine breadth: whole class novels, class poetry anthologies, read-aloud sessions including literary heritage texts, independent reading time. Use guided reading to introduce texts pupils might not choose themselves. Discuss what different structural forms are used for (e.g., how a reference book differs from a narrative).",
      "key_vocabulary": "genre, fiction, non-fiction, poetry, drama, literary heritage, traditional stories, reference text",
      "common_misconceptions": "Some pupils equate 'reading' with fiction only and need explicit encouragement to engage with non-fiction, poetry and drama as equally valid reading forms. Pupils may avoid texts that appear challenging or unfamiliar.",
      "concept_type": "process",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C015",
      "domain_id": "EN-Y5-D003",
      "concept_name": "Literary heritage and cultural diversity",
      "description": "Literary heritage refers to significant texts from Britain's literary tradition including myths, legends, traditional stories and classic fiction. Cultural diversity in reading means including texts from traditions beyond British literature. At upper KS2 mastery, pupils have encountered a range of texts from both the heritage canon and other cultural traditions, can discuss their characteristics and conventions, and understand that literature reflects cultural context.",
      "teaching_guidance": "Include texts from diverse traditions alongside British literary heritage. Discuss the conventions of myths and legends (e.g., heroes, quests, transformation) explicitly. When reading heritage texts, provide context about when and why they were written. Avoid presenting the literary heritage as a fixed, exclusive canon — discuss how understanding of 'heritage' itself is contested.",
      "key_vocabulary": "myth, legend, traditional story, literary heritage, cultural tradition, canon, classic, oral tradition",
      "common_misconceptions": "Pupils may assume that 'literary heritage' means only very old, difficult books. They may not recognise the conventions of genres such as myth and legend and therefore miss the significance of those conventions.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C016",
      "domain_id": "EN-Y5-D003",
      "concept_name": "Identifying themes and literary conventions",
      "description": "A theme is a central idea or concern that runs through a text (e.g., loss, heroism, justice, identity). A convention is a feature characteristic of a genre or form (e.g., the quest structure in an adventure, the first-person voice in autobiography). At upper KS2 mastery, pupils can identify and name themes and conventions in individual texts and compare them across multiple texts.",
      "teaching_guidance": "Explicitly name themes when discussing texts and ask pupils to provide evidence for their identification. Teach pupils to distinguish between a theme ('the story is about heroism') and a plot event ('the character rescues the child'). Use the same theme to compare across different texts read during the year. Teach genre conventions explicitly as part of reading and as models for writing.",
      "key_vocabulary": "theme, convention, genre, motif, symbol, quest, heroism, loss, identity, pattern",
      "common_misconceptions": "Pupils often confuse themes with subjects or plot summaries. They may identify themes without providing textual evidence. Some pupils cannot distinguish between a convention of a genre and a feature of a specific text.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C017",
      "domain_id": "EN-Y5-D003",
      "concept_name": "Cross-text comparison",
      "description": "Cross-text comparison involves making substantiated links between characters, settings, themes, viewpoints or techniques across more than one text. At upper KS2 mastery, pupils can identify meaningful similarities and differences between texts, considering different accounts of the same event and multiple viewpoints, within texts and across more than one text.",
      "teaching_guidance": "Model comparative discussion explicitly: 'In Book A, the theme of loss is shown through ... whereas in Book B...' Provide structured scaffolding (Venn diagrams, comparison grids) initially, then reduce support. Ensure the reading curriculum includes multiple texts on similar themes or by the same author to make comparison meaningful.",
      "key_vocabulary": "comparison, contrast, similarity, difference, viewpoint, account, theme, across texts",
      "common_misconceptions": "Pupils often describe rather than compare: listing features of each text separately rather than identifying relationships between them. They may compare at a superficial level (both books have a main character) rather than analysing theme, technique or viewpoint.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C018",
      "domain_id": "EN-Y5-D003",
      "concept_name": "Advanced inference and evidence-based reasoning",
      "description": "Inference at upper KS2 involves not simply deducing what a character feels but explaining why, identifying the textual evidence for the inference, and considering multiple possible interpretations. Mastery means pupils can infer characters' feelings, thoughts and motives from their actions and justify those inferences with specific evidence from the text, using the language of possibility ('this suggests...', 'this could imply...').",
      "teaching_guidance": "Teach the IPEE or similar frameworks (Inference, Point, Evidence, Explanation) to structure written responses. Model inference explicitly by thinking aloud about what is implied. Distinguish between inference (reading between the lines) and deduction (reading the lines). Practise with increasingly complex characters and ambiguous situations.",
      "key_vocabulary": "inference, implication, evidence, justify, motive, character, feeling, thought, suggest, imply",
      "common_misconceptions": "Pupils often confuse literal retrieval with inference. They may infer without providing textual evidence ('I think she is sad'), or provide evidence without explaining how it supports the inference. Some pupils over-read text and make inferences unsupported by evidence.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C019",
      "domain_id": "EN-Y5-D003",
      "concept_name": "Prediction from stated and implied information",
      "description": "At upper KS2, prediction extends beyond 'what happens next' to include using both explicitly stated and implied information to make reasoned predictions about plot, character development and outcome. Mastery means pupils can articulate what they predict and why, distinguishing between what the text states directly and what is implied.",
      "teaching_guidance": "Model prediction explicitly, thinking aloud about both the direct clues and the implied ones. After making predictions, return to them when reading reveals the outcome — discuss what clues were reliable and what were misleading. Teach pupils to use hedging language ('I think... because... the text implies...').",
      "key_vocabulary": "predict, prediction, stated, implied, inference, evidence, outcome, foreshadow",
      "common_misconceptions": "Pupils often predict based on personal preference or prior knowledge of genre conventions rather than specific textual evidence. They may not distinguish between 'the text says' and 'the text implies'.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C020",
      "domain_id": "EN-Y5-D003",
      "concept_name": "Multi-paragraph summarisation",
      "description": "Summarisation at upper KS2 requires pupils to identify the main idea or ideas across more than one paragraph and articulate key supporting details, while omitting non-essential information. Mastery means pupils can produce concise, accurate summaries that preserve meaning without distortion, forming the foundation for précis writing and note-taking.",
      "teaching_guidance": "Teach pupils to identify the main idea of each paragraph first, then synthesise across paragraphs. Use traffic-light annotation: green for main ideas, amber for supporting details, red for less important information. Provide summary frames to scaffold ('The main idea is... This is supported by...'). Gradually increase the length and complexity of texts summarised.",
      "key_vocabulary": "summarise, main idea, key detail, supporting detail, paragraph, synthesis, condense",
      "common_misconceptions": "Pupils often copy verbatim rather than summarising, or produce summaries that omit crucial information while retaining peripheral detail. They may confuse the main idea with the most interesting or dramatic detail.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C021",
      "domain_id": "EN-Y5-D003",
      "concept_name": "Authorial language analysis",
      "description": "Language analysis at upper KS2 involves identifying how authors use language (including figurative language such as metaphor, simile, analogy and imagery), understanding the structural and presentational choices they make, and evaluating the impact of those choices on the reader. Mastery means pupils can name the technique, describe its effect and evaluate whether it is effective, using appropriate metalanguage.",
      "teaching_guidance": "Teach the technical terms: metaphor, simile, analogy, imagery, style, effect. Use short extracts for focused analysis. Practise the three-step process: identify (what is the technique?), describe (what does it do?), evaluate (how effective is it and why?). Distinguish between identifying a feature and explaining its impact — always push for the 'so what?'",
      "key_vocabulary": "metaphor, simile, analogy, imagery, figurative language, style, effect, impact, technique, authorial choice",
      "common_misconceptions": "Pupils often identify a technique without evaluating its effect. They confuse simile and metaphor, or use 'simile' as a catch-all for all figurative language. Some pupils evaluate effect vaguely ('it makes it more interesting') without specific analysis of how the language works.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C022",
      "domain_id": "EN-Y5-D003",
      "concept_name": "Fact versus opinion",
      "description": "The ability to distinguish statements of fact (which are verifiable and can be shown to be true or false) from statements of opinion (which express a view, judgement or belief) is a critical literacy skill. At upper KS2 mastery, pupils can identify fact and opinion in non-fiction texts reliably, including in cases where opinion is expressed as if it were fact, and understand how this distinction relates to the reliability and bias of a source.",
      "teaching_guidance": "Provide texts that blend fact and opinion and ask pupils to annotate. Teach signal words for opinion (I think, probably, appears to, should, in my view) and discuss how some opinion is presented without such markers. Connect to news literacy and source evaluation. Discuss why writers present opinion as fact and what effect this has on readers.",
      "key_vocabulary": "fact, opinion, evidence, bias, reliability, statement, verify, claim, viewpoint",
      "common_misconceptions": "Pupils often classify surprising or counterintuitive facts as 'opinions' because they find them hard to believe. They may assume that all statistics are facts, not recognising that statistics can be selectively chosen to support a viewpoint. Some pupils cannot identify opinion that is presented without explicit markers.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true
    },
    {
      "concept_id": "EN-Y5-C023",
      "domain_id": "EN-Y5-D003",
      "concept_name": "Information retrieval and presentation",
      "description": "Retrieving, recording and presenting information from non-fiction involves locating specific information efficiently using contents pages, indexes, headings and skimming/scanning, selecting and recording relevant information, and presenting it in an appropriate format. At upper KS2 mastery, pupils can plan a research task, locate information across multiple sources, take effective notes and present findings coherently.",
      "teaching_guidance": "Teach pupils to identify their research question before beginning. Model how to use contents pages, indexes and heading structures to navigate non-fiction texts efficiently. Practise note-making (not copying) using bullet points or concept maps. Show how retrieved information can be presented in different formats (table, report, presentation) for different purposes.",
      "key_vocabulary": "retrieve, record, present, non-fiction, contents, index, skimming, scanning, note-taking, research",
      "common_misconceptions": "Pupils often read non-fiction from cover to cover rather than using navigation features to locate relevant information. They frequently copy text verbatim rather than making notes in their own words. Some pupils include all retrieved information in their presentation rather than selecting what is relevant.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true
    },
    {
      "concept_id": "EN-Y5-C024",
      "domain_id": "EN-Y5-D006",
      "concept_name": "Précis writing",
      "description": "Précis is the skill of condensing a longer piece of writing into a shorter form while retaining all the essential meaning, in the writer's own words and in a coherent style. It is distinct from note-taking and summary: a précis is a polished, continuous prose piece. At upper KS2 mastery, pupils can identify what is essential, omit what is not, and rewrite in their own words without distorting the original meaning.",
      "teaching_guidance": "Begin with short, clearly structured paragraphs and work up to longer extracts. Model the process: read the whole, identify the essential meaning, draft a condensed version, check it against the original. A useful benchmark is reducing text to one-third of its original length. Note that précis is valuable preparation for note-taking in secondary school across all subjects.",
      "key_vocabulary": "précis, condense, summarise, essential, paraphrase, own words, concise",
      "common_misconceptions": "Pupils often produce a summary that is merely shorter by removing some sentences, rather than a true précis that reconceives the content. They may struggle to distinguish essential meaning from illustrative examples.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C025",
      "domain_id": "EN-Y5-D006",
      "concept_name": "Cohesive devices and paragraph linking",
      "description": "Cohesive devices are words and phrases that connect ideas within and across paragraphs, creating a coherent, unified text. At Year 5, these include devices within paragraphs (then, after that, this, firstly) and linking adverbials across paragraphs referring to time (later), place (nearby) and number (secondly), as well as tense choices that signal temporal relationships. Mastery means pupils deploy a wide range of these devices deliberately and appropriately.",
      "teaching_guidance": "Teach cohesive devices as a repertoire organised by function: time, place, number, addition, contrast, consequence, example. Model how to vary devices to avoid repetition. Annotate published writing to identify how professional writers achieve cohesion. In editing sessions, specifically target cohesion as a revision focus.",
      "key_vocabulary": "cohesion, cohesive device, adverbial, linking phrase, paragraph, sequence, contrast, time, place, number",
      "common_misconceptions": "Pupils often overuse 'then' and 'next' as the only cohesive devices they know. Some pupils insert cohesive devices mechanically without ensuring they accurately reflect the logical relationship between ideas (e.g., using 'however' where 'therefore' is needed).",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C026",
      "domain_id": "EN-Y5-D006",
      "concept_name": "Audience, purpose and form in writing",
      "description": "At upper KS2, pupils plan writing by explicitly identifying the intended audience, the purpose of the writing and the most appropriate form to achieve that purpose, selecting from a range of text types used as models. Mastery means pupils make conscious choices about form and language that reflect genuine awareness of audience and purpose, not simply genre conventions applied mechanically.",
      "teaching_guidance": "Before all extended writing tasks, require pupils to articulate audience and purpose explicitly: Who is this for? What is it trying to do? What form is most appropriate? Provide model texts for each form studied. Return to audience and purpose when evaluating and editing — 'Does this achieve its purpose for its audience?'",
      "key_vocabulary": "audience, purpose, form, genre, register, style, model text, context",
      "common_misconceptions": "Pupils often treat 'audience' as a mechanical box to tick rather than a genuine influence on their writing choices. They may choose form based on what they find easiest rather than what is most effective for the purpose.",
      "concept_type": "process",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C027",
      "domain_id": "EN-Y5-D006",
      "concept_name": "Narrative writing: character, setting, atmosphere and dialogue",
      "description": "In narrative writing at upper KS2, pupils are expected to describe settings, characters and atmosphere with deliberate craft, and to integrate dialogue in ways that convey character and advance the action — not simply punctuate speech correctly. Mastery means pupils make authorial choices about how and when to use description and dialogue for effect, drawing on their knowledge of how authors work.",
      "teaching_guidance": "Read extracts specifically for the techniques authors use to build atmosphere and character. Teach the distinction between describing a character and revealing character through action and dialogue. Model integrating dialogue into narrative smoothly rather than as isolated exchanges. Practise writing the same scene using different combinations of description, action and dialogue to explore the effects.",
      "key_vocabulary": "character, setting, atmosphere, dialogue, narrative, integrate, convey, action, reveal, craft",
      "common_misconceptions": "Pupils often write dialogue in isolated chunks rather than integrating it with action and description. They may describe characters' emotions directly ('she felt sad') rather than conveying emotion through behaviour, action or dialogue ('she turned away and said nothing').",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C028",
      "domain_id": "EN-Y5-D007",
      "concept_name": "Relative clauses",
      "description": "A relative clause is a subordinate clause introduced by a relative pronoun (who, which, where, when, whose, that) or by an omitted relative pronoun, which gives more information about a noun. At upper KS2 mastery, pupils can construct relative clauses correctly, punctuate them appropriately, and understand the difference between defining and non-defining relative clauses. This is Year 5-specific grammar in Appendix 2.",
      "teaching_guidance": "Teach the relative pronouns and which nouns they refer to: who/whose for people, which for things, where for places, when for times. Practise constructing relative clauses from two short sentences. Introduce the concept of omitted relative pronouns ('the book I read' = 'the book that I read'). Show the difference between defining (no commas: 'the dog that bit me') and non-defining (commas: 'my dog, which is called Rex,') relative clauses.",
      "key_vocabulary": "relative clause, relative pronoun, who, which, where, when, whose, that, subordinate clause, defining, non-defining",
      "common_misconceptions": "Pupils may use 'which' for people (should be 'who') or 'who' for objects (should be 'which'). They frequently omit commas around non-defining relative clauses. Some pupils write very long relative clauses that become difficult to parse.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C029",
      "domain_id": "EN-Y5-D007",
      "concept_name": "Modal verbs",
      "description": "Modal verbs (might, should, will, must, can, could, would, may, shall, ought to) express degrees of possibility, necessity, certainty or permission. At upper KS2 mastery, pupils use modal verbs purposefully to indicate degrees of certainty in writing, understand that modal verbs are followed by an infinitive without 'to', and can discuss the effect of choosing one modal verb over another. This is Year 5-specific grammar in Appendix 2.",
      "teaching_guidance": "Teach modals on a cline of certainty: will (certain) → should (expected) → might (possible) → could (less likely). Show how modal choice affects meaning and register: 'You must come' vs 'You might come'. Use modal verbs in non-fiction writing to hedge claims appropriately (scientific and historical writing). Connect to spoken language: modals are used frequently in discussion and debate.",
      "key_vocabulary": "modal verb, possibility, certainty, necessity, permission, will, might, should, must, could, would, may",
      "common_misconceptions": "Pupils sometimes use 'of' instead of 'have' after modal verbs ('should of' instead of 'should have') — a spelling error driven by pronunciation. They may not appreciate the significant differences in certainty conveyed by different modal verbs.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C030",
      "domain_id": "EN-Y5-D007",
      "concept_name": "Passive voice",
      "description": "The passive voice occurs when the grammatical subject of a verb receives the action rather than performing it (e.g., 'The window was broken by Tom' rather than 'Tom broke the window'). At upper KS2 mastery, pupils can construct passive sentences, identify them in texts, and understand when and why writers choose the passive — particularly to change focus, to omit the agent, or to create an impersonal, formal tone.",
      "teaching_guidance": "Teach the structure: object of active → subject of passive; 'be' + past participle. Show how the agent (by whom) is optional in passives. Discuss contexts where passive is preferred: formal reports, scientific writing, news ('Mistakes were made'). Contrast active and passive versions of the same sentence to show how perspective and emphasis change.",
      "key_vocabulary": "passive voice, active voice, subject, object, agent, past participle, impersonal, formal",
      "common_misconceptions": "Pupils often over-use passive in all writing once they have learnt it, without selecting active or passive purposefully. They may confuse past tense with passive voice. Some pupils struggle to form passive correctly when the tense of 'be' must change.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C031",
      "domain_id": "EN-Y5-D007",
      "concept_name": "Perfect verb forms",
      "description": "The perfect aspect marks a relationship of time and cause between actions: the present perfect (has/have + past participle) connects a past action to the present; the past perfect (had + past participle) places one action before another in the past. At upper KS2 mastery, pupils use both forms correctly and understand that they signal temporal relationships rather than simple past action.",
      "teaching_guidance": "Teach the present perfect first using 'have/has + past participle' and contrast it with simple past: 'I ate lunch' (past, completed) vs 'I have eaten lunch' (past, relevant to present). Then teach past perfect: 'By the time she arrived, he had left'. Use timeline diagrams to show the relationship between actions. Show how past perfect is used in narratives to flash back.",
      "key_vocabulary": "perfect aspect, present perfect, past perfect, have, has, had, past participle, tense, time relationship",
      "common_misconceptions": "Pupils frequently confuse the present perfect ('I have seen') with simple past ('I saw') and use them interchangeably. They may not recognise the past perfect at all, or avoid using it in favour of simpler past tenses.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C032",
      "domain_id": "EN-Y5-D007",
      "concept_name": "Parenthesis punctuation (brackets, dashes and commas)",
      "description": "Parenthesis is additional information inserted into a sentence that could be removed without changing the main meaning. It can be marked by brackets, a pair of dashes or a pair of commas. At upper KS2 mastery, pupils use all three forms of parenthesis correctly and make deliberate choices between them based on the degree of emphasis and the register of the writing. This is Year 5-specific grammar in Appendix 2.",
      "teaching_guidance": "Introduce each punctuation mark for parenthesis and discuss the different effects: brackets (most separate, often for clarification or afterthought), dashes (emphatic, informal or dramatic), commas (most integrated, least disruptive). Practise identifying which marker has been used and evaluating whether the choice suits the register. Note that parenthesis must be 'closed': two dashes, two brackets or two commas.",
      "key_vocabulary": "parenthesis, bracket, dash, comma, additional information, embedded clause, aside",
      "common_misconceptions": "Pupils often open a parenthesis (with one bracket or dash) but fail to close it. They may use a single dash where a pair is needed, confusing it with a hyphen. Commas for parenthesis are easily confused with commas used for other purposes.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C033",
      "domain_id": "EN-Y5-D007",
      "concept_name": "Advanced punctuation for clause boundaries (semi-colons, colons, dashes)",
      "description": "Semi-colons, colons and dashes can all be used to mark boundaries between independent clauses, with different effects on the relationship signalled between those clauses. At upper KS2 mastery, pupils understand these three uses and can deploy them deliberately and correctly, using them to create varied sentence structures rather than relying solely on full stops.",
      "teaching_guidance": "Teach each mark in the context of two closely related independent clauses. Show that a colon announces, explains or elaborates; a semi-colon balances or contrasts clauses of equal weight; a dash is more informal and emphatic. Provide examples from literature and non-fiction to show these marks in professional use. Practise rewriting full-stop sentences using these marks and discussing the difference in effect.",
      "key_vocabulary": "semi-colon, colon, dash, independent clause, clause boundary, sentence structure, punctuation",
      "common_misconceptions": "Pupils often use a colon between a clause and a single word rather than between two independent clauses. They may use semi-colons randomly rather than to separate independent clauses of equal weight. The dash is often overused as a substitute for all other punctuation.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C034",
      "domain_id": "EN-Y5-D001",
      "concept_name": "Performing compositions",
      "description": "Performing their own and others' writing with appropriate intonation, volume and movement so that meaning is clear to an audience. At upper KS2 mastery, pupils understand that performance is an act of interpretation and that choices about voice and movement convey meaning. This connects reading aloud, drama and composition, reinforcing the relationship between writing and speech.",
      "teaching_guidance": "Provide explicit opportunities for pupils to prepare and rehearse performances of their own writing. Teach specific techniques: varying pace, emphasis, volume and pause. Video performances and allow pupils to self-evaluate. Connect to drama skills (role, character, performance) and to spoken language objectives around public speaking.",
      "key_vocabulary": "perform, performance, intonation, tone, volume, pace, emphasis, movement, audience, meaning",
      "common_misconceptions": "Pupils often mumble or rush when performing, undercutting the meaning they have crafted in their writing. Some pupils read in a flat monotone, not varying intonation to reflect the meaning of the text. Others exaggerate performance to the point of obscuring meaning.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true
    },
    {
      "concept_id": "EN-Y5-C035",
      "domain_id": "EN-Y5-D001",
      "concept_name": "Public speaking and formal debate",
      "description": "In Years 5 and 6, pupils' confidence, enjoyment and mastery of language should be extended through public speaking, performance and debate. At upper KS2 mastery, pupils can give structured spoken presentations, argue a position in formal debate, use notes purposefully, maintain focus on a topic, and evaluate different viewpoints, building on others' contributions courteously.",
      "teaching_guidance": "Teach formal debate structure: proposition, opposition, rebuttal, summing up. Practise note-making for speeches rather than reading scripts. Provide explicit criteria for effective public speaking and use peer assessment against these criteria. Build in regular opportunities for formal presentations in English and across the curriculum.",
      "key_vocabulary": "debate, argument, proposition, opposition, rebuttal, viewpoint, public speaking, formal presentation, register",
      "common_misconceptions": "Pupils often read directly from notes rather than using notes as prompts. They may confuse having a strong view with debating effectively — skill in debate requires responding to the opposing argument, not simply repeating one's own position more loudly.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": true
    },
    {
      "concept_id": "EN-Y5-C036",
      "domain_id": "EN-Y5-D002",
      "concept_name": "Morphology, Etymology and Word Building",
      "description": "Morphology is the study of word structure: how words are built from meaningful units (morphemes) including root words, prefixes and suffixes. Etymology is the study of word origins and how words have entered the English language from Latin, Greek, French, Anglo-Saxon and other sources. At Y5, pupils apply growing knowledge of these patterns both to decode unfamiliar words when reading (recognising familiar roots and affixes enables reading and meaning inference without a dictionary) and to understand the meaning of new words encountered across all subjects. This meta-linguistic awareness extends pupils' vocabulary range substantially and develops reading independence.",
      "teaching_guidance": "Teach morphology through explicit word analysis: take an unfamiliar word and break it into its component morphemes, identifying root, prefix and suffix and the meaning each contributes. Build a class word web around productive roots: 'rupt' (interrupt, disrupt, erupt, rupture, corrupt) shows how one root generates many related words. Teach Latinate roots systematically since they underpin much formal English vocabulary across subjects. Etymology enriches vocabulary learning: why does 'terrible' mean frightening (from Latin 'terrere', to frighten)? Connect morphological awareness to spelling: understanding that 'sign' is related to 'signal' and 'signature' explains why the silent 'g' is retained.",
      "key_vocabulary": "morphology, etymology, root word, prefix, suffix, affix, morpheme, derivation, Latin, Greek, word family, word building, compound, inflection, derivation",
      "common_misconceptions": "Pupils may approach unfamiliar words by sounding them out without using morphological knowledge; developing the habit of looking for known roots and affixes provides a more efficient decoding strategy for polysyllabic academic vocabulary. Some pupils may think etymology is merely word trivia rather than a practical vocabulary development tool; showing how etymological knowledge unlocks many related words makes its practical value clear. Pupils may confuse inflectional morphology (changing verb tense: walk/walked) with derivational morphology (creating new words: walk/walker); keeping these distinct prevents confusion.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y5-C037",
      "domain_id": "EN-Y5-D005",
      "concept_name": "Fluent Handwriting and Presentation",
      "description": "Fluent, legible handwriting at Y5 is both a practical communication tool and a means of developing automaticity that frees cognitive resources for the compositional aspects of writing. At Y5, pupils develop increasing speed while maintaining legibility, make deliberate choices about when to join letters and when to leave them unjoined (for example, when writing in certain print contexts or when neatness is prioritised over speed), and select appropriate writing implements for different purposes (fine-tipped pen for close work, broad nib for display, pencil for rough drafts). The development of a personal, consistent handwriting style marks growing maturity as a writer.",
      "teaching_guidance": "Handwriting at Y5 should be practised in context, not just as isolated letter formation drills. Set tasks that develop speed gradually: timed copying exercises where legibility is monitored alongside speed. Discuss explicitly when joining is appropriate and when it is not — in some contexts (labels, forms, digital environments) print is clearer. Develop pupils' awareness of presentation as a communicative choice: a formal letter to an unknown adult should look different from a note to a friend. Ensure access to a range of writing implements and give pupils opportunity to choose deliberately — this develops metacognitive awareness of their own writing process.",
      "key_vocabulary": "handwriting, legible, fluent, speed, join, joined, unjoined, presentation, implement, style, formation, consistent, neat, efficient, personal",
      "common_misconceptions": "Pupils may believe that faster handwriting necessarily means less legible handwriting; fluency and legibility are not opposites — fluent handwriting is often more legible than laboured, slow writing because it is formed with consistent motion patterns. Some pupils may not understand why the choice to join or not join matters; developing awareness that joining affects both speed and legibility in different contexts develops purposeful decision-making. Pupils with difficulty forming letters may benefit from specific investigation into which letters cause most difficulty rather than blanket handwriting practice.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "EN-Y4-C001",
      "dependent_concept": "EN-Y5-C003",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 1.0,
      "rationale": "Year 4 introduction to root words is the essential foundation for Year 5 morphology and etymology work. Without secure understanding of root words, pupils cannot apply morphological analysis to unfamiliar vocabulary."
    },
    {
      "prerequisite_concept": "EN-Y4-C002",
      "dependent_concept": "EN-Y5-C004",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 4 prefix work (super-, anti-, auto-) establishes the principle of prefixes changing meaning; Year 5 extends this to verb prefixes (dis-, de-, mis-, over-, re-), which are more numerous and varied."
    },
    {
      "prerequisite_concept": "EN-Y4-C003",
      "dependent_concept": "EN-Y5-C005",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 4 suffix work (including -ation, -ly, -ous) establishes suffix principles that Year 5 extends to verb-forming suffixes (-ate, -ise, -ify)."
    },
    {
      "prerequisite_concept": "EN-Y5-C003",
      "dependent_concept": "EN-Y5-C001",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 1.0,
      "rationale": "Understanding root words is the conceptual foundation for morphology — you cannot analyse word structure without identifying the root first."
    },
    {
      "prerequisite_concept": "EN-Y5-C003",
      "dependent_concept": "EN-Y5-C002",
      "confidence": "inferred",
      "relationship_type": "cognitive",
      "strength": 0.8,
      "rationale": "Root word knowledge provides the entry point for etymological study — pupils need to identify the root before they can investigate its origin."
    },
    {
      "prerequisite_concept": "EN-Y5-C001",
      "dependent_concept": "EN-Y5-C004",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Morphological understanding of how prefixes attach to roots is prerequisite for correctly applying verb prefixes."
    },
    {
      "prerequisite_concept": "EN-Y5-C001",
      "dependent_concept": "EN-Y5-C005",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Morphological understanding of how suffixes attach to roots is prerequisite for correctly applying verb-forming suffixes."
    },
    {
      "prerequisite_concept": "EN-Y4-C004",
      "dependent_concept": "EN-Y5-C007",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 4 homophone work (there/their/they're, accept/except etc.) provides the foundation for Year 5's more complex homophones and noun/verb pairs."
    },
    {
      "prerequisite_concept": "EN-Y5-C001",
      "dependent_concept": "EN-Y5-C008",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.7,
      "rationale": "Morphological knowledge (especially understanding of root words ending in -ce) supports the rule for choosing -cious over -tious."
    },
    {
      "prerequisite_concept": "EN-Y5-C001",
      "dependent_concept": "EN-Y5-C009",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.7,
      "rationale": "Morphological knowledge of root words and their endings supports the -cial/-tial rule (vowel/consonant after root)."
    },
    {
      "prerequisite_concept": "EN-Y5-C001",
      "dependent_concept": "EN-Y5-C010",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.8,
      "rationale": "The -ant/-ent rule depends on identifying related word forms, which requires morphological awareness of how words in a family are related."
    },
    {
      "prerequisite_concept": "EN-Y5-C001",
      "dependent_concept": "EN-Y5-C011",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.8,
      "rationale": "The -able/-ible rule depends on whether a complete root word can be identified before the suffix, which requires morphological analysis."
    },
    {
      "prerequisite_concept": "EN-Y4-C005",
      "dependent_concept": "EN-Y5-C012",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 4 dictionary use develops into Year 5's more systematic use of first 3-4 letters for navigation, reflecting increased independence and efficiency."
    },
    {
      "prerequisite_concept": "EN-Y5-C012",
      "dependent_concept": "EN-Y5-C013",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Dictionary skills (locating words, reading definitions) underpin thesaurus use, which involves similar navigation and requires understanding of synonym distinctions."
    },
    {
      "prerequisite_concept": "EN-Y4-C006",
      "dependent_concept": "EN-Y5-C014",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 4's wide reading across fiction and non-fiction continues and deepens in Year 5, extending into the specific genres named in the upper KS2 curriculum."
    },
    {
      "prerequisite_concept": "EN-Y4-C008",
      "dependent_concept": "EN-Y5-C016",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 4 theme identification builds directly into Year 5's requirement to discuss themes and conventions across a wide range of writing, adding greater complexity and cross-text scope."
    },
    {
      "prerequisite_concept": "EN-Y5-C016",
      "dependent_concept": "EN-Y5-C017",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Identifying themes and conventions within texts is prerequisite for making meaningful comparisons across texts — pupils need a shared conceptual vocabulary (theme, convention) to compare effectively."
    },
    {
      "prerequisite_concept": "EN-Y4-C010",
      "dependent_concept": "EN-Y5-C018",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 4 inference skills (drawing on implied meaning) develop into Year 5's more demanding requirement to infer and justify with specific textual evidence."
    },
    {
      "prerequisite_concept": "EN-Y5-C018",
      "dependent_concept": "EN-Y5-C021",
      "confidence": "inferred",
      "relationship_type": "cognitive",
      "strength": 0.8,
      "rationale": "Advanced inference skills (reading implied meaning with evidence) underpin the ability to analyse authorial language choices and evaluate their effect on readers."
    },
    {
      "prerequisite_concept": "EN-Y4-C011",
      "dependent_concept": "EN-Y5-C019",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 4 prediction from stated information develops into Year 5's more complex prediction from both stated and implied information."
    },
    {
      "prerequisite_concept": "EN-Y4-C012",
      "dependent_concept": "EN-Y5-C020",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 4 summarisation (identifying main ideas) develops into Year 5's multi-paragraph summarisation requiring synthesis across extended texts."
    },
    {
      "prerequisite_concept": "EN-Y5-C020",
      "dependent_concept": "EN-Y5-C024",
      "confidence": "inferred",
      "relationship_type": "cognitive",
      "strength": 0.85,
      "rationale": "Précis writing requires all the skills of multi-paragraph summarisation plus the additional demand of producing polished, condensed prose — it is a more advanced form of the same cognitive process."
    },
    {
      "prerequisite_concept": "EN-Y4-C014",
      "dependent_concept": "EN-Y5-C023",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 4 information retrieval skills develop into Year 5's requirement to retrieve, record and present from non-fiction, adding the presentation dimension and increased independence."
    },
    {
      "prerequisite_concept": "EN-Y4-C015",
      "dependent_concept": "EN-Y5-C035",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 4's discussions and presentations develop into Year 5's formal public speaking and structured debate, which requires all prior oracy skills plus formal conventions."
    },
    {
      "prerequisite_concept": "EN-Y4-C017",
      "dependent_concept": "EN-Y5-C026",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 4 audience and purpose awareness develops into Year 5's more sophisticated requirement to select form, model writing on published texts, and make deliberate choices accordingly."
    },
    {
      "prerequisite_concept": "EN-Y4-C018",
      "dependent_concept": "EN-Y5-C027",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 4 character and setting work develops into Year 5's requirement to describe atmosphere and integrate dialogue purposefully to convey character and advance action."
    },
    {
      "prerequisite_concept": "EN-Y4-C020",
      "dependent_concept": "EN-Y5-C025",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 4's paragraph cohesion and use of organisational features develops into Year 5's use of a wide range of cohesive devices and adverbials of time, place and number linking across paragraphs."
    },
    {
      "prerequisite_concept": "EN-Y4-C025",
      "dependent_concept": "EN-Y5-C028",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 1.0,
      "rationale": "Year 4's expanded noun phrases with modifying adjectives and preposition phrases develop directly into Year 5's relative clauses, which are a further way of extending and modifying nouns using a subordinate clause."
    },
    {
      "prerequisite_concept": "EN-Y4-C026",
      "dependent_concept": "EN-Y5-C029",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.7,
      "rationale": "Year 4's fronted adverbials introducing degrees of time, frequency and manner create familiarity with the idea of expressing possibility and condition, which extends into modal verb use in Year 5."
    },
    {
      "prerequisite_concept": "EN-Y4-C024",
      "dependent_concept": "EN-Y5-C030",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Year 4's distinction between Standard and non-Standard English, including understanding subject-verb relationships, supports Year 5's work on passive voice which requires manipulating the subject-verb-object relationship."
    },
    {
      "prerequisite_concept": "EN-Y4-C023",
      "dependent_concept": "EN-Y5-C031",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 4's tense work (including standard forms of verbs) provides the foundation for Year 5's perfect aspect, which requires understanding of 'have/had + past participle' as a distinct tense-aspect form."
    },
    {
      "prerequisite_concept": "EN-Y4-C027",
      "dependent_concept": "EN-Y5-C032",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 4's use of commas after fronted adverbials and in lists develops into Year 5's use of commas, brackets and dashes for parenthesis — a more complex application of the same logic of using punctuation to mark added information."
    },
    {
      "prerequisite_concept": "EN-Y4-C028",
      "dependent_concept": "EN-Y5-C033",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 4's punctuation of direct speech (inverted commas, commas, end punctuation) develops into Year 5's advanced clause-boundary punctuation using semi-colons, colons and dashes."
    },
    {
      "prerequisite_concept": "EN-Y5-C035",
      "dependent_concept": "EN-Y5-C034",
      "confidence": "inferred",
      "relationship_type": "cognitive",
      "strength": 0.7,
      "rationale": "Public speaking and debate skills (preparing to speak for an audience, monitoring audience response) underpin the ability to perform written compositions effectively."
    },
    {
      "prerequisite_concept": "EN-Y4-C013",
      "dependent_concept": "EN-Y5-C036",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Y4 root words for reading and meaning (EN-Y4-C013) is a direct developmental precursor to Y5 morphology and etymology: pupils build from identifying root words in Y4 to systematically analysing word structure and origins using the full morpheme toolkit in Y5."
    },
    {
      "prerequisite_concept": "EN-Y4-C014",
      "dependent_concept": "EN-Y5-C036",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Y4 prefixes and suffixes for reading (EN-Y4-C014) establishes the foundational affix knowledge that Y5 morphology and etymology extends: pupils move from recognising individual affixes to applying systematic morphological analysis across unfamiliar vocabulary."
    },
    {
      "prerequisite_concept": "EN-Y4-C040",
      "dependent_concept": "EN-Y5-C037",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Y4 joining strokes in handwriting (EN-Y4-C040) provides the physical handwriting foundation that Y5 fluent handwriting builds on: pupils move from learning joining technique to developing speed, consistency and deliberate decision-making about when to join."
    },
    {
      "prerequisite_concept": "EN-Y4-C041",
      "dependent_concept": "EN-Y5-C037",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Y4 handwriting fluency and quality (EN-Y4-C041) is the immediate precursor to Y5's further development of fluency with increasing speed and deliberate implement selection; Y5 extends the same skill set with greater metacognitive awareness and contextual decision-making."
    }
  ]
}
