{
  "metadata": {
    "subject": "English",
    "key_stage": "KS2",
    "years_covered": [
      6
    ],
    "document_reference": "DFE-00174-2013",
    "extraction_date": "2026-02-16",
    "structure_rating": 9,
    "notes": "Year 6 is the final year of Upper Key Stage 2 and the culmination of primary English. The programme of study is published as a combined Years 5 and 6 document. Content in this extraction represents the Year 6 lens, with grammar specifically identified in Appendix 2 as Year 6 statutory content building on Year 5 content. By end of Year 6, pupils' English must be sufficiently fluent and effortless to manage the general demands of secondary school across all subjects. Prerequisites reference Year 5 concepts (EN-Y5-C###). Source PDF: English_KS1-2_2014.pdf (September 2013 document)."
  },
  "domains": [
    {
      "domain_id": "EN-Y6-D001",
      "domain_name": "Spoken Language",
      "description": "Extending command of spoken language through public speaking, debate, performance and formal discussion (statutory for all years 1–6).",
      "curriculum_context": "By Year 6, the spoken language programme reaches its primary culmination: pupils are expected to demonstrate confident, assured command of language across the full range of contexts specified since Year 1, with a particular emphasis on public speaking, performance and debate that is named specifically for upper KS2. The curriculum states that pupils' confidence, enjoyment and mastery of language should be extended through these modes, signalling that Year 6 is a year for consolidation and showcasing, not merely incremental development. Pupils at this stage should be selecting and using appropriate registers with conscious control — a skill that directly mirrors the formal/informal distinction introduced in Year 6 grammar. The spoken language requirements cross-cut all subjects: pupils use spoken language to explore ideas, to evaluate, to report on learning and to persuade, providing the oral scaffolding for the complex written tasks of secondary school. Teachers should ensure that formal oracy opportunities are genuinely stretching, with pupils receiving explicit feedback on the quality and effectiveness of their communication, preparing them for the extended discussion, essay-based argument and examination oral components of secondary education.",
      "is_cross_cutting": true,
      "structure_type": "developmental"
    },
    {
      "domain_id": "EN-Y6-D002",
      "domain_name": "Reading - Word Reading",
      "description": "Applying morphological and etymological knowledge to read aloud fluently and to understand the meaning of unfamiliar words encountered across subjects.",
      "curriculum_context": "In Year 6, word reading as a distinct domain has effectively merged with vocabulary development: the curriculum assumes that for all but the very small number of pupils with decoding difficulties, there is no need for direct word reading instruction, and these pupils must follow the upper KS2 programme while receiving additional phonics support. The key Year 6 expectation is that pupils apply morphological and etymological knowledge automatically and flexibly across all subjects, not just in English lessons, enabling them to decode the specialist vocabulary of history, geography, science and mathematics without explicit teaching of every new word. The non-statutory guidance notes that vocabulary encountered across subjects should be treated as opportunity, not obstacle — teachers draw pupils' attention to new vocabulary, its pronunciation and its meaning. By Year 6, reading itself should be 'effortless' in terms of decoding, freeing cognitive resources entirely for comprehension and critical engagement, which is the core reading demand of secondary school. This domain also underpins the Year 6 grammar objective about formal vocabulary, since understanding morphology helps pupils recognise when a Latinate word is more formal than its Anglo-Saxon equivalent.",
      "is_cross_cutting": false,
      "structure_type": "sequential"
    },
    {
      "domain_id": "EN-Y6-D003",
      "domain_name": "Reading - Comprehension",
      "description": "Advanced comprehension including critical evaluation of authorial choices, analysis of formal and informal registers, formal presentations and debates, and preparation for secondary English demands.",
      "curriculum_context": "Year 6 reading comprehension represents the culmination of the primary programme and is explicitly designed to prepare pupils for secondary school. The curriculum states that by the end of Year 6, pupils' reading and writing should be 'sufficiently fluent and effortless for them to manage the general demands of the curriculum in Year 7, across all subjects'. All the comprehension skills developed from Year 1 onwards — inference, prediction, summarisation, retrieval, language analysis — are now applied to increasingly complex texts with high independence. The distinctively Year 6 dimension is the expectation of formal critical engagement: pupils evaluate authors' language choices (including figurative language), compare across texts, distinguish fact from opinion, present understanding through formal debate, and provide reasoned justifications for their views. The non-statutory guidance names specific technical terms pupils must know at this stage: metaphor, simile, analogy, imagery, style and effect — terms that are foundational for GCSE English Language and Literature. Teachers prepare pupils for secondary assessment by requiring the kind of sustained analytical response to text that will be assessed at GCSE, supporting pupils in making and defending interpretations with textual evidence.",
      "is_cross_cutting": false,
      "structure_type": "developmental"
    },
    {
      "domain_id": "EN-Y6-D004",
      "domain_name": "Writing - Transcription (Spelling)",
      "description": "Completing the primary spelling programme including the Years 5 and 6 statutory word list, complex suffix patterns, silent letters, homophones, and full integration of morphological and etymological spelling strategies.",
      "curriculum_context": "By Year 6, spelling instruction reaches its primary completion point: pupils are expected to have secured all the patterns and rules introduced across KS1 and KS2 and to spell the complete statutory word list for Years 5 and 6 accurately. The Year 6 emphasis is on consolidation, integration and automaticity — spelling should no longer consume conscious attention that should be free for composition. The curriculum is clear that knowledge of morphology and etymology is the primary spelling strategy at this level, supporting pupils in making principled decisions about unfamiliar words rather than relying purely on memory. Homophones and commonly confused words become increasingly subtle at Year 6 (device/devise; licence/license; prophecy/prophesy), reflecting the range of vocabulary pupils encounter across their reading. The non-statutory guidance notes that pupils should use dictionaries to check and confirm spellings and should use a thesaurus to develop vocabulary — with these reference tools becoming habitual instruments of self-correction and enrichment rather than emergency resources. Correct spelling is positioned as a dimension of meaning-making, not merely surface accuracy: misspelling homophones, for example, can change meaning entirely.",
      "is_cross_cutting": false,
      "structure_type": "sequential"
    },
    {
      "domain_id": "EN-Y6-D005",
      "domain_name": "Writing - Transcription (Handwriting and Presentation)",
      "description": "Fluent, legible, fast handwriting with confident personal style; appropriate choice of joined and unjoined styles for different tasks and purposes.",
      "curriculum_context": "By Year 6, the curriculum expects that handwriting is sufficiently fluent and fast that it no longer presents any barrier to composition. The Year 6 handwriting objectives are identical to Year 5's (this is a combined Years 5 and 6 programme), but the expectation of automaticity and personal style is higher. Pupils should be choosing letter shapes and joins with confident personal judgement — understanding that handwriting, like other aspects of writing, involves contextually appropriate choices. The curriculum explicitly teaches that unjoined styles are appropriate and professional in certain contexts (labelling, algebra, capital letters, email addresses), preventing the misunderstanding that joined cursive is always the 'correct' form. In Year 6, presentation extends to understanding what is appropriate for a high-stakes piece of writing (such as a final published version) versus a quick note or planning draft. This metacognitive awareness of presentation standards is directly transferable to secondary school where written examination answers, coursework and personal notes have different presentation requirements.",
      "is_cross_cutting": false,
      "structure_type": "developmental"
    },
    {
      "domain_id": "EN-Y6-D006",
      "domain_name": "Writing - Composition",
      "description": "Planning, drafting and producing polished narratives and non-fiction writing for clearly defined audiences and purposes, with sophisticated cohesion, precise vocabulary, and evidence of authorial control.",
      "curriculum_context": "Year 6 writing composition is where all threads of the primary programme converge: pupils should be composing with sufficient fluency and control that they can concentrate on making deliberate authorial choices rather than managing the mechanics of writing. The curriculum's aspiration for Year 6 is that pupils can 'consciously control sentence structure in their writing and understand why sentences are constructed as they are' — a metacognitive standard that requires not just doing but understanding. Pupils are expected to produce writing that reflects genuine awareness of audience and purpose: selecting vocabulary and grammar consciously for effect, using a wide range of cohesive devices including the sophisticated ones introduced in Year 6 grammar (ellipsis, grammatical connections, repetition for effect), and evaluating and editing their own work critically against the criteria of effectiveness for the intended reader. The composition programme also includes performing compositions — foregrounding the oral-written relationship — and the expectation of proof-reading that is thorough and systematic. The plan-draft-evaluate-edit cycle, which began in Year 1, reaches its most sophisticated form here, with pupils expected to move fluently between all stages and to understand each stage's purpose.",
      "is_cross_cutting": false,
      "structure_type": "developmental"
    },
    {
      "domain_id": "EN-Y6-D007",
      "domain_name": "Writing - Vocabulary, Grammar and Punctuation",
      "description": "Completing the primary grammar programme with Year 6-specific content: formal vocabulary and register, passive voice, synonyms and antonyms, advanced cohesive devices including ellipsis, layout devices, and the full range of advanced punctuation (semi-colons, colons, hyphens, bullet points).",
      "curriculum_context": "Year 6 grammar and punctuation teaching introduces the final cohort of statutory grammatical content before secondary school. The Year 6-specific Appendix 2 content covers: the difference between informal and formal vocabulary (finding/discovering, asking/requesting); synonyms and antonyms; the passive voice; formal versus informal structures including subjunctive forms (If I were, Were they to come); advanced cohesive devices across paragraphs (repetition, grammatical connections, ellipsis); and layout devices (headings, sub-headings, columns, bullets, tables). Year 6 punctuation content includes semi-colons, colons and dashes for clause boundaries, colons to introduce lists and semi-colons within lists, bullet point punctuation, and hyphens to avoid ambiguity — completing a repertoire that encompasses every major punctuation mark of written English. The Year 6 grammatical terminology set adds subject, object, active, passive, synonym, antonym, ellipsis, hyphen, colon, semi-colon and bullet points to all previously learnt terms. This comprehensive grammatical knowledge prepares pupils for GCSE assessments in both English Language (where understanding of grammar and punctuation choices is assessed) and English Literature (where understanding of authorial choices including syntax and punctuation is required).",
      "is_cross_cutting": false,
      "structure_type": "hierarchical"
    }
  ],
  "objectives": [
    {
      "objective_id": "EN-Y6-O001",
      "domain_id": "EN-Y6-D001",
      "objective_text": "listen and respond appropriately to adults and their peers",
      "non_statutory_guidance": "Pupils should be taught to develop their competence in spoken language and listening to enhance the effectiveness with which they are able to communicate across a range of contexts and to a range of audiences. They should therefore have opportunities to work in groups of different sizes – in pairs, small groups, large groups and as a whole class.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O002",
      "domain_id": "EN-Y6-D001",
      "objective_text": "ask relevant questions to extend their understanding and knowledge",
      "non_statutory_guidance": "Pupils should understand how to take turns and when and how to participate constructively in conversations and debates.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O003",
      "domain_id": "EN-Y6-D001",
      "objective_text": "use relevant strategies to build their vocabulary",
      "non_statutory_guidance": "Attention should also be paid to increasing pupils' vocabulary, ranging from describing their immediate world and feelings to developing a broader, deeper and richer vocabulary to discuss abstract concepts and a wider range of topics, and to enhancing their knowledge about language as a whole.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O004",
      "domain_id": "EN-Y6-D001",
      "objective_text": "articulate and justify answers, arguments and opinions",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O005",
      "domain_id": "EN-Y6-D001",
      "objective_text": "give well-structured descriptions, explanations and narratives for different purposes, including for expressing feelings",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O006",
      "domain_id": "EN-Y6-D001",
      "objective_text": "maintain attention and participate actively in collaborative conversations, staying on topic and initiating and responding to comments",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O007",
      "domain_id": "EN-Y6-D001",
      "objective_text": "use spoken language to develop understanding through speculating, hypothesising, imagining and exploring ideas",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O008",
      "domain_id": "EN-Y6-D001",
      "objective_text": "speak audibly and fluently with an increasing command of Standard English",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O009",
      "domain_id": "EN-Y6-D001",
      "objective_text": "participate in discussions, presentations, performances, role play, improvisations and debates",
      "non_statutory_guidance": "In years 5 and 6, pupils' confidence, enjoyment and mastery of language should be extended through public speaking, performance and debate.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O010",
      "domain_id": "EN-Y6-D001",
      "objective_text": "gain, maintain and monitor the interest of the listener(s)",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O011",
      "domain_id": "EN-Y6-D001",
      "objective_text": "consider and evaluate different viewpoints, attending to and building on the contributions of others",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O012",
      "domain_id": "EN-Y6-D001",
      "objective_text": "select and use appropriate registers for effective communication",
      "non_statutory_guidance": "These statements apply to all years. The content should be taught at a level appropriate to the age of the pupils. Pupils should build on the oral language skills that have been taught in preceding years. Pupils should receive constructive feedback on their spoken language and listening, not only to improve their knowledge and skills but also to establish secure foundations for effective spoken language in their studies at primary school, helping them to achieve in secondary education and beyond.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O013",
      "domain_id": "EN-Y6-D002",
      "objective_text": "apply their growing knowledge of root words, prefixes and suffixes (morphology and etymology), as listed in English Appendix 1, both to read aloud and to understand the meaning of new words that they meet",
      "non_statutory_guidance": "At this stage, there should be no need for further direct teaching of word reading skills for almost all pupils. If pupils are struggling or failing in this, the reasons for this should be investigated. It is imperative that pupils are taught to read during their last two years at primary school if they enter year 5 not being able to do so. Pupils should be encouraged to work out any unfamiliar word. They should focus on all the letters in a word so that they do not, for example, read 'invitation' for 'imitation' simply because they might be more familiar with the first word. Accurate reading of individual words, which might be key to the meaning of a sentence or paragraph, improves comprehension. When teachers are reading with or to pupils, attention should be paid to new vocabulary – both a word's meaning(s) and its correct pronunciation.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O014",
      "domain_id": "EN-Y6-D003",
      "objective_text": "maintain positive attitudes to reading and understanding of what they read by: continuing to read and discuss an increasingly wide range of fiction, poetry, plays, non-fiction and reference books or textbooks",
      "non_statutory_guidance": "Even though pupils can now read independently, reading aloud to them should include whole books so that they meet books and authors that they might not choose to read themselves.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O015",
      "domain_id": "EN-Y6-D003",
      "objective_text": "maintain positive attitudes to reading and understanding of what they read by: reading books that are structured in different ways and reading for a range of purposes",
      "non_statutory_guidance": "The knowledge and skills that pupils need in order to comprehend are very similar at different ages. Pupils should continue to apply what they have already learnt to more complex writing.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O016",
      "domain_id": "EN-Y6-D003",
      "objective_text": "maintain positive attitudes to reading and understanding of what they read by: increasing their familiarity with a wide range of books, including myths, legends and traditional stories, modern fiction, fiction from our literary heritage, and books from other cultures and traditions",
      "non_statutory_guidance": "Pupils should be taught to recognise themes in what they read, such as loss or heroism. They should have opportunities to compare characters, consider different accounts of the same event and discuss viewpoints (both of authors and of fictional characters), within a text and across more than one text. They should continue to learn the conventions of different types of writing, such as the use of the first person in writing diaries and autobiographies.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O017",
      "domain_id": "EN-Y6-D003",
      "objective_text": "maintain positive attitudes to reading and understanding of what they read by: recommending books that they have read to their peers, giving reasons for their choices",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O018",
      "domain_id": "EN-Y6-D003",
      "objective_text": "maintain positive attitudes to reading and understanding of what they read by: identifying and discussing themes and conventions in and across a wide range of writing",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O019",
      "domain_id": "EN-Y6-D003",
      "objective_text": "maintain positive attitudes to reading and understanding of what they read by: making comparisons within and across books",
      "non_statutory_guidance": "Pupils should be shown how to compare characters, settings, themes and other aspects of what they read.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O020",
      "domain_id": "EN-Y6-D003",
      "objective_text": "maintain positive attitudes to reading and understanding of what they read by: learning a wider range of poetry by heart",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O021",
      "domain_id": "EN-Y6-D003",
      "objective_text": "maintain positive attitudes to reading and understanding of what they read by: preparing poems and plays to read aloud and to perform, showing understanding through intonation, tone and volume so that the meaning is clear to an audience",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O022",
      "domain_id": "EN-Y6-D003",
      "objective_text": "understand what they read by: checking that the book makes sense to them, discussing their understanding and exploring the meaning of words in context",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O023",
      "domain_id": "EN-Y6-D003",
      "objective_text": "understand what they read by: asking questions to improve their understanding",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O024",
      "domain_id": "EN-Y6-D003",
      "objective_text": "understand what they read by: drawing inferences such as inferring characters' feelings, thoughts and motives from their actions, and justifying inferences with evidence",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O025",
      "domain_id": "EN-Y6-D003",
      "objective_text": "understand what they read by: predicting what might happen from details stated and implied",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O026",
      "domain_id": "EN-Y6-D003",
      "objective_text": "understand what they read by: summarising the main ideas drawn from more than one paragraph, identifying key details that support the main ideas",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O027",
      "domain_id": "EN-Y6-D003",
      "objective_text": "understand what they read by: identifying how language, structure and presentation contribute to meaning",
      "non_statutory_guidance": "Pupils should be taught the technical and other terms needed for discussing what they hear and read, such as metaphor, simile, analogy, imagery, style and effect.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O028",
      "domain_id": "EN-Y6-D003",
      "objective_text": "discuss and evaluate how authors use language, including figurative language, considering the impact on the reader",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O029",
      "domain_id": "EN-Y6-D003",
      "objective_text": "distinguish between statements of fact and opinion",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O030",
      "domain_id": "EN-Y6-D003",
      "objective_text": "retrieve, record and present information from non-fiction",
      "non_statutory_guidance": "In using reference books, pupils need to know what information they need to look for before they begin and need to understand the task. They should be shown how to use contents pages and indexes to locate information. The skills of information retrieval that are taught should be applied, for example, in reading history, geography and science textbooks, and in contexts where pupils are genuinely motivated to find out information, for example, reading information leaflets before a gallery or museum visit or reading a theatre programme or review. Teachers should consider making use of any library services and expertise to support this.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O031",
      "domain_id": "EN-Y6-D003",
      "objective_text": "participate in discussions about books that are read to them and those they can read for themselves, building on their own and others' ideas and challenging views courteously",
      "non_statutory_guidance": "Pupils should have guidance about and feedback on the quality of their explanations and contributions to discussions.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O032",
      "domain_id": "EN-Y6-D003",
      "objective_text": "explain and discuss their understanding of what they have read, including through formal presentations and debates, maintaining a focus on the topic and using notes where necessary",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O033",
      "domain_id": "EN-Y6-D003",
      "objective_text": "provide reasoned justifications for their views",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O034",
      "domain_id": "EN-Y6-D004",
      "objective_text": "use further prefixes and suffixes and understand the guidance for adding them",
      "non_statutory_guidance": "As in earlier years, pupils should continue to be taught to understand and apply the concepts of word structure so that they can draw on their knowledge of morphology and etymology to spell correctly.",
      "examples": "Converting nouns or adjectives into verbs using suffixes [for example, –ate; –ise; –ify]. Verb prefixes [for example, dis–, de–, mis–, over– and re–].",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O035",
      "domain_id": "EN-Y6-D004",
      "objective_text": "spell some words with 'silent' letters [for example, knight, psalm, solemn]",
      "non_statutory_guidance": "Some letters which are no longer sounded used to be sounded hundreds of years ago: e.g. in knight, there was a /k/ sound before the /n/, and the gh used to represent the sound that 'ch' now represents in the Scottish word loch.",
      "examples": "doubt, island, lamb, solemn, thistle, knight",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O036",
      "domain_id": "EN-Y6-D004",
      "objective_text": "continue to distinguish between homophones and other words which are often confused",
      "non_statutory_guidance": "In the pairs of words opposite, nouns end –ce and verbs end –se. Advice and advise provide a useful clue as the word advise (verb) is pronounced with a /z/ sound – which could not be spelt c.",
      "examples": "advice/advise, device/devise, licence/license, practice/practise, prophecy/prophesy; affect/effect; stationary/stationery; principal/principle; steal/steel; who's/whose; past/passed; precede/proceed",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O037",
      "domain_id": "EN-Y6-D004",
      "objective_text": "use knowledge of morphology and etymology in spelling and understand that the spelling of some words needs to be learnt specifically, as listed in English Appendix 1",
      "non_statutory_guidance": "bicycle is cycle (from the Greek for wheel) with bi– (meaning 'two') before it. medicine is related to medical so the /s/ sound is spelt as c. opposite is related to oppose, so the schwa sound in opposite is spelt as o.",
      "examples": "The statutory word list for Years 5 and 6 includes: accommodate, accompany, according, achieve, aggressive, amateur, ancient, apparent, appreciate, attached, available, average, awkward, bargain, bruise, category, cemetery, committee, communicate, community, competition, conscience, conscious, controversy, convenience, correspond, criticise, curiosity, definite, desperate, determined, develop, dictionary, disastrous, embarrass, environment, equip, especially, exaggerate, excellent, existence, explanation, familiar, foreign, forty, frequently, government, guarantee, harass, hindrance, identity, immediate, individual, interfere, interrupt, language, leisure, lightning, marvellous, mischievous, muscle, necessary, neighbour, nuisance, occupy, occur, phenomenon, prejudice, privilege, profession, programme, pronunciation, queue, recognise, recommend, relevant, restaurant, rhyme, rhythm, sacrifice, secretary, shoulder, signature, sincere(ly), soldier, stomach, sufficient, suggest, symbol, system, temperature, thorough, twelfth, variety, vegetable, vehicle, yacht",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O038",
      "domain_id": "EN-Y6-D004",
      "objective_text": "use dictionaries to check the spelling and meaning of words",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O039",
      "domain_id": "EN-Y6-D004",
      "objective_text": "use the first three or four letters of a word to check spelling, meaning or both of these in a dictionary",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O040",
      "domain_id": "EN-Y6-D004",
      "objective_text": "use a thesaurus",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O041",
      "domain_id": "EN-Y6-D005",
      "objective_text": "write legibly, fluently and with increasing speed by: choosing which shape of a letter to use when given choices and deciding whether or not to join specific letters",
      "non_statutory_guidance": "Pupils should continue to practise handwriting and be encouraged to increase the speed of it, so that problems with forming letters do not get in the way of their writing down what they want to say. They should be clear about what standard of handwriting is appropriate for a particular task, for example, quick notes or a final handwritten version. They should also be taught to use an unjoined style, for example, for labelling a diagram or data, writing an email address, or for algebra and capital letters, for example, for filling in a form.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O042",
      "domain_id": "EN-Y6-D005",
      "objective_text": "write legibly, fluently and with increasing speed by: choosing the writing implement that is best suited for a task",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O043",
      "domain_id": "EN-Y6-D006",
      "objective_text": "plan their writing by: identifying the audience for and purpose of the writing, selecting the appropriate form and using other similar writing as models for their own",
      "non_statutory_guidance": "Pupils should understand, through being shown, the skills and processes essential for writing: that is, thinking aloud to generate ideas, drafting, and re-reading to check that the meaning is clear.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O044",
      "domain_id": "EN-Y6-D006",
      "objective_text": "plan their writing by: noting and developing initial ideas, drawing on reading and research where necessary",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O045",
      "domain_id": "EN-Y6-D006",
      "objective_text": "plan their writing by: in writing narratives, considering how authors have developed characters and settings in what pupils have read, listened to or seen performed",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O046",
      "domain_id": "EN-Y6-D006",
      "objective_text": "draft and write by: selecting appropriate grammar and vocabulary, understanding how such choices can change and enhance meaning",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O047",
      "domain_id": "EN-Y6-D006",
      "objective_text": "draft and write by: in narratives, describing settings, characters and atmosphere and integrating dialogue to convey character and advance the action",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O048",
      "domain_id": "EN-Y6-D006",
      "objective_text": "draft and write by: précising longer passages",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O049",
      "domain_id": "EN-Y6-D006",
      "objective_text": "draft and write by: using a wide range of devices to build cohesion within and across paragraphs",
      "non_statutory_guidance": null,
      "examples": "Linking ideas across paragraphs using a wider range of cohesive devices: repetition of a word or phrase, grammatical connections [for example, the use of adverbials such as on the other hand, in contrast, or as a consequence], and ellipsis.",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O050",
      "domain_id": "EN-Y6-D006",
      "objective_text": "draft and write by: using further organisational and presentational devices to structure text and to guide the reader [for example, headings, bullet points, underlining]",
      "non_statutory_guidance": null,
      "examples": "Layout devices [for example, headings, sub-headings, columns, bullets, or tables, to structure text].",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O051",
      "domain_id": "EN-Y6-D006",
      "objective_text": "evaluate and edit by: assessing the effectiveness of their own and others' writing",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O052",
      "domain_id": "EN-Y6-D006",
      "objective_text": "evaluate and edit by: proposing changes to vocabulary, grammar and punctuation to enhance effects and clarify meaning",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O053",
      "domain_id": "EN-Y6-D006",
      "objective_text": "evaluate and edit by: ensuring the consistent and correct use of tense throughout a piece of writing",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O054",
      "domain_id": "EN-Y6-D006",
      "objective_text": "evaluate and edit by: ensuring correct subject and verb agreement when using singular and plural, distinguishing between the language of speech and writing and choosing the appropriate register",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O055",
      "domain_id": "EN-Y6-D006",
      "objective_text": "proof-read for spelling and punctuation errors",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O056",
      "domain_id": "EN-Y6-D006",
      "objective_text": "perform their own compositions, using appropriate intonation, volume, and movement so that meaning is clear",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O057",
      "domain_id": "EN-Y6-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by: recognising vocabulary and structures that are appropriate for formal speech and writing, including subjunctive forms",
      "non_statutory_guidance": "Pupils should continue to add to their knowledge of linguistic terms, including those to describe grammar, so that they can discuss their writing and reading.",
      "examples": "The difference between vocabulary typical of informal speech and vocabulary appropriate for formal speech and writing [for example, find out – discover; ask for – request; go in – enter]. The difference between structures typical of informal speech and structures appropriate for formal speech and writing [for example, the use of question tags: He's your friend, isn't he?, or the use of subjunctive forms such as If I were or Were they to come in some very formal writing and speech].",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O058",
      "domain_id": "EN-Y6-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by: using passive verbs to affect the presentation of information in a sentence",
      "non_statutory_guidance": null,
      "examples": "Use of the passive to affect the presentation of information in a sentence [for example, I broke the window in the greenhouse versus The window in the greenhouse was broken (by me)].",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O059",
      "domain_id": "EN-Y6-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by: using the perfect form of verbs to mark relationships of time and cause",
      "non_statutory_guidance": null,
      "examples": "he had seen her before [past perfect marking a completed action prior to another past action]",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O060",
      "domain_id": "EN-Y6-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by: using expanded noun phrases to convey complicated information concisely",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O061",
      "domain_id": "EN-Y6-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by: using modal verbs or adverbs to indicate degrees of possibility",
      "non_statutory_guidance": null,
      "examples": "Indicating degrees of possibility using adverbs [for example, perhaps, surely] or modal verbs [for example, might, should, will, must].",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O062",
      "domain_id": "EN-Y6-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by: using relative clauses beginning with who, which, where, when, whose, that or with an implied (i.e. omitted) relative pronoun",
      "non_statutory_guidance": null,
      "examples": "Relative clauses beginning with who, which, where, when, whose, that, or an omitted relative pronoun.",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O063",
      "domain_id": "EN-Y6-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by: learning the grammar for years 5 and 6 in English Appendix 2",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O064",
      "domain_id": "EN-Y6-D007",
      "objective_text": "indicate grammatical and other features by: using commas to clarify meaning or avoid ambiguity in writing",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O065",
      "domain_id": "EN-Y6-D007",
      "objective_text": "indicate grammatical and other features by: using hyphens to avoid ambiguity",
      "non_statutory_guidance": null,
      "examples": "How hyphens can be used to avoid ambiguity [for example, man eating shark versus man-eating shark, or recover versus re-cover].",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O066",
      "domain_id": "EN-Y6-D007",
      "objective_text": "indicate grammatical and other features by: using brackets, dashes or commas to indicate parenthesis",
      "non_statutory_guidance": null,
      "examples": "Brackets, dashes or commas to indicate parenthesis.",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O067",
      "domain_id": "EN-Y6-D007",
      "objective_text": "indicate grammatical and other features by: using semi-colons, colons or dashes to mark boundaries between independent clauses",
      "non_statutory_guidance": null,
      "examples": "Use of the semi-colon, colon and dash to mark the boundary between independent clauses [for example, It's raining; I'm fed up].",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O068",
      "domain_id": "EN-Y6-D007",
      "objective_text": "indicate grammatical and other features by: using a colon to introduce a list",
      "non_statutory_guidance": null,
      "examples": "Use of the colon to introduce a list and use of semi-colons within lists.",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O069",
      "domain_id": "EN-Y6-D007",
      "objective_text": "indicate grammatical and other features by: punctuating bullet points consistently",
      "non_statutory_guidance": null,
      "examples": "Punctuation of bullet points to list information.",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O070",
      "domain_id": "EN-Y6-D007",
      "objective_text": "use and understand the grammatical terminology in English Appendix 2 accurately and appropriately in discussing their writing and reading",
      "non_statutory_guidance": "Pupils should continue to add to their knowledge of linguistic terms, including those to describe grammar, so that they can discuss their writing and reading.",
      "examples": "Year 6 terminology: subject, object, active, passive, synonym, antonym, ellipsis, hyphen, colon, semi-colon, bullet points (in addition to all previously learnt terminology).",
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "EN-Y6-C001",
      "domain_id": "EN-Y6-D007",
      "concept_name": "Formal versus informal vocabulary",
      "description": "Formal vocabulary is typically Latinate, precise and abstract (discover, request, enter), while informal vocabulary is often Anglo-Saxon, concrete and conversational (find out, ask for, go in). At upper KS2 mastery, pupils understand this distinction, can identify formal and informal vocabulary in texts they read, and make deliberate, controlled choices between formal and informal vocabulary in their own writing based on audience and purpose. This is Year 6-specific content in Appendix 2.",
      "teaching_guidance": "Teach the formal/informal distinction as a cline rather than a binary. Collect synonym pairs across the range (find out – discover – ascertain; use – employ – utilise). Connect to the Anglo-Saxon vs. Norman French history of English vocabulary. Practise rewriting informal text in formal register and vice versa, discussing the effect of the shift. Link explicitly to written contexts where formal vocabulary is expected: reports, letters of complaint, essays.",
      "key_vocabulary": "formal, informal, register, Latinate, Anglo-Saxon, synonym, vocabulary choice, Standard English",
      "common_misconceptions": "Pupils sometimes equate formal with 'correct' and informal with 'wrong', rather than understanding that both are appropriate in different contexts. They may over-formalise all writing once they learn Latinate vocabulary, losing appropriate informality in personal or creative writing.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "teaching_weight": 5,
      "co_teach_hints": [
        "EN-Y6-C002",
        "EN-Y6-C003",
        "EN-Y6-C010",
        "EN-Y6-C016",
        "EN-Y6-C042"
      ]
    },
    {
      "concept_id": "EN-Y6-C002",
      "domain_id": "EN-Y6-D007",
      "concept_name": "Synonyms and antonyms",
      "description": "Synonyms are words with similar meanings; antonyms are words with opposite meanings. At Year 6 mastery, pupils understand that synonyms are rarely exact equivalents — they differ in connotation, register and degree — and that selecting the most precise synonym is a key dimension of effective vocabulary choice in writing. Antonyms help pupils understand word meaning through contrast and are explicitly named as Year 6 grammatical terminology in Appendix 2.",
      "teaching_guidance": "Teach synonyms on a cline: warm, hot, boiling, scalding — each word occupies a different position on the scale of heat. Use a thesaurus to explore synonym groups and ask pupils to discuss the differences in connotation. Teach antonyms through word families (appear/disappear; possible/impossible) and through meaning contrast. Connect to formal/informal vocabulary work: synonyms often differ in register as well as meaning.",
      "key_vocabulary": "synonym, antonym, connotation, denotation, register, nuance, word choice, degree",
      "common_misconceptions": "Pupils may treat synonyms as interchangeable and use a thesaurus to 'upgrade' vocabulary without checking that the synonym fits the precise meaning. They may confuse antonyms formed by negation prefixes (unhappy, dislike) with antonyms that are entirely different words (hot/cold).",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": [
        "EN-Y6-C001",
        "EN-Y6-C016",
        "EN-Y6-C038",
        "EN-Y6-C039",
        "EN-Y6-C041"
      ]
    },
    {
      "concept_id": "EN-Y6-C003",
      "domain_id": "EN-Y6-D007",
      "concept_name": "Formal and informal structures including subjunctive forms",
      "description": "Formal structures include those appropriate for academic writing and formal speech, such as the subjunctive mood (If I were, Were they to come, If that be the case) and the avoidance of question tags and contractions. The subjunctive is a verb form expressing hypothetical, wished-for or formally conditional situations, distinct from the indicative. At Year 6 mastery, pupils can identify formal structures in texts, recognise the subjunctive form, and use formal structures appropriately in their own writing when the register demands it. This is Year 6-specific content in Appendix 2.",
      "teaching_guidance": "Introduce subjunctive with high-frequency examples: 'If I were you' (not 'was'); 'Were she to attend' (not 'If she attended'); 'I suggest that he come' (not 'comes'). Explain that the subjunctive is used in formal written English and some spoken contexts. Contrast with informal equivalents using question tags (He's your friend, isn't he?). Provide texts — formal letters, reports, speeches — for pupils to identify formal structural features.",
      "key_vocabulary": "subjunctive, indicative, formal, informal, structure, question tag, hypothetical, conditional",
      "common_misconceptions": "Pupils often write 'If I was' instead of 'If I were' because the indicative form ('was') sounds more natural in speech. Some pupils avoid the subjunctive altogether by rephrasing to avoid the conditional structure. The subjunctive is often confused with the passive voice.",
      "concept_type": "knowledge",
      "complexity_level": 5,
      "is_cross_cutting": false,
      "teaching_weight": 6,
      "co_teach_hints": [
        "EN-Y6-C001",
        "EN-Y6-C042"
      ]
    },
    {
      "concept_id": "EN-Y6-C004",
      "domain_id": "EN-Y6-D007",
      "concept_name": "Advanced cohesive devices: repetition, grammatical connections and ellipsis",
      "description": "In Year 6, pupils extend their repertoire of cohesive devices to include: deliberate repetition of a key word or phrase for effect or emphasis; grammatical connections using adverbials such as 'on the other hand', 'in contrast', 'as a consequence'; and ellipsis (the deliberate omission of words that are understood from context). These are specifically identified as Year 6 text-level content in Appendix 2. At mastery, pupils deploy all three types purposefully to create well-structured, coherent texts that move beyond simple linking adverbials.",
      "teaching_guidance": "Teach each device with examples from published writing. For repetition: show how anaphora (starting successive sentences with the same phrase) creates rhythm and emphasis. For grammatical connections: teach the relationship each adverbial signals (contrast, cause, sequence, example). For ellipsis: show how it creates pace and avoids unnecessary repetition ('She ate breakfast. He did too [= ate breakfast too]'). Practise identifying all three in newspaper editorials, persuasive essays and literary prose.",
      "key_vocabulary": "cohesion, repetition, anaphora, grammatical connection, adverbial, ellipsis, omission, contrast, consequence",
      "common_misconceptions": "Pupils often confuse ellipsis (grammatical omission for cohesive effect) with simply leaving words out accidentally. They may use 'on the other hand' when they do not in fact intend contrast, applying cohesive adverbials mechanically rather than logically. Repetition for effect may be confused with inadvertent repetition as a writing weakness.",
      "concept_type": "skill",
      "complexity_level": 5,
      "is_cross_cutting": false,
      "teaching_weight": 5,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C005",
      "domain_id": "EN-Y6-D007",
      "concept_name": "Layout devices for structuring text",
      "description": "Layout devices including headings, sub-headings, columns, bullets and tables are used to organise non-fiction text, guide the reader and signal the structure of information. At Year 6 mastery, pupils deploy layout devices purposefully and consistently, understanding that the choice of device should serve the text's purpose and audience. This is Year 6-specific text-level content in Appendix 2.",
      "teaching_guidance": "Provide a range of non-fiction texts showing different layout devices in use. Analyse why each device has been chosen (table for comparison; subheadings to signal topic shifts; bullet points for parallel items). When pupils plan non-fiction writing, require them to decide on layout as part of the planning process, justifying their choices. Discuss how digital and print contexts create different layout conventions.",
      "key_vocabulary": "heading, sub-heading, column, bullet point, table, layout, organise, signpost, non-fiction",
      "common_misconceptions": "Pupils sometimes use layout devices decoratively rather than functionally — adding subheadings that do not accurately signal what follows. They may use bullet points where a continuous prose argument would be more appropriate for the genre.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C006",
      "domain_id": "EN-Y6-D007",
      "concept_name": "Semi-colons, colons and dashes for independent clauses",
      "description": "Semi-colons, colons and dashes can all mark boundaries between independent clauses (clauses that could each stand as a sentence), signalling different relationships. A colon introduces, explains or elaborates; a semi-colon balances or parallels two closely related clauses; a dash creates a more dramatic or informal effect. At Year 6 mastery, pupils deploy all three correctly and with awareness of their different effects. This is Year 6-specific punctuation content in Appendix 2.",
      "teaching_guidance": "Contrast the three marks using examples: 'She was nervous: she had never performed before.' (colon — elaborates) 'She was nervous; her hands trembled.' (semi-colon — balances) 'She was nervous — terrified, in fact.' (dash — dramatic addition). Test whether each clause can stand alone. Practise converting full-stop sentences to use these marks and discussing the change in effect. Use published writing to collect examples.",
      "key_vocabulary": "semi-colon, colon, dash, independent clause, clause boundary, balance, elaborate, contrast",
      "common_misconceptions": "Pupils frequently use a colon when the second part is not an independent clause (e.g., 'I like: chocolate and cake'). They may use semi-colons randomly as a sophistication marker without checking that both parts are independent clauses. The dash is often used as a catch-all substitute for all other punctuation.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "teaching_weight": 4,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C007",
      "domain_id": "EN-Y6-D007",
      "concept_name": "Colons to introduce lists and semi-colons within lists",
      "description": "A colon can introduce a list that follows a complete clause. When items in a list are long or contain commas themselves, semi-colons are used to separate items instead of commas, preventing ambiguity. At Year 6 mastery, pupils use colons to introduce lists correctly and know when to deploy semi-colons within a list for clarity. This is Year 6-specific punctuation content in Appendix 2.",
      "teaching_guidance": "Teach the 'complete clause before the colon' rule. Show how semi-colons clarify a list where items contain internal commas: 'The expedition required: warm, waterproof boots; a sleeping bag; and emergency rations.' Contrast with a simpler list separated by ordinary commas. Practise identifying when a list requires semi-colons to prevent misreading.",
      "key_vocabulary": "colon, semi-colon, list, items, clause, clarify, ambiguity, punctuation",
      "common_misconceptions": "Pupils often place a colon after a verb or preposition, where the sentence is not yet a complete clause ('I need: a pen, a ruler...'). They may not recognise when semi-colons within a list are needed to prevent ambiguity versus when commas are sufficient.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "teaching_weight": 4,
      "co_teach_hints": [
        "EN-Y6-C006",
        "EN-Y6-C009",
        "EN-Y6-C037"
      ]
    },
    {
      "concept_id": "EN-Y6-C008",
      "domain_id": "EN-Y6-D007",
      "concept_name": "Hyphens to avoid ambiguity",
      "description": "Hyphens are used within compound modifiers and certain prefixed words to prevent misreading and avoid ambiguity (man-eating shark vs. man eating shark; re-cover vs. recover). At Year 6 mastery, pupils understand why hyphens are used in these contexts, can identify ambiguous compound modifiers, and use hyphens appropriately and consistently in their own writing. This is Year 6-specific punctuation content in Appendix 2.",
      "teaching_guidance": "Present deliberately ambiguous compound modifiers and ask pupils to disambiguate: 'a little used car' (a little-used car vs. a little used car). Show how prefixes before vowels or proper nouns often require hyphens (co-ordinate, anti-inflammatory, pre-Roman). Distinguish hyphens from dashes — hyphens join words or word parts; dashes separate clauses or indicate parenthesis.",
      "key_vocabulary": "hyphen, compound modifier, prefix, ambiguity, word join, dash, punctuation",
      "common_misconceptions": "Pupils often confuse hyphens with dashes, using one where the other is appropriate. They may not recognise which compound modifiers require a hyphen (pre-eminent) versus those that do not (highly skilled). Some pupils over-hyphenate, inserting hyphens between all compound nouns.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C009",
      "domain_id": "EN-Y6-D007",
      "concept_name": "Bullet point punctuation",
      "description": "Bullet points are a layout device for listing items in a consistent, easily readable format. Correct punctuation of bullet points depends on whether they complete a sentence begun in the introductory clause (in which case lower case and no end punctuation on individual bullets, with a full stop on the last) or whether each is a sentence in its own right (capital letter, full stop on each). At Year 6 mastery, pupils punctuate bullet points consistently within a given style. This is Year 6-specific content in Appendix 2.",
      "teaching_guidance": "Teach two styles: (1) bullets completing a lead-in sentence — lower case, no end punctuation mid-list, full stop or semi-colon at end; (2) standalone bullet sentences — capital letter and full stop on each. Emphasise consistency within a document. Show examples from published non-fiction, instruction manuals, business documents. Note that different style guides vary; the key is consistency.",
      "key_vocabulary": "bullet point, list, punctuation, consistency, capital letter, full stop, semi-colon, layout",
      "common_misconceptions": "Pupils often mix styles inconsistently within a single list. They may punctuate every bullet with a full stop regardless of whether it completes a sentence or is a fragment. Some pupils avoid bullet points entirely in favour of prose, not recognising when a list format is more effective.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C010",
      "domain_id": "EN-Y6-D007",
      "concept_name": "Active and passive voice (advanced application)",
      "description": "Year 6 extends Year 5's introduction of passive voice to full Appendix 2 terminology: subject, object, active voice, passive voice. At Year 6 mastery, pupils can identify the grammatical subject and object of both active and passive sentences, construct passives correctly across different tenses, analyse why an author has chosen passive voice, and deploy it purposefully in their own writing — particularly in formal and impersonal registers.",
      "teaching_guidance": "Teach subject and object as distinct grammatical roles first: in 'The dog bit the man', 'the dog' is subject, 'the man' is object. Show how passive reverses these roles: 'The man was bitten by the dog.' The 'by' phrase (agent) can be omitted to achieve impersonality: 'Mistakes were made.' Collect examples of deliberate passive from science reports, news articles and formal writing. Discuss the ideological effect of omitting the agent.",
      "key_vocabulary": "active voice, passive voice, subject, object, agent, by-phrase, impersonal, formal, passive construction",
      "common_misconceptions": "Pupils often confuse past tense with passive voice. They may struggle to form passive correctly in non-present tenses ('It will be decided' vs 'It would be decided'). Some pupils write passive in all formal writing without selecting it for specific effect.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "teaching_weight": 5,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C011",
      "domain_id": "EN-Y6-D007",
      "concept_name": "Year 6 grammatical terminology",
      "description": "Year 6 introduces the final set of grammatical terminology that pupils are expected to know by the end of primary education: subject, object, active, passive, synonym, antonym, ellipsis, hyphen, colon, semi-colon, bullet points — in addition to all previously learnt terms from Years 1–5. At mastery, pupils use all these terms accurately and appropriately in discussion of their reading and writing, showing that metalinguistic awareness is integrated into their English practice.",
      "teaching_guidance": "Do not introduce terminology as a separate vocabulary lesson divorced from use — teach each term in the context of reading and writing where the concept is deployed. Create classroom displays of grammatical terms with examples. Use the terms consistently in marking, modelling and discussion. Regular low-stakes quizzes on terminology keep the vocabulary active.",
      "key_vocabulary": "subject, object, active, passive, synonym, antonym, ellipsis, hyphen, colon, semi-colon, bullet point, metalanguage",
      "common_misconceptions": "Pupils may know the name of a term without being able to identify or use the concept. The difference between subject and topic is frequently confused. 'Object' in grammar is often confused with its everyday meaning.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C012",
      "domain_id": "EN-Y6-D003",
      "concept_name": "Critical evaluation of authorial language and structure",
      "description": "At Year 6, language analysis extends to evaluation: not just identifying what a writer does but critically evaluating whether it is effective, for whom and why. Pupils consider how language, structure and presentation contribute to meaning in texts of increasing complexity, applying technical vocabulary including metaphor, simile, analogy, imagery, style and effect. Mastery means pupils can construct a sustained analytical argument about a text's language and structure, supported by specific textual evidence.",
      "teaching_guidance": "Model the three-move analysis: identify (name the technique) → describe (explain what the writer does) → evaluate (assess the effect, for whom it works and why). Push pupils beyond 'this is effective' to 'this is effective because... and this creates... for the reader who...'. Use short, rich extracts for focused analysis. Build from oral whole-class discussion to written analytical paragraph using frames if needed, then reducing scaffolding.",
      "key_vocabulary": "analyse, evaluate, technique, effect, impact, language choice, structure, presentation, metaphor, simile, analogy, imagery",
      "common_misconceptions": "Pupils identify techniques without evaluating effect. They evaluate vaguely ('it's more interesting') without specific analysis of mechanism. Some pupils list techniques rather than building a coherent analytical argument. Others evaluate from their own response rather than considering the intended audience and purpose.",
      "concept_type": "skill",
      "complexity_level": 5,
      "is_cross_cutting": false,
      "teaching_weight": 5,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C013",
      "domain_id": "EN-Y6-D006",
      "concept_name": "Writing with conscious grammatical control",
      "description": "The curriculum's overarching Year 6 writing aspiration is that pupils can 'consciously control sentence structure in their writing and understand why sentences are constructed as they are'. This metacognitive dimension — knowing not just how to write a sentence but why a particular construction achieves a particular effect — represents the highest expectation of the primary programme and directly prepares pupils for GCSE. Mastery means pupils can justify their grammatical choices in terms of effect, audience and purpose.",
      "teaching_guidance": "Build in regular 'writer talk' where pupils explain their grammatical choices: 'I used a short sentence here because...', 'I chose the passive because I wanted to...', 'I used a colon here to...'. Use shared writing as a forum for making these decisions explicit. Peer and self-editing sessions should involve discussing grammatical choices, not just identifying errors. Model the reflective process by thinking aloud while composing.",
      "key_vocabulary": "sentence structure, grammatical choice, effect, purpose, audience, conscious control, metalanguage, justify",
      "common_misconceptions": "Pupils may make effective grammatical choices instinctively (from their reading) but be unable to articulate why. Conversely, they may use complex structures incorrectly in an attempt to appear sophisticated. The conscious-control requirement distinguishes Year 6 from simply following grammatical rules.",
      "concept_type": "process",
      "complexity_level": 5,
      "is_cross_cutting": false,
      "teaching_weight": 5,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C014",
      "domain_id": "EN-Y6-D006",
      "concept_name": "Register control in reading and writing",
      "description": "Register is the variety of language appropriate to a particular social situation, purpose and relationship between writer and audience. At Year 6 mastery, pupils recognise register in texts they read (distinguishing formal from informal, written from spoken, academic from personal) and make deliberate register choices in their own writing. This includes understanding that different parts of the same text may use different registers for specific effects.",
      "teaching_guidance": "Analyse texts for register: what signals formality or informality? (vocabulary choice, sentence length, use of personal pronouns, degree of hedging, use of contractions). Practise writing the same content in two registers (a formal report and an informal blog post about the same event). Discuss how shifting register unexpectedly can be used for deliberate comic or critical effect.",
      "key_vocabulary": "register, formal, informal, academic, personal, spoken, written, audience, purpose, tone",
      "common_misconceptions": "Pupils often treat register as binary (formal/informal) rather than as a multidimensional continuum. They may confuse polite tone with formal register or aggressive tone with informal register. Register control requires ongoing reading of texts in different registers to develop intuitive sensitivity.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": true,
      "teaching_weight": 4,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C015",
      "domain_id": "EN-Y6-D006",
      "concept_name": "Secondary school readiness in English",
      "description": "By the end of Year 6, pupils' reading and writing should be sufficiently fluent and effortless for them to manage the general demands of the curriculum in Year 7 across all subjects, not just in English. This means pupils can read subject-specific texts independently and write in a range of forms without the scaffolding of primary school. Secondary readiness in English encompasses: automatic decoding, wide vocabulary, confident comprehension, fluent composition with grammatical control, and effective oracy. This is the explicit terminal aspiration of the primary English curriculum.",
      "teaching_guidance": "In Year 6, provide regular practice with the kinds of texts, tasks and assessment formats pupils will encounter at secondary: extended reading for meaning, formal written argument, note-making from exposition, timed writing. Reduce scaffolding progressively. Ensure pupils have encountered the full range of non-fiction text types in the secondary curriculum (textbook entries, explanatory essays, persuasive articles). Brief pupils explicitly on secondary school English expectations.",
      "key_vocabulary": "fluency, automaticity, independent, subject vocabulary, secondary school, cross-curricular, writing under pressure",
      "common_misconceptions": "Teachers and pupils sometimes conflate secondary readiness in English with performance in English alone, missing the cross-curricular dimension. Pupils may be fluent readers of fiction but not of non-fiction, which is disproportionately important in secondary school across subjects.",
      "concept_type": "attitude",
      "complexity_level": 5,
      "is_cross_cutting": true,
      "teaching_weight": 5,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C016",
      "domain_id": "EN-Y6-D007",
      "concept_name": "Nuanced vocabulary and academic language",
      "description": "The curriculum states that by Year 6 pupils should 'understand nuances in vocabulary choice and age-appropriate, academic vocabulary'. This involves understanding that words differ not just in denotation (basic meaning) but in connotation, degree, register and precision. At mastery, pupils select vocabulary consciously to achieve precise, nuanced meaning, deploying academic vocabulary (investigate, conclude, analyse, evaluate, interpret, contrast, justify) confidently across subjects.",
      "teaching_guidance": "Explicitly teach academic vocabulary across subjects, connecting English vocabulary work to the language of mathematics (calculate, estimate), science (observe, hypothesise, conclude) and humanities (evidence, source, interpret, period). Use vocabulary maps showing a word at the centre surrounded by its synonyms, connotations, antonyms and word family. Require pupils to use specific vocabulary in written and spoken justifications.",
      "key_vocabulary": "nuance, connotation, denotation, academic vocabulary, precision, register, word choice, vocabulary development",
      "common_misconceptions": "Pupils may use impressive-sounding words incorrectly, valuing rarity over precision. They may not recognise that academic vocabulary varies by subject — 'evaluate' in mathematics means something different from 'evaluate' in literary criticism.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": true,
      "teaching_weight": 5,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C017",
      "domain_id": "EN-Y6-D003",
      "concept_name": "Reading breadth: wide range of fiction and non-fiction",
      "description": "By Year 6, pupils are expected to have encountered and independently engaged with a broad range of reading material, including myths, legends, traditional stories, modern fiction, fiction from literary heritage, books from other cultures and traditions, poetry, plays, non-fiction reference books and textbooks. Mastery means pupils read extensively and with genuine understanding across all these forms, recommending books with reasons, comparing texts across genres and traditions, and bringing their reading experience to bear in discussion and in their own writing.",
      "teaching_guidance": "Maintain a class reading record that tracks the range of genres and traditions pupils have encountered. Include whole-class reads, independent choice, and teacher read-alouds to ensure breadth beyond individual preferences. Discuss books from other cultures, including translated texts, to broaden pupils' sense of world literature. Make explicit connections between reading experience and writing: 'The author of this book does X — could you try that technique?' Ensure non-fiction is given equal status as reading for pleasure and for learning, using high-quality non-fiction texts across subjects.",
      "key_vocabulary": "genre, fiction, non-fiction, myth, legend, tradition, heritage, literary, culture, compare, recommend, breadth",
      "common_misconceptions": "Pupils and teachers sometimes equate reading breadth with quantity, valuing number of books over depth of engagement. Wide reading does not mean surface reading — reading broadly and deeply are not in opposition. Some pupils develop preferences that narrow their reading range; structured exposure to different genres and traditions prevents this.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C018",
      "domain_id": "EN-Y6-D003",
      "concept_name": "Poetry: understanding poetic forms and language",
      "description": "By Year 6, pupils understand a range of poetic forms and conventions (ballad, sonnet, free verse, narrative poem, haiku, limerick) and can identify how poetic devices — including rhythm, rhyme, alliteration, assonance, simile, metaphor, personification, imagery — contribute to the effect and meaning of a poem. Mastery means pupils can analyse a poem using technical vocabulary, discuss how form and language choices create particular effects on the reader, and recite a wide range of poems from memory with appropriate pace, intonation and expression.",
      "teaching_guidance": "Build pupils' repertoire of memorised poems progressively through the year. Use shared reading of poems from different cultures and traditions, including contemporary poetry. Teach technical vocabulary in context, always connecting the term to its effect: 'This is an example of alliteration — what effect does the repeated sound create?' Contrast poems written in different forms on the same subject to highlight how form shapes meaning. Provide regular opportunities for pupils to read poetry aloud expressively and to receive feedback on their performance.",
      "key_vocabulary": "poem, poetry, stanza, verse, rhyme, rhythm, alliteration, assonance, simile, metaphor, personification, imagery, form, convention, recite",
      "common_misconceptions": "Pupils often assume all poems rhyme and that free verse is simply prose without punctuation. They may identify poetic devices in isolation without connecting them to their effect on the reader. Memorisation is sometimes treated as mechanical repetition rather than as an opportunity for deep engagement with a poem's meaning and musicality.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C019",
      "domain_id": "EN-Y6-D003",
      "concept_name": "Understanding plot and narrative structure",
      "description": "By Year 6, pupils can identify and analyse the structural features of narrative texts: orientation, complication, rising action, climax, resolution and coda. Mastery means pupils can trace how a plot develops across a whole text, explain why events are sequenced as they are, identify foreshadowing and flashback techniques, and evaluate how structural choices affect the reader's engagement and experience. Pupils can compare how different authors structure narratives for different effects.",
      "teaching_guidance": "Teach plot structure using known texts before applying to new ones. Ask pupils to map the structure of a chapter or whole book on a narrative arc, identifying the key structural turning points. Use film, picture books and short stories alongside longer novels to explore how structural conventions are adapted to different media and lengths. Foreshadowing and flashback can be introduced through explicit examples, asking pupils to identify retrospectively how the author planted clues. Connect to composition: when planning their own writing, pupils should make conscious structural choices.",
      "key_vocabulary": "plot, narrative, structure, orientation, complication, climax, resolution, foreshadowing, flashback, turning point, sequence, pacing",
      "common_misconceptions": "Pupils often retell plot rather than analyse structure. They may identify a 'beginning, middle and end' without examining how the structural choices create specific effects. Foreshadowing is often missed or identified only after the fact, rather than tracked as the text unfolds.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": [
        "EN-Y6-C017",
        "EN-Y6-C020",
        "EN-Y6-C021",
        "EN-Y6-C023"
      ]
    },
    {
      "concept_id": "EN-Y6-C020",
      "domain_id": "EN-Y6-D003",
      "concept_name": "Understanding setting and atmosphere in texts",
      "description": "By Year 6, pupils can identify how authors create setting through selective detail, sensory language and figurative language, and can analyse how setting contributes to atmosphere and affects the reader's expectations and emotional response. Mastery means pupils understand that setting is not merely background but an active component of narrative meaning — setting can reflect characters' emotional states, create tension or contrast, and signal thematic concerns. Pupils can compare settings within and across texts and discuss the deliberate choices authors make in their construction.",
      "teaching_guidance": "Present contrasting extracts in which setting is constructed very differently and ask pupils to analyse the techniques used: 'What specific language choices create this atmosphere? What does the description make you feel, and why?' Teach pupils to identify vocabulary choices, sentence structure and figurative language as tools for setting construction. Use creative writing tasks in which setting serves a specific atmospheric purpose, requiring pupils to make deliberate language choices and explain them.",
      "key_vocabulary": "setting, atmosphere, mood, environment, sensory language, imagery, contrast, tension, pathetic fallacy, description, backdrop",
      "common_misconceptions": "Pupils often describe setting without analysing how it is constructed. They may treat setting as purely physical (a list of things in the environment) rather than as an emotional and thematic construction. The concept of pathetic fallacy — using weather or environment to reflect a character's feelings — is often confused with simple weather description.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C021",
      "domain_id": "EN-Y6-D003",
      "concept_name": "Understanding character and characterisation",
      "description": "By Year 6, pupils can identify and evaluate the techniques authors use to develop character — direct description, dialogue, action, reaction of other characters, interior monologue — and can analyse how a character changes or develops across a text. Mastery means pupils can draw complex inferences about characters' motivations and values from implicit clues in the text, compare characters within and across texts, and use appropriate evidence and terminology to support their characterisation analysis.",
      "teaching_guidance": "Use 'Show, don't tell' as an organising principle: identify passages where the author reveals character through action and dialogue rather than direct statement, and ask why this is often more effective. Create character maps for complex protagonists, charting their development across a text and identifying the key moments that drive change. Compare characters across different texts on the same theme (e.g., different protagonists dealing with injustice) to develop comparative analysis skills. Role-play and hot-seating activities deepen pupils' understanding of motivation and interior experience before they write analytically.",
      "key_vocabulary": "character, characterisation, protagonist, antagonist, motivation, direct characterisation, indirect characterisation, development, inference, interior monologue, dialogue, action",
      "common_misconceptions": "Pupils frequently identify character traits ('She is brave') without providing textual evidence or explaining how the text signals this trait. They may treat characters as real people rather than as constructed entities, leading to responses that are empathetic but not analytical. The distinction between what a character does (action) and what the author is showing through that action (characterisation) is an important analytical step that needs explicit teaching.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "teaching_weight": 4,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C022",
      "domain_id": "EN-Y6-D003",
      "concept_name": "Distinguishing fact and opinion in texts",
      "description": "By Year 6, pupils can reliably distinguish statements of fact (claims that can in principle be verified) from statements of opinion (evaluations, preferences, interpretations and value judgements), and can identify the language signals that typically accompany each — hedging language, evaluative adjectives, modal verbs for opinion; direct assertion, passive constructions, and citation for fact. Mastery means pupils apply this distinction critically across a wide range of non-fiction texts and can evaluate the extent to which an author's argument relies on facts, opinions or a blend of both.",
      "teaching_guidance": "Use newspaper articles, advertisements, political speeches and textbook extracts as sources of mixed fact and opinion. Challenge pupils to highlight or mark up texts, coding each sentence as F (fact) or O (opinion) and identifying the language signals they used. Discuss 'disputed facts' (claims that appear factual but are contested) and 'supported opinions' (evaluations backed by evidence) as more complex cases. Connect to persuasive writing: understanding how persuasive texts blend fact and opinion enables more sophisticated analysis of argument.",
      "key_vocabulary": "fact, opinion, claim, evidence, verify, assertion, hedging, evaluative, modal verb, argument, bias, reliable",
      "common_misconceptions": "Pupils often conflate strongly stated opinions with facts, and tentatively expressed facts with opinions. They may assume that statistical data is always factual without considering the reliability of its source or the way it has been presented. The distinction between a stated fact and a reliable fact (one that can actually be verified) is an important critical-thinking extension.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C023",
      "domain_id": "EN-Y6-D003",
      "concept_name": "Comparing and contrasting texts",
      "description": "By Year 6, pupils can make structured comparisons within and across texts, examining how two or more authors handle the same theme, genre, character type or technique differently, and explaining what effect these differences create. Mastery means pupils sustain a comparative analysis with specific evidence from both texts, using appropriate comparative language and evaluating which author's approach is more effective for specific purposes and audiences.",
      "teaching_guidance": "Teach the structure of comparative analysis: introduce both texts, identify the aspect being compared, provide evidence from each, explain the difference and evaluate the effect. Model the use of comparative discourse markers (whereas, in contrast, similarly, however, by comparison). Begin with short paired texts before extending to comparisons involving longer or more complex material. Ensure pupils move beyond surface similarity ('Both texts are about...) to analytical comparison ('Both texts deal with X but Author A does this by... whereas Author B...').",
      "key_vocabulary": "compare, contrast, similarity, difference, whereas, in contrast, similarly, however, evidence, evaluate, effect, approach",
      "common_misconceptions": "Pupils frequently write about each text separately rather than maintaining a running comparison. They may identify similarities and differences without evaluating their significance. Structural templates for comparative writing can help pupils maintain the comparison, but should be removed as scaffolding once the approach is secure.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "teaching_weight": 4,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C024",
      "domain_id": "EN-Y6-D004",
      "concept_name": "Morphological and etymological spelling strategies",
      "description": "By Year 6, pupils apply knowledge of morphology (word structure: roots, prefixes, suffixes) and etymology (word origin and history) as their primary spelling strategy, enabling them to spell unfamiliar words by analogy with known roots and patterns rather than relying on memory alone. Mastery means pupils can use morphological analysis to decode and spell specialist vocabulary across subjects, understand how Latin and Greek roots generate whole families of English words, and use a dictionary and thesaurus independently to confirm and extend their vocabulary.",
      "teaching_guidance": "Teach Latin and Greek roots explicitly as word family generators: knowing that 'scrib/script' means 'write' enables pupils to spell and understand scribe, describe, scripture, prescription, transcribe. Use etymology as a hook for spelling: many apparently irregular spellings become logical when the word's history is known (e.g., 'island' contains a silent 's' because it derives from Old English 'igland' but was later respelt under the influence of French 'isle'). Create visual word webs showing morphological families. Require pupils to use dictionaries proactively — not just to check spelling but to discover word origin and related words.",
      "key_vocabulary": "morphology, etymology, root, prefix, suffix, word family, origin, Latin, Greek, analogy, pattern",
      "common_misconceptions": "Pupils who have been trained to spell by sound-symbol correspondence may not yet appreciate morphological reasoning as a spelling strategy for more complex vocabulary. They may apply phonetic strategies to words like 'necessary' or 'beautiful' rather than recognising that the pattern follows a morphological rule. Some pupils use dictionaries only as a last resort; embedding their proactive use changes this habit.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C025",
      "domain_id": "EN-Y6-D006",
      "concept_name": "Non-narrative writing: explanation, report, persuasion and discussion",
      "description": "By Year 6, pupils can plan and produce effective non-narrative texts in a range of forms — explanation, report, persuasion and discussion — with appropriate structure, vocabulary, register and text organisation for each form. Mastery means pupils understand the distinctive conventions of each non-narrative form (e.g., impersonal third-person for reports, direct address for persuasion, balanced argument for discussion) and deploy them purposefully, using evidence, examples and organisational devices to produce coherent, well-structured non-fiction.",
      "teaching_guidance": "Ensure pupils have studied high-quality examples of each form before writing in that form. Use analysis of model texts to identify the structural and language conventions: 'In this explanation text, every paragraph begins with... and the passive voice is used because...'. Teach text types as a repertoire with shared features (all non-fiction needs clear structure and appropriate vocabulary) and distinctive features (each form serves a specific purpose). Require pupils to plan the structure, audience and purpose before drafting, and to evaluate their writing against these criteria after.",
      "key_vocabulary": "explanation, report, persuasion, discussion, argument, evidence, structure, register, impersonal, audience, purpose, organise",
      "common_misconceptions": "Pupils frequently confuse explanation and report (both deal with factual content but for different purposes: explanation answers 'how/why', report answers 'what/when/where'). They may use narrative conventions in non-fiction (past tense, personal pronouns) where the form requires impersonal, present tense writing. Persuasion and discussion are also confused: persuasion advocates a single position; discussion considers multiple viewpoints.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C026",
      "domain_id": "EN-Y6-D006",
      "concept_name": "Narrative writing with authorial control",
      "description": "By Year 6, pupils produce narrative writing that demonstrates authorial control: deliberate choices of structure, viewpoint, vocabulary and grammatical form serve the intended effect on the reader. Mastery means pupils plan narratives with purposeful structure (not merely chronological sequence), create authentic settings and well-developed characters through showing rather than telling, integrate dialogue purposefully to advance plot and reveal character, and vary sentence structure and vocabulary choices consciously to create pace, tone and atmosphere.",
      "teaching_guidance": "Use shared writing to model the metacognitive dimension of narrative composition: think aloud about choices ('Should I use a long sentence here to create a sense of confusion, or a short sentence for impact?'). Provide regular opportunities for extended independent narrative writing preceded by structured planning. Develop pupils' awareness of viewpoint: first-person and third-person narrators each have distinctive possibilities and limitations. Teach the principle of 'show, don't tell' as a touchstone for descriptive writing. Use peer evaluation focused on specific craft elements (setting construction, dialogue punctuation, pacing) rather than general impression.",
      "key_vocabulary": "narrative, viewpoint, first person, third person, dialogue, setting, character, pacing, tone, atmosphere, structure, authorial choice",
      "common_misconceptions": "Pupils often produce narratives that are chronological lists of events ('and then... and then...') rather than structured stories with purpose and shape. They may write long descriptions that pause the narrative without serving it. Dialogue is frequently punctuated incorrectly and written mechanically rather than used as a tool for revealing character or advancing the plot.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "teaching_weight": 4,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C027",
      "domain_id": "EN-Y6-D006",
      "concept_name": "Poetry writing with craft and intention",
      "description": "By Year 6, pupils can compose poems in a range of forms, making deliberate choices about poetic devices, line breaks, structure and vocabulary to create specific effects. Mastery means pupils understand that in poetry every word carries weight, that poetic form is a tool for meaning rather than a constraint, and that effective poetry requires multiple drafts and critical self-evaluation. Pupils can write in both formal and free-verse forms, adapting their approach to purpose and audience.",
      "teaching_guidance": "Always begin poetry writing units with extensive reading and oral engagement with poems — pupils should have a rich reservoir of poetic language and form before they write. Teach specific poetic devices through imitation: ask pupils to write in the style of a studied poem before developing their own approach. Emphasise that poetry writing is a craft requiring revision: use the metaphor of the sculptor who removes material to reveal the form. Oral rehearsal before writing helps pupils find the rhythm and sound of their poem. Peer feedback should focus on specific craft choices rather than general impressions.",
      "key_vocabulary": "poem, verse, stanza, line break, rhythm, rhyme, free verse, device, imagery, draft, revise, craft",
      "common_misconceptions": "Pupils often default to simple rhyme at the expense of sense and imagery, prioritising the rhyme scheme over meaning. They may believe that poems should be difficult to understand and therefore write deliberately obscure poetry. Some pupils treat poetry as an opportunity for personal expression without craft, producing writing that is emotionally engaged but technically undeveloped.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "teaching_weight": 4,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C028",
      "domain_id": "EN-Y6-D006",
      "concept_name": "Writing for different purposes with appropriate form",
      "description": "By Year 6, pupils can identify the purpose of a writing task (to inform, explain, persuade, entertain, argue, discuss, instruct or evaluate) and select the appropriate form, structure, vocabulary and register for that purpose. Mastery means pupils make conscious purpose-driven choices at every level of their writing — from genre selection to paragraph organisation to individual vocabulary and punctuation choices — and can articulate why their choices serve the purpose effectively.",
      "teaching_guidance": "Present writing tasks with explicitly stated purposes and audiences, requiring pupils to plan how their choices will serve those parameters. Include tasks where the same content must be written for different purposes or audiences, highlighting how purpose drives form choices. Regular 'author's chair' discussions where pupils explain and justify their choices to peers develop metacognitive awareness of purpose. Connect to reading: identify the purpose of texts studied and analyse how that purpose shapes every aspect of the writing.",
      "key_vocabulary": "purpose, form, genre, structure, register, vocabulary, audience, inform, persuade, entertain, argue, discuss, instruct",
      "common_misconceptions": "Pupils often conflate form with purpose, assuming that all narrative writing entertains and all non-fiction informs, without recognising that purpose is more specific and that forms can serve multiple purposes. They may apply a default style to all writing tasks rather than adapting to purpose — for example, using formal vocabulary in a piece of creative fiction where a colloquial voice is more appropriate.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": [
        "EN-Y6-C013",
        "EN-Y6-C014",
        "EN-Y6-C015",
        "EN-Y6-C025",
        "EN-Y6-C026",
        "EN-Y6-C027",
        "EN-Y6-C029",
        "EN-Y6-C031",
        "EN-Y6-C033",
        "EN-Y6-C047"
      ]
    },
    {
      "concept_id": "EN-Y6-C029",
      "domain_id": "EN-Y6-D006",
      "concept_name": "Audience awareness in writing",
      "description": "By Year 6, pupils can identify the intended audience for a writing task and make specific adaptations at the level of vocabulary, sentence complexity, degree of explanation, formality and content selection to serve that audience effectively. Mastery means pupils understand that effective communication requires the writer to model the reader's knowledge, expectations and needs, and make deliberate choices to meet them. A fully secure pupil can write for audiences very different from themselves, including adult readers, specialist audiences and young children.",
      "teaching_guidance": "Create authentic audience contexts for writing tasks: write instructions for a Year 2 pupil; write a report for the school governors; write a persuasive letter to a local councillor. After pupils draft, ask them to evaluate whether each section of their writing is pitched correctly for the audience. Use real audiences where possible — the knowledge that a piece of writing will actually be read by the stated audience dramatically improves purposefulness and care in composition. Connect to reading: when studying a text, identify who the author wrote it for and how the text signals this.",
      "key_vocabulary": "audience, reader, adapt, vocabulary, register, formal, informal, appropriate, pitch, accessible, technical",
      "common_misconceptions": "Pupils frequently write for a vague 'general reader' rather than a specific audience, producing writing that is neither appropriately technical nor appropriately accessible. They may conflate audience with purpose, assuming that all writing for children must be simple and all writing for adults must be formal. Understanding audience requires genuine perspective-taking: pupils must step outside their own knowledge to consider what the reader needs.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "teaching_weight": 3,
      "co_teach_hints": [
        "EN-Y6-C015",
        "EN-Y6-C025",
        "EN-Y6-C028",
        "EN-Y6-C030",
        "EN-Y6-C031",
        "EN-Y6-C033",
        "EN-Y6-C034",
        "EN-Y6-C047"
      ]
    },
    {
      "concept_id": "EN-Y6-C030",
      "domain_id": "EN-Y6-D006",
      "concept_name": "Précis and summarisation",
      "description": "By Year 6, pupils can précis (condense) a longer passage, retaining the essential meaning and key information while omitting less important detail, and can summarise the main ideas of a text in their own words. Mastery means pupils understand that précis requires selection and decision-making rather than simply shortening sentences, and can maintain the logical coherence of the original while reducing its length by a specified proportion.",
      "teaching_guidance": "Teach précis as a three-stage process: read for overall understanding; identify the main ideas (marking or annotating); write the précis from notes rather than paraphrasing sentence by sentence. Specify a target length (reduce to one third, or write in 50 words) to force genuine selection. Compare pupils' précis of the same text to discuss what was essential and what was appropriately cut. Connect to note-making strategies and to the curriculum expectation of summarising main ideas drawn from more than one paragraph.",
      "key_vocabulary": "précis, summarise, condense, essential, main idea, select, paraphrase, own words, shorten, proportion",
      "common_misconceptions": "Pupils often produce précis by cutting words from sentences rather than by identifying essential meaning and rewriting. The result is a fragment of the original rather than a coherent summary. Some pupils include their own opinions or additional information in a précis, not recognising that précis requires strict fidelity to the source material's meaning.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": [
        "EN-Y6-C015",
        "EN-Y6-C029",
        "EN-Y6-C032",
        "EN-Y6-C033"
      ]
    },
    {
      "concept_id": "EN-Y6-C031",
      "domain_id": "EN-Y6-D006",
      "concept_name": "Using evidence and quotation to support writing",
      "description": "By Year 6, pupils can select relevant evidence from source texts, quote accurately and embed quotations fluently within their own prose, and use evidence to support analytical and argumentative claims. Mastery means pupils understand that evidence is used to support a point rather than to replace it — the writer's point comes first, then the evidence, then the explanation of how the evidence supports the point. A fully secure pupil can explain the significance of chosen evidence rather than simply quoting and moving on.",
      "teaching_guidance": "Teach the 'point-evidence-explain' or PEE structure as a frame for analytical paragraphs, but ensure pupils understand it as a logical structure rather than a mechanical formula. Model how to embed short quotations naturally within a sentence: 'The author describes the setting as 'bleak and windswept', suggesting...' rather than 'The author uses the word bleak. This is effective because...'. Practise identifying the most precise, relevant evidence from a longer passage. Connect to the reading comprehension objectives: pupils who quote well in writing are also developing their ability to retrieve and use evidence in comprehension tasks.",
      "key_vocabulary": "evidence, quotation, quote, embed, support, point, explain, textual evidence, cite, reference, PEE, analytical",
      "common_misconceptions": "Pupils frequently choose long quotations instead of the most precise short phrase. They often juxtapose a quote and an assertion without explanation, assuming the quote speaks for itself. Some pupils copy out whole paragraphs as 'evidence' rather than selecting the specific phrase that supports their point.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "teaching_weight": 4,
      "co_teach_hints": [
        "EN-Y6-C013",
        "EN-Y6-C025",
        "EN-Y6-C026",
        "EN-Y6-C027",
        "EN-Y6-C028",
        "EN-Y6-C029",
        "EN-Y6-C033"
      ]
    },
    {
      "concept_id": "EN-Y6-C032",
      "domain_id": "EN-Y6-D006",
      "concept_name": "Summarising main ideas across paragraphs",
      "description": "By Year 6, pupils can read a multi-paragraph text, identify the main idea of each paragraph, and produce a coherent summary of the whole text that captures the main ideas in logical order. Mastery means pupils distinguish main ideas from supporting detail, understand that different texts have different organisational structures (e.g., argument builds through paragraphs whereas explanation cascades from general to specific), and can use their understanding of text structure to guide their identification of main ideas.",
      "teaching_guidance": "Teach pupils to read first for the gist of each paragraph before making notes. Provide paragraph-level annotation tasks — write a one-sentence summary of each paragraph in the margin — as a precursor to whole-text summary. Contrast the main ideas of two texts on the same topic to highlight how different authors foreground different information. Ensure pupils practice with genuinely complex non-fiction texts across subjects, not only in English lessons.",
      "key_vocabulary": "main idea, supporting detail, paragraph, summarise, identify, structure, topic sentence, organise, notes",
      "common_misconceptions": "Pupils frequently copy the first or last sentence of a paragraph as its main idea rather than identifying the central point. They may include supporting details in a summary at the expense of main ideas. Some pupils struggle to identify main ideas when a text is not clearly organised with topic sentences.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C033",
      "domain_id": "EN-Y6-D006",
      "concept_name": "Drafting, editing and improving writing",
      "description": "By Year 6, pupils draft writing with the intention of improving it, evaluating their drafts against the criteria of effectiveness for the intended reader and purpose, and proposing and implementing specific changes to vocabulary, grammar, sentence structure and organisation to enhance clarity and effect. Mastery means pupils approach editing as a creative and analytical activity rather than as error correction, understanding that all professional writing goes through multiple drafts and that the editing process is where much of the real improvement happens.",
      "teaching_guidance": "Model the editing process explicitly using teacher-composed drafts that contain genuine compositional weaknesses (not just surface errors). Distinguish revision (changing the substance and structure) from proofreading (correcting surface errors). Require pupils to show evidence of drafting by keeping first drafts alongside final versions. Teach specific editing strategies: reading aloud to identify where the writing 'doesn't flow'; replacing every instance of a weak word (e.g., 'nice', 'good') with something more precise; checking each paragraph serves the stated purpose.",
      "key_vocabulary": "draft, revise, edit, improve, evaluate, criteria, effectiveness, vocabulary choice, clarity, effect, proofread, redraft",
      "common_misconceptions": "Pupils often treat editing as changing a few words or correcting spelling, rather than as reconsidering the entire piece for effectiveness. They may be reluctant to make significant changes because they value their original effort. Some pupils edit for surface correctness without addressing the deeper issues of coherence, audience and purpose that should be the primary focus.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": [
        "EN-Y6-C013",
        "EN-Y6-C025",
        "EN-Y6-C026",
        "EN-Y6-C027",
        "EN-Y6-C028",
        "EN-Y6-C029",
        "EN-Y6-C030",
        "EN-Y6-C031"
      ]
    },
    {
      "concept_id": "EN-Y6-C034",
      "domain_id": "EN-Y6-D006",
      "concept_name": "Planning and structuring extended writing",
      "description": "By Year 6, pupils can produce effective written plans for extended writing tasks that identify the audience and purpose, select the appropriate form, and outline the structure of the piece with sufficient detail to support drafting without constraining creative development. Mastery means pupils use a range of planning approaches (mind map, outline, list, diagram) as appropriate to the text type, and can move between planning and drafting flexibly, revising the plan when drafting reveals the need for structural changes.",
      "teaching_guidance": "Teach planning as a tool for the writer rather than a piece of work to be assessed in its own right. Show that a plan exists to support drafting, not to be copied into the draft. Demonstrate how planning differs for different text types: a narrative plan might sketch characters and plot arc; a report plan might list headings and bullet points for each section. Encourage pupils to return to their plans during drafting to check they are on track, and to modify plans when drafting reveals better approaches.",
      "key_vocabulary": "plan, structure, outline, draft, audience, purpose, form, heading, organisation, brainstorm, map",
      "common_misconceptions": "Pupils sometimes produce very detailed plans that function as a first draft rather than as a guide for drafting. Others plan superficially and then draft without direction. Planning approaches should be taught as flexible tools adapted to the task, not as a single fixed method applied to all writing.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C035",
      "domain_id": "EN-Y6-D006",
      "concept_name": "Self-evaluation and editing for coherence and effect",
      "description": "By Year 6, pupils can assess the effectiveness of their own and others' writing systematically, using stated criteria related to audience, purpose and form, and propose specific, actionable improvements. Mastery means pupils distinguish effective from ineffective choices at the level of the whole text (structure, coherence, argument), the paragraph (topic focus, cohesion) and the sentence (grammar, vocabulary, punctuation), and can prioritise which revisions will most improve the impact of their writing.",
      "teaching_guidance": "Establish shared success criteria with pupils before they write, making the evaluative process transparent. Use structured peer review protocols in which reviewers write specific comments rather than general impressions. Train pupils to use the criteria both prospectively (planning) and retrospectively (evaluating). Practise evaluating published texts against criteria before evaluating pupils' own writing — this develops the critical vocabulary and perspective needed for self-assessment. Ensure the focus of self-evaluation is primarily effectiveness for the reader, not surface correctness.",
      "key_vocabulary": "evaluate, effectiveness, criteria, coherence, impact, reader, purpose, revise, improve, peer review, self-assessment, actionable",
      "common_misconceptions": "Pupils often evaluate their own writing for surface errors rather than for communicative effectiveness. Peer review frequently produces vague praise ('it was good') or similarly vague criticism ('it was boring') without specific actionable feedback. Providing structured sentence starters for feedback comments ('One thing that worked well was... because...; One thing that could be improved is... by...') builds the vocabulary and analytical approach for effective evaluation.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "teaching_weight": 4,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C036",
      "domain_id": "EN-Y6-D004",
      "concept_name": "Spelling patterns, rules and the Years 5 and 6 statutory word list",
      "description": "By Year 6, pupils apply all the spelling patterns and rules introduced across the primary programme — including silent letters, homophones and other commonly confused words, complex prefix and suffix rules — and can accurately spell all words on the Years 5 and 6 statutory word list. Mastery means spelling is sufficiently automatic that it does not consume conscious attention during composition, freeing working memory for higher-level decisions about content, structure and vocabulary. Pupils use dictionaries and thesauruses independently and proactively as spelling and vocabulary tools.",
      "teaching_guidance": "Integrate statutory word list spelling into regular practice across the week through a variety of activities: look-cover-write-check, cloze activities using statutory words, dictionary detective tasks, and application in extended writing. Teach spelling strategies as a toolkit, not a single approach: apply phonics, apply morphology, apply etymology, apply analogy with known words. Prioritise words that appear frequently in academic writing across subjects. Monitor progress with regular low-stakes testing but ensure pupils understand that the goal is automatic deployment in writing, not test performance.",
      "key_vocabulary": "statutory word list, spelling rule, pattern, prefix, suffix, silent letter, homophone, dictionary, proof-read, automatic",
      "common_misconceptions": "Pupils often approach the statutory word list as a memorisation task divorced from meaning and use, leading to correct spelling in tests but errors in composition. Homophones (advice/advise, licence/license) are consistently confused when spelt correctly in isolation but used incorrectly in context — teaching the meaning distinction alongside the spelling prevents this.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C037",
      "domain_id": "EN-Y6-D007",
      "concept_name": "Full range of punctuation including advanced marks",
      "description": "By Year 6, pupils use the full primary range of punctuation — sentence demarcation (capital letter, full stop, question mark, exclamation mark), comma (for lists, clauses, and to avoid ambiguity), apostrophe (for contraction and possession), inverted commas, brackets and dashes (for parenthesis), semi-colons, colons and hyphens — accurately, consistently and with awareness of the effect different marks create. Mastery means punctuation choices are driven by meaning and effect, not merely by convention, and pupils can explain why a particular mark is used in a specific context.",
      "teaching_guidance": "Teach advanced punctuation marks in the context of meaning and effect, not as isolated rules. Use published examples to collect instances of semi-colons, colons and hyphens, analysing the effect each creates. Require pupils to explain their punctuation choices in extended writing: 'I used a semi-colon here because...' Proof-reading for punctuation should be one distinct pass in the editing process, separate from content revision. Include activities where pupils change the punctuation of a passage and discuss how the meaning changes.",
      "key_vocabulary": "punctuation, sentence demarcation, comma, apostrophe, inverted commas, bracket, dash, semi-colon, colon, hyphen, effect, meaning",
      "common_misconceptions": "Pupils often use commas in place of full stops (comma splicing) or use commas randomly as a pacing device. Apostrophes for possession are frequently confused with plural forms. Semi-colons are sometimes used decoratively without understanding that both clauses must be independent. Hyphens and dashes are consistently confused with each other.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C038",
      "domain_id": "EN-Y6-D007",
      "concept_name": "Sentence structure and grammatical control",
      "description": "By Year 6, pupils can construct a wide range of sentence types — simple, compound, complex and multi-clause sentences — with secure control of syntax, and can vary sentence structure consciously for effect. Mastery means pupils understand how different clause types (relative, adverbial, noun clause) create different sentence structures and effects, can identify subject and object within sentences, and can construct sentences in both active and passive voice correctly. This provides the grammatical foundation for the Year 6 aspiration of conscious grammatical control.",
      "teaching_guidance": "Use sentence-level activities — combining short sentences into complex ones using different subordinating conjunctions, expanding sentences with different clause types — to build flexible syntactic control. Teach clause types through analysis of published texts before requiring production. Vary the complexity of mentor sentences used for imitation activities, from short simple sentences to complex multi-clause constructions. Always connect sentence-level work to the effect of structure choices on the reader: 'Why might the author have used a short sentence here rather than a longer one?'",
      "key_vocabulary": "sentence, simple, compound, complex, clause, main clause, subordinate clause, relative clause, adverbial clause, subject, object, active, passive, syntax",
      "common_misconceptions": "Pupils often confuse complex sentences (containing a subordinate clause) with complicated sentences (which may simply be long compound sentences with many 'and's). They may construct sentences that are grammatically ambiguous due to misplaced subordinate clauses. Understanding the distinction between clause and phrase is a prerequisite that some pupils lack when they encounter complex sentence work.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C039",
      "domain_id": "EN-Y6-D007",
      "concept_name": "Year 6 grammatical terminology for metalinguistic discussion",
      "description": "By Year 6, pupils know and can accurately apply all the grammatical terminology required by the primary programme: word classes (noun, verb, adjective, adverb, pronoun, preposition, conjunction, determiner), clause types and functions, punctuation terms, and the Year 6 additions (subject, object, active, passive, synonym, antonym, ellipsis, hyphen, colon, semi-colon, bullet points). Mastery means pupils use metalinguistic vocabulary precisely and automatically in discussions of their reading and writing, using grammatical labels as analytical tools rather than as learned vocabulary items.",
      "teaching_guidance": "Ensure grammatical terminology is taught in the context of its use, not as a list to memorise. Create a classroom environment in which discussing grammar is the norm — every writing conference or peer review session uses grammatical vocabulary. Use regular, brief activities (analyse this sentence using grammatical terms; sort these words by word class) to keep terminology active. Connect to reading analysis: asking 'what word class is this and how does its position in the sentence affect its meaning?' develops metalinguistic awareness.",
      "key_vocabulary": "noun, verb, adjective, adverb, pronoun, preposition, conjunction, determiner, clause, phrase, subject, object, active, passive, synonym, antonym, ellipsis",
      "common_misconceptions": "Pupils often know grammatical terms in isolation but cannot deploy them in the analysis of real texts. They may correctly identify a noun when it appears in a simple example but misidentify it in a complex sentence where the word functions differently from its typical role. The distinction between the word class of a word (its intrinsic category) and its function in a sentence (which can vary) is a common source of confusion.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": [
        "EN-Y6-C002",
        "EN-Y6-C011",
        "EN-Y6-C037"
      ]
    },
    {
      "concept_id": "EN-Y6-C040",
      "domain_id": "EN-Y6-D007",
      "concept_name": "Perfect verb forms and complex tense use",
      "description": "By Year 6, pupils use the perfect form of verbs (present perfect: 'I have seen'; past perfect: 'She had arrived') accurately and with understanding of the temporal relationships these forms express. Mastery means pupils know that the present perfect connects a past event to the present moment, while the past perfect marks a completed action prior to another past action, and that both are tools for managing time relationships precisely in writing. Pupils use these forms correctly in both spoken and written Standard English.",
      "teaching_guidance": "Teach perfect forms through the temporal relationships they express, not through grammar labels alone. Use timelines to show that 'I have eaten' connects a past action to the present, while 'I had eaten' situates a completed action before another past point. Collect examples from literature where the past perfect creates specific effects: the revelation that something has already happened before the narrated events begin. Connect to non-fiction writing: the present perfect is common in scientific writing ('Researchers have found...') and the past perfect in historical narrative ('By the time the king arrived, the battle had already ended.').",
      "key_vocabulary": "perfect form, present perfect, past perfect, auxiliary verb, have, had, tense, aspect, temporal relationship, Standard English",
      "common_misconceptions": "Pupils frequently confuse past simple ('She walked') with past perfect ('She had walked'), using past simple where the sequencing requires past perfect. They may avoid perfect forms entirely in favour of the simpler past simple, producing writing that cannot differentiate between events at different past time points. In speech, some pupils use non-standard forms ('I done it' rather than 'I have done it') that reflect dialect rather than Standard English.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": [
        "EN-Y6-C004",
        "EN-Y6-C006",
        "EN-Y6-C010",
        "EN-Y6-C037",
        "EN-Y6-C042"
      ]
    },
    {
      "concept_id": "EN-Y6-C041",
      "domain_id": "EN-Y6-D007",
      "concept_name": "Grammatical features of sentences: expanded noun phrases, modal verbs, relative clauses",
      "description": "By Year 6, pupils use expanded noun phrases to convey complex information concisely, deploy modal verbs to indicate degrees of possibility and obligation, and construct relative clauses beginning with who, which, where, when, whose, that, or with an implied relative pronoun. Mastery means pupils can identify these features in texts they read, analyse their effect on meaning and tone, and deploy them purposefully in their own writing. These are the Year 5/6 specific grammatical features identified in Appendix 2.",
      "teaching_guidance": "Teach each feature through the meaning or effect it creates rather than through abstract labelling. Expanded noun phrases: 'Instead of writing \"a dog\", the author writes \"a small, scruffy, gap-toothed dog of uncertain parentage\" — how does this change your mental picture?' Modal verbs: use a scale from possibility (might, could) to probability (should, ought) to certainty (will, shall, must) and discuss how modal choice signals the writer's confidence. Relative clauses: practise both with explicit relative pronoun ('the book that she gave me') and with omitted relative pronoun ('the book she gave me'), discussing the stylistic effect of each.",
      "key_vocabulary": "expanded noun phrase, modifier, premodifier, postmodifier, modal verb, degree of possibility, relative clause, relative pronoun, who, which, where, when, whose, that",
      "common_misconceptions": "Pupils sometimes confuse modal verbs with other auxiliary verbs, particularly 'have' and 'do'. They may add relative clauses as dangling modifiers that do not clearly attach to the intended noun. Expanded noun phrases are sometimes confused with adjective strings — pupils add several adjectives without understanding that a noun phrase can include prepositional phrases, relative clauses and other modifiers beyond adjectives.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "teaching_weight": 5,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C042",
      "domain_id": "EN-Y6-D007",
      "concept_name": "Standard English and formal speech and writing",
      "description": "By Year 6, pupils understand Standard English as a codified form of the language used in formal contexts and assessed in national qualifications, can distinguish between Standard English and dialect features in both speech and writing, and consistently use Standard English in formal written contexts. Mastery means pupils understand that Standard English is not inherently superior to dialect — both have value and serve different communicative purposes — but that competence in Standard English is essential for the formal registers of secondary education and beyond.",
      "teaching_guidance": "Teach Standard English as a register rather than as 'correct' English, valuing dialect alongside it. Contrast standard and non-standard forms explicitly: 'We was going' (non-standard) versus 'We were going' (Standard English); 'I done my homework' versus 'I have done my homework.' Use real examples of dialect in literature and media to establish that non-standard forms have validity and richness. Require Standard English consistently in formal writing tasks and exam-style responses, while allowing (and valuing) dialect in creative and spoken contexts where it is appropriate.",
      "key_vocabulary": "Standard English, dialect, formal, informal, non-standard, register, grammar, spoken, written, appropriate, context",
      "common_misconceptions": "Pupils and teachers sometimes conflate Standard English with 'correct' English and dialect with 'incorrect' English, creating a deficit view of non-standard language use. Standard English is a social register, not an absolute linguistic standard. Pupils from dialect-speaking communities may face additional barriers; recognising and valuing their dialect while teaching Standard English as an additional register is both linguistically accurate and culturally respectful.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "teaching_weight": 3,
      "co_teach_hints": [
        "EN-Y6-C001",
        "EN-Y6-C003",
        "EN-Y6-C010",
        "EN-Y6-C011",
        "EN-Y6-C016",
        "EN-Y6-C037",
        "EN-Y6-C040"
      ]
    },
    {
      "concept_id": "EN-Y6-C043",
      "domain_id": "EN-Y6-D003",
      "concept_name": "Fluent independent reading and reading stamina",
      "description": "By Year 6, pupils read fluently, accurately and with sustained engagement across extended texts and a full range of text types, applying their full repertoire of decoding, vocabulary and comprehension strategies automatically so that cognitive resources are available for higher-level interpretation and critical thinking. Mastery — the curriculum's 'effortless' standard — means that reading does not require conscious effort or decoding support, enabling pupils to sustain concentration across a full chapter, textbook extract or examination paper without fatigue or comprehension breakdown.",
      "teaching_guidance": "Assess reading stamina through extended independent reading tasks as well as through comprehension questions on short extracts. Build reading stamina progressively through the year: sustained silent reading periods, extended 'reading for meaning' tasks, and reading across subjects. Ensure pupils have access to appropriate-challenge texts for both independent and guided reading — texts that are too easy or too hard both undermine stamina development. Reading to pupils of challenging texts that they cannot yet read independently develops vocabulary and comprehension at the upper boundary of their current ability.",
      "key_vocabulary": "fluency, stamina, effortless, automatic, decoding, comprehension, sustained, independent, challenge, engagement",
      "common_misconceptions": "Reading fluency is sometimes conflated with reading speed. A pupil who reads quickly without comprehension is not fluent in the meaningful sense. Similarly, a pupil who reads slowly but with full comprehension and without decoding difficulty may simply be a careful reader. The target is accurate, effortful-free reading with full comprehension, at an appropriate pace for the text and task.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C044",
      "domain_id": "EN-Y6-D002",
      "concept_name": "Vocabulary acquisition: morphology, etymology and context",
      "description": "By Year 6, pupils actively use morphological analysis (recognising roots, prefixes and suffixes) and etymological knowledge (recognising word origin patterns) to access the meaning of unfamiliar words encountered in their reading across all subjects, and use context to refine their understanding of word meaning. Mastery means pupils approach new vocabulary as an intellectual challenge, routinely working out meanings from morphological clues before turning to a dictionary, and developing a rich, precisely differentiated vocabulary that serves both their reading comprehension and their writing.",
      "teaching_guidance": "Prioritise a 'word consciousness' culture in which encountering and learning new words is valued and celebrated. Keep classroom word banks, word walls and vocabulary journals. Teach pupils to use a dictionary and thesaurus as complementary tools — the dictionary for denotation and spelling, the thesaurus for exploring synonyms and their nuances. Explicitly teach how to use context clues: read the whole sentence and surrounding sentences before making a vocabulary decision. Celebrate pupils who notice and share interesting or unusual words they have encountered in their reading.",
      "key_vocabulary": "vocabulary, morphology, etymology, root, prefix, suffix, context, denotation, connotation, synonym, dictionary, thesaurus",
      "common_misconceptions": "Pupils sometimes skip unfamiliar words rather than attempting to work out their meaning. They may over-rely on context at the expense of morphological analysis, or vice versa. Dictionary use is often reactive and occasional rather than proactive and habitual. Some pupils equate vocabulary richness with using rare or long words rather than with using the most precise and appropriate word for the context.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C045",
      "domain_id": "EN-Y6-D001",
      "concept_name": "Presentation, performance and formal public speaking",
      "description": "By Year 6, pupils can deliver formal presentations and performances with command, clarity and audience awareness, adapting their spoken language for public, formal contexts. Mastery means pupils speak with confidence, control pace and volume, use formal vocabulary and registers deliberately, maintain the interest of their audience through varied tone and appropriate use of gesture and eye contact, and handle questions and follow-up with composure. This is the culmination of the spoken language curriculum's requirement for pupils to 'gain, maintain and monitor the interest of the listener.'",
      "teaching_guidance": "Provide regular opportunities for formal presentations to unfamiliar or larger audiences — not only the class teacher. Teach specific presentation techniques: structuring a presentation, using cue cards rather than a script, making eye contact with different parts of the audience, varying pace for emphasis. Video performances for self-analysis with specific criteria (eye contact, pace, volume, vocabulary). Connect to debate: formal debate requires all these skills plus the additional challenge of responding to an opposing argument in real time.",
      "key_vocabulary": "presentation, performance, formal, public speaking, audience, eye contact, pace, volume, register, cue card, debate",
      "common_misconceptions": "Pupils often conflate confidence in informal speech with competence in formal public speaking — the registers and skills are related but distinct. They may read from a script rather than using notes, which reduces naturalness and audience contact. Some pupils speak too quickly when nervous; explicitly teaching techniques for managing nervousness (breathing, deliberate pausing) is as important as teaching the content of a good presentation.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": true,
      "teaching_weight": 4,
      "co_teach_hints": [
        "EN-Y6-C046",
        "EN-Y6-C048"
      ]
    },
    {
      "concept_id": "EN-Y6-C046",
      "domain_id": "EN-Y6-D001",
      "concept_name": "Discussion, debate and collaborative talk",
      "description": "By Year 6, pupils can participate in and lead structured discussions and formal debates, contributing substantive and evidence-based points, responding to others' contributions constructively, challenging views courteously, and building on previous contributions to move the discussion forward. Mastery means pupils can hold two tasks simultaneously in discussion: developing their own thinking while monitoring and responding to the thinking of others, maintaining focus on the topic while adapting to the direction the discussion takes.",
      "teaching_guidance": "Use a range of formal discussion structures — Socratic seminar, philosophical enquiry, structured academic controversy — to develop different discussion skills. Teach specific discussion moves: adding, challenging, building, questioning, summarising. Train pupils to use evidence in discussion ('I agree, and the evidence from the text is...') and to disagree politely ('I see your point, but I would argue...'. Evaluate discussions explicitly against criteria, including both content (quality of argument and evidence) and process (listening, turn-taking, responding to others).",
      "key_vocabulary": "discussion, debate, argument, evidence, respond, challenge, agree, disagree, contribute, courteous, build on, Socratic",
      "common_misconceptions": "Pupils frequently equate discussion participation with speaking quantity, not recognising that listening and responding to others is equally important. In debates, pupils may read out prepared points without engaging with what the opposing side has said. Some pupils equate confidence in discussion with correctness, making them resistant to having their views challenged.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C047",
      "domain_id": "EN-Y6-D006",
      "concept_name": "Writing in a range of forms for authentic purposes",
      "description": "By Year 6, pupils have experience of writing in a broad range of forms across authentic or quasi-authentic purposes — not only the forms specifically assessed at KS2 but also letters, journal entries, scripts, reviews, biographical writing, and cross-curricular writing such as science explanations and history essays. Mastery means pupils understand that writing is a tool for accomplishing purposes in the world, and that learning the conventions of a wide range of forms equips them for the writing demands of secondary school and adult life.",
      "teaching_guidance": "Plan a year's writing curriculum that includes both assessed forms and a range of additional forms not assessed at KS2. Use authentic purposes where possible: write letters that will actually be sent, reviews for a class reading blog, explanations that will be used to help younger pupils. Cross-curricular writing opportunities are particularly valuable because they provide authentic purposes and audiences in subjects where the writing conventions are different from those of English. Introduce pupils to the range of writing forms they will encounter in secondary school.",
      "key_vocabulary": "form, genre, authentic, purpose, letter, journal, script, review, biography, cross-curricular, convention",
      "common_misconceptions": "Pupils sometimes assume that the writing forms assessed at KS2 (narrative, non-chronological report, persuasion) represent the full range of writing they need to learn. Teachers may narrow the writing curriculum to focus on assessed forms, reducing pupils' exposure to the broader range needed for secondary school and beyond.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "EN-Y6-C048",
      "domain_id": "EN-Y6-D001",
      "concept_name": "Drama: performance, role play and improvisation",
      "description": "By Year 6, pupils participate in a range of dramatic activities — including role play, improvisation, script reading, and performance — using their voices, movement and expression to communicate character, mood and meaning. Mastery means pupils can commit to a dramatic role with confidence, adapt their spoken language and non-verbal communication for performance contexts, and use drama as a tool for exploring ideas, perspectives and texts. Drama experience directly supports the spoken language curriculum's requirements for public speaking, performance and debate.",
      "teaching_guidance": "Use drama as a learning tool across the curriculum, not only in dedicated drama lessons. In English, use hot-seating, freeze-frame and thought-tracking activities to deepen comprehension of texts and characters. Use improvisation to explore 'what if' scenarios relating to studied texts or historical events. Provide opportunities for prepared performance as well as spontaneous improvisation — each develops different skills. Connect to the performance of poetry and prose reading aloud, where vocal expression and physical presence serve similar communicative functions.",
      "key_vocabulary": "drama, role play, improvisation, performance, script, character, expression, movement, voice, tone, freeze-frame, hot-seating",
      "common_misconceptions": "Pupils may be self-conscious about dramatic participation, particularly in improvisation; structured warm-up activities and a supportive classroom culture reduce this barrier. Some teachers treat drama as separate from English literacy learning, missing the rich connections between dramatic experience and reading comprehension, characterisation, and spoken language development.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_weight": 2,
      "co_teach_hints": [
        "EN-Y6-C045"
      ]
    },
    {
      "concept_id": "EN-Y6-C049",
      "domain_id": "EN-Y6-D005",
      "concept_name": "Personal Handwriting Style and Presentation",
      "description": "By Y6, handwriting development reaches the point where pupils should have established a fluent, legible personal style that can be sustained at speed. The focus shifts from learning to form letters and join them correctly (KS1/Y3-4) to developing a consistent personal style and making deliberate choices about presentation suited to different purposes. Pupils choose deliberately whether to join or not join specific letter combinations based on legibility and context, and choose appropriate writing implements for different writing tasks. A confident, fluent handwriting style supports the extended writing required at Y6 and beyond, freeing working memory for the compositional decisions that determine writing quality.",
      "teaching_guidance": "At Y6, handwriting teaching is primarily about consolidation and self-awareness rather than new skill development. Support pupils in identifying their own handwriting strengths and areas for development: is it most legible when they slow down? Do specific letter combinations cause difficulty? Do they tire after sustained writing? Address individual issues rather than whole-class handwriting practice at this stage. Discuss explicitly the different presentation demands of different tasks: extended narrative writing needs sustainable speed; a formal letter to an external audience needs careful presentation; a planning draft can be rough. Develop pupils' awareness of the professional presentation expectations they will encounter in secondary school and beyond.",
      "key_vocabulary": "handwriting, personal style, legible, fluent, speed, join, unjoined, presentation, implement, consistent, sustain, purpose, context, formation, independent",
      "common_misconceptions": "Pupils may believe that good handwriting means slow, painstaking handwriting; the goal is fluency (smooth, automatic, well-formed) not slowness. Some pupils may use poor presentation to conceal difficulties with content; encouraging drafting and redrafting separates the compositional and transcriptional dimensions of writing. Pupils with specific handwriting difficulties (dyspraxia, hypermobility) may benefit from alternatives to handwriting (keyboard, voice recognition) rather than continued handwriting practice that has not achieved fluency.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": []
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "EN-Y5-C028",
      "dependent_concept": "EN-Y6-C001",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.75,
      "rationale": "Year 5 relative clauses, which include Latinate conjunctions, create familiarity with grammatical patterns associated with formal registers that Year 6 extends to explicit formal/informal vocabulary distinction."
    },
    {
      "prerequisite_concept": "EN-Y5-C013",
      "dependent_concept": "EN-Y6-C002",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 5's thesaurus skills involve working with synonyms; Year 6 formalises the concept of synonyms and antonyms as grammatical terminology and deepens understanding of connotation and nuance."
    },
    {
      "prerequisite_concept": "EN-Y5-C001",
      "dependent_concept": "EN-Y6-C002",
      "confidence": "inferred",
      "relationship_type": "cognitive",
      "strength": 0.8,
      "rationale": "Morphological knowledge supports understanding of synonyms — many synonym pairs (discover/find out) differ in morphological complexity, and understanding word structure illuminates why Latinate words feel more formal."
    },
    {
      "prerequisite_concept": "EN-Y6-C001",
      "dependent_concept": "EN-Y6-C003",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Understanding formal versus informal vocabulary is prerequisite for understanding formal versus informal grammatical structures, since both dimensions of formality need to be controlled simultaneously."
    },
    {
      "prerequisite_concept": "EN-Y5-C029",
      "dependent_concept": "EN-Y6-C003",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.7,
      "rationale": "Modal verbs express hypothetical and conditional meaning; subjunctive forms are another way of expressing hypothesis and conditionality in formal registers, representing a more formal grammatical equivalent."
    },
    {
      "prerequisite_concept": "EN-Y5-C025",
      "dependent_concept": "EN-Y6-C004",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "Year 5's cohesive devices (adverbials of time, place, number) are extended in Year 6 to include repetition, grammatical connections and ellipsis — the most sophisticated level of cohesion in the primary programme."
    },
    {
      "prerequisite_concept": "EN-Y5-C030",
      "dependent_concept": "EN-Y6-C010",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 1.0,
      "rationale": "Year 5 introduces passive voice as a concept; Year 6 extends to full formal treatment in Appendix 2, adding the terminology subject, object, active and passive, and deepening understanding of purpose and effect."
    },
    {
      "prerequisite_concept": "EN-Y5-C032",
      "dependent_concept": "EN-Y6-C006",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 5's parenthesis punctuation (brackets, dashes, commas) establishes understanding of these marks as clause-boundary signallers; Year 6 deepens understanding of colons and semi-colons for the same purpose, completing the punctuation repertoire."
    },
    {
      "prerequisite_concept": "EN-Y5-C033",
      "dependent_concept": "EN-Y6-C006",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 1.0,
      "rationale": "Year 5 introduces semi-colons, colons and dashes for independent clause boundaries; Year 6 formalises these as Appendix 2 terminology and requires pupils to understand the differences in effect between the three marks."
    },
    {
      "prerequisite_concept": "EN-Y6-C006",
      "dependent_concept": "EN-Y6-C007",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Understanding how colons introduce independent clause extensions is prerequisite for understanding how they introduce lists, since both applications share the same structural requirement of a complete clause before the colon."
    },
    {
      "prerequisite_concept": "EN-Y5-C021",
      "dependent_concept": "EN-Y6-C012",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "Year 5's authorial language analysis (identify, describe, evaluate figurative language) develops in Year 6 to sustained critical evaluation of authorial choices across language and structure, with higher expectations of analytical depth and independence."
    },
    {
      "prerequisite_concept": "EN-Y6-C001",
      "dependent_concept": "EN-Y6-C014",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Formal/informal vocabulary distinction is a key component of register control; understanding register requires this knowledge as a building block, extending it to grammar, sentence structure and discourse."
    },
    {
      "prerequisite_concept": "EN-Y6-C003",
      "dependent_concept": "EN-Y6-C014",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.85,
      "rationale": "Understanding formal versus informal grammatical structures (including subjunctive) is a necessary component of full register control, alongside vocabulary choice."
    },
    {
      "prerequisite_concept": "EN-Y5-C026",
      "dependent_concept": "EN-Y6-C013",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 5's audience and purpose planning is the foundation for Year 6's metacognitive, conscious grammatical control: knowing who you are writing for and what you are trying to achieve enables purposeful grammatical choices."
    },
    {
      "prerequisite_concept": "EN-Y6-C013",
      "dependent_concept": "EN-Y6-C015",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Secondary school readiness requires the metacognitive grammatical control that Year 6 develops — pupils must not only perform tasks competently but understand what they are doing and why."
    },
    {
      "prerequisite_concept": "EN-Y5-C022",
      "dependent_concept": "EN-Y6-C016",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Distinguishing fact from opinion requires understanding of connotation and how language choices can present opinion as fact; this critical awareness of word choice feeds directly into Year 6's focus on nuanced vocabulary."
    },
    {
      "prerequisite_concept": "EN-Y6-C002",
      "dependent_concept": "EN-Y6-C016",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Understanding synonyms and antonyms — particularly that synonyms differ in connotation and degree — is the conceptual basis for developing nuanced vocabulary understanding at Year 6."
    },
    {
      "prerequisite_concept": "EN-Y5-C035",
      "dependent_concept": "EN-Y6-C015",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.7,
      "rationale": "Year 5's public speaking and debate provide oral scaffolding for the sustained academic discourse expected of pupils entering secondary school, where extended discussion is assessed across all subjects."
    },
    {
      "prerequisite_concept": "EN-Y5-C031",
      "dependent_concept": "EN-Y6-C010",
      "confidence": "inferred",
      "relationship_type": "cognitive",
      "strength": 0.7,
      "rationale": "Perfect verb forms require understanding of tense and aspect, which supports the ability to form passive constructions correctly across different tenses — both require manipulation of auxiliary verbs and non-finite verb forms."
    },
    {
      "prerequisite_concept": "EN-Y6-C004",
      "dependent_concept": "EN-Y6-C013",
      "confidence": "inferred",
      "relationship_type": "cognitive",
      "strength": 0.75,
      "rationale": "Deploying advanced cohesive devices requires exactly the kind of conscious grammatical control that Year 6 targets — pupils must choose between devices based on the logical relationship they intend to signal."
    },
    {
      "prerequisite_concept": "EN-Y6-C010",
      "dependent_concept": "EN-Y6-C013",
      "confidence": "inferred",
      "relationship_type": "cognitive",
      "strength": 0.8,
      "rationale": "Conscious control of passive voice — understanding when and why to use it for presentational effect — is one of the clearest examples of the metacognitive grammatical awareness that Year 6 targets across all structures."
    },
    {
      "prerequisite_concept": "EN-Y5-C037",
      "dependent_concept": "EN-Y6-C049",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Y6 personal handwriting style develops from Y5 fluent handwriting with deliberate joining choices; the same skills are required but at greater speed and with more individual style development."
    }
  ]
}
