{
  "metadata": {
    "subject": "English",
    "key_stage": "KS2",
    "years_covered": [
      3
    ],
    "document_reference": "DFE-00181-2013",
    "extraction_date": "2026-02-16",
    "structure_rating": 7,
    "notes": "Year 3 is the first year of Lower Key Stage 2. The document presents Years 3 and 4 together but this extraction focuses on Year 3 content and appropriate developmental expectations. Year 3-specific grammar content is taken from English Appendix 2."
  },
  "domains": [
    {
      "domain_id": "EN-Y3-D001",
      "domain_name": "Spoken Language",
      "description": "Development of spoken language skills across all contexts, including discussion, presentations, and drama. Statutory requirements for spoken language apply to all years 1-6. Year 3 pupils should develop greater familiarity and confidence in using language in a variety of situations, audiences and purposes, including drama, formal presentations and debate.",
      "is_cross_cutting": true,
      "structure_type": "mixed",
      "curriculum_context": "Spoken language at Year 3 continues the development of confident, purposeful oral communication that began in KS1, now with greater expectations for clarity, organisation and stamina in extended talk. Pupils are expected to build on the informal oral language of home and early schooling to develop more formal registers appropriate to different audiences and purposes — including explaining reasoning, retelling and discussing texts. The statutory curriculum requires all spoken language objectives to be developed continuously throughout the primary years, with teachers providing rich opportunities for debate, drama, collaborative discussion and formal presentation. Year 3 marks a transition point where pupils are expected to sustain extended contributions and actively listen and respond to others with increasing sophistication."
    },
    {
      "domain_id": "EN-Y3-D002",
      "domain_name": "Reading - Word Reading",
      "description": "Application of phonics, morphology and etymology to decode and understand new words. By Year 3, most pupils should not need further direct word reading instruction; focus shifts to supporting vocabulary development through growing knowledge of root words, prefixes and suffixes.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "curriculum_context": "Reading — word reading at Year 3 moves beyond the phonics-dominated approach of KS1 to develop fluent, automatic decoding of a wider range of texts including those with more complex vocabulary. Pupils are expected to apply their growing knowledge of root words, prefixes and suffixes to read and understand new vocabulary encountered in reading. The statutory curriculum requires pupils to read most words fluently without needing to sound them out, and to re-read texts for accuracy and comprehension, self-correcting where necessary. The goal is secure, automatic word recognition that frees cognitive resources for comprehension, inference and appreciation of authorial craft."
    },
    {
      "domain_id": "EN-Y3-D003",
      "domain_name": "Reading - Comprehension",
      "description": "Understanding and engagement with a wide range of texts through discussion, inference and critical thinking. At Year 3, comprehension takes precedence. Pupils should read books at age-appropriate interest level accurately and at sufficient speed to focus on understanding rather than decoding.",
      "is_cross_cutting": false,
      "structure_type": "mixed",
      "curriculum_context": "Reading comprehension at Year 3 deepens pupils' ability to understand, interpret and evaluate a widening range of texts including stories from other cultures, poetry, myths, legends and non-fiction. Pupils are expected to ask and answer questions about texts, predict what might happen from details stated and implied, draw inferences about characters' feelings, thoughts and motives, and identify how language and structure contribute to meaning. The statutory curriculum requires pupils to be familiar with a range of authors and to participate in discussion about books, building on the reading for pleasure habits established in KS1. Year 3 comprehension work focuses particularly on inference skills and on discussing how authors choose words for effect."
    },
    {
      "domain_id": "EN-Y3-D004",
      "domain_name": "Writing - Transcription (Spelling)",
      "description": "Spelling accuracy using phonics, morphology, etymology and understanding of word structure. Year 3 spelling focuses on prefixes, suffixes, homophones, possessive apostrophes and words often misspelt. Pupils learn the statutory Years 3-4 word list.",
      "is_cross_cutting": false,
      "structure_type": "sequential",
      "curriculum_context": "Writing — transcription: spelling at Year 3 introduces pupils to a wider range of spelling rules and conventions, moving beyond the high-frequency words and basic phonics patterns of KS1. Pupils learn to use the first two or three letters of a word to locate it in a dictionary, add common prefixes and suffixes and understand how they change meaning or function, and spell homophones correctly. The statutory curriculum includes specific statutory word lists for Years 3 and 4 that pupils are expected to learn, covering common exception words not decodable by standard phonics rules. Accurate spelling at Year 3 requires regular revisiting and testing of spellings in context, alongside explicit teaching of the spelling conventions and their exceptions."
    },
    {
      "domain_id": "EN-Y3-D005",
      "domain_name": "Writing - Transcription (Handwriting)",
      "description": "Development of joined, legible and fluent handwriting. Joined handwriting should be the norm in Year 3. Pupils should use it fast enough to keep pace with what they want to say.",
      "is_cross_cutting": false,
      "structure_type": "sequential",
      "curriculum_context": "Handwriting at Year 3 focuses on developing fluent, joined handwriting as the standard form of written communication, consolidating the letter formation and beginning joins of KS1. Pupils are expected to use joined handwriting consistently and to develop a personal style that balances legibility, speed and accuracy. The statutory curriculum requires that pupils can write capital letters and digits that are of the correct size and orientation, and that handwriting is sufficiently automatic to support the compositional demands of extended writing. By Year 3, the focus shifts from forming individual letters correctly to developing the smooth, efficient hand movements that enable sustained, legible writing at speed."
    },
    {
      "domain_id": "EN-Y3-D006",
      "domain_name": "Writing - Composition",
      "description": "Planning, drafting and evaluating writing for different purposes and audiences. Year 3 pupils should write with reasonable accuracy and good sentence punctuation. Focus on consolidating writing skills, vocabulary, sentence structure and linguistic terminology while enhancing effectiveness.",
      "is_cross_cutting": false,
      "structure_type": "sequential",
      "curriculum_context": "Writing — composition at Year 3 develops pupils' ability to plan, draft and evaluate a wider range of text types for different purposes and audiences, with increasing awareness of the reader's needs. Pupils learn to organise writing into paragraphs to group related information, to use headings and sub-headings in non-fiction writing, and to develop settings, characters and plot in narrative. The statutory curriculum requires pupils to compose and rehearse sentences orally before writing them, to assess the effectiveness of their own and others' writing and suggest improvements, and to proofread for spelling and punctuation errors. The compositional demands at Year 3 are supported by extensive reading of high-quality texts that provide models of effective writing across different genres."
    },
    {
      "domain_id": "EN-Y3-D007",
      "domain_name": "Writing - Vocabulary, Grammar and Punctuation",
      "description": "Understanding and applying grammatical concepts and punctuation conventions in writing. Explicit teaching of grammar terminology and concepts. Pupils should understand how writing differs from speech and begin to apply Standard English.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "curriculum_context": "Vocabulary, grammar and punctuation at Year 3 introduces pupils to more complex sentence structures and extends their grammatical vocabulary, building on the sentence-level work of KS1. Pupils learn to express time, place and cause using conjunctions, adverbs and prepositions, to use fronted adverbials and understand when to use commas after them, and to use inverted commas for direct speech. The statutory curriculum introduces pupils to new grammatical terms: fronted adverbial, determiner, pronoun, possessive pronoun, and adverbial. The teaching of grammar at this stage is always embedded in meaningful writing contexts, with pupils learning to use new structures not just to recognise them, and evaluating the effect of grammatical choices on the reader."
    }
  ],
  "objectives": [
    {
      "objective_id": "EN-Y3-O001",
      "domain_id": "EN-Y3-D001",
      "objective_text": "listen and respond appropriately to adults and peers",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O002",
      "domain_id": "EN-Y3-D001",
      "objective_text": "ask relevant questions to extend their understanding and knowledge",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O003",
      "domain_id": "EN-Y3-D001",
      "objective_text": "use relevant strategies to build their vocabulary",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O004",
      "domain_id": "EN-Y3-D001",
      "objective_text": "articulate and justify answers, arguments and opinions",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O005",
      "domain_id": "EN-Y3-D001",
      "objective_text": "give well-structured descriptions, explanations and narratives for different purposes, including for expressing feelings",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O006",
      "domain_id": "EN-Y3-D001",
      "objective_text": "maintain attention and participate actively in collaborative conversations, staying on topic and initiating and responding to comments",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O007",
      "domain_id": "EN-Y3-D001",
      "objective_text": "use spoken language to develop understanding through speculating, hypothesising, imagining and exploring ideas",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O008",
      "domain_id": "EN-Y3-D001",
      "objective_text": "speak audibly and fluently with an increasing command of Standard English",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O009",
      "domain_id": "EN-Y3-D001",
      "objective_text": "participate in discussions, presentations, performances, role play, improvisations and debates",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O010",
      "domain_id": "EN-Y3-D001",
      "objective_text": "gain, maintain and monitor the interest of the listener(s)",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O011",
      "domain_id": "EN-Y3-D001",
      "objective_text": "consider and evaluate different viewpoints, attending to and building on the contributions of others",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O012",
      "domain_id": "EN-Y3-D001",
      "objective_text": "select and use appropriate registers for effective communication",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O013",
      "domain_id": "EN-Y3-D002",
      "objective_text": "apply their growing knowledge of root words, prefixes and suffixes (etymology and morphology) as listed in English Appendix 1, both to read aloud and to understand the meaning of new words they meet",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O014",
      "domain_id": "EN-Y3-D002",
      "objective_text": "read further exception words, noting the unusual correspondences between spelling and sound, and where these occur in the word",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O015",
      "domain_id": "EN-Y3-D003",
      "objective_text": "develop positive attitudes to reading and understanding of what they read by listening to and discussing a wide range of fiction, poetry, plays, non-fiction and reference books or textbooks",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O016",
      "domain_id": "EN-Y3-D003",
      "objective_text": "read books that are structured in different ways and reading for a range of purposes",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O017",
      "domain_id": "EN-Y3-D003",
      "objective_text": "use dictionaries to check the meaning of words that they have read",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O018",
      "domain_id": "EN-Y3-D003",
      "objective_text": "increase their familiarity with a wide range of books, including fairy stories, myths and legends, and retelling some of these orally",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O019",
      "domain_id": "EN-Y3-D003",
      "objective_text": "identify themes and conventions in a wide range of books",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O020",
      "domain_id": "EN-Y3-D003",
      "objective_text": "prepare poems and play scripts to read aloud and to perform, showing understanding through intonation, tone, volume and action",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O021",
      "domain_id": "EN-Y3-D003",
      "objective_text": "discuss words and phrases that capture the reader's interest and imagination",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O022",
      "domain_id": "EN-Y3-D003",
      "objective_text": "recognise some different forms of poetry [for example, free verse, narrative poetry]",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O023",
      "domain_id": "EN-Y3-D003",
      "objective_text": "check that the text makes sense to them, discussing their understanding and explaining the meaning of words in context",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O024",
      "domain_id": "EN-Y3-D003",
      "objective_text": "ask questions to improve their understanding of a text",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O025",
      "domain_id": "EN-Y3-D003",
      "objective_text": "draw inferences such as inferring characters' feelings, thoughts and motives from their actions, and justifying inferences with evidence",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O026",
      "domain_id": "EN-Y3-D003",
      "objective_text": "predict what might happen from details stated and implied",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O027",
      "domain_id": "EN-Y3-D003",
      "objective_text": "identify main ideas drawn from more than one paragraph and summarising these",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O028",
      "domain_id": "EN-Y3-D003",
      "objective_text": "identify how language, structure, and presentation contribute to meaning",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O029",
      "domain_id": "EN-Y3-D003",
      "objective_text": "retrieve and record information from non-fiction",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O030",
      "domain_id": "EN-Y3-D003",
      "objective_text": "participate in discussion about both books that are read to them and those they can read for themselves, taking turns and listening to what others say",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O031",
      "domain_id": "EN-Y3-D004",
      "objective_text": "use further prefixes and suffixes and understand how to add them (English Appendix 1)",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O032",
      "domain_id": "EN-Y3-D004",
      "objective_text": "spell further homophones",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O033",
      "domain_id": "EN-Y3-D004",
      "objective_text": "spell words that are often misspelt (English Appendix 1)",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O034",
      "domain_id": "EN-Y3-D004",
      "objective_text": "place the possessive apostrophe accurately in words with regular plurals [for example, girls', boys'] and in words with irregular plurals [for example, children's]",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O035",
      "domain_id": "EN-Y3-D004",
      "objective_text": "use the first two or three letters of a word to check its spelling in a dictionary",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O036",
      "domain_id": "EN-Y3-D004",
      "objective_text": "write from memory simple sentences, dictated by the teacher, that include words and punctuation taught so far",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O037",
      "domain_id": "EN-Y3-D005",
      "objective_text": "use the diagonal and horizontal strokes that are needed to join letters and understand which letters, when adjacent to one another, are best left unjoined",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O038",
      "domain_id": "EN-Y3-D005",
      "objective_text": "increase the legibility, consistency and quality of their handwriting [for example, by ensuring that the downstrokes of letters are parallel and equidistant; that lines of writing are spaced sufficiently so that the ascenders and descenders of letters do not touch]",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O039",
      "domain_id": "EN-Y3-D006",
      "objective_text": "plan their writing by discussing writing similar to that which they are planning to write in order to understand and learn from its structure, vocabulary and grammar",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O040",
      "domain_id": "EN-Y3-D006",
      "objective_text": "plan their writing by discussing and recording ideas",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O041",
      "domain_id": "EN-Y3-D006",
      "objective_text": "draft and write by composing and rehearsing sentences orally (including dialogue), progressively building a varied and rich vocabulary and an increasing range of sentence structures (English Appendix 2)",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O042",
      "domain_id": "EN-Y3-D006",
      "objective_text": "draft and write by organising paragraphs around a theme",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O043",
      "domain_id": "EN-Y3-D006",
      "objective_text": "draft and write by creating settings, characters and plot in narratives",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O044",
      "domain_id": "EN-Y3-D006",
      "objective_text": "draft and write by using simple organisational devices [for example, headings and sub-headings] in non-narrative material",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O045",
      "domain_id": "EN-Y3-D006",
      "objective_text": "evaluate and edit by assessing the effectiveness of their own and others' writing and suggesting improvements",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O046",
      "domain_id": "EN-Y3-D006",
      "objective_text": "evaluate and edit by proposing changes to grammar and vocabulary to improve consistency, including the accurate use of pronouns in sentences",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O047",
      "domain_id": "EN-Y3-D006",
      "objective_text": "evaluate and edit by proof-reading for spelling and punctuation errors",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O048",
      "domain_id": "EN-Y3-D006",
      "objective_text": "read aloud their own writing, to a group or the whole class, using appropriate intonation and controlling the tone and volume so that the meaning is clear",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O049",
      "domain_id": "EN-Y3-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by extending the range of sentences with more than one clause by using a wider range of conjunctions, including when, if, because, although",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O050",
      "domain_id": "EN-Y3-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by using the present perfect form of verbs in contrast to the past tense",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O051",
      "domain_id": "EN-Y3-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by choosing nouns or pronouns appropriately for clarity and cohesion and to avoid repetition",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O052",
      "domain_id": "EN-Y3-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by using conjunctions, adverbs and prepositions to express time and cause",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O053",
      "domain_id": "EN-Y3-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by using fronted adverbials",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O054",
      "domain_id": "EN-Y3-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by learning the grammar for years 3 and 4 in English Appendix 2",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O055",
      "domain_id": "EN-Y3-D007",
      "objective_text": "indicate grammatical and other features by using commas after fronted adverbials",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O056",
      "domain_id": "EN-Y3-D007",
      "objective_text": "indicate grammatical and other features by indicating possession by using the possessive apostrophe with plural nouns",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O057",
      "domain_id": "EN-Y3-D007",
      "objective_text": "indicate grammatical and other features by using and punctuating direct speech",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O058",
      "domain_id": "EN-Y3-D007",
      "objective_text": "use and understand the grammatical terminology in English Appendix 2 accurately and appropriately when discussing their writing and reading",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O059",
      "domain_id": "EN-Y3-D007",
      "objective_text": "form nouns using a range of prefixes [for example super-, anti-, auto-] (Year 3 Appendix 2 content)",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O060",
      "domain_id": "EN-Y3-D007",
      "objective_text": "use of the forms a or an according to whether the next word begins with a consonant or a vowel (Year 3 Appendix 2 content)",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O061",
      "domain_id": "EN-Y3-D007",
      "objective_text": "word families based on common words, showing how words are related in form and meaning [for example, solve, solution, solver, dissolve, insoluble] (Year 3 Appendix 2 content)",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O062",
      "domain_id": "EN-Y3-D007",
      "objective_text": "expressing time, place and cause using conjunctions [for example, when, before, after, while, so, because], adverbs [for example, then, next, soon, therefore], or prepositions [for example, before, after, during, in, because of] (Year 3 Appendix 2 content)",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O063",
      "domain_id": "EN-Y3-D007",
      "objective_text": "introduction to paragraphs as a way to group related material (Year 3 Appendix 2 content)",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O064",
      "domain_id": "EN-Y3-D007",
      "objective_text": "headings and sub-headings to aid presentation (Year 3 Appendix 2 content)",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O065",
      "domain_id": "EN-Y3-D007",
      "objective_text": "use of the present perfect form of verbs instead of the simple past [for example, He has gone out to play contrasted with He went out to play] (Year 3 Appendix 2 content)",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O066",
      "domain_id": "EN-Y3-D007",
      "objective_text": "introduction to inverted commas to punctuate direct speech (Year 3 Appendix 2 content)",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y3-O067",
      "domain_id": "EN-Y3-D007",
      "objective_text": "Year 3 terminology for pupils: preposition, conjunction, word family, prefix, clause, subordinate clause, direct speech, consonant, consonant letter, vowel, vowel letter, inverted commas (or 'speech marks')",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    }
  ],
  "concepts": [
    {
      "concept_id": "EN-Y3-C001",
      "domain_id": "EN-Y3-D001",
      "concept_name": "Active listening and appropriate response",
      "description": "Pupils develop active listening skills and respond appropriately in different social and learning contexts, including responding to teacher instructions and peer contributions",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_guidance": "Build on KS1 listening by increasing the complexity of what children listen to and respond to — longer passages, multi-step instructions, and sustained partner discussions. Teach active listening strategies: make eye contact, nod, ask a follow-up question. Use think-pair-share routines so children rehearse their response with a partner before contributing to class discussion. Provide sentence stems for responses: 'I agree because...', 'I would add that...', 'Can you explain what you mean by...?'",
      "key_vocabulary": "active listening, respond, relevant, appropriate, follow up, eye contact, body language, contribute",
      "common_misconceptions": "Children may respond to a discussion prompt with an unrelated personal anecdote rather than addressing what was said. They may hear the last thing said but miss the overall point of a longer explanation. Some children respond immediately without processing, giving superficial or repetitive answers."
    },
    {
      "concept_id": "EN-Y3-C002",
      "domain_id": "EN-Y3-D001",
      "concept_name": "Questioning to extend understanding",
      "description": "Pupils formulate and ask relevant questions that deepen their understanding of topics and texts",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_guidance": "Teach children to ask questions that genuinely extend their understanding, not just factual recall questions. Model higher-order questioning during shared reading: 'Why do you think the author chose this word?', 'What would have happened if...?' Use Bloom's taxonomy question stems displayed in the classroom. Practise generating questions before, during and after reading. Teach children to distinguish between 'thin' questions (one right answer) and 'thick' questions (multiple possible answers requiring discussion).",
      "key_vocabulary": "question, enquiry, why, how, what if, wonder, investigate, extend, understanding, explore",
      "common_misconceptions": "Children often default to closed, factual questions rather than open-ended ones that promote deeper thinking. They may ask questions to which they already know the answer. Some children confuse questioning with guessing and feel embarrassed if their question reveals a gap in understanding."
    },
    {
      "concept_id": "EN-Y3-C003",
      "domain_id": "EN-Y3-D001",
      "concept_name": "Vocabulary building strategies",
      "description": "Pupils actively develop their vocabulary through discussion, reading, using dictionaries and explicit learning strategies, including collecting and using new vocabulary",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_guidance": "Teach explicit vocabulary-building strategies: using context clues to infer meaning, looking at word parts (prefixes, suffixes, root words), consulting a dictionary, and discussing shades of meaning between synonyms. Introduce 2-3 new words per text during guided and shared reading. Encourage children to collect interesting words in vocabulary journals. Use word-of-the-day or word-of-the-week routines with opportunities to use the new word in speech and writing throughout the day.",
      "key_vocabulary": "vocabulary, context clue, meaning, synonym, word part, dictionary, definition, precise, varied",
      "common_misconceptions": "Children may skip unfamiliar words rather than using strategies to work out their meaning. They may assume a word has only one meaning and not consider alternative definitions. Some children learn definitions without understanding how to use the word in context, leading to awkward or incorrect usage in their own writing."
    },
    {
      "concept_id": "EN-Y3-C004",
      "domain_id": "EN-Y3-D001",
      "concept_name": "Articulating and justifying opinions",
      "description": "Pupils express their views clearly and provide reasons to support their thinking, justifying answers and arguments with evidence",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_guidance": "Develop children's ability to state and defend a position using evidence. Teach the structure: state your opinion, give a reason, provide evidence or an example. Use discussion topics linked to texts being read: 'Do you think the character made the right decision? Give your reasons.' Practise in debates with simple structures where each child must state a position and give at least one supporting reason. Model the language of reasoned argument: 'firstly', 'in my opinion', 'the evidence for this is'.",
      "key_vocabulary": "opinion, justify, reason, evidence, because, I believe, in my view, firstly, support, argue",
      "common_misconceptions": "Children may state strong opinions without any supporting reasoning. They may confuse personal preference with reasoned argument ('I think it's good because I like it'). Some children find it difficult to consider alternative viewpoints or to change their mind in response to new evidence."
    },
    {
      "concept_id": "EN-Y3-C005",
      "domain_id": "EN-Y3-D001",
      "concept_name": "Structured spoken descriptions and explanations",
      "description": "Pupils organise their spoken contributions with clear structure appropriate to different purposes, including describing settings, explaining processes and retelling stories",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_guidance": "Teach children to give well-structured spoken descriptions, explanations and narratives using scaffolds such as: 'First... then... finally...' for sequences, 'It looks like... It feels like...' for descriptions, and 'The reason is... This is because...' for explanations. Provide opportunities to describe objects, pictures and experiences to a partner or group. Model structured talk yourself, pointing out how you organise what you say. Use talk frames displayed in the classroom for reference.",
      "key_vocabulary": "describe, explain, sequence, structure, firstly, then, next, because, detail, clearly, organise",
      "common_misconceptions": "Children may give rambling, unstructured descriptions that jump between points. They may include irrelevant detail while omitting key information. Some children speak too quickly or in incomplete sentences when giving explanations, assuming the listener shares their knowledge and can fill in gaps."
    },
    {
      "concept_id": "EN-Y3-C006",
      "domain_id": "EN-Y3-D001",
      "concept_name": "Collaborative conversation",
      "description": "Pupils engage in extended discussions, staying focused on the topic, initiating and responding to contributions, and maintaining attention",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_guidance": "Teach collaborative conversation skills by establishing group talk expectations: take turns, build on others' ideas, challenge politely, ask for clarification. Use structured group talk activities such as 'envoys' (one group member visits another group to share ideas), 'jigsaw' (each group member researches one aspect), and 'snowball' (pairs join fours, fours join eights). Assign roles within groups (speaker, listener, recorder, reporter) to ensure equitable participation.",
      "key_vocabulary": "collaborate, group, build on, agree, disagree, add to, take turns, role, recorder, reporter",
      "common_misconceptions": "Children may think collaboration means agreeing with everyone rather than constructively engaging with different ideas. Dominant speakers may assume a leadership role while quieter children disengage. Some groups focus on completing a task quickly rather than ensuring all members contribute and understand."
    },
    {
      "concept_id": "EN-Y3-C007",
      "domain_id": "EN-Y3-D001",
      "concept_name": "Exploratory talk",
      "description": "Pupils use talk to think aloud, speculate, hypothesise and explore ideas, using spoken language to develop understanding",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_guidance": "Teach exploratory talk — the kind of talk where children think aloud, try out ideas, speculate and hypothesise without the pressure of being right. Create a safe environment where tentative suggestions are valued: 'What if...', 'Maybe...', 'I'm not sure but I think...'. Use philosophy for children (P4C) sessions and open-ended discussion prompts linked to texts. Distinguish between presentational talk (polished, for an audience) and exploratory talk (rough, for thinking through ideas).",
      "key_vocabulary": "explore, wonder, what if, maybe, perhaps, I'm not sure, try out, think aloud, possible, idea",
      "common_misconceptions": "Children may feel that they must have a definitive answer before speaking, which inhibits exploratory talk. They may dismiss tentative ideas from peers as 'wrong'. Some children confuse exploratory talk with off-topic chatter. Others are reluctant to speculate because they fear being incorrect."
    },
    {
      "concept_id": "EN-Y3-C008",
      "domain_id": "EN-Y3-D001",
      "concept_name": "Audible and fluent speech",
      "description": "Pupils develop clear, fluent speech and begin to use Standard English forms appropriately, with appropriate volume for different contexts",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach children to speak audibly and fluently in different contexts: partner work, small group discussion, class presentations and performing to an audience. Use voice projection exercises and practise speaking clearly without shouting. Teach children to vary their pace and volume for effect. Provide opportunities for purposeful speaking: show-and-tell, book recommendations, presenting research to the class. Give specific feedback on clarity and fluency rather than just content.",
      "key_vocabulary": "audible, fluent, clear, volume, pace, project, audience, speak up, expression, articulate",
      "common_misconceptions": "Children may speak too quietly in whole-class settings because they are self-conscious, or too loudly in small groups because they are excited. They may speak too fast when nervous, making their speech difficult to follow. Some children are fluent in casual conversation but become halting and stilted when speaking in formal or presentational contexts."
    },
    {
      "concept_id": "EN-Y3-C009",
      "domain_id": "EN-Y3-D001",
      "concept_name": "Spoken performance and drama",
      "description": "Pupils engage in a variety of spoken language activities including debates, presentations, role play, improvisations and performances, developing familiarity with a greater variety of situations, audiences and purposes",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Use drama techniques to explore texts and develop spoken language: hot-seating (children answer questions in character), freeze-frame (creating still images of key moments), thought-tracking (speaking a character's inner thoughts aloud), and conscience alley (the class lines up to voice arguments for and against a character's decision). Link drama to writing by having children write in role after a drama session. Teach children to use voice, gesture and movement to convey character and emotion.",
      "key_vocabulary": "drama, perform, character, role, voice, gesture, expression, hot-seat, freeze-frame, in role",
      "common_misconceptions": "Children may perform actions without verbal language, relying on mime rather than developing spoken responses in role. They may break character frequently or find it difficult to respond spontaneously as a character. Some children treat drama as play rather than a structured learning activity with clear objectives."
    },
    {
      "concept_id": "EN-Y3-C010",
      "domain_id": "EN-Y3-D001",
      "concept_name": "Audience engagement",
      "description": "Pupils develop awareness of their audience and adjust their speaking to engage and maintain listeners' interest",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach children to engage an audience by making eye contact, using appropriate gestures, varying vocal tone and pace, and organising their content logically. Practise with show-and-tell, book recommendations and mini-presentations. Use video recording so children can observe their own performance and identify areas for improvement. Provide a simple framework for presentations: tell them what you'll talk about, give your main points, end with a summary or question for the audience.",
      "key_vocabulary": "audience, engage, eye contact, gesture, tone, pace, present, perform, beginning, ending, hook",
      "common_misconceptions": "Children may read from notes without looking up, losing audience engagement. They may speak in a monotone or too quietly for the audience to hear. Some children focus entirely on getting through their content without considering whether the audience understands or is interested."
    },
    {
      "concept_id": "EN-Y3-C011",
      "domain_id": "EN-Y3-D001",
      "concept_name": "Evaluating different viewpoints",
      "description": "Pupils listen to and build on others' contributions while considering alternative perspectives",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "teaching_guidance": "Teach children to consider different viewpoints when discussing texts, events or issues. Use activities where children must argue a position they do not personally hold. In guided reading, ask 'How do you think the other character felt?', 'Can you understand why they did that even if you disagree?' Use simple debate structures where children hear both sides before forming their own view. Model evaluating viewpoints: 'That's an interesting point because..., but I also think...'",
      "key_vocabulary": "viewpoint, opinion, perspective, agree, disagree, both sides, consider, reason, evidence, fair",
      "common_misconceptions": "Children may struggle to separate their own view from a character's perspective. They may dismiss alternative viewpoints rather than engaging with them. Some children change their position every time they hear a new argument, without weighing the strength of different reasons."
    },
    {
      "concept_id": "EN-Y3-C012",
      "domain_id": "EN-Y3-D001",
      "concept_name": "Register and audience awareness",
      "description": "Pupils begin to adjust their language choices for different audiences and purposes, understanding differences between spoken and written language and between formal and informal registers",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Begin developing awareness that spoken language changes depending on audience and situation. Contrast informal talk with friends and more formal talk with adults or in presentations. Discuss examples: 'How would you ask a friend to play? How would you ask the head teacher for permission?' Use role-play to practise switching between registers. Connect to writing by discussing how written language is typically more formal than spoken language, and how the audience for writing affects word choice and tone.",
      "key_vocabulary": "register, formal, informal, audience, appropriate, polite, casual, situation, tone, adjust",
      "common_misconceptions": "Children may not realise that they already adjust their language for different audiences and situations. They may think formal language means using long or complicated words rather than adjusting tone, vocabulary and sentence structure appropriately. Some children use very informal or colloquial language in all contexts."
    },
    {
      "concept_id": "EN-Y3-C013",
      "domain_id": "EN-Y3-D002",
      "concept_name": "Root words for reading and meaning",
      "description": "Pupils use understanding of root words to decode unfamiliar words and comprehend their meaning, applying growing knowledge of morphology to read aloud and understand new words",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_guidance": "Build on KS1 root word knowledge by explicitly teaching how knowing a root word helps read and understand unfamiliar words. Use word webs showing families derived from a single root (e.g., 'help' → helpful, unhelpful, helpless, helper, helping). When children encounter unfamiliar words in reading, prompt them to look for a root word they recognise. Connect to the Year 3 prefixes and suffixes work by showing how roots combine with affixes to create new words with related meanings.",
      "key_vocabulary": "root word, base word, word family, meaning, related, build, prefix, suffix, recognise, derive",
      "common_misconceptions": "Children may misidentify root words by stripping off parts that are not actually affixes (e.g., thinking 'carpet' has the root 'car'). They may not realise that root words carry the core meaning and that affixes modify it. Some children recognise root words in isolation but do not apply this knowledge when encountering derived forms in reading."
    },
    {
      "concept_id": "EN-Y3-C014",
      "domain_id": "EN-Y3-D002",
      "concept_name": "Prefixes and suffixes (etymology and morphology)",
      "description": "Pupils understand how prefixes and suffixes change word meanings and use this to read and comprehend new words, including prefixes dis-, mis-, in-, il-, im-, ir-, re-, sub-, inter-, super-, anti-, auto- and suffixes -ation, -ly, -ous",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "teaching_guidance": "Teach the Year 3 prefixes (un-, dis-, mis-, re-, pre-, anti-, auto-, super-, sub-) and suffixes (-tion, -sion, -ly, -ous, -ment, -ness, -ful, -less) systematically, exploring how each affix changes meaning or word class. Group prefixes by meaning: negation (un-, dis-, mis-), repetition (re-), position (super-, sub-), self (auto-). Use word-building activities: give children root words and a set of affixes to combine. Connect morphology to reading comprehension — knowing word parts helps decode unfamiliar words.",
      "key_vocabulary": "prefix, suffix, morphology, etymology, word part, meaning, un-, dis-, re-, -tion, -ly, -ous",
      "common_misconceptions": "Children may add affixes incorrectly, creating non-existent words. They may not understand that some affixes change the word class (e.g., adding -ly to an adjective creates an adverb). Some children confuse prefixes with suffixes or think that any group of letters at the start of a word is a prefix."
    },
    {
      "concept_id": "EN-Y3-C015",
      "domain_id": "EN-Y3-D002",
      "concept_name": "Exception words (Years 3-4)",
      "description": "Pupils read words with unusual spelling-sound correspondences from the Years 3-4 word list, noting where unusual patterns occur in words",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach the Years 3-4 exception words through regular, systematic practice. Use look-say-cover-write-check, dictation, word sorts, and mnemonics. Display the words in the classroom and refer to them during writing. Group exception words by common patterns where possible (e.g., words with 'ough': though, thought, through; words with silent letters: island, knowledge). Assess regularly through dictation sentences that include several exception words in context.",
      "key_vocabulary": "exception word, statutory word, learn, remember, practise, spelling, tricky, pattern, dictation",
      "common_misconceptions": "Children may spell exception words phonetically (e.g., 'bizness' for 'business', 'diffrent' for 'different'). They may learn to recognise the words when reading but not be able to spell them from memory. Some children assume that all difficult words are exception words, when in fact many follow morphological or etymological patterns."
    },
    {
      "concept_id": "EN-Y3-C016",
      "domain_id": "EN-Y3-D002",
      "concept_name": "Decoding strategies for longer words",
      "description": "Pupils try different pronunciations of longer unfamiliar words to match them to vocabulary they have heard but not seen in print",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach strategies for decoding longer, multi-syllabic words: breaking words into syllables, identifying root words within longer words, using knowledge of prefixes and suffixes, and reading through the whole word rather than guessing from the first few letters. Model the decoding process with unfamiliar words encountered in shared reading. Use activities where children physically divide written words into syllables. Ensure children know that they should focus on all the letters in a word, not just the beginning.",
      "key_vocabulary": "decode, multi-syllabic, syllable, break up, root word, prefix, suffix, sound out, read through",
      "common_misconceptions": "Children often guess at longer words based on the first syllable, producing errors that sound plausible but are incorrect (e.g., reading 'interesting' as 'international'). They may skip unfamiliar words entirely rather than attempting to decode them. Some children try to decode every word phoneme by phoneme rather than recognising larger chunks."
    },
    {
      "concept_id": "EN-Y3-C017",
      "domain_id": "EN-Y3-D003",
      "concept_name": "Wide reading for positive attitudes",
      "description": "Pupils develop positive attitudes to reading through exposure to diverse high-quality texts including fiction, poetry, plays, non-fiction and reference books",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Foster positive attitudes to reading by providing access to a wide range of texts (fiction, non-fiction, poetry, graphic novels, magazines) and ensuring daily time for independent reading. Create an inviting reading environment with comfortable spaces and regularly updated book displays. Use book recommendations from peers and adults. Read aloud to the class daily from high-quality texts that children might not choose themselves. Respect children's reading choices while also broadening their repertoire through guided reading and class novels.",
      "key_vocabulary": "reading for pleasure, fiction, non-fiction, poetry, genre, favourite, author, recommend, wide reading",
      "common_misconceptions": "Children may develop fixed genre preferences and resist reading outside their comfort zone. Some children believe reading is only 'proper reading' if it involves chapter books, dismissing comics, poetry and non-fiction. Others may pretend to read during independent reading time without actually engaging with the text."
    },
    {
      "concept_id": "EN-Y3-C018",
      "domain_id": "EN-Y3-D003",
      "concept_name": "Reading for different purposes",
      "description": "Pupils experience and understand different text structures and read for a range of purposes, including pleasure and information",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach children that reading serves different purposes and that they should adapt their reading approach accordingly. Model reading for information (scanning, skimming, using contents and index), reading for pleasure (sustained, immersive reading), and reading to learn (close reading, rereading, note-taking). Provide authentic purposes for reading: following instructions to make something, researching a topic, reading a story for enjoyment, reading a poem to perform. Discuss the difference between these approaches explicitly.",
      "key_vocabulary": "purpose, information, pleasure, learn, scan, skim, close reading, contents, index, non-fiction",
      "common_misconceptions": "Children may read all texts in the same way regardless of purpose — reading an information text from start to finish instead of using the contents page to find relevant sections. They may not understand that different text types have different structures designed for different purposes."
    },
    {
      "concept_id": "EN-Y3-C019",
      "domain_id": "EN-Y3-D003",
      "concept_name": "Dictionary use for reading comprehension",
      "description": "Pupils develop dictionary skills to independently find the meaning of words encountered in reading, using alphabetical order and first two or three letters",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_guidance": "Teach dictionary skills systematically in Year 3: using alphabetical order to the second and third letter to locate words quickly, reading definitions and selecting the appropriate meaning when multiple senses are given, and using the dictionary as a reading comprehension tool. Model looking up unfamiliar words encountered in shared reading. Teach children to read around the word first to see if context provides sufficient clues, using the dictionary to confirm or correct their inference.",
      "key_vocabulary": "dictionary, alphabetical order, definition, meaning, entry, look up, word, headword, guide word",
      "common_misconceptions": "Children may look up every unfamiliar word, disrupting the flow of reading, rather than using context first and the dictionary to confirm. They may select the first definition listed without checking whether it fits the context. Some children struggle with alphabetical order beyond the first letter, making dictionary searches slow and frustrating."
    },
    {
      "concept_id": "EN-Y3-C020",
      "domain_id": "EN-Y3-D003",
      "concept_name": "Fairy stories, myths and legends",
      "description": "Pupils build familiarity with traditional literature including fairy stories, myths and legends from various traditions, and retell some of these orally",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Introduce and explore fairy stories, myths and legends as distinct literary forms. Teach the conventions of each: fairy stories have magic, good vs evil, repeated patterns ('Once upon a time...'); myths explain natural phenomena and involve gods or supernatural beings; legends are stories about heroic or historical figures that may have some basis in truth. Read examples from different cultures. Discuss how these stories pass down cultural values and beliefs. Use as models for children's own writing.",
      "key_vocabulary": "fairy story, myth, legend, traditional tale, character, hero, villain, moral, magic, convention, retell",
      "common_misconceptions": "Children often use 'fairy tale', 'myth' and 'legend' interchangeably without understanding the distinctions. They may think myths are simply 'untrue stories' rather than narratives that served cultural or explanatory purposes. Some children assume all traditional stories come from one culture."
    },
    {
      "concept_id": "EN-Y3-C021",
      "domain_id": "EN-Y3-D003",
      "concept_name": "Themes and conventions in books",
      "description": "Pupils recognise common themes (e.g. good vs evil, triumph, use of magical devices) and understand genre conventions in a wide range of books",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach children to identify themes (the underlying ideas or messages in a text, such as friendship, bravery, jealousy) and conventions (the typical features of a genre, such as the quest structure in adventure stories or the 'once upon a time' opening in fairy tales). Use explicit teaching: 'The theme of this story is friendship because...' Provide graphic organisers where children record evidence of themes across a text. Compare themes across different texts read during the term.",
      "key_vocabulary": "theme, convention, genre, message, moral, pattern, idea, feature, example, evidence, compare",
      "common_misconceptions": "Children often confuse the theme with the plot, stating what happens rather than what the story is about at a deeper level. They may identify a theme without providing supporting evidence from the text. Some children think a story can have only one theme."
    },
    {
      "concept_id": "EN-Y3-C022",
      "domain_id": "EN-Y3-D003",
      "concept_name": "Poetry and play performance",
      "description": "Pupils prepare and perform poems and play scripts showing understanding through intonation, tone, volume and action, using drama approaches to explore meaning",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Provide regular opportunities for children to rehearse and perform poems and play scripts. Teach performance skills: using voice (volume, pace, pause, intonation) and body (gesture, movement, facial expression) to bring a text to life. Begin with choral speaking of poems before moving to individual or small-group performances. Discuss how a performer's choices affect the audience's experience. Use readers' theatre with play scripts, assigning roles and practising expressive reading before performing to an audience.",
      "key_vocabulary": "perform, rehearse, expression, intonation, volume, pace, gesture, audience, script, poem, voice",
      "common_misconceptions": "Children may recite poems or read scripts in a flat monotone without expression. They may rush through a performance because of nervousness. Some children focus on memorisation at the expense of expression and meaning. Others may add exaggerated actions that distract from the text rather than enhancing it."
    },
    {
      "concept_id": "EN-Y3-C023",
      "domain_id": "EN-Y3-D003",
      "concept_name": "Effective language in texts",
      "description": "Pupils identify and appreciate effective language choices, discussing words and phrases that capture the reader's interest and imagination",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach children to identify and discuss the effect of writers' language choices. During shared reading, highlight specific words and phrases, asking: 'Why did the author choose this word? What effect does it have? What picture does it create in your mind?' Introduce the concept of word choice as a deliberate authorial decision. Model identifying powerful verbs, precise adjectives, and figurative language. Encourage children to 'magpie' effective language from their reading for use in their own writing.",
      "key_vocabulary": "language, word choice, effect, powerful, vivid, author, writer, describe, imagine, create, picture",
      "common_misconceptions": "Children may describe language as 'good' or 'nice' without being able to explain what makes it effective. They may focus on finding 'wow words' (long or unusual words) rather than understanding how well-chosen simple words can also be powerful. Some children do not connect their analysis of language in reading to their own writing choices."
    },
    {
      "concept_id": "EN-Y3-C024",
      "domain_id": "EN-Y3-D003",
      "concept_name": "Forms of poetry",
      "description": "Pupils recognise and understand different poetic forms and their characteristics, including free verse and narrative poetry",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach children to recognise and appreciate different forms of poetry: rhyming poetry, free verse, haiku, kennings, acrostic, concrete/shape poems, narrative poetry, limericks and nonsense verse. Read a wide range of poetry aloud, discussing how the form shapes the content. Encourage children to learn poems by heart. Teach children to write in different poetic forms, providing clear models and frameworks. Display poetry in the classroom and make poetry anthologies available for independent reading.",
      "key_vocabulary": "poem, verse, rhyme, rhythm, stanza, haiku, limerick, free verse, acrostic, pattern, form, poet",
      "common_misconceptions": "Children may think all poetry must rhyme. They may not appreciate that poetry has different forms with different rules and conventions. Some children think poetry is simply short prose with line breaks. Others may feel they cannot write poetry because they cannot find rhyming words."
    },
    {
      "concept_id": "EN-Y3-C025",
      "domain_id": "EN-Y3-D003",
      "concept_name": "Comprehension monitoring",
      "description": "Pupils check that text makes sense, re-reading when unclear and using context to understand the meaning of words",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach comprehension monitoring — the ability to notice when meaning breaks down and to take corrective action. Model the inner voice of a reader: 'Wait, that doesn't make sense. Let me reread that sentence.' Teach specific fix-up strategies: rereading the sentence, reading on to see if meaning becomes clear, looking at pictures or diagrams, breaking down unfamiliar words, and asking for help. Use think-alouds during shared reading to demonstrate monitoring in action.",
      "key_vocabulary": "check, monitor, make sense, reread, understand, confused, fix up, strategy, notice, meaning",
      "common_misconceptions": "Children often continue reading past points of confusion without noticing that comprehension has broken down. They may not realise that rereading is a legitimate and effective strategy rather than a sign of failure. Some children monitor for individual word accuracy but not for overall meaning."
    },
    {
      "concept_id": "EN-Y3-C026",
      "domain_id": "EN-Y3-D003",
      "concept_name": "Questions to improve reading comprehension",
      "description": "Pupils formulate questions to deepen comprehension of texts, asking about characters, events, author intentions and unclear parts",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach children to generate their own questions about texts as a comprehension strategy. Model questioning before, during and after reading: 'Before I read, I wonder...', 'As I read this paragraph, I'm wondering...', 'Now I've finished, I still want to know...' Use question stems displayed in the classroom. Teach the difference between literal questions (answered directly in the text) and inferential questions (requiring the reader to draw conclusions). Use reciprocal reading where the 'questioner' role is rotated.",
      "key_vocabulary": "question, wonder, why, how, what if, literal, inferential, understand, comprehension, curious",
      "common_misconceptions": "Children may ask questions that can be answered by simply rereading the text rather than questions that deepen understanding. They may confuse asking questions with testing each other on recall. Some children do not see questioning as a reading strategy, viewing it as something the teacher does."
    },
    {
      "concept_id": "EN-Y3-C027",
      "domain_id": "EN-Y3-D003",
      "concept_name": "Drawing inferences with evidence",
      "description": "Pupils read between the lines to infer characters' feelings, thoughts and motives from their actions, justifying inferences with evidence from the text",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Develop inference skills by teaching children to combine information from the text with their own knowledge to draw conclusions. Use the PEE structure: Point (what you infer), Evidence (quote from the text), Explanation (how the evidence supports your inference). Start with character feelings and motivations: 'How does the character feel? What in the text tells you that?' Use visual texts (picture books, illustrated stories) alongside written texts to practise inference. Teach the language of inference: 'This suggests...', 'This implies...', 'I think this because...'",
      "key_vocabulary": "infer, inference, evidence, clue, suggest, imply, because, I think, the text says, this shows",
      "common_misconceptions": "Children often state feelings or thoughts without linking them to evidence from the text. They may confuse inference with prediction or simply retell what the text says explicitly. Some children make inferences that are unsupported by the text, drawing on personal experience rather than textual evidence."
    },
    {
      "concept_id": "EN-Y3-C028",
      "domain_id": "EN-Y3-D003",
      "concept_name": "Prediction from stated and implied detail",
      "description": "Pupils use explicit and implicit textual clues to make reasoned predictions about plot and character",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach prediction as an ongoing reading strategy, not just a pre-reading activity. Encourage children to predict at key points in a text: 'Based on what has happened so far, what do you think will happen next? Why?' Teach children to use both stated information (what the text says explicitly) and implied information (what can be inferred) to support their predictions. After reading on, revisit predictions: 'Were we right? What actually happened? What clues did we miss?'",
      "key_vocabulary": "predict, prediction, clue, evidence, expect, because, based on, I think, confirm, revise",
      "common_misconceptions": "Children may make predictions based on personal preference ('I think the dog will be rescued because I like dogs') rather than textual evidence. They may not distinguish between a prediction (based on evidence) and a guess (random). Some children make predictions but never check them against what actually happens."
    },
    {
      "concept_id": "EN-Y3-C029",
      "domain_id": "EN-Y3-D003",
      "concept_name": "Identifying and summarising main ideas",
      "description": "Pupils extract key information across multiple paragraphs, identifying main ideas and creating brief summaries",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "teaching_guidance": "Teach summarising by modelling how to identify the main idea of a paragraph or section and distinguish it from supporting details. Use the strategy: 'If I had to tell someone what this paragraph is about in one sentence, what would I say?' Practise with non-fiction texts where main ideas are often stated explicitly. In narrative, focus on identifying the key events rather than retelling every detail. Use graphic organisers (main idea maps, flow charts) to support summarising. Limit summaries to a set number of words or sentences.",
      "key_vocabulary": "main idea, summarise, key point, detail, important, brief, in short, retell, gist, paragraph",
      "common_misconceptions": "Children often retell a text in extensive detail rather than summarising the key points. They may confuse a main idea with an interesting detail. Some children include personal opinions in a summary rather than sticking to what the text says. Others struggle to identify the main idea when it is implied rather than stated."
    },
    {
      "concept_id": "EN-Y3-C030",
      "domain_id": "EN-Y3-D003",
      "concept_name": "Language, structure and presentation contributing to meaning",
      "description": "Pupils understand how authors use language choices, text structure and presentational features to convey meaning, including conventions of different text types",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach children to notice how language choices, text structure and presentational features contribute to meaning. In fiction, discuss how an author's vocabulary and sentence structure create mood, pace and tone. In non-fiction, discuss how headings, subheadings, bullet points, diagrams and bold text help organise and communicate information. Compare texts that present the same content differently and discuss the effect of each approach. Link to children's own writing: 'How could you organise your writing so the reader can find information easily?'",
      "key_vocabulary": "language, structure, presentation, heading, subheading, layout, diagram, bold, effect, meaning, organise",
      "common_misconceptions": "Children may not notice structural and presentational features, reading past them without understanding their purpose. They may think headings and subheadings are decorative rather than organisational. Some children struggle to articulate how language choices contribute to meaning beyond saying they are 'good' or 'interesting'."
    },
    {
      "concept_id": "EN-Y3-C031",
      "domain_id": "EN-Y3-D003",
      "concept_name": "Retrieving and recording information from non-fiction",
      "description": "Pupils locate specific information in non-fiction texts using contents pages and indexes, knowing what information they need before beginning",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_guidance": "Teach children to retrieve and record information from non-fiction texts. Model using contents pages, indexes and glossaries to locate specific information. Teach note-taking strategies: using bullet points, using own words rather than copying, and recording the source. Provide structured research tasks where children must find and record specific information. Teach the difference between retrieving (finding facts that are stated) and interpreting (working out what facts mean). Connect to cross-curricular research in history, geography and science.",
      "key_vocabulary": "retrieve, record, information, non-fiction, contents, index, glossary, notes, source, fact, research",
      "common_misconceptions": "Children often copy chunks of text verbatim rather than recording information in their own words. They may not use navigational features (contents, index) to find information efficiently, instead reading entire texts from start to finish. Some children struggle to distinguish between relevant and irrelevant information when researching a specific question."
    },
    {
      "concept_id": "EN-Y3-C032",
      "domain_id": "EN-Y3-D003",
      "concept_name": "Discussion about books",
      "description": "Pupils engage in collaborative talk about texts, taking turns, listening to others, and developing rules for effective discussion",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Create a structured discussion culture around books through guided reading discussions, book clubs and whole-class shared reading. Teach discussion skills: taking turns, building on others' contributions, referring to the text to support points, and respectfully challenging ideas. Use open-ended discussion prompts: 'What was the most important moment in this chapter?', 'Do you agree with the character's decision?', 'How does this book compare to...?' Display discussion sentence starters and encourage children to use them.",
      "key_vocabulary": "discuss, respond, opinion, evidence, agree, disagree, compare, I think, the text says, build on",
      "common_misconceptions": "Children may retell the plot during discussion rather than sharing their personal responses and interpretations. They may wait for the teacher to ask questions rather than initiating their own contributions. Some children dominate discussions while others contribute little without explicit turn-taking structures."
    },
    {
      "concept_id": "EN-Y3-C033",
      "domain_id": "EN-Y3-D003",
      "concept_name": "Silent reading with understanding",
      "description": "Pupils develop the ability to read silently while maintaining comprehension, developing stamina for sustained independent reading",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Develop the transition from reading aloud to independent silent reading. Ensure children have daily silent reading time with appropriately challenging texts. Teach children to maintain concentration during sustained silent reading, starting with short periods (5-10 minutes) and gradually extending. Monitor comprehension of silently read texts through brief discussions, reading journals or comprehension questions. Ensure children are reading texts they can decode accurately (at least 95% accuracy) so that comprehension is not undermined by word-level difficulties.",
      "key_vocabulary": "silent reading, independent, concentrate, sustain, comprehension, focus, meaning, understand, engage",
      "common_misconceptions": "Children may appear to be reading silently but actually be skimming or turning pages without engaging with meaning. Some children mouth words or whisper during silent reading because they have not yet internalised the transition from oral to silent reading. Others choose texts that are too difficult for independent reading, undermining comprehension."
    },
    {
      "concept_id": "EN-Y3-C034",
      "domain_id": "EN-Y3-D004",
      "concept_name": "Prefixes and suffixes spelling rules",
      "description": "Pupils apply spelling rules for adding prefixes and suffixes to root words, including rules for dis-, mis-, in- (and variants il-, im-, ir-), re-, sub-, inter-, super-, anti-, auto-, -ation and -ly",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach the Year 3 prefix and suffix spelling rules systematically. Key prefixes: un-, dis-, mis-, re-, pre-, anti-, auto-, super-, sub- — teach that the spelling of the root word does not change when a prefix is added. Key suffixes: -ly (adjective → adverb), -ous (noun → adjective), -tion/-sion (verb → noun). Teach rules for adding suffixes that require spelling changes: dropping the final 'e' before vowel suffixes, changing 'y' to 'i', and the -tion/-sion patterns. Use word-sorting and word-building activities.",
      "key_vocabulary": "prefix, suffix, root word, spelling rule, un-, dis-, mis-, re-, -ly, -ous, -tion, -sion, word part",
      "common_misconceptions": "Children may incorrectly change the root word's spelling when adding a prefix (e.g., writing 'dissappoint' instead of 'disappoint'). They may forget to drop the final 'e' before a vowel suffix (e.g., 'hopeing' for 'hoping'). The -tion/-sion distinction is challenging because both produce a similar sound."
    },
    {
      "concept_id": "EN-Y3-C035",
      "domain_id": "EN-Y3-D004",
      "concept_name": "Suffix doubling rules for polysyllabic words",
      "description": "Pupils apply the rule for doubling final consonants in stressed syllables before vowel suffixes (forgetting, preferred, beginning) and not doubling in unstressed syllables (gardening, limiting)",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach the consonant doubling rule for polysyllabic words: when adding a vowel suffix (-ing, -ed, -er, -est) to a word where the last syllable is stressed and ends in a single consonant after a single vowel, double the final consonant (e.g., begin → beginning, forget → forgetting, prefer → preferred). Contrast with words where the last syllable is not stressed, where doubling does not occur (e.g., garden → gardening, visit → visiting). Use sorting activities to practise identifying when doubling is needed.",
      "key_vocabulary": "double, consonant, suffix, stressed syllable, -ing, -ed, polysyllabic, rule, single vowel",
      "common_misconceptions": "Children often apply the doubling rule inconsistently, sometimes doubling when they should not (e.g., 'enterring') or failing to double when they should (e.g., 'begining'). They may not understand the concept of syllable stress, making it difficult to apply the rule by ear. Some children over-generalise, doubling consonants in all words when adding suffixes."
    },
    {
      "concept_id": "EN-Y3-C036",
      "domain_id": "EN-Y3-D004",
      "concept_name": "Homophones (Years 3-4)",
      "description": "Pupils correctly spell pairs and groups of words that sound the same but have different meanings and spellings, including accept/except, affect/effect, brake/break, grate/great, weather/whether and others from the Years 3-4 list",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach the Years 3-4 homophones and near-homophones systematically: accept/except, affect/effect, ball/bawl, berry/bury, brake/break, fair/fare, grate/great, groan/grown, heel/heal/he'll, knot/not, mail/male, main/mane, meat/meet, medal/meddle, missed/mist, peace/piece, plain/plane, rain/reign/rein, scene/seen, weather/whether, whose/who's. Teach each pair with clear definitions, pictures and example sentences. Practise through cloze exercises where children choose the correct homophone.",
      "key_vocabulary": "homophone, same sound, different meaning, different spelling, pair, context, choose, which one",
      "common_misconceptions": "Children frequently select the more familiar spelling regardless of meaning (e.g., always writing 'there' instead of distinguishing 'their' and 'they're'). They may not check which meaning is intended when writing. Some children do not hear any difference between near-homophones and therefore do not understand why two spellings exist."
    },
    {
      "concept_id": "EN-Y3-C037",
      "domain_id": "EN-Y3-D004",
      "concept_name": "Spelling patterns from various etymologies",
      "description": "Pupils learn specific spelling patterns from Greek, Latin and French origins including: /i/ spelt y (myth, gym), /u/ spelt ou (young), -ous suffix, -sure/-ture endings, -sion/-tion/-ssion/-cian endings, ch spelt Greek-style (chorus, scheme), ch spelt French-style (chef, machine), -gue/-que endings, sc for /s/ (science), ei/eigh/ey for /ei/ (vein, eight)",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach spelling patterns that derive from different etymological origins of English words. Key Year 3 patterns include: the /ʃ/ sound spelt 'ch' (from French — chef, machine, brochure), the /k/ sound spelt 'ch' (from Greek — chorus, character, school), and words ending in '-gue' and '-que' (from French — league, tongue, antique, unique). Group words by their shared origin and pattern. Use etymological information to explain why these words are spelt as they are, connecting spelling to the history of the English language.",
      "key_vocabulary": "spelling pattern, origin, French, Greek, Latin, etymology, /ʃ/ sound, /k/ sound, -gue, -que",
      "common_misconceptions": "Children may apply standard English phonics rules to words of French or Greek origin, producing incorrect spellings (e.g., spelling 'machine' as 'masheen'). They may not realise that English has borrowed words from many languages, each bringing its own spelling conventions. Some children find it difficult to remember which 'ch' pattern applies to which word."
    },
    {
      "concept_id": "EN-Y3-C038",
      "domain_id": "EN-Y3-D004",
      "concept_name": "Years 3-4 statutory word list",
      "description": "Pupils learn to spell the statutory Years 3-4 word list including: accident, actual, address, answer, appear, arrive, believe, bicycle, breath, build, busy, calendar, caught, centre, century, certain, circle, complete, consider, continue, decide, describe, different, difficult, disappear, early, earth, eight, enough, exercise, experience, experiment, extreme, famous, favourite, February, forward, fruit, grammar, group, guard, guide, heard, heart, height, history, imagine, important, increase, interest, island, knowledge, learn, length, library, material, medicine, mention, minute, natural, naughty, notice, occasion, often, opposite, ordinary, particular, peculiar, perhaps, popular, position, possess, possible, potatoes, pressure, probably, promise, purpose, quarter, question, recent, regular, reign, remember, sentence, separate, special, straight, strange, strength, suppose, surprise, therefore, though, thought, through, various, weight, woman",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach the Years 3-4 statutory word list through systematic, regular practice. These words include: accident(ally), actual(ly), address, answer, appear, arrive, believe, bicycle, breath(e), build, busy/business, calendar, caught, centre, century, certain, circle, complete, consider, continue, decide, describe, different, difficult, disappear, early, earth, eight/eighth, enough, exercise, experience, experiment, extreme, famous, favourite, February, forward(s), fruit, grammar, group, guard, guide, heard, heart, height, history, imagine, important, increase, interest, island, knowledge, learn, length, library, material, medicine, mention, minute, natural, naughty, notice, occasion(ally), often, opposite, ordinary, particular, peculiar, perhaps, popular, position, possess(ion), possible, potatoes, pressure, probably, promise, purpose, quarter, question, recent, regular, reign, remember, sentence, separate, special, straight, strange, strength, suppose, surprise, therefore, though/although, thought, through, various, weight, woman/women. Use dictation, word sorts, mnemonics and regular assessment.",
      "key_vocabulary": "statutory word list, exception word, spelling, learn, practise, remember, dictation, pattern, tricky",
      "common_misconceptions": "Children may spell these words phonetically (e.g., 'bisniss' for 'business', 'anser' for 'answer'). They may confuse similar-looking words (e.g., 'though' and 'through'). Some children can read these words but cannot produce the correct spelling from memory without further practice."
    },
    {
      "concept_id": "EN-Y3-C039",
      "domain_id": "EN-Y3-D004",
      "concept_name": "Possessive apostrophe with plural nouns",
      "description": "Pupils place the possessive apostrophe accurately with regular plurals (girls', boys', babies') and irregular plurals (children's, men's, mice's)",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach the possessive apostrophe with plural nouns as a progression from the Year 2 singular possessive. Teach the rule: for regular plurals ending in -s, add an apostrophe after the 's' (the girls' coats, the dogs' leads); for irregular plurals not ending in -s, add apostrophe + s (the children's toys, the men's room). Use physical objects and labels to practise. Provide sorting activities distinguishing between plural -s, possessive 's, and plural possessive s'. Practise in the context of sentence writing.",
      "key_vocabulary": "possessive apostrophe, plural, belongs to, ownership, regular plural, irregular plural, apostrophe, s'",
      "common_misconceptions": "Children frequently confuse plural -s, singular possessive 's, and plural possessive s'. They may place the apostrophe before the -s even for plural possessives (e.g., 'the dog's leads' when meaning multiple dogs). The irregular plural possessive (children's) is particularly confusing because it follows the singular pattern."
    },
    {
      "concept_id": "EN-Y3-C040",
      "domain_id": "EN-Y3-D004",
      "concept_name": "Dictionary use for spelling",
      "description": "Pupils use the first two or three letters of a word to check and correct spellings in a dictionary, developing efficient dictionary skills",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach dictionary use for spelling: when children are unsure of a spelling, teach them to make a best guess based on their phonic and morphological knowledge, then check the dictionary. Teach strategies for looking up words when you do not know the exact spelling: try different plausible spellings, use the initial phonemes to navigate to the right section, and check words around the entry you expect. Model dictionary use for spelling regularly during shared writing. Provide age-appropriate dictionaries that are quick to navigate.",
      "key_vocabulary": "dictionary, spelling, check, look up, alphabetical order, entry, correct, guess, confirm, verify",
      "common_misconceptions": "Children may not think to use a dictionary for spelling, seeing it only as a tool for finding meanings. They may struggle to locate a word when they do not know the first few letters of the correct spelling. Some children find dictionary use too slow and disruptive to their writing flow, requiring teaching of efficient search strategies."
    },
    {
      "concept_id": "EN-Y3-C041",
      "domain_id": "EN-Y3-D004",
      "concept_name": "Writing from dictation",
      "description": "Pupils write from memory simple sentences dictated by the teacher, demonstrating application of spelling and punctuation knowledge taught so far",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Use dictation as a regular practice activity for spelling and punctuation. Read sentences aloud at a pace that allows children to write each word, drawing on their phonics, spelling rules and knowledge of exception words. Begin with short sentences using familiar vocabulary and progress to longer sentences with more challenging spellings. After dictation, children self-check against the correct version and identify errors. Dictation develops the ability to hold a sentence in working memory while applying spelling and punctuation knowledge.",
      "key_vocabulary": "dictation, listen, write, sentence, spell, punctuation, check, correct, memory, accurate",
      "common_misconceptions": "Children may struggle to hold a whole sentence in working memory, particularly if they are slow writers or if the sentence is long. They may focus on spelling at the expense of punctuation or vice versa. Some children write what they think they heard rather than using their spelling knowledge to produce the correct form."
    },
    {
      "concept_id": "EN-Y3-C042",
      "domain_id": "EN-Y3-D005",
      "concept_name": "Joining strokes in handwriting",
      "description": "Pupils use the diagonal and horizontal strokes needed to join letters and understand which letters, when adjacent, are best left unjoined",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Continue developing joined handwriting in Year 3, building on the joins introduced in Year 2. Teach all four basic joins (diagonal to ascender, diagonal to non-ascender, horizontal to ascender, horizontal to non-ascender) with fluency and consistency. Practise joining within high-frequency words and spelling words. Ensure that children can maintain correct letter formation and size while joining. Teach that some letters (capital letters, after certain letters) may need a pen lift. Practise joining in the context of independent writing, not just in handwriting sessions.",
      "key_vocabulary": "join, joining, cursive, stroke, diagonal, horizontal, fluent, consistent, pen lift, handwriting",
      "common_misconceptions": "Children may sacrifice legibility for the sake of joining every letter. They may make incorrect joins that distort letter shapes (e.g., the 'r' join often causes problems). Some children join successfully in handwriting practice but revert to print in independent writing because joined writing requires more cognitive effort."
    },
    {
      "concept_id": "EN-Y3-C043",
      "domain_id": "EN-Y3-D005",
      "concept_name": "Handwriting quality and consistency",
      "description": "Pupils increase the legibility, consistency and quality of their joined handwriting, ensuring parallel equidistant downstrokes and sufficient spacing for ascenders and descenders",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Develop handwriting quality and consistency in Year 3 by focusing on even letter sizing, consistent spacing between words, correct use of ascenders and descenders, and overall neatness. Use the school's handwriting programme for regular practice. Encourage self-assessment: children compare their handwriting to a model and identify areas for improvement. Ensure children write on correctly lined paper and use the lines as guides. Discuss the importance of legible handwriting for communication — the reader needs to be able to read what has been written.",
      "key_vocabulary": "quality, consistency, neat, legible, size, spacing, ascender, descender, proportion, presentation",
      "common_misconceptions": "Children may write neatly in handwriting practice but produce untidy work in other subjects because they are concentrating on content rather than presentation. They may think that neat handwriting is about artistic ability rather than consistent application of correct formation. Some children write very small or very large, making their work difficult to read."
    },
    {
      "concept_id": "EN-Y3-C044",
      "domain_id": "EN-Y3-D006",
      "concept_name": "Planning writing from model texts",
      "description": "Pupils discuss writing similar to what they plan to write in order to understand and learn from its structure, vocabulary and grammar",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach planning through exposure to model texts — children read and analyse high-quality examples of the text type they are going to write before planning their own. Use boxing-up (a grid showing the structure of the model text) to help children internalise the text's structure. Teach children to plan the purpose, audience, key content and structural organisation of their writing before they begin drafting. Model planning through shared writing, thinking aloud about the decisions being made.",
      "key_vocabulary": "plan, model text, purpose, audience, structure, boxing up, organise, key points, draft, prepare",
      "common_misconceptions": "Children may treat planning as copying out sections of the model text rather than using it as a structural template. They may spend too long on detailed plans that effectively become a first draft. Some children plan but then deviate significantly from their plan during writing, suggesting the planning was not purposeful."
    },
    {
      "concept_id": "EN-Y3-C045",
      "domain_id": "EN-Y3-D006",
      "concept_name": "Generating and recording ideas",
      "description": "Pupils plan writing by discussing and recording ideas using brainstorming, planning frames or notes",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach strategies for generating and recording ideas before writing. Use mind maps, brainstorms, lists, sketches and note-taking as pre-writing tools. Encourage children to draw on their reading, personal experience, research and imagination. Model the process of idea generation during shared writing: 'I could write about... or I could... What ideas do I have for the middle section?' Teach children that not all ideas generated will make it into the final piece — selecting and organising ideas is part of the writing process.",
      "key_vocabulary": "ideas, brainstorm, mind map, notes, jot down, think, plan, generate, record, select, organise",
      "common_misconceptions": "Children may feel they need a perfect idea before they can start, leading to 'writer's block'. They may record too many ideas and try to include all of them, resulting in unfocused writing. Some children skip the idea-generation stage entirely, writing the first thing that comes to mind."
    },
    {
      "concept_id": "EN-Y3-C046",
      "domain_id": "EN-Y3-D006",
      "concept_name": "Oral rehearsal of sentences",
      "description": "Pupils compose and rehearse sentences orally including dialogue, progressively building varied and rich vocabulary and an increasing range of sentence structures",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach oral rehearsal of sentences as a bridge between planning and writing. Before writing each sentence, children should say it aloud (to a partner or quietly to themselves), listening for grammatical sense, vocabulary choices and the flow of the sentence. In Year 3, extend from KS1 by rehearsing multi-clause sentences: 'When the storm began, the ship rocked violently.' Model oral rehearsal in shared writing, demonstrating how the same idea can be expressed in different ways and choosing the most effective version.",
      "key_vocabulary": "rehearse, say it first, sentence, aloud, listen, check, does it sound right, partner, compose",
      "common_misconceptions": "Children may rehearse a simple sentence but write a more complex one, or vice versa, because they lose track during the physical act of writing. They may rehearse silently rather than aloud, which reduces the effectiveness of the strategy. Some children see oral rehearsal as unnecessary and skip it, particularly when they are confident writers."
    },
    {
      "concept_id": "EN-Y3-C047",
      "domain_id": "EN-Y3-D006",
      "concept_name": "Paragraphing in composition",
      "description": "Pupils organise writing into paragraphs around a theme, grouping related sentences together",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach paragraphing as a way to group related material in both narrative and non-fiction writing. In narrative, teach that a new paragraph signals a change in time, place, topic or speaker. In non-fiction, teach that each paragraph deals with one main point. Model paragraph breaks during shared writing, explicitly explaining why a new paragraph is needed. Provide texts for children to divide into paragraphs and discuss where the breaks should fall and why.",
      "key_vocabulary": "paragraph, group, related, topic, new line, indent, change, time, place, speaker, main point",
      "common_misconceptions": "Children may write entire texts as a single paragraph, not seeing the need for breaks. They may break paragraphs at arbitrary points (e.g., when they reach the edge of the page) rather than for organisational reasons. Some children understand the concept of paragraphs in non-fiction but struggle to apply it in narrative writing."
    },
    {
      "concept_id": "EN-Y3-C048",
      "domain_id": "EN-Y3-D006",
      "concept_name": "Narrative elements: setting, character and plot",
      "description": "Pupils develop key elements of story writing including describing settings, developing characters with distinct traits, and planning and writing story plots",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach the three key elements of narrative: setting (where and when the story takes place), character (who the story is about), and plot (what happens — including a problem or conflict and its resolution). Use quality texts as models, identifying how authors establish setting through sensory description, develop characters through dialogue and action, and structure plot with tension and resolution. In Year 3, focus on creating detailed settings and developing characters beyond simple descriptions.",
      "key_vocabulary": "setting, character, plot, problem, resolution, describe, dialogue, action, tension, narrative, story",
      "common_misconceptions": "Children may rush past setting and character development to focus on action and events. They may describe characters only by physical appearance rather than personality, feelings and motivation. Some children create elaborate settings and characters but have weak or non-existent plot structures."
    },
    {
      "concept_id": "EN-Y3-C049",
      "domain_id": "EN-Y3-D006",
      "concept_name": "Organisational devices in non-narrative writing",
      "description": "Pupils structure non-fiction writing using simple organisational devices such as headings and sub-headings",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach children to use organisational devices in non-narrative writing: headings, subheadings, bullet points, numbered lists, text boxes, and diagrams. Show how these features help the reader navigate and understand information texts. Study model texts (information leaflets, non-fiction books, web pages) to identify how organisational devices are used. In shared writing, model deciding which organisational features are appropriate for the purpose and audience. Ensure children use these devices in their own non-fiction writing.",
      "key_vocabulary": "heading, subheading, bullet point, list, diagram, caption, text box, label, organise, layout, feature",
      "common_misconceptions": "Children may add headings and subheadings as decorations after writing rather than using them to plan and organise content. They may use bullet points where continuous prose would be more appropriate, or vice versa. Some children create visually appealing layouts without ensuring the content underneath is well written."
    },
    {
      "concept_id": "EN-Y3-C050",
      "domain_id": "EN-Y3-D006",
      "concept_name": "Evaluating own and others' writing",
      "description": "Pupils assess the effectiveness of writing, identifying strengths and suggesting specific improvements",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Develop peer evaluation skills by teaching children to give specific, constructive feedback. Provide evaluation frameworks: 'Two stars and a wish' (two things done well and one area for improvement), or success criteria checklists. Model giving feedback that is specific ('I liked the way you used the word shimmering to describe the water') rather than vague ('That was good'). Teach children to evaluate their own writing against the same criteria. Ensure that evaluation leads to action — children should use feedback to improve their work.",
      "key_vocabulary": "evaluate, feedback, improve, strength, target, success criteria, specific, star, wish, effective",
      "common_misconceptions": "Children may focus evaluation on surface features (handwriting, length) rather than quality of content, structure and language. They may be reluctant to offer constructive criticism to peers, saying everything is 'good'. Some children can identify weaknesses in others' writing but not in their own."
    },
    {
      "concept_id": "EN-Y3-C051",
      "domain_id": "EN-Y3-D006",
      "concept_name": "Editing for grammar, vocabulary and consistency",
      "description": "Pupils propose changes to grammar and vocabulary to improve consistency, including accurate use of pronouns to avoid repetition",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach editing as a distinct stage in the writing process where children improve their work by changing vocabulary, grammar and sentence structure for greater clarity and effect. Model editing during shared writing: read the draft aloud, identify a sentence that could be improved, and demonstrate how to revise it. Teach children to check for consistency of tense, pronoun reference and vocabulary register. Provide editing checklists tailored to the specific text type. Ensure children understand that editing improves content, while proof-reading corrects errors.",
      "key_vocabulary": "edit, improve, change, revise, vocabulary, grammar, sentence, consistency, tense, draft, better",
      "common_misconceptions": "Children often conflate editing with proof-reading, focusing on correcting spelling and punctuation errors rather than improving the quality of writing. They may resist changing their work because they see the first draft as the finished product. Some children make edits that introduce new errors because they do not reread the revised version."
    },
    {
      "concept_id": "EN-Y3-C052",
      "domain_id": "EN-Y3-D006",
      "concept_name": "Proof-reading",
      "description": "Pupils check and correct spelling and punctuation mistakes by re-reading their writing",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach proof-reading as the final stage of the writing process — checking for spelling, punctuation and grammatical errors. Model proof-reading techniques: reading aloud slowly, pointing to each word, using a ruler to read line by line, reading backwards to check spelling. Provide a proof-reading checklist: capital letters at sentence starts, full stops at sentence ends, correct use of apostrophes, spelling of exception words. Teach children to use a coloured pen for corrections so they can see what they have changed.",
      "key_vocabulary": "proof-read, check, correct, spelling, punctuation, error, mistake, capital letter, full stop, fix",
      "common_misconceptions": "Children may skim-read their work and declare it error-free without careful checking. They may correct some errors but miss others because they read what they intended rather than what they wrote. Some children proof-read for one type of error at a time (which is actually good practice) but do not complete enough passes to catch all types."
    },
    {
      "concept_id": "EN-Y3-C053",
      "domain_id": "EN-Y3-D006",
      "concept_name": "Reading aloud own writing",
      "description": "Pupils present their writing orally with appropriate intonation, tone and volume so that meaning is clear to a group or the whole class",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Provide regular opportunities for children to read their own writing aloud to different audiences — partners, small groups and the whole class. Teach children to use appropriate intonation, volume and pace that reflect the meaning and mood of their writing. Use peer response: after a child reads aloud, their partner identifies something specific they enjoyed. Connect reading aloud to the editing process — hearing their own writing often helps children identify where improvements are needed.",
      "key_vocabulary": "read aloud, perform, audience, intonation, expression, volume, pace, share, respond, feedback",
      "common_misconceptions": "Children may read their own writing in a flat monotone because they are focused on decoding their own handwriting. They may read too fast, particularly when nervous about performing in front of peers. Some children change their writing as they read aloud (ad-libbing improvements) rather than reading what is actually written on the page."
    },
    {
      "concept_id": "EN-Y3-C054",
      "domain_id": "EN-Y3-D007",
      "concept_name": "Multi-clause sentences with conjunctions",
      "description": "Pupils extend sentences with more than one clause using a wider range of conjunctions including when, if, because, although, creating subordinate clauses",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach children to write multi-clause sentences using co-ordinating conjunctions (and, but, or, so) and subordinating conjunctions (when, if, because, that, although, while, after, before, until). Model combining short sentences into multi-clause sentences during shared writing. Teach children to vary their sentence structure — not every sentence needs to be multi-clause. Practise converting simple sentences into compound or complex sentences and vice versa. Use sentence-combining activities with sets of short sentences.",
      "key_vocabulary": "clause, multi-clause, conjunction, and, but, because, when, if, although, join, combine, sentence",
      "common_misconceptions": "Children may overuse multi-clause sentences, creating sprawling constructions that lose clarity. They may default to one conjunction (usually 'and' or 'because') without varying their repertoire. Some children write multi-clause sentences without proper punctuation, particularly missing commas after fronted subordinate clauses."
    },
    {
      "concept_id": "EN-Y3-C055",
      "domain_id": "EN-Y3-D007",
      "concept_name": "Present perfect tense",
      "description": "Pupils understand and use the present perfect form of verbs (have/has + past participle) in contrast to the simple past tense, understanding the difference in meaning",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach the present perfect tense as a way of expressing something that started in the past and continues to the present, or something completed at an unspecified time in the past. Contrast with the simple past: 'He went to town' (simple past — finished action) vs 'He has gone to town' (present perfect — he is still there). Use the formula: has/have + past participle. Practise converting between simple past and present perfect. Address irregular past participles (gone, seen, taken, written) alongside regular ones (walked, played).",
      "key_vocabulary": "present perfect, has, have, past participle, tense, simple past, -ed, gone, seen, taken, done",
      "common_misconceptions": "Children commonly use the simple past where the present perfect is needed (e.g., 'I already did it' instead of 'I have already done it'). They may confuse the present perfect with the simple past because both refer to past events. Some children use 'has went' or 'have went' instead of 'has gone' or 'have gone', reflecting non-standard dialect influence."
    },
    {
      "concept_id": "EN-Y3-C056",
      "domain_id": "EN-Y3-D007",
      "concept_name": "Pronoun choice for cohesion",
      "description": "Pupils choose nouns or pronouns appropriately for clarity and cohesion, avoiding repetition and ensuring pronoun references are clear",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach that pronouns replace nouns to avoid repetition and create cohesion in writing. Model the problem of not using pronouns: 'Sarah went to the shop. Sarah bought some bread. Sarah walked home.' Then show how pronouns improve the text: 'Sarah went to the shop. She bought some bread. She walked home.' Teach children to choose pronouns carefully so the reader always knows who or what is being referred to. Introduce possessive pronouns (his, her, their, its) alongside personal pronouns.",
      "key_vocabulary": "pronoun, he, she, it, they, him, her, them, replace, noun, cohesion, reference, who, clear",
      "common_misconceptions": "Children often use pronouns ambiguously, making it unclear which noun the pronoun refers to (e.g., 'Tom and Jack went out. He fell over.' — who fell?). They may over-use names instead of pronouns, creating repetitive writing. Some children use the wrong pronoun form ('him went' instead of 'he went')."
    },
    {
      "concept_id": "EN-Y3-C057",
      "domain_id": "EN-Y3-D007",
      "concept_name": "Conjunctions, adverbs and prepositions for time and cause",
      "description": "Pupils use conjunctions (when, before, after, while, so, because), adverbs (then, next, soon, therefore) and prepositions (before, after, during, in, because of) to express time, place and cause",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach conjunctions (when, before, after, while, because, so), adverbs (then, next, soon, therefore) and prepositions (before, after, during, in, because of) as tools for expressing time, cause and effect. Show how these words link events and ideas: 'The road was icy. She slipped.' → 'Because the road was icy, she slipped.' / 'She slipped because the road was icy.' Practise using different connectives to express the same relationship. Create a classroom display of time and cause connectives for reference during writing.",
      "key_vocabulary": "conjunction, adverb, preposition, time, cause, because, when, before, after, while, then, so",
      "common_misconceptions": "Children may use 'because' as their only causal connective, not varying their language. They may confuse temporal and causal connectives (e.g., using 'when' where 'because' is needed). Some children start sentences with connectives but do not complete the grammatical structure (e.g., 'Because the rain.' as a complete sentence)."
    },
    {
      "concept_id": "EN-Y3-C058",
      "domain_id": "EN-Y3-D007",
      "concept_name": "Fronted adverbials",
      "description": "Pupils place adverbials at the start of sentences for effect (e.g. Later that day, I heard the bad news.) and use commas after fronted adverbials",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Introduce fronted adverbials in Year 3 as a sentence-opening device that adds variety and detail. Teach that a fronted adverbial is a word or phrase at the start of a sentence that tells the reader when, where or how something happened, followed by a comma: 'Slowly, the door creaked open.' 'After lunch, we went outside.' 'In the dark forest, a wolf waited.' Model adding fronted adverbials to plain sentences in shared writing. Practise through sentence-level activities before applying in extended writing.",
      "key_vocabulary": "fronted adverbial, adverbial, comma, sentence opener, when, where, how, time, place, manner",
      "common_misconceptions": "Children may forget the comma after a fronted adverbial. They may overuse fronted adverbials, starting every sentence with one, which becomes repetitive. Some children confuse fronted adverbials with conjunctions and create sentence fragments. Others use only time adverbials ('First,... Then,... Next,...') rather than varying with place and manner."
    },
    {
      "concept_id": "EN-Y3-C059",
      "domain_id": "EN-Y3-D007",
      "concept_name": "Direct speech punctuation",
      "description": "Pupils use and punctuate direct speech correctly, beginning with introduction to inverted commas (speech marks) and basic speech punctuation conventions",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach direct speech punctuation using the conventions: inverted commas (speech marks) around the spoken words, a new speaker on a new line, a comma or other punctuation before the closing speech mark, and a reporting clause (he said, she asked). Model with examples from class texts. Begin with simple reporting structures ('Hello,' said Tom.) before introducing variations (Tom said, 'Hello.' / 'Hello,' said Tom, 'how are you?'). Use drama to generate dialogue that children then write up with correct punctuation.",
      "key_vocabulary": "speech marks, inverted commas, dialogue, said, asked, replied, reporting clause, spoken words, new line",
      "common_misconceptions": "Children often forget to open or close speech marks, particularly when a sentence of dialogue is long. They may not place the comma before the closing speech mark. Some children do not start a new line for each new speaker, making dialogue difficult to follow. Others punctuate reported speech as if it were direct speech."
    },
    {
      "concept_id": "EN-Y3-C060",
      "domain_id": "EN-Y3-D007",
      "concept_name": "Noun formation using prefixes",
      "description": "Pupils understand how prefixes create new nouns, particularly super- (supermarket, superstar), anti- (antiseptic, antisocial) and auto- (autobiography, autograph)",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach how prefixes can be used to create nouns from other word classes: super- (superhero), anti- (antiseptic), auto- (autobiography). Demonstrate the pattern: identify the root word, add the prefix, note how the meaning changes. Connect to vocabulary development by exploring how these prefixes create words with specific meanings. Use word-building activities where children combine prefixes with root words to create and define new nouns. Link to reading comprehension — understanding these prefixes helps children decode unfamiliar vocabulary.",
      "key_vocabulary": "prefix, noun, word formation, super-, anti-, auto-, meaning, root word, create, derive",
      "common_misconceptions": "Children may not realise that the prefix changes the meaning systematically (e.g., 'anti-' always means 'against'). They may confuse word-class changes from prefixes with those from suffixes. Some children add prefixes to words where they do not apply, creating non-existent words."
    },
    {
      "concept_id": "EN-Y3-C061",
      "domain_id": "EN-Y3-D007",
      "concept_name": "Articles a/an",
      "description": "Pupils correctly choose between the articles 'a' and 'an' according to whether the next word begins with a consonant or vowel sound",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach the rule for choosing between the indefinite articles 'a' and 'an': use 'a' before a consonant sound and 'an' before a vowel sound. Emphasise that the rule is about sound, not spelling: 'an hour' (silent h), 'a uniform' (y sound), 'an umbrella' (vowel sound). Provide practice exercises where children choose the correct article for given words. Connect to speaking — most children already use 'a' and 'an' correctly in speech and can transfer this knowledge to writing by saying the phrase aloud.",
      "key_vocabulary": "article, a, an, consonant sound, vowel sound, before, indefinite article, choose, rule",
      "common_misconceptions": "Children may apply the rule based on the letter rather than the sound, writing 'an uniform' or 'a hour'. They may not realise that words beginning with 'h' can take either article depending on pronunciation. Some children omit articles entirely, particularly children whose home language does not use articles."
    },
    {
      "concept_id": "EN-Y3-C062",
      "domain_id": "EN-Y3-D007",
      "concept_name": "Word families",
      "description": "Pupils understand word families based on common words, showing how words are related in form and meaning (e.g. solve, solution, solver, dissolve, insoluble)",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_guidance": "Teach word families as groups of words that share a common root word (e.g., solve, solution, dissolve, resolver, insoluble). Show how the root carries a consistent meaning across all words in the family. Use word family trees or webs as visual displays. When encountering unfamiliar words in reading, prompt children to identify whether the word belongs to a family they already know. Connect word families to spelling — knowing one word in a family often helps spell others.",
      "key_vocabulary": "word family, root word, related, connect, group, derive, base, same root, meaning, pattern",
      "common_misconceptions": "Children may group words that look similar but are not actually related (e.g., 'play' and 'player' are related, but 'play' and 'place' are not). They may confuse word families with rhyming families. Some children understand word families in isolation but do not apply this knowledge as a reading or spelling strategy."
    },
    {
      "concept_id": "EN-Y3-C063",
      "domain_id": "EN-Y3-D007",
      "concept_name": "Paragraphs to group related material",
      "description": "Pupils understand paragraphs as a way to group related material, introduced as an organisational concept in Year 3",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach paragraphing as an organisational tool for grouping related material. In non-fiction, model how each paragraph focuses on one aspect of the topic, with a topic sentence that introduces the main idea. In fiction, teach the TIPTOP rule for starting new paragraphs: Time change, Introduce a new character, Place change, Topic change, Opposite (change of focus). Provide texts for children to divide into paragraphs, discussing the reasons for each break. Model paragraph structure explicitly during shared writing.",
      "key_vocabulary": "paragraph, topic, group, related, organise, main idea, topic sentence, new paragraph, TIPTOP, indent",
      "common_misconceptions": "Children may understand that paragraphs exist but not know when to start a new one. They may create very uneven paragraphs — one or two very long paragraphs and several very short ones. Some children insert paragraph breaks mechanically (e.g., every five sentences) rather than according to content."
    },
    {
      "concept_id": "EN-Y3-C064",
      "domain_id": "EN-Y3-D007",
      "concept_name": "Headings and sub-headings",
      "description": "Pupils understand and use headings and sub-headings to aid presentation and organise information texts",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach headings and subheadings as organisational tools that help readers navigate non-fiction texts. Model how to write clear, informative headings that tell the reader what a section is about. Analyse model texts: cover up the headings and ask children to predict what each section will contain based on the heading. In shared writing, compose texts where children suggest appropriate headings and subheadings. Teach the difference between headings (main topics) and subheadings (subtopics within a section).",
      "key_vocabulary": "heading, subheading, title, section, topic, organise, navigation, reader, information, non-fiction",
      "common_misconceptions": "Children may write vague or unhelpful headings (e.g., 'Stuff' or 'Part 2' instead of 'How Volcanoes Erupt'). They may not understand the hierarchical relationship between headings and subheadings. Some children add headings after writing rather than using them to plan and organise content."
    },
    {
      "concept_id": "EN-Y3-C065",
      "domain_id": "EN-Y3-D007",
      "concept_name": "Year 3 grammatical terminology",
      "description": "Pupils learn and use Year 3 grammatical terminology accurately: preposition, conjunction, word family, prefix, clause, subordinate clause, direct speech, consonant, consonant letter, vowel, vowel letter, inverted commas",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach the Year 3 grammatical terminology from Appendix 2: preposition, conjunction, word family, prefix, clause, subordinate clause, direct speech, consonant, consonant letter, vowel, vowel letter, inverted commas (speech marks). Teach each term in context, using it when discussing reading and writing. Display definitions with examples. Practise identifying these features in texts. Test understanding through activities like 'find the preposition in this sentence' or 'underline the subordinate clause'.",
      "key_vocabulary": "preposition, conjunction, word family, prefix, clause, subordinate clause, direct speech, inverted commas",
      "common_misconceptions": "Children may learn the definitions of grammatical terms without being able to identify examples in context. They may confuse prepositions with conjunctions when both can express similar meanings (e.g., 'before the match' vs 'before the match started'). Some children know the terms but cannot explain their function in a sentence."
    },
    {
      "concept_id": "EN-Y3-C066",
      "domain_id": "EN-Y3-D007",
      "concept_name": "Standard English awareness",
      "description": "Pupils begin to understand differences between Standard English and non-Standard English and start to apply Standard English in writing, for example in dialogue",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Continue developing awareness of Standard English, focusing on subject-verb agreement and common non-standard forms. Address the specific verb forms that differ in many dialects: 'we were' not 'we was'; 'I did' not 'I done'; 'she saw' not 'she seen'; 'they went' not 'they gone'. Approach sensitively, validating dialect as appropriate in informal spoken contexts while teaching that Standard English is expected in writing and formal speech. Use editing activities where children identify and correct non-standard verb forms in written text.",
      "key_vocabulary": "Standard English, grammar, verb, correct form, formal, writing, we were, I did, she saw, agreement",
      "common_misconceptions": "Children may feel that their dialect is being criticised when Standard English is taught, requiring a sensitive approach that values linguistic diversity. They may apply Standard English forms inconsistently, particularly in verbs that are common in non-standard dialect (e.g., 'done' for 'did'). Some children can identify non-standard forms in others' writing but not in their own."
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "EN-KS1-C001",
      "dependent_concept": "EN-Y3-C001",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 listening skills develop into more sophisticated active listening and appropriate response in Year 3"
    },
    {
      "prerequisite_concept": "EN-KS1-C002",
      "dependent_concept": "EN-Y3-C002",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 questioning skills develop into Year 3 questioning to extend understanding and knowledge"
    },
    {
      "prerequisite_concept": "EN-KS1-C003",
      "dependent_concept": "EN-Y3-C003",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 vocabulary building develops into Year 3 use of relevant strategies to build vocabulary"
    },
    {
      "prerequisite_concept": "EN-KS1-C004",
      "dependent_concept": "EN-Y3-C004",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 speaking in full sentences to communicate ideas develops into Year 3 articulating and justifying answers and opinions"
    },
    {
      "prerequisite_concept": "EN-KS1-C005",
      "dependent_concept": "EN-Y3-C005",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 describing events and narratives develops into Year 3 well-structured descriptions, explanations and narratives"
    },
    {
      "prerequisite_concept": "EN-KS1-C006",
      "dependent_concept": "EN-Y3-C006",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 participation in collaborative conversation develops into Year 3 more sustained collaborative discussion"
    },
    {
      "prerequisite_concept": "EN-KS1-C007",
      "dependent_concept": "EN-Y3-C007",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "KS1 using talk to develop understanding develops into Year 3 exploratory talk including speculating and hypothesising"
    },
    {
      "prerequisite_concept": "EN-KS1-C008",
      "dependent_concept": "EN-Y3-C008",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 speaking clearly and fluently develops into Year 3 audible and fluent speech with increasing Standard English"
    },
    {
      "prerequisite_concept": "EN-KS1-C009",
      "dependent_concept": "EN-Y3-C009",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 participation in performances and drama develops into Year 3 wider range including debates and formal presentations"
    },
    {
      "prerequisite_concept": "EN-KS1-C010",
      "dependent_concept": "EN-Y3-C010",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "KS1 awareness of audience develops into Year 3 actively gaining, maintaining and monitoring listener interest"
    },
    {
      "prerequisite_concept": "EN-KS1-C011",
      "dependent_concept": "EN-Y3-C011",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 listening to others and responding develops into Year 3 evaluating different viewpoints and building on contributions"
    },
    {
      "prerequisite_concept": "EN-KS1-C012",
      "dependent_concept": "EN-Y3-C012",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.7,
      "rationale": "KS1 basic awareness of different contexts develops into Year 3 selecting appropriate registers for effective communication"
    },
    {
      "prerequisite_concept": "EN-KS1-C013",
      "dependent_concept": "EN-Y3-C013",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.95,
      "rationale": "KS1 knowledge of grapheme-phoneme correspondences and simple word structure is foundational to Year 3 applying root word knowledge for reading"
    },
    {
      "prerequisite_concept": "EN-KS1-C014",
      "dependent_concept": "EN-Y3-C014",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 introduction to prefixes and suffixes (un-, -ful, -less, -ness, -er) develops into Year 3 wider range of prefixes and suffixes with etymology"
    },
    {
      "prerequisite_concept": "EN-KS1-C015",
      "dependent_concept": "EN-Y3-C015",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 exception words develop into Year 3 further exception words from the Years 3-4 word list"
    },
    {
      "prerequisite_concept": "EN-KS1-C013",
      "dependent_concept": "EN-Y3-C016",
      "confidence": "inferred",
      "relationship_type": "foundational",
      "strength": 0.8,
      "rationale": "Phonics knowledge from KS1 enables Year 3 pupils to try different pronunciations of longer unfamiliar words"
    },
    {
      "prerequisite_concept": "EN-KS1-C016",
      "dependent_concept": "EN-Y3-C017",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 listening to and discussing texts develops into Year 3 wider positive attitudes to reading across a broader range of text types"
    },
    {
      "prerequisite_concept": "EN-KS1-C017",
      "dependent_concept": "EN-Y3-C018",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "KS1 reading for different purposes develops into Year 3 reading books structured in different ways for a range of purposes"
    },
    {
      "prerequisite_concept": "EN-KS1-C018",
      "dependent_concept": "EN-Y3-C019",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "KS1 introduction to dictionaries develops into Year 3 systematic dictionary use for checking meaning"
    },
    {
      "prerequisite_concept": "EN-KS1-C019",
      "dependent_concept": "EN-Y3-C020",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "KS1 familiarity with stories and traditional tales develops into Year 3 specific study of fairy stories, myths and legends"
    },
    {
      "prerequisite_concept": "EN-KS1-C020",
      "dependent_concept": "EN-Y3-C021",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "KS1 beginning to identify features of different texts develops into Year 3 identifying themes and conventions across a wide range of books"
    },
    {
      "prerequisite_concept": "EN-KS1-C021",
      "dependent_concept": "EN-Y3-C022",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS1 reading aloud poems and play scripts develops into Year 3 performance with understanding through intonation, tone, volume and action"
    },
    {
      "prerequisite_concept": "EN-KS1-C022",
      "dependent_concept": "EN-Y3-C023",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.7,
      "rationale": "KS1 discussing language in texts develops into Year 3 identifying words and phrases that capture the reader's interest"
    },
    {
      "prerequisite_concept": "EN-KS1-C020",
      "dependent_concept": "EN-Y3-C024",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.7,
      "rationale": "KS1 exposure to various poems develops into Year 3 recognising and naming different forms of poetry"
    },
    {
      "prerequisite_concept": "EN-KS1-C023",
      "dependent_concept": "EN-Y3-C025",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 checking text makes sense and re-reading develops into Year 3 systematic comprehension monitoring and explaining word meaning in context"
    },
    {
      "prerequisite_concept": "EN-KS1-C024",
      "dependent_concept": "EN-Y3-C026",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS1 asking and answering questions about texts develops into Year 3 formulating questions to improve understanding"
    },
    {
      "prerequisite_concept": "EN-KS1-C025",
      "dependent_concept": "EN-Y3-C027",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 making simple inferences develops into Year 3 drawing inferences with evidence about feelings, thoughts and motives"
    },
    {
      "prerequisite_concept": "EN-KS1-C026",
      "dependent_concept": "EN-Y3-C028",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 making predictions develops into Year 3 predicting from both stated and implied details"
    },
    {
      "prerequisite_concept": "EN-KS1-C027",
      "dependent_concept": "EN-Y3-C029",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "KS1 identifying key points develops into Year 3 identifying main ideas across multiple paragraphs and summarising"
    },
    {
      "prerequisite_concept": "EN-KS1-C028",
      "dependent_concept": "EN-Y3-C030",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.75,
      "rationale": "KS1 awareness of how texts are organised develops into Year 3 identifying how language, structure and presentation contribute to meaning"
    },
    {
      "prerequisite_concept": "EN-KS1-C029",
      "dependent_concept": "EN-Y3-C031",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS1 finding information from non-fiction develops into Year 3 systematic retrieval and recording of information using contents and index"
    },
    {
      "prerequisite_concept": "EN-KS1-C030",
      "dependent_concept": "EN-Y3-C032",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 participating in discussion about books develops into Year 3 more structured discussion with rules for effective dialogue"
    },
    {
      "prerequisite_concept": "EN-KS1-C031",
      "dependent_concept": "EN-Y3-C033",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "KS1 beginning to read silently develops into Year 3 sustained silent reading with good understanding"
    },
    {
      "prerequisite_concept": "EN-KS1-C032",
      "dependent_concept": "EN-Y3-C034",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 basic prefix and suffix knowledge (un-, -ful, -less, -ness, -er, -est) is prerequisite for Year 3 wider range of prefixes and suffixes with rules"
    },
    {
      "prerequisite_concept": "EN-KS1-C032",
      "dependent_concept": "EN-Y3-C035",
      "confidence": "inferred",
      "relationship_type": "foundational",
      "strength": 0.75,
      "rationale": "KS1 phonics knowledge and syllable awareness underpin Year 3 rules for doubling consonants in polysyllabic words"
    },
    {
      "prerequisite_concept": "EN-KS1-C033",
      "dependent_concept": "EN-Y3-C036",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 introduction to homophones (there/their/they're, here/hear, quite/quiet) develops into Year 3 wider set of homophones"
    },
    {
      "prerequisite_concept": "EN-KS1-C032",
      "dependent_concept": "EN-Y3-C037",
      "confidence": "inferred",
      "relationship_type": "foundational",
      "strength": 0.7,
      "rationale": "KS1 phonics knowledge provides foundation for recognising etymology-based spelling patterns in Year 3"
    },
    {
      "prerequisite_concept": "EN-KS1-C034",
      "dependent_concept": "EN-Y3-C038",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 statutory word list (Years 1-2) is prerequisite for learning the new Years 3-4 statutory word list"
    },
    {
      "prerequisite_concept": "EN-KS1-C035",
      "dependent_concept": "EN-Y3-C039",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 use of apostrophe for singular possession develops into Year 3 possessive apostrophe with plural nouns"
    },
    {
      "prerequisite_concept": "EN-KS1-C018",
      "dependent_concept": "EN-Y3-C040",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "KS1 introduction to dictionaries develops into Year 3 systematic dictionary use for spelling checking"
    },
    {
      "prerequisite_concept": "EN-KS1-C036",
      "dependent_concept": "EN-Y3-C041",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 writing dictated sentences with taught words develops into Year 3 more complex dictated sentences"
    },
    {
      "prerequisite_concept": "EN-KS1-C037",
      "dependent_concept": "EN-Y3-C042",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "KS1 formation of individual letters and beginning to join develops into Year 3 use of diagonal and horizontal joining strokes"
    },
    {
      "prerequisite_concept": "EN-KS1-C037",
      "dependent_concept": "EN-Y3-C043",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 consistent letter sizing and spacing develops into Year 3 increased legibility, consistency and quality with attention to ascenders and descenders"
    },
    {
      "prerequisite_concept": "EN-KS1-C038",
      "dependent_concept": "EN-Y3-C044",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.75,
      "rationale": "KS1 discussing texts before writing and identifying features develops into Year 3 systematic analysis of model texts for structure, vocabulary and grammar"
    },
    {
      "prerequisite_concept": "EN-KS1-C039",
      "dependent_concept": "EN-Y3-C045",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 planning and writing sentences before writing develops into Year 3 systematic planning including discussing and recording ideas"
    },
    {
      "prerequisite_concept": "EN-KS1-C040",
      "dependent_concept": "EN-Y3-C046",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 composing sentences orally before writing develops into Year 3 rehearsing more complex sentences including dialogue"
    },
    {
      "prerequisite_concept": "EN-KS1-C041",
      "dependent_concept": "EN-Y3-C047",
      "confidence": "inferred",
      "relationship_type": "foundational",
      "strength": 0.8,
      "rationale": "KS1 organising writing with a beginning, middle and end provides the foundation for Year 3 introduction to paragraphing"
    },
    {
      "prerequisite_concept": "EN-KS1-C042",
      "dependent_concept": "EN-Y3-C048",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS1 writing simple narratives with characters and events develops into Year 3 creating settings, characters and plot"
    },
    {
      "prerequisite_concept": "EN-KS1-C043",
      "dependent_concept": "EN-Y3-C049",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.75,
      "rationale": "KS1 sequencing and simple non-fiction writing develops into Year 3 using headings and sub-headings as organisational devices"
    },
    {
      "prerequisite_concept": "EN-KS1-C044",
      "dependent_concept": "EN-Y3-C050",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS1 re-reading to check writing makes sense develops into Year 3 systematic evaluation of effectiveness in own and others' writing"
    },
    {
      "prerequisite_concept": "EN-KS1-C044",
      "dependent_concept": "EN-Y3-C051",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS1 basic editing and correcting develops into Year 3 proposing specific grammar and vocabulary changes for consistency"
    },
    {
      "prerequisite_concept": "EN-KS1-C044",
      "dependent_concept": "EN-Y3-C052",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 re-reading to check spelling and punctuation develops into Year 3 systematic proof-reading"
    },
    {
      "prerequisite_concept": "EN-KS1-C045",
      "dependent_concept": "EN-Y3-C053",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS1 reading own writing aloud develops into Year 3 reading aloud to a group or class with appropriate intonation and volume"
    },
    {
      "prerequisite_concept": "EN-KS1-C046",
      "dependent_concept": "EN-Y3-C054",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 use of coordinating conjunctions (and, but, or) and subordinating conjunctions (because, when, if, that) develops into Year 3 wider range of conjunctions for multi-clause sentences"
    },
    {
      "prerequisite_concept": "EN-KS1-C047",
      "dependent_concept": "EN-Y3-C055",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "KS1 past and present tense is the foundational prerequisite for understanding the present perfect tense in Year 3"
    },
    {
      "prerequisite_concept": "EN-KS1-C048",
      "dependent_concept": "EN-Y3-C056",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS1 use of personal pronouns (I, he, she, we, they) develops into Year 3 systematic choice of nouns or pronouns for clarity and cohesion"
    },
    {
      "prerequisite_concept": "EN-KS1-C046",
      "dependent_concept": "EN-Y3-C057",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS1 use of conjunctions, adverbs and prepositions develops into Year 3 applying these specifically to express time, place and cause"
    },
    {
      "prerequisite_concept": "EN-KS1-C046",
      "dependent_concept": "EN-Y3-C058",
      "confidence": "inferred",
      "relationship_type": "foundational",
      "strength": 0.7,
      "rationale": "KS1 adverbials and sentence-level grammar provide the foundation for Year 3 introduction to fronted adverbials"
    },
    {
      "prerequisite_concept": "EN-KS1-C049",
      "dependent_concept": "EN-Y3-C059",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.85,
      "rationale": "KS1 demarcating sentences with punctuation develops into Year 3 introduction to direct speech punctuation with inverted commas"
    },
    {
      "prerequisite_concept": "EN-KS1-C050",
      "dependent_concept": "EN-Y3-C060",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "KS1 introduction to simple prefixes (un-) develops into Year 3 understanding how super-, anti-, auto- form nouns"
    },
    {
      "prerequisite_concept": "EN-KS1-C051",
      "dependent_concept": "EN-Y3-C061",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.7,
      "rationale": "KS1 basic noun and determiner knowledge develops into Year 3 correct use of a/an articles"
    },
    {
      "prerequisite_concept": "EN-KS1-C050",
      "dependent_concept": "EN-Y3-C062",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "KS1 introduction to prefixes, suffixes and root words develops into Year 3 systematic study of word families"
    },
    {
      "prerequisite_concept": "EN-KS1-C041",
      "dependent_concept": "EN-Y3-C063",
      "confidence": "inferred",
      "relationship_type": "foundational",
      "strength": 0.8,
      "rationale": "KS1 organising writing into sections with a beginning, middle and end provides the foundation for Year 3 introduction to paragraphs"
    },
    {
      "prerequisite_concept": "EN-KS1-C043",
      "dependent_concept": "EN-Y3-C064",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.75,
      "rationale": "KS1 sequencing information in non-fiction develops into Year 3 use of headings and sub-headings"
    },
    {
      "prerequisite_concept": "EN-KS1-C052",
      "dependent_concept": "EN-Y3-C065",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 grammatical terminology (noun, verb, adjective, adverb, sentence, punctuation, plural, singular) develops into Year 3 new terminology including preposition, conjunction, clause, subordinate clause"
    },
    {
      "prerequisite_concept": "EN-KS1-C053",
      "dependent_concept": "EN-Y3-C066",
      "confidence": "inferred",
      "relationship_type": "foundational",
      "strength": 0.65,
      "rationale": "KS1 beginning awareness of spoken vs written language provides the foundation for Year 3 understanding Standard English vs non-Standard English"
    }
  ]
}