{
  "metadata": {
    "subject": "English",
    "key_stage": "KS2",
    "years_covered": [
      4
    ],
    "document_reference": "DFE-00181-2013",
    "extraction_date": "2026-02-16",
    "structure_rating": 7,
    "notes": "Year 4 is the second year of Lower Key Stage 2. The document presents Years 3 and 4 together; this extraction represents Year 4 content, which consolidates and builds upon Year 3. By end of Year 4, pupils should justify views independently, use joined handwriting throughout, and have secure grammar including fronted adverbials, direct speech punctuation, and possessive apostrophe with plural nouns. Year 4-specific grammar content is taken from English Appendix 2."
  },
  "domains": [
    {
      "domain_id": "EN-Y4-D001",
      "domain_name": "Spoken Language",
      "description": "Development of spoken language skills across all contexts, including discussion, presentations, and drama. Statutory requirements for spoken language apply to all years 1-6. In Years 3 and 4, pupils should become more familiar with and confident in using language in a greater variety of situations, for a variety of audiences and purposes, including through drama, formal presentations and debate.",
      "is_cross_cutting": true,
      "structure_type": "mixed",
      "curriculum_context": "Spoken language at Year 4 continues to develop pupils' confidence in extended, purposeful oral communication across a range of contexts — debate, drama, explanation and presentation. Pupils are expected to articulate and justify answers, build on others' contributions in discussion, and speak with increasing awareness of audience and purpose. The statutory curriculum requires teachers to create regular, structured opportunities for sustained talk in whole-class, group and paired contexts. By Year 4, pupils should be able to organise spoken contributions coherently, use appropriate vocabulary for different contexts, and show active listening behaviours that contribute constructively to shared discussion."
    },
    {
      "domain_id": "EN-Y4-D002",
      "domain_name": "Reading - Word Reading",
      "description": "Application of phonics, morphology and etymology to decode and understand new words. By Year 4, most pupils should not need further direct word reading instruction; any focus should support vocabulary development. Pupils apply growing knowledge of root words, prefixes and suffixes and read further exception words.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "curriculum_context": "Reading — word reading at Year 4 consolidates automatic decoding so that pupils can read most words, including those with more complex morphology, without conscious attention. Pupils are expected to understand that many words have been borrowed from other languages and carry the spelling patterns of their language of origin — Latin, French, Greek — and to use this knowledge to tackle unfamiliar vocabulary in academic texts. The statutory curriculum requires pupils to continue to apply their phonic knowledge and skill to read aloud and to understand new words encountered in their independent reading. Year 4 is a crucial year for closing any remaining gaps in decoding fluency so that comprehension, rather than decoding, becomes the primary challenge in reading."
    },
    {
      "domain_id": "EN-Y4-D003",
      "domain_name": "Reading - Comprehension",
      "description": "Understanding and engagement with a wide range of texts through discussion, inference and critical thinking. Comprehension takes precedence over word reading. By end of Year 4, pupils should justify views about what they read increasingly independently. The knowledge and skills needed to comprehend are similar across years 3-4 and 5-6; the complexity of writing increases the challenge.",
      "is_cross_cutting": false,
      "structure_type": "mixed",
      "curriculum_context": "Reading comprehension at Year 4 expects pupils to read with developing independence, selecting and discussing books across a range of genres including fiction, poetry and information texts. Pupils develop skills of inference and deduction — reading between the lines to understand characters' motivations, the significance of events, and the effect of authorial choices. The statutory curriculum requires pupils to discuss words and phrases that capture their interest or imagination, to make comparisons within and across books, and to prepare poems and play scripts to read aloud and perform with appropriate intonation and volume. Comprehension is developed both through shared reading of challenging texts read aloud by the teacher and through pupils' independent reading of texts chosen for themselves."
    },
    {
      "domain_id": "EN-Y4-D004",
      "domain_name": "Writing - Transcription (Spelling)",
      "description": "Spelling accuracy using phonics, morphology, etymology and understanding of word structure. Year 4 spelling consolidates and extends the Years 3-4 rules and the statutory word list. Pupils should also use dictionaries efficiently to check and correct spellings.",
      "is_cross_cutting": false,
      "structure_type": "sequential",
      "curriculum_context": "Writing — transcription: spelling at Year 4 deepens pupils' mastery of spelling patterns and requires them to accurately apply the Year 3/4 statutory word list in their writing. Pupils learn further morphological patterns including the possessive apostrophe with plural nouns, the use of 'ough' letter strings, and the spelling of words with the 'k' sound spelt 'ch'. The statutory curriculum requires pupils to spell correctly a wider range of homophones and commonly confused words, and to use a dictionary and thesaurus to check and enhance their writing. Year 4 spelling instruction continues to require regular opportunities to investigate word patterns, test and apply spellings in writing, and revisit previously taught patterns."
    },
    {
      "domain_id": "EN-Y4-D005",
      "domain_name": "Writing - Transcription (Handwriting)",
      "description": "Development of joined, legible and fluent handwriting. By Year 4, joined handwriting should be the norm throughout independent writing, increasing in fluency and quality to support composition and spelling.",
      "is_cross_cutting": false,
      "structure_type": "sequential",
      "curriculum_context": "Handwriting at Year 4 aims for pupils to have fully consistent, legible joined handwriting that is sufficiently automatic to support extended composition without conscious attention to letter formation. Pupils are expected to choose an appropriate presentation style for different purposes — including when it is appropriate to use print rather than joined cursive. The statutory curriculum requires pupils to increase their legibility, consistency and quality of handwriting, developing their own personalised joined style that retains legibility at speed. By Year 4, the expectation is that handwriting should no longer present a barrier to extended writing, with pupils able to write continuously and fluently for sustained periods."
    },
    {
      "domain_id": "EN-Y4-D006",
      "domain_name": "Writing - Composition",
      "description": "Planning, drafting, evaluating and publishing writing for different purposes and audiences. Year 4 pupils consolidate writing skills, enhancing effectiveness and increasing competence. They write for a range of real purposes and audiences across the curriculum, using more varied grammar, vocabulary and narrative structures. Pupils should understand how writing can be different from speech.",
      "is_cross_cutting": false,
      "structure_type": "sequential",
      "curriculum_context": "Writing — composition at Year 4 expects pupils to compose extended pieces of writing independently across a range of genres, using their reading as a model for effective writing. Pupils are expected to create detailed settings, characters and plot in narratives; to use organisational features, sub-headings and paragraphing in non-fiction; and to write for a range of purposes including to persuade, describe and explain. The statutory curriculum requires pupils to independently assess the effectiveness of their own writing in relation to audience and purpose, making revisions to vocabulary, grammar and punctuation to improve it. Year 4 composition work emphasises the recursive nature of writing — planning, drafting, revising and editing — as an integrated process."
    },
    {
      "domain_id": "EN-Y4-D007",
      "domain_name": "Writing - Vocabulary, Grammar and Punctuation",
      "description": "Understanding and applying grammatical concepts and punctuation conventions in writing. Grammar should be taught explicitly with terminology from English Appendix 2. Year 4 introduces: noun phrases expanded by modifying adjectives and preposition phrases, fronted adverbials with commas, direct speech punctuation with inverted commas, possessive apostrophe with plural nouns, and new terminology: determiner, pronoun, possessive pronoun, adverbial. Pupils begin to distinguish Standard English from non-Standard English.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "curriculum_context": "Vocabulary, grammar and punctuation at Year 4 builds on the grammatical understanding of Year 3 to develop pupils' ability to write sentences of greater complexity and variety. Pupils learn to use fronted adverbials, expanded noun phrases, pronouns to avoid ambiguity, and the possessive apostrophe — including for plural nouns. The statutory curriculum requires pupils to use inverted commas and other punctuation to indicate direct speech accurately, and to understand the grammatical difference between standard and non-standard English forms. Pupils extend their grammatical vocabulary to include noun phrase, relative pronoun, subordinate clause, direct and indirect speech, and possessive apostrophe, using these terms to discuss the effects of grammatical choices in reading and their own writing."
    }
  ],
  "objectives": [
    {
      "objective_id": "EN-Y4-O001",
      "domain_id": "EN-Y4-D001",
      "objective_text": "listen and respond appropriately to adults and their peers",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O002",
      "domain_id": "EN-Y4-D001",
      "objective_text": "ask relevant questions to extend their understanding and knowledge",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O003",
      "domain_id": "EN-Y4-D001",
      "objective_text": "use relevant strategies to build their vocabulary",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O004",
      "domain_id": "EN-Y4-D001",
      "objective_text": "articulate and justify answers, arguments and opinions",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O005",
      "domain_id": "EN-Y4-D001",
      "objective_text": "give well-structured descriptions, explanations and narratives for different purposes, including for expressing feelings",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O006",
      "domain_id": "EN-Y4-D001",
      "objective_text": "maintain attention and participate actively in collaborative conversations, staying on topic and initiating and responding to comments",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O007",
      "domain_id": "EN-Y4-D001",
      "objective_text": "use spoken language to develop understanding through speculating, hypothesising, imagining and exploring ideas",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O008",
      "domain_id": "EN-Y4-D001",
      "objective_text": "speak audibly and fluently with an increasing command of Standard English",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O009",
      "domain_id": "EN-Y4-D001",
      "objective_text": "participate in discussions, presentations, performances, role play, improvisations and debates",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O010",
      "domain_id": "EN-Y4-D001",
      "objective_text": "gain, maintain and monitor the interest of the listener(s)",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O011",
      "domain_id": "EN-Y4-D001",
      "objective_text": "consider and evaluate different viewpoints, attending to and building on the contributions of others",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O012",
      "domain_id": "EN-Y4-D001",
      "objective_text": "select and use appropriate registers for effective communication",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O013",
      "domain_id": "EN-Y4-D002",
      "objective_text": "apply their growing knowledge of root words, prefixes and suffixes (etymology and morphology) as listed in English Appendix 1, both to read aloud and to understand the meaning of new words they meet",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O014",
      "domain_id": "EN-Y4-D002",
      "objective_text": "read further exception words, noting the unusual correspondences between spelling and sound, and where these occur in the word",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O015",
      "domain_id": "EN-Y4-D003",
      "objective_text": "develop positive attitudes to reading and understanding of what they read by listening to and discussing a wide range of fiction, poetry, plays, non-fiction and reference books or textbooks",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O016",
      "domain_id": "EN-Y4-D003",
      "objective_text": "read books that are structured in different ways and reading for a range of purposes",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O017",
      "domain_id": "EN-Y4-D003",
      "objective_text": "use dictionaries to check the meaning of words that they have read",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O018",
      "domain_id": "EN-Y4-D003",
      "objective_text": "increase their familiarity with a wide range of books, including fairy stories, myths and legends, and retelling some of these orally",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O019",
      "domain_id": "EN-Y4-D003",
      "objective_text": "identify themes and conventions in a wide range of books",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O020",
      "domain_id": "EN-Y4-D003",
      "objective_text": "prepare poems and play scripts to read aloud and to perform, showing understanding through intonation, tone, volume and action",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O021",
      "domain_id": "EN-Y4-D003",
      "objective_text": "discuss words and phrases that capture the reader's interest and imagination",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O022",
      "domain_id": "EN-Y4-D003",
      "objective_text": "recognise some different forms of poetry [for example, free verse, narrative poetry]",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O023",
      "domain_id": "EN-Y4-D003",
      "objective_text": "check that the text makes sense to them, discussing their understanding and explaining the meaning of words in context",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O024",
      "domain_id": "EN-Y4-D003",
      "objective_text": "ask questions to improve their understanding of a text",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O025",
      "domain_id": "EN-Y4-D003",
      "objective_text": "draw inferences such as inferring characters' feelings, thoughts and motives from their actions, and justifying inferences with evidence",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O026",
      "domain_id": "EN-Y4-D003",
      "objective_text": "predict what might happen from details stated and implied",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O027",
      "domain_id": "EN-Y4-D003",
      "objective_text": "identify main ideas drawn from more than one paragraph and summarising these",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O028",
      "domain_id": "EN-Y4-D003",
      "objective_text": "identify how language, structure, and presentation contribute to meaning",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O029",
      "domain_id": "EN-Y4-D003",
      "objective_text": "retrieve and record information from non-fiction",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O030",
      "domain_id": "EN-Y4-D003",
      "objective_text": "participate in discussion about both books that are read to them and those they can read for themselves, taking turns and listening to what others say",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O031",
      "domain_id": "EN-Y4-D004",
      "objective_text": "use further prefixes and suffixes and understand how to add them (English Appendix 1)",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O032",
      "domain_id": "EN-Y4-D004",
      "objective_text": "spell further homophones",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O033",
      "domain_id": "EN-Y4-D004",
      "objective_text": "spell words that are often misspelt (English Appendix 1)",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O034",
      "domain_id": "EN-Y4-D004",
      "objective_text": "place the possessive apostrophe accurately in words with regular plurals [for example, girls', boys'] and in words with irregular plurals [for example, children's]",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O035",
      "domain_id": "EN-Y4-D004",
      "objective_text": "use the first two or three letters of a word to check its spelling in a dictionary",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O036",
      "domain_id": "EN-Y4-D004",
      "objective_text": "write from memory simple sentences, dictated by the teacher, that include words and punctuation taught so far",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O037",
      "domain_id": "EN-Y4-D005",
      "objective_text": "use the diagonal and horizontal strokes that are needed to join letters and understand which letters, when adjacent to one another, are best left unjoined",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O038",
      "domain_id": "EN-Y4-D005",
      "objective_text": "increase the legibility, consistency and quality of their handwriting [for example, by ensuring that the downstrokes of letters are parallel and equidistant; that lines of writing are spaced sufficiently so that the ascenders and descenders of letters do not touch]",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O039",
      "domain_id": "EN-Y4-D006",
      "objective_text": "plan their writing by discussing writing similar to that which they are planning to write in order to understand and learn from its structure, vocabulary and grammar",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O040",
      "domain_id": "EN-Y4-D006",
      "objective_text": "plan their writing by discussing and recording ideas",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O041",
      "domain_id": "EN-Y4-D006",
      "objective_text": "draft and write by composing and rehearsing sentences orally (including dialogue), progressively building a varied and rich vocabulary and an increasing range of sentence structures (English Appendix 2)",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O042",
      "domain_id": "EN-Y4-D006",
      "objective_text": "draft and write by organising paragraphs around a theme",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O043",
      "domain_id": "EN-Y4-D006",
      "objective_text": "draft and write by creating settings, characters and plot in narratives",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O044",
      "domain_id": "EN-Y4-D006",
      "objective_text": "draft and write by using simple organisational devices [for example, headings and sub-headings] in non-narrative material",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O045",
      "domain_id": "EN-Y4-D006",
      "objective_text": "evaluate and edit by assessing the effectiveness of their own and others' writing and suggesting improvements",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O046",
      "domain_id": "EN-Y4-D006",
      "objective_text": "evaluate and edit by proposing changes to grammar and vocabulary to improve consistency, including the accurate use of pronouns in sentences",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O047",
      "domain_id": "EN-Y4-D006",
      "objective_text": "evaluate and edit by proof-reading for spelling and punctuation errors",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O048",
      "domain_id": "EN-Y4-D006",
      "objective_text": "read aloud their own writing, to a group or the whole class, using appropriate intonation and controlling the tone and volume so that the meaning is clear",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O049",
      "domain_id": "EN-Y4-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by extending the range of sentences with more than one clause by using a wider range of conjunctions, including when, if, because, although",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O050",
      "domain_id": "EN-Y4-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by using the present perfect form of verbs in contrast to the past tense",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O051",
      "domain_id": "EN-Y4-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by choosing nouns or pronouns appropriately for clarity and cohesion and to avoid repetition",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O052",
      "domain_id": "EN-Y4-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by using conjunctions, adverbs and prepositions to express time and cause",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O053",
      "domain_id": "EN-Y4-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by using fronted adverbials",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O054",
      "domain_id": "EN-Y4-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by learning the grammar for years 3 and 4 in English Appendix 2",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O055",
      "domain_id": "EN-Y4-D007",
      "objective_text": "indicate grammatical and other features by using commas after fronted adverbials",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O056",
      "domain_id": "EN-Y4-D007",
      "objective_text": "indicate grammatical and other features by indicating possession by using the possessive apostrophe with plural nouns",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O057",
      "domain_id": "EN-Y4-D007",
      "objective_text": "indicate grammatical and other features by using and punctuating direct speech",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O058",
      "domain_id": "EN-Y4-D007",
      "objective_text": "use and understand the grammatical terminology in English Appendix 2 accurately and appropriately when discussing their writing and reading",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O059",
      "domain_id": "EN-Y4-D007",
      "objective_text": "Year 4 word-level grammar: the grammatical difference between plural and possessive -s; Standard English forms for verb inflections instead of local spoken forms [for example, we were instead of we was, or I did instead of I done]",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O060",
      "domain_id": "EN-Y4-D007",
      "objective_text": "Year 4 sentence-level grammar: noun phrases expanded by the addition of modifying adjectives, nouns and preposition phrases [e.g. the teacher expanded to: the strict maths teacher with curly hair]; fronted adverbials [for example, Later that day, I heard the bad news.]",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O061",
      "domain_id": "EN-Y4-D007",
      "objective_text": "Year 4 text-level grammar: use of paragraphs to organise ideas around a theme; appropriate choice of pronoun or noun within and across sentences to aid cohesion and avoid repetition",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O062",
      "domain_id": "EN-Y4-D007",
      "objective_text": "Year 4 punctuation: use of inverted commas and other punctuation to indicate direct speech [for example, a comma after the reporting clause; end punctuation within inverted commas: The conductor shouted, \"Sit down!\"]; apostrophes to mark plural possession [for example, the girl's name, the girls' names]; use of commas after fronted adverbials",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    },
    {
      "objective_id": "EN-Y4-O063",
      "domain_id": "EN-Y4-D007",
      "objective_text": "Year 4 terminology for pupils: determiner, pronoun, possessive pronoun, adverbial",
      "is_statutory": true,
      "non_statutory_guidance": "",
      "examples": ""
    }
  ],
  "concepts": [
    {
      "concept_id": "EN-Y4-C001",
      "domain_id": "EN-Y4-D001",
      "concept_name": "Active listening and appropriate response",
      "description": "Pupils listen and respond appropriately to adults and their peers in Year 4, demonstrating sustained and attentive listening across formal and informal contexts with increasing independence",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_guidance": "Build on Year 3 listening by requiring children to listen to more extended and complex speech — longer teacher explanations, class debates and oral presentations by peers. Teach children to listen for the main point and supporting details, and to respond by summarising what they heard before adding their own contribution. Use the response frame: 'What I heard you say was... and I would add...' Practise listening to audio recordings and news reports as well as live speech.",
      "key_vocabulary": "active listening, respond, summarise, main point, detail, appropriate, contribution, follow up, paraphrase",
      "common_misconceptions": "Children may appear attentive but only process the last thing said, missing the overall argument or explanation. They may respond to what they want to talk about rather than what was actually said. Some children interrupt rather than waiting for the speaker to finish because they fear forgetting their point."
    },
    {
      "concept_id": "EN-Y4-C002",
      "domain_id": "EN-Y4-D001",
      "concept_name": "Questioning to extend understanding",
      "description": "Pupils formulate and ask relevant questions that deepen their understanding of topics and texts, including questions that probe beyond surface meaning",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "teaching_guidance": "Teach children to formulate questions that deepen learning, moving beyond factual recall to analytical and evaluative questions. Use question taxonomies: 'remembering' questions (Who? What?), 'understanding' questions (Why? How?), 'applying' questions (What would happen if?), and 'evaluating' questions (Do you agree? Was it fair?). Model generating higher-order questions during shared reading. Encourage children to ask questions that do not have a single right answer but invite discussion and exploration.",
      "key_vocabulary": "question, enquiry, why, how, what if, evaluate, analyse, deeper, understanding, explore, investigate",
      "common_misconceptions": "Children may confuse genuine questions with rhetorical ones. They often default to lower-order factual questions rather than analytical or evaluative ones. Some children ask questions that are too broad ('Why is reading important?') rather than specific and answerable. Others may feel embarrassed to ask questions that reveal gaps in their understanding."
    },
    {
      "concept_id": "EN-Y4-C003",
      "domain_id": "EN-Y4-D001",
      "concept_name": "Vocabulary building strategies",
      "description": "Pupils use a range of strategies to build their vocabulary, including using dictionaries, word families, etymology and morphology, discussion and reading widely",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "teaching_guidance": "Develop vocabulary-building strategies with greater independence in Year 4. Teach children to use morphological analysis (breaking words into roots, prefixes and suffixes), context clues (what surrounding words suggest), etymology (word origins), and dictionary/thesaurus use to build and refine their vocabulary. Introduce academic and subject-specific vocabulary through cross-curricular learning. Encourage children to notice and collect interesting or unfamiliar words in a vocabulary journal and use them in speech and writing.",
      "key_vocabulary": "vocabulary, strategy, context, morphology, etymology, synonym, define, precise, academic, subject-specific",
      "common_misconceptions": "Children may know a word's general meaning but not its precise or nuanced usage, leading to incorrect or awkward word choices. They may not transfer vocabulary learned in one subject to another. Some children rely solely on the teacher to explain new words rather than using independent strategies."
    },
    {
      "concept_id": "EN-Y4-C004",
      "domain_id": "EN-Y4-D001",
      "concept_name": "Articulating and justifying opinions",
      "description": "Pupils articulate and justify answers, arguments and opinions with increasing confidence and independence, providing reasoned justification for views about what they read and broader topics",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "teaching_guidance": "Develop children's ability to construct sustained arguments using the structure: assertion, reason, evidence, explanation. Model argumentative talk: 'I believe that... because... For example... This shows that...' Use formal debates with motions where children must argue for or against a proposition. Teach children to anticipate counter-arguments and address them. Practise in the context of book discussions, cross-curricular topics and PSHE issues. Encourage children to qualify their arguments: 'mostly', 'often', 'in many cases'.",
      "key_vocabulary": "argue, justify, opinion, evidence, reason, counter-argument, because, however, on the other hand, assert",
      "common_misconceptions": "Children may state opinions as facts without providing evidence. They may use emotional appeals rather than reasoned argument ('It's not fair!' rather than explaining why). Some children cannot distinguish between a strong argument (supported by evidence) and a weak one (unsupported assertion). Others find it difficult to argue a position they do not personally hold."
    },
    {
      "concept_id": "EN-Y4-C005",
      "domain_id": "EN-Y4-D001",
      "concept_name": "Structured spoken descriptions and explanations",
      "description": "Pupils give well-structured descriptions, explanations and narratives for different purposes, including for expressing feelings, adapting structure to audience and purpose",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "teaching_guidance": "Teach children to give well-structured spoken descriptions and explanations with increasing detail, precision and organisation. Provide frameworks: for descriptions, use sensory categories (sight, sound, smell, touch, taste); for explanations, use sequential connectives (first, next, then, finally) and causal connectives (because, therefore, as a result). Practise explaining processes, describing events and giving presentations about topics studied. Model the use of precise, technical vocabulary when explaining subject-specific content.",
      "key_vocabulary": "describe, explain, detail, precise, technical, structure, sequence, because, therefore, audience, clarity",
      "common_misconceptions": "Children may include irrelevant or excessive detail that obscures the main point. They may struggle to adapt their explanations for different levels of audience knowledge. Some children give circular explanations that repeat the question rather than answering it. Others may speak too quickly when explaining complex ideas."
    },
    {
      "concept_id": "EN-Y4-C006",
      "domain_id": "EN-Y4-D001",
      "concept_name": "Collaborative conversation",
      "description": "Pupils maintain attention and participate actively in collaborative conversations, staying on topic, initiating and responding to comments, and taking turns within group and whole-class contexts",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "teaching_guidance": "Develop collaborative conversation skills by increasing the complexity of group tasks and the expectation for equitable participation. Teach children to take on specific roles within groups (chairperson, note-taker, reporter, timekeeper) and to manage their own group process. Use Kagan structures (think-pair-share, round robin, numbered heads together) to ensure all children contribute. Teach ground rules for collaborative discussion: listen actively, build on others' ideas, challenge ideas not people, and seek agreement where possible.",
      "key_vocabulary": "collaborate, role, chairperson, contribute, build on, challenge, consensus, ground rules, equitable, group",
      "common_misconceptions": "Groups may focus on reaching agreement quickly rather than genuinely discussing different viewpoints. One or two confident children may dominate while others disengage. Some children confuse collaboration with simply dividing tasks and working independently. Others may agree with the majority view to avoid conflict rather than contributing their genuine perspective."
    },
    {
      "concept_id": "EN-Y4-C007",
      "domain_id": "EN-Y4-D001",
      "concept_name": "Exploratory talk",
      "description": "Pupils use spoken language to develop understanding through speculating, hypothesising, imagining and exploring ideas, increasingly using talk as a tool for thinking",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "teaching_guidance": "Continue developing exploratory talk by providing increasingly complex and ambiguous discussion prompts that require sustained thinking. Use 'What if?' scenarios, ethical dilemmas linked to texts, and open-ended cross-curricular questions. Teach children that exploratory talk is characterised by tentative language ('perhaps', 'I wonder', 'it could be'), building on others' ideas ('Yes, and...'), and a willingness to change one's mind. Create a classroom culture where not knowing is valued as a starting point for enquiry.",
      "key_vocabulary": "explore, speculate, hypothesise, tentative, perhaps, what if, I wonder, build on, change my mind, enquiry",
      "common_misconceptions": "Children may confuse exploratory talk with unstructured chat. They may feel pressure to reach a conclusion quickly rather than allowing ideas to develop through discussion. Some children may dismiss others' tentative ideas rather than building on them. Others may be reluctant to engage in exploratory talk because they see uncertainty as weakness."
    },
    {
      "concept_id": "EN-Y4-C008",
      "domain_id": "EN-Y4-D001",
      "concept_name": "Audible and fluent speech with Standard English",
      "description": "Pupils speak audibly and fluently with an increasing command of Standard English, understanding when Standard English is required and beginning to distinguish it from non-Standard forms",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Develop awareness that Standard English is expected in formal speaking contexts as well as in writing. Teach children to recognise when Standard English is appropriate (presentations, debates, speaking to unfamiliar adults) and when informal spoken language is acceptable (casual conversation, playground talk). Practise switching between registers through role-play. Focus on common non-standard forms: 'was/were' agreement, irregular past tenses, and double negatives. Continue to value dialect and home language while building bidialectal competence.",
      "key_vocabulary": "Standard English, formal, informal, register, appropriate, spoken, correct, grammar, fluent, audible",
      "common_misconceptions": "Children may think Standard English is 'posh' or 'not natural'. They may not realise they already switch between registers in different contexts. Some children apply Standard English rules rigidly in all contexts, losing naturalness in casual speech. Others may use Standard English in writing but revert to non-standard forms in formal speech."
    },
    {
      "concept_id": "EN-Y4-C009",
      "domain_id": "EN-Y4-D001",
      "concept_name": "Spoken performance and drama",
      "description": "Pupils participate in discussions, presentations, performances, role play, improvisations and debates with growing familiarity and confidence across a variety of situations, audiences and purposes, including formal presentations and debate",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Use drama techniques to deepen understanding of texts and develop spoken language in context. Introduce more sophisticated strategies: improvisation (unscripted scenes based on a text), writing and performing short scripts, director's chair (one child directs others in a scene, making deliberate choices about voice and movement), and debate in role (arguing a character's perspective). Connect drama to writing by using drama as a pre-writing activity: children explore characters and situations physically before writing.",
      "key_vocabulary": "drama, improvise, script, direct, perform, character, motivation, scene, audience, interpretation",
      "common_misconceptions": "Children may focus on entertainment value rather than using drama to explore the text or develop understanding. They may find it difficult to sustain a role, breaking character when they are unsure what to say. Some children may copy film or TV performances rather than developing their own interpretation."
    },
    {
      "concept_id": "EN-Y4-C010",
      "domain_id": "EN-Y4-D001",
      "concept_name": "Audience engagement",
      "description": "Pupils gain, maintain and monitor the interest of the listener(s), adjusting pace, volume, tone and vocabulary to sustain engagement",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach children to maintain audience engagement during longer presentations. Model techniques: starting with a hook (a surprising fact, a question, a bold statement), organising content with clear signposts ('My first point is...', 'Moving on to...'), using visual aids or props, making eye contact around the room, and ending with a summary or call to action. Give children practice presenting to different audiences (their own class, younger children, parents). Use peer feedback focused specifically on engagement techniques.",
      "key_vocabulary": "audience, engage, hook, signpost, structure, visual aid, eye contact, present, conclude, interact",
      "common_misconceptions": "Children may read directly from notes without looking up, losing connection with their audience. They may include too much detail, causing the audience to lose interest. Some children speak in a monotone, while others adopt an artificial 'presentation voice' that sounds unnatural. A few children may prioritise being entertaining over being informative."
    },
    {
      "concept_id": "EN-Y4-C011",
      "domain_id": "EN-Y4-D001",
      "concept_name": "Evaluating different viewpoints",
      "description": "Pupils consider and evaluate different viewpoints, attending to and building constructively on the contributions of others in discussion and debate",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "teaching_guidance": "Teach children to evaluate different viewpoints by considering the strength of the reasoning and evidence behind each one. Use structured activities: present two or more contrasting viewpoints on an issue from a text and ask children to weigh the arguments for each. Teach the difference between opinion (subjective preference) and evidence-based argument (supported by facts). Model evaluating viewpoints: 'This argument is stronger because it is supported by evidence, while this one relies on emotion.' Connect to reading comprehension where characters hold different views.",
      "key_vocabulary": "viewpoint, evaluate, evidence, argument, strong, weak, bias, fair, balanced, perspective, reason, weigh",
      "common_misconceptions": "Children may equate the viewpoint they agree with as the 'right' one rather than evaluating the quality of reasoning. They may dismiss viewpoints they disagree with without engaging with the argument. Some children struggle to understand that a well-argued position can still be wrong, and a poorly argued position can still be correct."
    },
    {
      "concept_id": "EN-Y4-C012",
      "domain_id": "EN-Y4-D001",
      "concept_name": "Register and audience awareness",
      "description": "Pupils select and use appropriate registers for effective communication, with a growing understanding of formal and informal language use and Standard versus non-Standard English",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Develop register awareness by exploring how language changes depending on audience, purpose and context. Compare formal and informal versions of the same message (a text to a friend vs a letter to the head teacher). Teach that register involves vocabulary choice, sentence structure, tone and level of detail. Use role-play to practise speaking in different registers. In writing, connect register to text type: an email to a friend uses different register from a formal letter or a newspaper report. Model making deliberate register choices during shared writing.",
      "key_vocabulary": "register, formal, informal, audience, purpose, tone, vocabulary, appropriate, context, adjust, language",
      "common_misconceptions": "Children may think formal register means using long, complicated words, when it actually involves a combination of vocabulary, grammar and tone. They may not adjust their register for written texts, writing in an informal, chatty style for all purposes. Some children equate formality with unfriendliness."
    },
    {
      "concept_id": "EN-Y4-C013",
      "domain_id": "EN-Y4-D002",
      "concept_name": "Root words for reading and meaning",
      "description": "Pupils apply growing knowledge of root words alongside etymology and morphology to read aloud and comprehend new words, supporting vocabulary development rather than decoding alone",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "teaching_guidance": "Build on Year 3 root word knowledge by introducing Latin and Greek roots found in subject-specific vocabulary across the curriculum. Examples: 'aqua' (water), 'bio' (life), 'geo' (earth), 'port' (carry), 'rupt' (break), 'struct' (build), 'tele' (far). Use word webs to show how a single root generates multiple words. When encountering unfamiliar vocabulary in science, geography or history, prompt children to identify the root word and use it to infer meaning. Create class root word collections for each subject area.",
      "key_vocabulary": "root word, Latin, Greek, origin, word family, meaning, derive, vocabulary, subject-specific, infer",
      "common_misconceptions": "Children may not connect root word knowledge to reading comprehension, treating it as a separate spelling activity. They may misidentify root words in words that are not etymologically related (e.g., thinking 'television' and 'telephone' share the root 'tel' when the actual root is 'tele-'). Some children memorise roots without understanding how to apply them to new vocabulary."
    },
    {
      "concept_id": "EN-Y4-C014",
      "domain_id": "EN-Y4-D002",
      "concept_name": "Prefixes and suffixes for reading (etymology and morphology)",
      "description": "Pupils apply knowledge of a wide range of prefixes and suffixes (as listed in English Appendix 1) both to read aloud and to understand the meaning of new words, testing different pronunciations for longer words",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "teaching_guidance": "Extend prefix and suffix knowledge to support reading of unfamiliar vocabulary. Year 4 prefixes include: in-/im-/il-/ir- (meaning 'not': inactive, impossible, illegal, irregular), inter- (between: interact, international), and further practice with un-, dis-, mis-, re-. Year 4 suffixes include: -ation (information), -ous (famous), -ly (happily), -er/-or (teacher, inventor). Teach children to decode unfamiliar words in reading by identifying the prefix or suffix and the root word. Model this process during shared reading across all subjects.",
      "key_vocabulary": "prefix, suffix, morphology, in-, im-, il-, ir-, inter-, -ation, -ous, root word, decode, meaning",
      "common_misconceptions": "Children may not realise that in-, im-, il- and ir- are all variants of the same 'not' prefix, applied depending on the initial letter of the root word. They may strip affixes from words that are not actually prefixed (e.g., thinking 'improve' has the prefix 'im-'). Some children can identify affixes but do not use this knowledge to work out the meaning of unfamiliar words."
    },
    {
      "concept_id": "EN-Y4-C015",
      "domain_id": "EN-Y4-D002",
      "concept_name": "Exception words (Years 3-4)",
      "description": "Pupils read further exception words from the Years 3-4 statutory list, noting the unusual correspondences between spelling and sound and where these occur in words",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Continue practising the Years 3-4 statutory word list words throughout Year 4, focusing on those that children still find challenging. Use a range of strategies: look-say-cover-write-check, dictation in sentence contexts, word sorts by common patterns, mnemonics for particularly tricky words, and regular assessment. Focus on words that appear frequently in cross-curricular writing. Encourage children to self-monitor their spelling of exception words in independent writing and correct errors using dictionaries.",
      "key_vocabulary": "exception word, statutory word, spelling, practise, remember, dictation, pattern, tricky, self-correct",
      "common_misconceptions": "Children may be able to spell exception words in isolation (on a spelling test) but revert to phonetic spelling in independent writing. They may confuse similar-looking words (e.g., 'thought', 'though', 'through', 'thorough'). Some children assume that once they pass a spelling test on these words, they never need to practise them again."
    },
    {
      "concept_id": "EN-Y4-C016",
      "domain_id": "EN-Y4-D003",
      "concept_name": "Wide reading for positive attitudes",
      "description": "Pupils develop positive attitudes to reading through listening to and discussing a wide range of fiction, poetry, plays, non-fiction, reference books and textbooks, including books and authors they would not choose themselves",
      "concept_type": "attitude",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Foster positive attitudes to reading by ensuring access to a wide range of engaging texts, including books chosen by children, texts recommended by peers and adults, and texts representing diverse voices and experiences. Maintain daily independent reading time with teacher conferencing. Create a reading community through book clubs, author visits, library visits and reading challenges. Model your own reading habits: share what you are reading and why. Avoid linking reading to extrinsic rewards (stickers, prizes) that can undermine intrinsic motivation.",
      "key_vocabulary": "reading for pleasure, attitude, enjoy, choice, recommend, wide reading, author, genre, motivation, engage",
      "common_misconceptions": "Children may equate reading ability with reading enjoyment, and those who find reading difficult may develop negative attitudes. Some children read only one genre or author and resist exploring new territory. Others may report enjoying reading but not actually read independently, suggesting their attitudes have not translated into habits."
    },
    {
      "concept_id": "EN-Y4-C017",
      "domain_id": "EN-Y4-D003",
      "concept_name": "Reading for different purposes and structures",
      "description": "Pupils read books structured in different ways and read for a range of purposes including pleasure and information, understanding how text structure serves its purpose",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach children to read for different purposes and to recognise how text structure supports purpose. Study how different types of texts are structured: chronological texts (recounts, instructions, narratives), non-chronological texts (reports, explanations, discussion texts), and reference texts (dictionaries, encyclopaedias, websites). Teach children to identify the purpose of a text and to select the appropriate reading strategy: reading for gist (skimming), reading for specific information (scanning), or reading for deep understanding (close reading).",
      "key_vocabulary": "purpose, structure, chronological, non-chronological, skim, scan, close reading, text type, audience, form",
      "common_misconceptions": "Children may read all texts at the same pace and with the same approach regardless of purpose. They may not recognise that the same topic can be presented in different text structures for different purposes. Some children struggle to switch between reading strategies, defaulting to reading everything from start to finish."
    },
    {
      "concept_id": "EN-Y4-C018",
      "domain_id": "EN-Y4-D003",
      "concept_name": "Dictionary use for reading comprehension",
      "description": "Pupils use dictionaries to check the meaning of words they have read, efficiently using alphabetical order and knowledge of first two or three letters",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_guidance": "Develop efficient dictionary use in Year 4, building speed and independence. Teach children to use guide words at the top of dictionary pages to navigate quickly. When a word has multiple meanings, teach children to read all definitions and select the one that fits the context. Introduce the practice of checking pronunciation using the dictionary's pronunciation guide. Encourage dictionary use as a habit during independent reading — children should have dictionaries accessible whenever they read.",
      "key_vocabulary": "dictionary, definition, guide word, meaning, context, pronunciation, alphabetical, entry, look up, check",
      "common_misconceptions": "Children may look up a word but select the wrong definition because they do not consider the context. They may find dictionary use too slow and skip unfamiliar words instead. Some children rely on the dictionary for every unfamiliar word rather than using context first and the dictionary to confirm."
    },
    {
      "concept_id": "EN-Y4-C019",
      "domain_id": "EN-Y4-D003",
      "concept_name": "Fairy stories, myths and legends",
      "description": "Pupils increase familiarity with fairy stories, myths and legends from a range of traditions and retell some of these orally, recognising common themes such as triumph of good over evil and use of magical devices",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Extend knowledge of fairy stories, myths and legends through texts from diverse cultural traditions. In Year 4, deepen analysis: compare versions of the same story from different cultures (e.g., Cinderella variants from around the world), discuss how myths reflect the values and beliefs of the culture that produced them, and explore how legends blend fact and fiction. Teach children to recognise structural patterns: the hero's journey, the quest, the transformation, the trickster tale. Use as models for children's own narrative writing.",
      "key_vocabulary": "fairy story, myth, legend, culture, tradition, hero, quest, moral, origin story, variant, pattern",
      "common_misconceptions": "Children may assume that myths from other cultures are simply 'wrong explanations' rather than understanding their cultural significance. They may think that all versions of a traditional story must be the same and be surprised by cultural variations. Some children struggle to see how mythological structures are still used in modern storytelling."
    },
    {
      "concept_id": "EN-Y4-C020",
      "domain_id": "EN-Y4-D003",
      "concept_name": "Themes and conventions in books",
      "description": "Pupils identify themes and conventions in a wide range of books, recognising recurring themes in fiction and genre conventions in different types of writing (e.g. greeting in letters, first-person diary, presentational devices in instructions)",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Deepen children's ability to identify and discuss themes and conventions in books read during the year. Teach children to track a theme across a whole text, noting how it is introduced, developed and resolved. Use a theme-tracking grid where children record evidence from different parts of the text. Compare themes across texts by the same author or within the same genre. Teach conventions of specific genres: the detective story (clues, red herrings, suspects, resolution), the adventure story (danger, courage, journey, return), the school story (friendships, conflicts, growing up).",
      "key_vocabulary": "theme, convention, genre, evidence, track, develop, compare, pattern, feature, detective, adventure",
      "common_misconceptions": "Children may identify themes at a surface level ('it's about animals') rather than at a deeper level ('it's about loyalty'). They may confuse a theme with a moral or lesson. Some children can identify themes when prompted but do not notice them independently during reading."
    },
    {
      "concept_id": "EN-Y4-C021",
      "domain_id": "EN-Y4-D003",
      "concept_name": "Poetry and play performance",
      "description": "Pupils prepare poems and play scripts to read aloud and perform, showing understanding through intonation, tone, volume and action, using drama to explore meaning and comprehension",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Provide regular, purposeful opportunities for children to prepare and perform poems and play scripts. In Year 4, increase expectations for performance quality: appropriate use of tone, volume, pace, emphasis, pause, gesture and movement. Teach children to analyse a text before performing it, making deliberate choices about how to convey meaning and mood. Use group performance to develop ensemble skills — reading in unison, splitting parts, using dramatic pauses. Connect to writing by having children write their own scripts and poems for performance.",
      "key_vocabulary": "perform, rehearse, script, poem, expression, tone, emphasis, pause, gesture, movement, ensemble",
      "common_misconceptions": "Children may prioritise volume over expression, thinking that speaking loudly equals performing well. They may not understand that performance choices should be driven by the meaning of the text. Some children memorise texts mechanically without understanding them deeply enough to perform expressively."
    },
    {
      "concept_id": "EN-Y4-C022",
      "domain_id": "EN-Y4-D003",
      "concept_name": "Effective language in texts",
      "description": "Pupils discuss words and phrases that capture the reader's interest and imagination, extending their interest in the meaning and origin of words",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Develop children's ability to analyse how authors use language for effect. Move beyond identifying individual powerful words to discussing how language choices work together to create mood, atmosphere, character and setting. Teach children to notice patterns in an author's language use: do they use short sentences for tension? Figurative language for description? Formal vocabulary for authority? Use close reading activities where children annotate short passages, highlighting language features and commenting on their effect.",
      "key_vocabulary": "language, effect, author, choice, mood, atmosphere, figurative, imagery, technique, analyse, create, purpose",
      "common_misconceptions": "Children may comment on language as 'good writing' without explaining what makes it effective. They may focus on individual words rather than how language features work together. Some children can identify language features (simile, metaphor, alliteration) but cannot explain their effect on the reader."
    },
    {
      "concept_id": "EN-Y4-C023",
      "domain_id": "EN-Y4-D003",
      "concept_name": "Forms of poetry",
      "description": "Pupils recognise some different forms of poetry and their characteristics, including free verse and narrative poetry",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Extend knowledge of poetry forms by introducing narrative poetry, ballads, sonnets (read not written), limericks, and concrete/shape poems alongside the forms introduced in Year 3. Read and perform a wide range of poetry throughout the year, not just during a 'poetry unit'. Teach children to appreciate how the form of a poem shapes its content — a haiku demands compression, a limerick demands humour, a narrative poem tells a story. Encourage children to experiment with different forms in their own writing.",
      "key_vocabulary": "poem, form, narrative poem, ballad, limerick, sonnet, concrete poem, rhythm, rhyme scheme, stanza",
      "common_misconceptions": "Children may believe that poetry must follow strict rules and that deviation from a pattern is 'wrong' rather than a creative choice. They may think that learning about poetry forms is about following templates rather than understanding how form shapes meaning. Some children may feel poetry is exclusively a KS1 activity and resist engaging with it."
    },
    {
      "concept_id": "EN-Y4-C024",
      "domain_id": "EN-Y4-D003",
      "concept_name": "Comprehension monitoring",
      "description": "Pupils check that text makes sense to them, discussing their understanding and explaining the meaning of words in context, re-reading when meaning breaks down",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Strengthen comprehension monitoring in Year 4 by teaching children to deploy a wider range of fix-up strategies independently. Teach the hierarchy: reread the sentence, read on to see if meaning becomes clear, use context to infer the meaning of unfamiliar words, break down unfamiliar words into roots and affixes, check a dictionary or glossary, and ask a peer or adult. Use think-aloud activities in guided reading to model metacognitive awareness: 'I noticed I lost track of what was happening here, so I...' Encourage children to annotate texts with question marks where they are confused.",
      "key_vocabulary": "comprehension, monitor, strategy, reread, context, infer, check, fix up, meaning, metacognition",
      "common_misconceptions": "Children may continue reading past points of confusion without noticing the breakdown in comprehension. They may rely on a single fix-up strategy (usually rereading) without trying alternatives. Some children monitor word-level accuracy but not overall text-level meaning."
    },
    {
      "concept_id": "EN-Y4-C025",
      "domain_id": "EN-Y4-D003",
      "concept_name": "Questions to improve reading comprehension",
      "description": "Pupils ask questions to improve their understanding of a text, developing, agreeing on and evaluating rules for effective discussion, with expectation that all pupils take part",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach questioning as a deep reading strategy, not just a comprehension exercise. Model generating questions at different levels: literal (What happened?), inferential (Why did the character...?), evaluative (Was this the right decision?), and authorial (Why did the writer choose to...?). Use reciprocal reading groups where children take turns as the 'questioner'. Teach children to distinguish between questions the text answers, questions the reader must infer answers to, and questions the text leaves deliberately unanswered.",
      "key_vocabulary": "question, literal, inferential, evaluative, author, purpose, explore, discuss, higher-order, think",
      "common_misconceptions": "Children may generate only literal recall questions rather than questions that promote deeper thinking. They may see questioning as something done to test comprehension rather than as a strategy to deepen it. Some children ask questions without attempting to answer them, treating questioning as an end in itself."
    },
    {
      "concept_id": "EN-Y4-C026",
      "domain_id": "EN-Y4-D003",
      "concept_name": "Drawing inferences with evidence",
      "description": "Pupils draw inferences such as inferring characters' feelings, thoughts and motives from their actions, and justify inferences with evidence from the text",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Develop inference skills in Year 4 by requiring children to use more precise textual evidence and to make more complex inferences about characters' feelings, motivations, and relationships. Teach children to consider what is deliberately left unsaid as well as what is stated. Use the inference equation: clues from the text + reader's knowledge = inference. Teach children to support their inferences with multiple pieces of evidence, not just one quote. Practise with increasingly subtle texts where meaning must be constructed rather than found.",
      "key_vocabulary": "infer, evidence, clue, motive, feeling, suggest, imply, deduce, multiple, justify, prove, show",
      "common_misconceptions": "Children may make inferences that are plausible but unsupported by the text. They may over-rely on personal experience rather than textual evidence. Some children state inferences without providing evidence, while others provide evidence without explaining what it shows. The most common error is confusing inference with retrieval."
    },
    {
      "concept_id": "EN-Y4-C027",
      "domain_id": "EN-Y4-D003",
      "concept_name": "Prediction from stated and implied detail",
      "description": "Pupils predict what might happen from details stated and implied in the text, using explicit and implicit clues to make reasoned predictions",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Develop prediction skills by requiring children to draw on both explicit and implicit information from the text. Teach children to use their knowledge of text structures and genre conventions to inform predictions: 'This is a detective story, so I expect the detective will find a clue soon.' Encourage children to make several predictions and to weigh which is most likely based on available evidence. After reading on, discuss which predictions were confirmed and what textual signals were helpful or misleading.",
      "key_vocabulary": "predict, evidence, stated, implied, likely, because, genre, convention, confirm, revise, expect",
      "common_misconceptions": "Children may rely on genre knowledge alone without attending to the specific details of the text. They may make predictions based on what they want to happen rather than what the evidence suggests. Some children abandon predictions too quickly when they encounter new information rather than weighing it against existing evidence."
    },
    {
      "concept_id": "EN-Y4-C028",
      "domain_id": "EN-Y4-D003",
      "concept_name": "Identifying and summarising main ideas across paragraphs",
      "description": "Pupils identify main ideas drawn from more than one paragraph and summarise these, demonstrating ability to synthesise information across extended texts",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "teaching_guidance": "Teach summarising across paragraphs — identifying the main idea of each paragraph and then synthesising these into an overall summary of the text or section. Use the strategy of writing a one-sentence summary for each paragraph, then combining these into a coherent summary of the whole text. Teach children to distinguish between essential information and supporting detail. Practise with both fiction (summarising the key events and themes) and non-fiction (summarising the main argument or information). Set word limits to force conciseness.",
      "key_vocabulary": "summarise, main idea, key events, paragraph, overall, essential, detail, concise, synthesise, gist",
      "common_misconceptions": "Children often struggle to summarise across multiple paragraphs, producing paragraph-by-paragraph retellings rather than integrated summaries. They may include minor details while omitting key information. Some children write summaries that are nearly as long as the original text. Others may summarise the beginning in detail but rush through the middle and end."
    },
    {
      "concept_id": "EN-Y4-C029",
      "domain_id": "EN-Y4-D003",
      "concept_name": "Language, structure and presentation contributing to meaning",
      "description": "Pupils identify how language, structure and presentation contribute to meaning, understanding how authors use these features to shape reader response",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Deepen children's understanding of how language, structure and presentational features contribute to meaning. In fiction, analyse how authors use short sentences for tension, long sentences for description, dialogue for characterisation, and structural features (chapters, flashbacks, multiple narrators) to shape the reader's experience. In non-fiction, examine how headings, bullet points, diagrams, photographs with captions, and text boxes enhance understanding. Compare texts that present similar content with different structural and presentational choices.",
      "key_vocabulary": "language, structure, presentation, effect, author's choice, technique, layout, text feature, purpose, audience",
      "common_misconceptions": "Children may describe structural features without explaining their effect on the reader. They may not connect an author's structural choices to their purpose (e.g., not understanding why a mystery novel withholds information). Some children treat non-fiction presentational features as decorative rather than functional."
    },
    {
      "concept_id": "EN-Y4-C030",
      "domain_id": "EN-Y4-D003",
      "concept_name": "Retrieving and recording information from non-fiction",
      "description": "Pupils retrieve and record information from non-fiction, knowing what information they need before beginning and using contents pages and indexes to locate it efficiently",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_guidance": "Develop retrieval and recording skills by teaching children to research more complex questions that require information from multiple sources or multiple sections of a text. Teach note-taking strategies: key words, abbreviations, tables and grids for comparing information, and paraphrasing in own words. Emphasise that recording information is not the same as copying text. Model how to cross-reference information from different sources and how to identify when sources disagree. Connect to cross-curricular research projects.",
      "key_vocabulary": "retrieve, record, research, note-taking, paraphrase, source, key words, cross-reference, compare, non-fiction",
      "common_misconceptions": "Children may copy chunks of text rather than selecting and paraphrasing key information. They may not check whether information from different sources is consistent. Some children record all information they find rather than selecting what is relevant to their research question. Others may accept all written information as factual without considering the source."
    },
    {
      "concept_id": "EN-Y4-C031",
      "domain_id": "EN-Y4-D003",
      "concept_name": "Discussion about books",
      "description": "Pupils participate in discussion about both books read to them and those they read independently, taking turns, listening to others, and with expectation that all pupils contribute",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Develop the quality and depth of book discussions in Year 4. Teach children to support their views with evidence from the text, to compare texts with each other, and to consider alternative interpretations. Use Aidan Chambers' 'Tell Me' framework: 'What did you like? What puzzled you? What patterns or connections did you notice?' Provide time for both partner discussions and whole-class conversations about books. Encourage children to recommend books to each other with specific reasons. Teach the difference between sharing a personal response and making a critical judgement about a text.",
      "key_vocabulary": "discuss, respond, interpret, evidence, compare, recommend, critical, opinion, perspective, justify, text",
      "common_misconceptions": "Children may retell the plot as their primary response rather than sharing personal reactions, interpretations or evaluations. They may be reluctant to disagree with peers or the teacher about a text. Some children think there is one 'right' interpretation of a text that the teacher knows and they must discover."
    },
    {
      "concept_id": "EN-Y4-C032",
      "domain_id": "EN-Y4-D004",
      "concept_name": "Prefixes and suffixes spelling rules",
      "description": "Pupils apply spelling rules for adding further prefixes and suffixes to root words as specified in English Appendix 1 for Years 3-4, with understanding of how they change meaning",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Consolidate and extend prefix and suffix spelling rules taught in Year 3. Year 4 adds the prefixes in-, il-, im-, ir- (all meaning 'not'), teaching the rule that the prefix changes to match the initial letter of the root word: illegal (not legal), immature (not mature), irregular (not regular), insecure (not secure). For suffixes, practise the -ation ending (where the root changes: inform → information, explore → exploration) and the -ous ending (fame → famous, danger → dangerous). Use word-sorting activities to consolidate patterns.",
      "key_vocabulary": "prefix, suffix, spelling rule, in-, il-, im-, ir-, -ation, -ous, root word, change, pattern, not",
      "common_misconceptions": "Children may apply the wrong variant of the 'not' prefix (e.g., writing 'inlegal' instead of 'illegal' or 'inresponsible' instead of 'irresponsible'). They may not recognise that all four prefixes (in-, il-, im-, ir-) share the same meaning. Some children double or omit letters at the junction of prefix and root word."
    },
    {
      "concept_id": "EN-Y4-C033",
      "domain_id": "EN-Y4-D004",
      "concept_name": "Suffix doubling rules for polysyllabic words",
      "description": "Pupils apply the rule for doubling the final consonant in stressed syllables before vowel suffixes (forgetting, preferred, beginning) and not doubling in unstressed syllables (gardening, limiting, limitation)",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Revisit and consolidate the consonant doubling rule for polysyllabic words, as this remains a challenging area. Practise with additional examples: refer → referring, referred; occur → occurring, occurred; commit → committing, committed. Contrast with non-doubling examples: visit → visiting (unstressed final syllable); garden → gardening; listen → listening. Use sorting activities: children sort words into 'doubles' and 'doesn't double' categories and articulate the rule in their own words.",
      "key_vocabulary": "double consonant, suffix, stressed syllable, -ing, -ed, -er, polysyllabic, rule, pattern, one vowel",
      "common_misconceptions": "Children may double consonants in words where the final syllable is unstressed (e.g., 'visiting' → 'visitting'). They may not hear the difference between stressed and unstressed syllables. Some children apply the rule to words ending in two consonants (e.g., doubling in 'jumping' → 'jumpping'), where doubling never occurs because the word already ends in two consonants."
    },
    {
      "concept_id": "EN-Y4-C034",
      "domain_id": "EN-Y4-D004",
      "concept_name": "Homophones (Years 3-4)",
      "description": "Pupils correctly spell pairs and groups of homophones and near-homophones from the Years 3-4 list, including accept/except, affect/effect, brake/break, grate/great, weather/whether, whose/who's and others",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Continue practising Years 3-4 homophones with the full list for this phase. Focus on those that cause the most errors in children's writing: there/their/they're, to/too/two, your/you're, its/it's, where/wear/were, here/hear, plain/plane, whether/weather, whose/who's, piece/peace. Teach memory aids: 'their' contains 'heir' (ownership), 'there' contains 'here' (place), 'they're' = 'they are'. Practise through cloze passages and proof-reading activities. Assess in the context of independent writing, not just spelling tests.",
      "key_vocabulary": "homophone, same sound, different spelling, meaning, context, choose, its/it's, there/their/they're, your/you're",
      "common_misconceptions": "Children most commonly confuse its/it's and their/there/they're. They may spell homophones correctly on a test but use the wrong one in independent writing because they are not thinking about meaning. Some children do not understand why English has homophones or why it matters which spelling is used."
    },
    {
      "concept_id": "EN-Y4-C035",
      "domain_id": "EN-Y4-D004",
      "concept_name": "Spelling patterns from various etymologies",
      "description": "Pupils learn specific spelling patterns from Greek, Latin and French origins: /i/ spelt y (myth, gym), /u/ spelt ou (young), -ous suffix, -sure/-ture endings, -sion/-tion/-ssion/-cian endings, ch spelt Greek-style (chorus, scheme), ch spelt French-style (chef, machine), -gue/-que endings (league, antique), sc for /s/ (science), ei/eigh/ey for /ei/ (vein, eight, obey)",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Extend knowledge of etymological spelling patterns. In Year 4, explore how words from different languages follow different spelling conventions: the /ʃ/ sound can be spelt 'sh' (English), 'ch' (French — chef, machine), 'ti' (Latin — station, nation), 'ci' (Latin — special, official), or 'ss' (Latin — mission, discussion). Teach the /k/ sound spelt 'ch' from Greek (chorus, chemistry, character) and 'que' from French (unique, antique). Use etymology dictionaries to investigate word origins when interesting examples arise during reading.",
      "key_vocabulary": "etymology, spelling pattern, origin, French, Greek, Latin, English, /ʃ/ sound, /k/ sound, language",
      "common_misconceptions": "Children may not connect etymology to spelling, seeing them as separate topics. They may apply English phonics rules to words of foreign origin, producing incorrect spellings. Some children find it overwhelming that one sound can have many spellings and may not see the systematic patterns based on word origin."
    },
    {
      "concept_id": "EN-Y4-C036",
      "domain_id": "EN-Y4-D004",
      "concept_name": "Years 3-4 statutory word list",
      "description": "Pupils learn to spell correctly all words from the statutory Years 3-4 word list: accident, actual, address, answer, appear, arrive, believe, bicycle, breath, breathe, build, busy/business, calendar, caught, centre, century, certain, circle, complete, consider, continue, decide, describe, different, difficult, disappear, early, earth, eight/eighth, enough, exercise, experience, experiment, extreme, famous, favourite, February, forward(s), fruit, grammar, group, guard, guide, heard, heart, height, history, imagine, important, increase, interest, island, knowledge, learn, length, library, material, medicine, mention, minute, natural, naughty, notice, occasion(ally), often, opposite, ordinary, particular, peculiar, perhaps, popular, position, possess(ion), possible, potatoes, pressure, probably, promise, purpose, quarter, question, recent, regular, reign, remember, sentence, separate, special, straight, strange, strength, suppose, surprise, therefore, though/although, thought, through, various, weight, woman/women",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Continue systematic practice of the Years 3-4 statutory word list throughout Year 4, with particular attention to words that remain difficult. Use words in sentence-level dictation to practise applying correct spelling in context. Create personal spelling logs where children record words they find challenging. Teach children to use the 'have a go' strategy — trying a word two or three ways to see which looks right — before checking in the dictionary. Connect word list practice to independent writing: children should be expected to spell these words correctly in all written work.",
      "key_vocabulary": "statutory word list, spelling, practise, dictation, personal log, have a go, check, correct, independent",
      "common_misconceptions": "Children may treat word list practice as a separate activity from 'real' writing and not transfer correct spellings to independent work. They may spell words correctly when focusing on spelling but revert to errors when concentrating on content. Some children rely on phonetic approximations for words that require whole-word memorisation."
    },
    {
      "concept_id": "EN-Y4-C037",
      "domain_id": "EN-Y4-D004",
      "concept_name": "Possessive apostrophe with plural nouns",
      "description": "Pupils place the possessive apostrophe accurately with regular plurals (girls', boys', babies') and irregular plurals (children's, men's, mice's), understanding that the apostrophe is placed after the plural form",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Consolidate understanding of the possessive apostrophe with both singular and plural nouns. Teach the rule clearly: for singular nouns, add 's (the cat's tail); for regular plurals ending in -s, add just an apostrophe (the cats' tails); for irregular plurals not ending in -s, add 's (the children's coats). Use a three-column sorting activity where children classify possessive nouns as singular, regular plural or irregular plural. Practise in the context of sentence writing and editing activities. Address possessive apostrophe with names ending in -s (James's or James').",
      "key_vocabulary": "possessive apostrophe, singular, plural, regular, irregular, belongs to, ownership, apostrophe, 's, s'",
      "common_misconceptions": "Children frequently place the apostrophe in the wrong position, writing 'the dog's' when they mean multiple dogs (the dogs'). They may add possessive apostrophes to ordinary plural nouns (e.g., 'the apple's are red'). The irregular plural possessive (children's, women's) catches out many children because it follows the singular pattern."
    },
    {
      "concept_id": "EN-Y4-C038",
      "domain_id": "EN-Y4-D004",
      "concept_name": "Dictionary use for spelling",
      "description": "Pupils use the first two or three letters of a word to check and correct spellings in a dictionary with sufficient efficiency, supported by adequate spelling knowledge",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Develop efficient dictionary use for checking and confirming spellings. Teach children to make a 'best guess' spelling based on their phonic and morphological knowledge, then verify using the dictionary. Teach strategies for finding words when the initial spelling guess is wrong: try alternative phoneme-grapheme correspondences (e.g., if 'nolledge' is not found, try 'knowledge'), look for related words in the same word family, and use a 'hard words to spell' list. Make dictionaries easily accessible during all writing activities.",
      "key_vocabulary": "dictionary, spelling, check, verify, best guess, alternative spelling, word family, confirm, look up",
      "common_misconceptions": "Children may give up looking for a word if their first spelling attempt is not found, rather than trying alternative spellings. They may see dictionary checking as disrupting their writing flow rather than as an integral part of good writing practice. Some children always ask a peer or adult rather than developing dictionary independence."
    },
    {
      "concept_id": "EN-Y4-C039",
      "domain_id": "EN-Y4-D004",
      "concept_name": "Writing from dictation",
      "description": "Pupils write from memory simple sentences dictated by the teacher, demonstrating secure application of all spelling and punctuation knowledge taught so far",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Use dictation as a regular practice activity, increasing complexity from Year 3. Dictate passages of 2-3 sentences at a time, including the punctuation as spoken cues ('capital letter... full stop... new sentence... comma'). Include Years 3-4 statutory word list words, apostrophes for contraction and possession, and varied sentence structures. After dictation, children self-check against the correct version, identifying and categorising their errors (spelling, punctuation, or grammatical). Use the pattern of errors to inform future teaching.",
      "key_vocabulary": "dictation, listen, write, sentence, punctuation, spell, check, self-correct, error, accuracy, pattern",
      "common_misconceptions": "Children may struggle to hold longer sentences in working memory, particularly those with subordinate clauses or multiple punctuation marks. They may focus on spelling at the expense of punctuation or vice versa. Some children transcribe what they hear phonetically rather than applying spelling rules and exception word knowledge."
    },
    {
      "concept_id": "EN-Y4-C040",
      "domain_id": "EN-Y4-D005",
      "concept_name": "Joining strokes in handwriting",
      "description": "Pupils use the diagonal and horizontal strokes needed to join letters and understand which letters, when adjacent, are best left unjoined, with joined handwriting used throughout independent writing",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Continue developing fluent, consistent joined handwriting in Year 4. By this stage, most children should be joining most letters automatically. Focus on maintaining legibility while increasing writing speed. Teach children to adapt their handwriting for different purposes: quick notes can be less neat than a presentation piece. Identify and address persistent formation or joining errors through targeted individual practice. Some children may need to continue using print for specific purposes (labelling diagrams, filling in forms) while using joined writing for continuous text.",
      "key_vocabulary": "joined, cursive, fluent, legible, speed, consistent, join, stroke, adapt, purpose, presentation",
      "common_misconceptions": "Children may equate fast writing with good writing, sacrificing legibility for speed. They may have persistent formation errors (often in letters r, s, k) that become harder to correct the longer they go unaddressed. Some children can write neatly in handwriting practice but produce illegible work when composing because cognitive load affects motor control."
    },
    {
      "concept_id": "EN-Y4-C041",
      "domain_id": "EN-Y4-D005",
      "concept_name": "Handwriting fluency and quality",
      "description": "Pupils increase the legibility, consistency and quality of their handwriting, ensuring parallel equidistant downstrokes, sufficient spacing for ascenders and descenders, and sufficient fluency to keep pace with their ideas",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Develop handwriting fluency and quality by setting clear expectations for presentation across all written work. Teach children to evaluate their own handwriting against the school's handwriting expectations: consistent size, correct joining, clear ascenders and descenders, appropriate spacing. Use self-assessment: children circle their best line of handwriting and identify one thing to improve. Ensure that handwriting practice addresses the specific errors each child makes, rather than whole-class repetition of letter formations that most children have mastered.",
      "key_vocabulary": "fluency, quality, legible, consistent, presentation, self-assess, improve, speed, handwriting, standard",
      "common_misconceptions": "Children may view handwriting practice as unnecessary once they can join letters, not understanding that fluency and quality require ongoing attention. They may not connect legible handwriting to effective communication — if the reader cannot read the writing, the content is lost. Some children's handwriting deteriorates significantly under time pressure (tests, timed writing)."
    },
    {
      "concept_id": "EN-Y4-C042",
      "domain_id": "EN-Y4-D006",
      "concept_name": "Planning writing from model texts",
      "description": "Pupils plan their writing by discussing writing similar to what they plan to write in order to understand and learn from its structure, vocabulary and grammar, considering purpose and audience",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach planning as a structured process using model texts as the basis for writing. Analyse the structure of high-quality model texts together, then use that structure as a planning framework. Teach different planning formats: boxing-up grids (dividing the text into sections with notes for each), flow charts for chronological texts, mind maps for non-chronological texts, and story mountains for narratives. In Year 4, plans should include notes on vocabulary, sentence structures and text features to use, not just content.",
      "key_vocabulary": "plan, model text, structure, boxing up, mind map, flow chart, audience, purpose, vocabulary, draft",
      "common_misconceptions": "Children may write plans that are too detailed, effectively writing a first draft in their plan. They may plan content but not consider structure, vocabulary or audience. Some children produce neat, elaborate plans but then deviate significantly from them during writing, suggesting that planning is not yet integrated into their writing process."
    },
    {
      "concept_id": "EN-Y4-C043",
      "domain_id": "EN-Y4-D006",
      "concept_name": "Generating and recording ideas",
      "description": "Pupils plan writing by discussing and recording ideas, thinking aloud to explore and collect ideas before drafting",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Develop idea-generation skills by teaching children multiple strategies: brainstorming, researching using books and appropriate websites, drawing on personal experience, exploring through drama and discussion, and reading model texts for inspiration. Teach children to select and organise ideas after generating them — not all ideas will be used, and some will be combined. Model the process of choosing the strongest ideas for a piece of writing. Use collaborative idea-generation activities where children build on each other's suggestions.",
      "key_vocabulary": "generate, ideas, brainstorm, research, select, organise, develop, inspiration, choose, combine, record",
      "common_misconceptions": "Children may choose the first idea they think of rather than generating multiple options and selecting the best. They may try to include every idea they generate, producing unfocused writing. Some children struggle to generate ideas independently, relying heavily on teacher prompts or peer suggestions."
    },
    {
      "concept_id": "EN-Y4-C044",
      "domain_id": "EN-Y4-D006",
      "concept_name": "Oral rehearsal of sentences including dialogue",
      "description": "Pupils compose and rehearse sentences orally including dialogue, progressively building a varied and rich vocabulary and an increasing range of sentence structures, understanding how writing differs from speech",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach oral rehearsal of increasingly complex sentences, including sentences with dialogue. Before writing a sentence containing speech, children should rehearse the whole sentence aloud: the reporting clause, the spoken words, and the correct intonation for direct speech. In Year 4, extend to rehearsing short sequences of dialogue between characters, paying attention to how speech sounds natural and how reporting verbs affect the reader's understanding. Use talk partners for rehearsal before independent writing.",
      "key_vocabulary": "rehearse, sentence, aloud, dialogue, speech, reporting verb, intonation, partner, compose, natural",
      "common_misconceptions": "Children may rehearse dialogue that sounds natural in speech but loses clarity in writing because they rely on tone and context rather than explicit reporting. They may rehearse simple sentences but revert to writing more complex structures without rehearsal. Some children see oral rehearsal as childish and resist it, particularly those who are confident writers."
    },
    {
      "concept_id": "EN-Y4-C045",
      "domain_id": "EN-Y4-D006",
      "concept_name": "Paragraphing in composition",
      "description": "Pupils organise writing into paragraphs around a theme, grouping related sentences together, building on the introduction to paragraphs in Year 3",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Develop paragraphing skills in Year 4 with the expectation that all extended writing is organised into paragraphs. Teach children to plan their paragraphs before writing, identifying the main point of each paragraph. In narrative, teach that paragraphs signal changes in time, place, topic or speaker. In non-fiction, teach that each paragraph develops one main idea with supporting details. Model linking paragraphs using cohesive devices: adverbials of time (later that day, meanwhile), connecting phrases (in addition, however, as a result), and pronoun reference.",
      "key_vocabulary": "paragraph, organise, topic sentence, main idea, cohesion, link, adverbial, time, place, topic, speaker",
      "common_misconceptions": "Children may create paragraphs of very uneven length — one very long paragraph followed by several short ones. They may break paragraphs at the wrong point, splitting a single idea across two paragraphs or combining unrelated ideas in one. Some children use paragraphs in one genre (usually non-fiction) but not in another (usually narrative)."
    },
    {
      "concept_id": "EN-Y4-C046",
      "domain_id": "EN-Y4-D006",
      "concept_name": "Narrative elements: setting, character and plot",
      "description": "Pupils create settings, characters and plot in narratives, developing the three elements together to form coherent and engaging stories",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Extend children's ability to develop setting, character and plot in their narrative writing. Teach setting description using sensory details: What can the character see, hear, smell, feel? Teach characterisation through action and dialogue rather than just physical description — show the reader what a character is like through what they say and do. Teach plot structures: problem → complication → climax → resolution. Model these elements in shared writing, drawing explicitly on techniques observed in class reading.",
      "key_vocabulary": "setting, character, plot, describe, dialogue, action, tension, climax, resolution, sensory detail, show",
      "common_misconceptions": "Children may describe characters only by appearance ('She had long brown hair') without revealing personality or motivation. They may rush through the climax of their story because they find writing tension difficult. Some children create elaborate settings but weak plots, or strong plots but flat, undeveloped characters."
    },
    {
      "concept_id": "EN-Y4-C047",
      "domain_id": "EN-Y4-D006",
      "concept_name": "Organisational devices in non-narrative writing",
      "description": "Pupils structure non-fiction writing using simple organisational devices such as headings and sub-headings, understanding that these serve the reader",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach children to use appropriate organisational devices in non-narrative writing, matching the device to the text type and purpose. Teach when to use: headings and subheadings (information reports, explanation texts), bullet points and numbered lists (instructions, summaries), diagrams and labelled illustrations (explanations, reports), text boxes and captions (information texts), and tables (comparison texts). Model choosing and using these devices during shared writing. Study published non-fiction texts to see how professionals use organisational devices.",
      "key_vocabulary": "heading, subheading, bullet point, diagram, caption, text box, table, layout, organise, navigation",
      "common_misconceptions": "Children may use organisational devices inconsistently or inappropriately (e.g., using bullet points within a flowing explanation text). They may add devices after writing rather than using them to plan and organise content. Some children prioritise making their work look visually attractive over ensuring the devices genuinely aid the reader's understanding."
    },
    {
      "concept_id": "EN-Y4-C048",
      "domain_id": "EN-Y4-D006",
      "concept_name": "Evaluating own and others' writing",
      "description": "Pupils assess the effectiveness of their own and others' writing, identifying strengths and suggesting specific improvements, monitoring whether writing makes sense at different levels",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Develop evaluation skills by teaching children to assess their own and others' writing against clear, text-type-specific success criteria. Model the evaluation process: read the writing, identify what meets the success criteria, identify what could be improved, and suggest specific changes. Use the 'what, so what, now what' framework: what has the writer done? Why is it effective (or not)? What specific improvement could they make? Teach children to evaluate organisation, language choices, and audience awareness, not just surface accuracy.",
      "key_vocabulary": "evaluate, success criteria, effective, improve, specific, feedback, strength, target, audience, purpose",
      "common_misconceptions": "Children may focus evaluation on neatness and length rather than quality of content, structure and language. They may give vague feedback ('It's good' or 'You need to add more') rather than specific, actionable suggestions. Some children can evaluate others' writing but not their own because they cannot distance themselves from their intentions."
    },
    {
      "concept_id": "EN-Y4-C049",
      "domain_id": "EN-Y4-D006",
      "concept_name": "Editing for grammar, vocabulary and consistency",
      "description": "Pupils propose changes to grammar and vocabulary to improve consistency, including the accurate use of pronouns in sentences to avoid repetition and ensure clarity",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach editing as a craft skill — the ability to improve the quality of writing by changing vocabulary, sentence structures and organisation. Model editing techniques: replacing weak verbs with strong ones, adding or removing adjectives for precision, combining or splitting sentences for varied rhythm, and reorganising paragraphs for better flow. Teach children to use an editing pen (different colour from their writing pen) to make changes directly on their draft. Ensure children reread their edited version to check that changes improve the text.",
      "key_vocabulary": "edit, revise, improve, vocabulary, sentence structure, reorganise, draft, refine, strengthen, craft",
      "common_misconceptions": "Children may equate editing with adding more detail rather than making existing text better. They may resist editing because they see their first draft as finished. Some children make surface-level changes (swapping one adjective for another) rather than substantive revisions to content, structure or style."
    },
    {
      "concept_id": "EN-Y4-C050",
      "domain_id": "EN-Y4-D006",
      "concept_name": "Proof-reading",
      "description": "Pupils check and correct spelling and punctuation mistakes by re-reading their writing, monitoring meaning as they write",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Consolidate proof-reading skills, teaching children to check systematically for spelling, punctuation and grammatical accuracy. Teach multi-pass proof-reading: read once for spelling (touching each word), once for punctuation (checking sentence boundaries), and once for grammar (reading aloud for sense). Provide year-group-specific proof-reading checklists that include Year 4 expectations: apostrophes for possession, commas after fronted adverbials, speech punctuation, consistent tense, and accurate spelling of statutory word list words.",
      "key_vocabulary": "proof-read, check, correct, spelling, punctuation, grammar, error, accuracy, systematic, checklist",
      "common_misconceptions": "Children may skim-read when proof-reading, reading what they intended rather than what they wrote. They may check for one type of error but miss others. Some children introduce new errors when correcting existing ones because they do not reread the corrected sentence. Others may declare their work 'perfect' without actually checking it carefully."
    },
    {
      "concept_id": "EN-Y4-C051",
      "domain_id": "EN-Y4-D006",
      "concept_name": "Reading aloud own writing",
      "description": "Pupils present their writing orally to a group or whole class with appropriate intonation, controlling tone and volume so that meaning is clear",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Provide regular opportunities for children to read their own writing aloud, treating it as a performance that communicates their work to an audience. In Year 4, increase expectations for expression: children should vary pace, volume and tone to reflect the mood and meaning of their writing. Use peer response: listeners identify specific effective moments and ask questions. Connect reading aloud to the editing process — children often notice weaknesses in their writing when they hear it spoken. Encourage children to read aloud different types of writing: stories, poems, information texts and persuasive writing.",
      "key_vocabulary": "read aloud, perform, expression, intonation, pace, volume, audience, communicate, share, respond",
      "common_misconceptions": "Children may rush through reading their own work because they are self-conscious. They may read aloud without expression because they are concentrating on decoding their own handwriting. Some children ad-lib improvements as they read rather than reading what is actually written, which defeats the purpose of using reading aloud as an editing tool."
    },
    {
      "concept_id": "EN-Y4-C052",
      "domain_id": "EN-Y4-D007",
      "concept_name": "Multi-clause sentences with conjunctions",
      "description": "Pupils extend the range of sentences with more than one clause by using a wider range of conjunctions, including when, if, because, although, creating subordinate clauses for varied effect",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Consolidate and extend multi-clause sentence writing. In Year 4, children should use a wider range of subordinating conjunctions (although, while, until, since, unless, wherever) alongside co-ordinating conjunctions (and, but, or, so, yet). Teach children to vary sentence length and structure deliberately: short sentences for impact, longer multi-clause sentences for explanation and description. Model parsing complex sentences to identify clauses. Use sentence-combining and sentence-expanding activities to develop flexibility.",
      "key_vocabulary": "clause, multi-clause, conjunction, although, while, until, since, subordinate, co-ordinate, vary, sentence",
      "common_misconceptions": "Children may write multi-clause sentences that are grammatically tangled, losing track of the main clause among multiple subordinate clauses. They may use 'when' and 'because' as their default subordinating conjunctions without varying their repertoire. Some children write either all simple sentences or all complex sentences, lacking the ability to vary for effect."
    },
    {
      "concept_id": "EN-Y4-C053",
      "domain_id": "EN-Y4-D007",
      "concept_name": "Present perfect tense",
      "description": "Pupils understand and use the present perfect form of verbs (have/has + past participle) in contrast to the simple past tense, understanding the difference in meaning and when each is appropriate",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Consolidate the present perfect tense by providing regular practice in Year 4 writing. Teach children to choose between the simple past and present perfect with awareness of the difference in meaning: 'I ate lunch' (completed) vs 'I have eaten lunch' (relevant to now). Practise with irregular past participles that cause common errors: gone (not went), done (not did), seen (not saw), written (not wrote), taken (not took). Use dictation and editing activities to reinforce correct usage.",
      "key_vocabulary": "present perfect, has, have, past participle, tense, simple past, irregular, gone, done, seen, written",
      "common_misconceptions": "Children commonly use the simple past form instead of the past participle with 'has/have' (e.g., 'I have went' instead of 'I have gone', 'She has wrote' instead of 'She has written'). They may not understand when to use the present perfect versus the simple past. Some children avoid the present perfect entirely because they find it confusing."
    },
    {
      "concept_id": "EN-Y4-C054",
      "domain_id": "EN-Y4-D007",
      "concept_name": "Pronoun choice for cohesion",
      "description": "Pupils choose nouns or pronouns appropriately for clarity and cohesion within and across sentences, avoiding repetition while ensuring pronoun references are clear",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Develop pronoun use for cohesion in Year 4, focusing on clear and unambiguous pronoun reference. Teach children to check that every pronoun has a clear antecedent — the reader should always know who or what the pronoun refers to. Use editing activities where children identify unclear pronoun reference and revise for clarity. Teach possessive pronouns (his, her, its, their, our, your, my) and demonstrative pronouns (this, that, these, those) alongside personal pronouns. Model choosing between nouns and pronouns for variety and clarity during shared writing.",
      "key_vocabulary": "pronoun, cohesion, reference, antecedent, clear, ambiguous, he, she, they, it, his, her, their",
      "common_misconceptions": "Children frequently use pronouns ambiguously, particularly in narratives with characters of the same gender (e.g., 'Tom told Harry that he was late' — who was late?). They may overuse pronouns, creating passages where the referent is unclear. Conversely, some children avoid pronouns and repeat nouns excessively, producing stilted writing."
    },
    {
      "concept_id": "EN-Y4-C055",
      "domain_id": "EN-Y4-D007",
      "concept_name": "Conjunctions, adverbs and prepositions for time and cause",
      "description": "Pupils use conjunctions (when, before, after, while, so, because), adverbs (then, next, soon, therefore) and prepositions (before, after, during, in, because of) to express time, place and cause in writing",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_guidance": "Extend children's use of conjunctions, adverbs and prepositions to express time, cause and purpose. Year 4 additions include: purpose conjunctions (so that, in order to), concessive conjunctions (although, even though), and a wider range of adverbials (meanwhile, consequently, as a result, in contrast). Teach children to use these connectives to build logical relationships between ideas in both narrative and non-fiction writing. Display a connectives menu organised by function (time, cause, contrast, addition, purpose) for reference during writing.",
      "key_vocabulary": "conjunction, adverb, preposition, time, cause, purpose, although, meanwhile, consequently, so that",
      "common_misconceptions": "Children may overuse one connective function (usually time: 'then... then... then...') without using causal, contrastive or purposive connectives. They may use connectives incorrectly, placing 'however' where 'because' is needed. Some children sprinkle connectives into their writing without understanding the logical relationship they signal."
    },
    {
      "concept_id": "EN-Y4-C056",
      "domain_id": "EN-Y4-D007",
      "concept_name": "Fronted adverbials",
      "description": "Pupils understand and use fronted adverbials placed at the start of sentences for effect (e.g. Later that day, I heard the bad news.) and use commas after them",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Consolidate the use of fronted adverbials in Year 4, extending the range of adverbial types. Teach time adverbials (Later that evening, After several attempts), place adverbials (Beyond the hedge, At the top of the hill), manner adverbials (Cautiously, With great care), and frequency adverbials (Often, Every morning). Ensure children always use a comma after a fronted adverbial. Model using fronted adverbials to improve the opening of sentences and to create variety in sentence structure. Avoid overuse — not every sentence should begin with a fronted adverbial.",
      "key_vocabulary": "fronted adverbial, comma, time, place, manner, sentence opener, variety, adverbial phrase, position",
      "common_misconceptions": "Children commonly forget the comma after a fronted adverbial. They may overuse fronted adverbials, starting every sentence with one, creating a repetitive pattern. Some children confuse fronted adverbials with conjunctions and produce sentence fragments. Others use only single-word adverbials rather than adverbial phrases."
    },
    {
      "concept_id": "EN-Y4-C057",
      "domain_id": "EN-Y4-D007",
      "concept_name": "Direct speech punctuation",
      "description": "Pupils use and punctuate direct speech fully, using inverted commas and other punctuation to indicate direct speech, including a comma after the reporting clause and end punctuation within inverted commas (e.g. The conductor shouted, \"Sit down!\")",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Consolidate direct speech punctuation by practising more complex dialogue structures. Teach: speech before the reporting clause ('Hello,' said Tom.), speech after the reporting clause (Tom said, 'Hello.'), speech interrupted by the reporting clause ('Hello,' said Tom, 'how are you?'), and new speaker on a new line. Practise varying reporting verbs beyond 'said': whispered, exclaimed, asked, replied, muttered, announced. Use drama to generate natural-sounding dialogue that children then punctuate correctly in writing.",
      "key_vocabulary": "speech marks, inverted commas, dialogue, reporting clause, said, asked, replied, new line, comma, punctuation",
      "common_misconceptions": "Children frequently misplace speech marks, particularly forgetting to close them or placing them around the reporting clause as well as the speech. They may not place the comma before the closing speech mark. The interrupted speech pattern ('Hello,' said Tom, 'how are you?') is particularly challenging. Some children put speech marks around reported speech."
    },
    {
      "concept_id": "EN-Y4-C058",
      "domain_id": "EN-Y4-D007",
      "concept_name": "Expanded noun phrases",
      "description": "Pupils expand noun phrases by adding modifying adjectives, nouns and preposition phrases (e.g. the teacher expanded to: the strict maths teacher with curly hair) to build more precise and varied descriptions",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Develop the use of expanded noun phrases with modifiers before and after the noun. In Year 4, extend beyond adjective + noun to include prepositional phrases after the noun: 'the old man with a walking stick', 'the abandoned house on the hill', 'a small kitten with bright green eyes'. Teach children to use expanded noun phrases for precise, vivid description rather than vague generality. Model choosing noun phrases that create specific images in the reader's mind. Connect to reading — identify and discuss effective noun phrases in class texts.",
      "key_vocabulary": "noun phrase, expanded, modifier, adjective, prepositional phrase, describe, detail, precise, vivid, image",
      "common_misconceptions": "Children may add modifiers that are redundant or contradictory ('a big enormous giant'). They may not realise that noun phrases can include information after the noun as well as before it. Some children produce noun phrases that are overloaded with modifiers, making sentences unwieldy and difficult to read."
    },
    {
      "concept_id": "EN-Y4-C059",
      "domain_id": "EN-Y4-D007",
      "concept_name": "Plural vs possessive -s distinction",
      "description": "Pupils understand and apply the grammatical difference between the plural -s (indicating more than one) and the possessive -s (indicating ownership), including with irregular plurals",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach the distinction between plural -s and possessive -s (and possessive s') explicitly in Year 4, as this is a persistent source of error. Use the test: if you can replace '-s' with 'belongs to', it is possessive and needs an apostrophe; if it simply means 'more than one', it is plural and does not. Provide sorting and editing activities: children categorise words ending in -s as plural or possessive and add apostrophes where needed. Practise in sentence contexts to build automaticity.",
      "key_vocabulary": "plural, possessive, apostrophe, -s, 's, belongs to, more than one, singular, grammar, distinguish",
      "common_misconceptions": "This is one of the most common errors in children's writing across all year groups. Children may add apostrophes to all words ending in -s ('the apple's are red') or omit them from all possessives ('the girls coat'). They may know the rule but fail to apply it consistently in independent writing because it requires pausing to consider whether each -s is plural or possessive."
    },
    {
      "concept_id": "EN-Y4-C060",
      "domain_id": "EN-Y4-D007",
      "concept_name": "Standard English verb inflections",
      "description": "Pupils use Standard English forms for verb inflections instead of local spoken forms (e.g. we were instead of we was, or I did instead of I done), understanding the difference between Standard and non-Standard English",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach Standard English verb inflections that differ from non-standard dialect forms. Focus on the key distinctions: 'we were' (not 'we was'), 'I did' (not 'I done'), 'she saw' (not 'she seen'), 'they went' (not 'they gone'), 'he ran' (not 'he run'), 'we have' (not 'we has'). Use editing activities where children identify and correct non-standard verb forms in written text. Approach sensitively: Standard English is expected in writing and formal speech, but dialect is a valid and valued form of communication in other contexts.",
      "key_vocabulary": "Standard English, verb, inflection, we were, I did, she saw, they went, correct, formal, written",
      "common_misconceptions": "Children who speak a non-standard dialect may not hear a difference between 'I done it' and 'I did it', making it difficult to correct in writing. They may apply corrections inconsistently. Some children feel that correcting their verb forms is criticising their home language. Others may overcorrect, producing hypercorrect forms ('I were going')."
    },
    {
      "concept_id": "EN-Y4-C061",
      "domain_id": "EN-Y4-D007",
      "concept_name": "Paragraphs to organise ideas around a theme",
      "description": "Pupils use paragraphs to organise ideas around a theme in their writing, with appropriate choice of pronoun or noun within and across sentences to aid cohesion and avoid repetition",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Develop paragraphing skills by teaching children to organise paragraphs around a clear theme or idea, with explicit topic sentences. In narrative, teach children to use paragraphs to control pace: short paragraphs for fast-paced action or tension, longer paragraphs for description and reflection. In non-fiction, teach that each paragraph should have a clear main idea supported by details, examples or evidence. Model linking paragraphs with cohesive devices that show the relationship between ideas.",
      "key_vocabulary": "paragraph, theme, topic sentence, organise, main idea, detail, evidence, link, cohesion, pace, structure",
      "common_misconceptions": "Children may write paragraphs without topic sentences, making it difficult for the reader to identify the main idea. They may not use linking devices between paragraphs, creating disjointed text. Some children understand paragraphing in one text type (usually non-fiction) but not in another (usually narrative)."
    },
    {
      "concept_id": "EN-Y4-C062",
      "domain_id": "EN-Y4-D007",
      "concept_name": "Year 4 grammatical terminology",
      "description": "Pupils learn and use Year 4 grammatical terminology accurately when discussing writing and reading: determiner, pronoun, possessive pronoun, adverbial (building on cumulative terminology from previous years)",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach the Year 4 grammatical terminology from Appendix 2: determiner, pronoun, possessive pronoun, adverbial. Ensure children can both define these terms and identify examples in context. Teach 'determiner' as the broader category that includes articles (a, an, the), demonstratives (this, that, these, those), possessives (my, your, his, her, its, our, their) and quantifiers (some, many, every). Teach 'adverbial' as a word, phrase or clause that functions as an adverb, telling when, where, how or why.",
      "key_vocabulary": "determiner, pronoun, possessive pronoun, adverbial, article, demonstrative, function, identify, terminology",
      "common_misconceptions": "Children may struggle to understand 'determiner' as a category because it includes many different word types. They may confuse possessive pronouns (mine, yours, his, hers) with possessive determiners (my, your, his, her). Some children know the terminology but cannot explain the function of these elements in a sentence."
    },
    {
      "concept_id": "EN-Y4-C063",
      "domain_id": "EN-Y4-D007",
      "concept_name": "Figurative language and academic vocabulary",
      "description": "Pupils demonstrate understanding of figurative language, distinguish shades of meaning among related words, and use age-appropriate academic vocabulary to express and discuss ideas with precision",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "teaching_guidance": "Introduce figurative language through reading: identify and discuss similes, metaphors, personification and onomatopoeia in class texts. Teach children to use figurative language purposefully in their own writing — to create vivid images, to compare unfamiliar things to familiar ones, and to engage the reader emotionally. Develop academic vocabulary through cross-curricular learning, teaching subject-specific terminology in science, history, geography and RE. Encourage children to use precise, ambitious vocabulary rather than defaulting to simple, familiar words.",
      "key_vocabulary": "figurative language, simile, metaphor, personification, onomatopoeia, academic vocabulary, precise, vivid",
      "common_misconceptions": "Children may use similes and metaphors that are clichéd ('as fast as lightning', 'a blanket of snow') rather than creating original comparisons. They may use figurative language excessively, producing overwritten prose. Some children confuse simile and metaphor. Others may use ambitious vocabulary incorrectly because they have encountered it in reading but not fully understood its meaning."
    },
    {
      "concept_id": "EN-Y4-C064",
      "domain_id": "EN-Y4-D003",
      "concept_name": "Justifying views about reading independently",
      "description": "Pupils increasingly justify their views about what they have read independently by end of Year 4, having developed from supported justification at the start of Year 3 to full independence",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Teach children to justify their views about books with increasing independence and specificity. Encourage children to go beyond 'I liked it because it was exciting' to explain what specifically made it exciting: character development, plot twists, descriptive language, relatable themes. Use book review frameworks that prompt children to evaluate specific aspects: character, setting, plot, language, themes, and overall impact. Teach children to support their views with direct reference to or quotation from the text.",
      "key_vocabulary": "justify, opinion, evidence, review, recommend, character, plot, theme, language, effective, because, quote",
      "common_misconceptions": "Children may give vague evaluative statements ('It was good') without specific justification. They may evaluate books purely on plot (whether they liked what happened) without considering the quality of writing, characterisation or themes. Some children find it difficult to explain why they did not enjoy a book without simply saying 'it was boring'."
    },
    {
      "concept_id": "EN-Y4-C065",
      "domain_id": "EN-Y4-D003",
      "concept_name": "Silent reading with understanding",
      "description": "Pupils read silently with good understanding, applying all comprehension strategies independently, and developing stamina for sustained independent reading",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_guidance": "Continue developing silent reading stamina and comprehension in Year 4. Extend sustained silent reading periods to 15-20 minutes. Teach children to set a reading purpose before starting: 'I'm going to find out about...', 'I want to know what happens to...' Monitor silent reading comprehension through brief partner discussions, reading journals or teacher conferences. Ensure children are reading texts at an appropriate level — challenging enough to develop skills but not so difficult that comprehension breaks down. Teach children to self-select books at the right level.",
      "key_vocabulary": "silent reading, independent, sustained, comprehension, focus, concentrate, appropriate level, purpose, engage",
      "common_misconceptions": "Children may appear to be reading silently but actually be disengaged, turning pages without processing meaning. Some children choose books that are too easy because they are familiar and comfortable, missing opportunities for growth. Others choose books that are too difficult because of peer pressure or the status associated with thick books, and comprehension suffers."
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "EN-Y3-C001",
      "dependent_concept": "EN-Y4-C001",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 active listening skills develop into Year 4 more sophisticated and consistent active listening and response across a wider variety of contexts"
    },
    {
      "prerequisite_concept": "EN-Y3-C002",
      "dependent_concept": "EN-Y4-C002",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 questioning skills develop into Year 4 more probing questions that extend understanding beyond surface meaning"
    },
    {
      "prerequisite_concept": "EN-Y3-C003",
      "dependent_concept": "EN-Y4-C003",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 vocabulary building strategies develop into Year 4 wider and more systematic use of multiple strategies including etymology and morphology"
    },
    {
      "prerequisite_concept": "EN-Y3-C004",
      "dependent_concept": "EN-Y4-C004",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 articulating opinions develops into Year 4 increasingly independent justification of views about what they read, with greater confidence and reasoning"
    },
    {
      "prerequisite_concept": "EN-Y3-C005",
      "dependent_concept": "EN-Y4-C005",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 structured spoken descriptions develop into Year 4 well-structured, purpose-adapted descriptions, explanations and narratives"
    },
    {
      "prerequisite_concept": "EN-Y3-C006",
      "dependent_concept": "EN-Y4-C006",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 collaborative conversation skills develop into Year 4 more sustained and constructive collaborative discussion with greater initiative"
    },
    {
      "prerequisite_concept": "EN-Y3-C007",
      "dependent_concept": "EN-Y4-C007",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 exploratory talk develops into Year 4 more sophisticated use of talk as a genuine thinking tool for speculating and hypothesising"
    },
    {
      "prerequisite_concept": "EN-Y3-C008",
      "dependent_concept": "EN-Y4-C008",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 audible and fluent speech develops into Year 4 increasing command of Standard English, beginning to distinguish Standard from non-Standard forms"
    },
    {
      "prerequisite_concept": "EN-Y3-C009",
      "dependent_concept": "EN-Y4-C009",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 participation in performances and presentations develops into Year 4 greater confidence across a wider variety of formal and informal spoken contexts"
    },
    {
      "prerequisite_concept": "EN-Y3-C010",
      "dependent_concept": "EN-Y4-C010",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Year 3 audience engagement skills develop into Year 4 active monitoring of listener interest with more sophisticated adaptation of delivery"
    },
    {
      "prerequisite_concept": "EN-Y3-C011",
      "dependent_concept": "EN-Y4-C011",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 evaluating viewpoints develops into Year 4 more considered evaluation and constructive building on others' contributions"
    },
    {
      "prerequisite_concept": "EN-Y3-C012",
      "dependent_concept": "EN-Y4-C012",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Year 3 register and audience awareness develops into Year 4 more deliberate and effective selection of appropriate registers, including Standard English in formal contexts"
    },
    {
      "prerequisite_concept": "EN-Y3-C013",
      "dependent_concept": "EN-Y4-C013",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 root word knowledge develops into Year 4 growing application of etymology and morphology to comprehend new vocabulary, with comprehension now primary"
    },
    {
      "prerequisite_concept": "EN-Y3-C014",
      "dependent_concept": "EN-Y4-C014",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 prefix and suffix knowledge develops into Year 4 wider application to read and understand new words, supported by trying different pronunciations for longer words"
    },
    {
      "prerequisite_concept": "EN-Y3-C015",
      "dependent_concept": "EN-Y4-C015",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 exception words provide the foundation for Year 4 reading further exception words from the Years 3-4 statutory list, noting unusual correspondences"
    },
    {
      "prerequisite_concept": "EN-Y3-C017",
      "dependent_concept": "EN-Y4-C016",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 positive attitudes to reading through wide exposure develops into Year 4 more independent choice and appreciation of diverse texts"
    },
    {
      "prerequisite_concept": "EN-Y3-C018",
      "dependent_concept": "EN-Y4-C017",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Year 3 reading for different purposes develops into Year 4 understanding how text structure serves purpose across a wider range of text types"
    },
    {
      "prerequisite_concept": "EN-Y3-C019",
      "dependent_concept": "EN-Y4-C018",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Year 3 dictionary use for reading comprehension develops into Year 4 efficient dictionary use supported by secure knowledge of spelling and alphabetical order"
    },
    {
      "prerequisite_concept": "EN-Y3-C020",
      "dependent_concept": "EN-Y4-C019",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 familiarity with fairy stories, myths and legends develops into Year 4 deeper knowledge of themes and retelling skills with greater independence"
    },
    {
      "prerequisite_concept": "EN-Y3-C021",
      "dependent_concept": "EN-Y4-C020",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 recognition of themes and conventions develops into Year 4 identification across a wider range of books with greater analytical independence"
    },
    {
      "prerequisite_concept": "EN-Y3-C022",
      "dependent_concept": "EN-Y4-C021",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 poetry and play performance develops into Year 4 more polished performance with deeper understanding of how expression supports meaning"
    },
    {
      "prerequisite_concept": "EN-Y3-C023",
      "dependent_concept": "EN-Y4-C022",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 appreciation of effective language develops into Year 4 more sophisticated discussion of vocabulary and exploration of word meaning and origin"
    },
    {
      "prerequisite_concept": "EN-Y3-C024",
      "dependent_concept": "EN-Y4-C023",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 recognition of poetic forms develops into Year 4 broader recognition and appreciation of different forms of poetry"
    },
    {
      "prerequisite_concept": "EN-Y3-C025",
      "dependent_concept": "EN-Y4-C024",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 comprehension monitoring develops into Year 4 more fluent and automatic monitoring of understanding during independent reading"
    },
    {
      "prerequisite_concept": "EN-Y3-C026",
      "dependent_concept": "EN-Y4-C025",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 questioning for comprehension develops into Year 4 more independent formulation of questions, with pupils able to develop and evaluate rules for effective discussion"
    },
    {
      "prerequisite_concept": "EN-Y3-C027",
      "dependent_concept": "EN-Y4-C026",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 drawing inferences with evidence develops into Year 4 more sophisticated and independently justified inference about characters' inner states"
    },
    {
      "prerequisite_concept": "EN-Y3-C028",
      "dependent_concept": "EN-Y4-C027",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 prediction from stated and implied detail develops into Year 4 more confident use of textual evidence for prediction"
    },
    {
      "prerequisite_concept": "EN-Y3-C029",
      "dependent_concept": "EN-Y4-C028",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 identifying main ideas develops into Year 4 synthesising main ideas drawn from more than one paragraph and creating accurate summaries"
    },
    {
      "prerequisite_concept": "EN-Y3-C030",
      "dependent_concept": "EN-Y4-C029",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 understanding of how language, structure and presentation contribute to meaning develops into Year 4 more analytical identification of how authors deliberately use these features"
    },
    {
      "prerequisite_concept": "EN-Y3-C031",
      "dependent_concept": "EN-Y4-C030",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 retrieving information from non-fiction develops into Year 4 more efficient retrieval and recording with clearer task awareness before beginning"
    },
    {
      "prerequisite_concept": "EN-Y3-C032",
      "dependent_concept": "EN-Y4-C031",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 discussion about books develops into Year 4 fuller participation with expectation that all pupils contribute and with independently agreed rules for discussion"
    },
    {
      "prerequisite_concept": "EN-Y3-C034",
      "dependent_concept": "EN-Y4-C032",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 prefix and suffix spelling rules develop into Year 4 consolidation and extension of those rules across further prefixes and suffixes"
    },
    {
      "prerequisite_concept": "EN-Y3-C035",
      "dependent_concept": "EN-Y4-C033",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 introduction to suffix doubling rules for polysyllabic words is consolidated and applied more automatically in Year 4"
    },
    {
      "prerequisite_concept": "EN-Y3-C036",
      "dependent_concept": "EN-Y4-C034",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 learning of homophones develops into Year 4 secure spelling of the full Years 3-4 homophones list"
    },
    {
      "prerequisite_concept": "EN-Y3-C037",
      "dependent_concept": "EN-Y4-C035",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 introduction to etymological spelling patterns is consolidated and extended in Year 4, with pupils applying the full range of Years 3-4 patterns"
    },
    {
      "prerequisite_concept": "EN-Y3-C038",
      "dependent_concept": "EN-Y4-C036",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 learning of the statutory word list continues in Year 4 until all words in the Years 3-4 list are securely known"
    },
    {
      "prerequisite_concept": "EN-Y3-C039",
      "dependent_concept": "EN-Y4-C037",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 introduction to possessive apostrophe with plurals develops into Year 4 accurate placement across both regular and irregular plural nouns"
    },
    {
      "prerequisite_concept": "EN-Y3-C040",
      "dependent_concept": "EN-Y4-C038",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Year 3 dictionary use for spelling develops into Year 4 more efficient dictionary use supported by growing spelling knowledge"
    },
    {
      "prerequisite_concept": "EN-Y3-C041",
      "dependent_concept": "EN-Y4-C039",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 writing from dictation develops into Year 4 more demanding dictated sentences including all punctuation taught so far"
    },
    {
      "prerequisite_concept": "EN-Y3-C042",
      "dependent_concept": "EN-Y4-C040",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 joining strokes in handwriting develops into Year 4 joined handwriting used throughout all independent writing as the norm"
    },
    {
      "prerequisite_concept": "EN-Y3-C043",
      "dependent_concept": "EN-Y4-C041",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 handwriting quality and consistency develops into Year 4 increased fluency to keep pace with ideas, supporting composition and spelling"
    },
    {
      "prerequisite_concept": "EN-Y3-C044",
      "dependent_concept": "EN-Y4-C042",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 planning from model texts develops into Year 4 more analytical study of model texts for structure, vocabulary and grammar to inform own writing"
    },
    {
      "prerequisite_concept": "EN-Y3-C045",
      "dependent_concept": "EN-Y4-C043",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 generating and recording ideas develops into Year 4 more purposeful idea generation linked to audience, purpose and form"
    },
    {
      "prerequisite_concept": "EN-Y3-C046",
      "dependent_concept": "EN-Y4-C044",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 oral rehearsal develops into Year 4 confident oral composition including dialogue, with growing understanding that writing differs from speech"
    },
    {
      "prerequisite_concept": "EN-Y3-C047",
      "dependent_concept": "EN-Y4-C045",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 paragraphing as an organisational concept develops into Year 4 consistent and purposeful use of paragraphs to organise ideas around themes"
    },
    {
      "prerequisite_concept": "EN-Y3-C048",
      "dependent_concept": "EN-Y4-C046",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 narrative elements develop into Year 4 more fully developed creation of setting, character and plot working together in coherent narratives"
    },
    {
      "prerequisite_concept": "EN-Y3-C049",
      "dependent_concept": "EN-Y4-C047",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 organisational devices in non-narrative writing develops into Year 4 more confident and purposeful use of headings and sub-headings"
    },
    {
      "prerequisite_concept": "EN-Y3-C050",
      "dependent_concept": "EN-Y4-C048",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 evaluating writing develops into Year 4 more independent and analytical assessment of effectiveness with specific suggestions for improvement"
    },
    {
      "prerequisite_concept": "EN-Y3-C051",
      "dependent_concept": "EN-Y4-C049",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 editing for grammar and vocabulary develops into Year 4 more systematic proposed changes to improve consistency, including accurate pronoun use"
    },
    {
      "prerequisite_concept": "EN-Y3-C052",
      "dependent_concept": "EN-Y4-C050",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 proof-reading develops into Year 4 more thorough and independent checking of all spelling and punctuation taught to date"
    },
    {
      "prerequisite_concept": "EN-Y3-C053",
      "dependent_concept": "EN-Y4-C051",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 reading aloud own writing develops into Year 4 more polished oral presentation with controlled intonation, tone and volume"
    },
    {
      "prerequisite_concept": "EN-Y3-C054",
      "dependent_concept": "EN-Y4-C052",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 multi-clause sentences with conjunctions develops into Year 4 extension with a wider range of conjunctions used more confidently and accurately"
    },
    {
      "prerequisite_concept": "EN-Y3-C055",
      "dependent_concept": "EN-Y4-C053",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 introduction to present perfect tense develops into Year 4 secure understanding and accurate use in contrast to the simple past"
    },
    {
      "prerequisite_concept": "EN-Y3-C056",
      "dependent_concept": "EN-Y4-C054",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 pronoun choice for cohesion develops into Year 4 consistent and accurate pronoun use within and across sentences to aid cohesion"
    },
    {
      "prerequisite_concept": "EN-Y3-C057",
      "dependent_concept": "EN-Y4-C055",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 conjunctions, adverbs and prepositions for time and cause develops into Year 4 more confident and varied use across all three word classes"
    },
    {
      "prerequisite_concept": "EN-Y3-C058",
      "dependent_concept": "EN-Y4-C056",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 introduction to fronted adverbials develops into Year 4 secure and accurate use including obligatory comma after fronted adverbials"
    },
    {
      "prerequisite_concept": "EN-Y3-C059",
      "dependent_concept": "EN-Y4-C057",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 introduction to inverted commas for direct speech develops into Year 4 full direct speech punctuation including comma after reporting clause and end punctuation within inverted commas"
    },
    {
      "prerequisite_concept": "EN-Y3-C054",
      "dependent_concept": "EN-Y4-C058",
      "confidence": "inferred",
      "relationship_type": "foundational",
      "strength": 0.75,
      "rationale": "Year 3 multi-clause sentence construction provides grammatical foundation for Year 4 expanded noun phrases which require understanding of noun phrase structure within sentences"
    },
    {
      "prerequisite_concept": "EN-Y3-C065",
      "dependent_concept": "EN-Y4-C059",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Year 3 grammatical terminology including singular/plural provides foundation for Year 4 understanding the grammatical distinction between plural and possessive -s"
    },
    {
      "prerequisite_concept": "EN-Y3-C066",
      "dependent_concept": "EN-Y4-C060",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 Standard English awareness develops into Year 4 accurate use of Standard English verb inflections instead of local spoken forms"
    },
    {
      "prerequisite_concept": "EN-Y3-C063",
      "dependent_concept": "EN-Y4-C061",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 paragraphs to group related material develops into Year 4 purposeful use of paragraphs to organise ideas around a theme with cohesive pronoun/noun choice"
    },
    {
      "prerequisite_concept": "EN-Y3-C065",
      "dependent_concept": "EN-Y4-C062",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 grammatical terminology provides the cumulative foundation for Year 4 new terms: determiner, pronoun, possessive pronoun, adverbial"
    },
    {
      "prerequisite_concept": "EN-Y3-C023",
      "dependent_concept": "EN-Y4-C063",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Year 3 identification of effective language develops into Year 4 fuller understanding of figurative language, shades of meaning and academic vocabulary"
    },
    {
      "prerequisite_concept": "EN-Y3-C004",
      "dependent_concept": "EN-Y4-C064",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 articulating and justifying opinions with support develops into Year 4 increasingly independent justification of views about texts, achieved fully by end of Year 4"
    },
    {
      "prerequisite_concept": "EN-Y3-C033",
      "dependent_concept": "EN-Y4-C065",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 developing silent reading with understanding develops into Year 4 secure silent reading with good comprehension as the norm for independent reading"
    },
    {
      "prerequisite_concept": "EN-Y3-C062",
      "dependent_concept": "EN-Y4-C013",
      "confidence": "inferred",
      "relationship_type": "foundational",
      "strength": 0.8,
      "rationale": "Year 3 word families knowledge supports Year 4 application of root word understanding to comprehend meaning of new vocabulary encountered in reading"
    },
    {
      "prerequisite_concept": "EN-Y3-C060",
      "dependent_concept": "EN-Y4-C062",
      "confidence": "inferred",
      "relationship_type": "supportive",
      "strength": 0.7,
      "rationale": "Year 3 noun formation using prefixes supports Year 4 understanding of determiners and noun phrases as extended grammatical structures"
    },
    {
      "prerequisite_concept": "EN-Y3-C061",
      "dependent_concept": "EN-Y4-C062",
      "confidence": "inferred",
      "relationship_type": "supportive",
      "strength": 0.7,
      "rationale": "Year 3 understanding of articles a/an (as determiners) provides foundation for Year 4 explicit learning of the term 'determiner'"
    }
  ]
}