{
  "metadata": {
    "subject": "Geography",
    "key_stage": "KS2",
    "years_covered": [
      3,
      4,
      5,
      6
    ],
    "document_reference": "DFE-00186-2013",
    "extraction_date": "2026-02-17",
    "structure_rating": 8
  },
  "domains": [
    {
      "domain_id": "GE-KS2-D001",
      "domain_name": "Locational Knowledge",
      "description": "Locating the world's countries with focus on Europe and North and South America; studying UK counties, cities and regions; understanding longitude, latitude, Equator, hemispheres, Tropics, Arctic and Antarctic, Prime Meridian and time zones.",
      "curriculum_context": "At KS2, locational knowledge expands from the foundational continent and ocean framework of KS1 to more precise spatial knowledge. Pupils locate countries across Europe and the Americas, and develop understanding of the coordinate system of longitude and latitude that allows any point on Earth to be precisely located. The study of UK counties, cities and regions develops pupils' detailed knowledge of their own country. The addition of key lines of latitude (Equator, Tropics of Cancer and Capricorn, Arctic and Antarctic Circles) and the Prime Meridian provides pupils with the geographic grid that scientists, navigators and geographers use to describe global location, connecting geography to science and mathematics. Time zones introduce the concept that place on Earth directly affects lived experience through the timing of day and night.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "GE-KS2-D002",
      "domain_name": "Place Knowledge",
      "description": "Understanding and comparing the human and physical geography of a region of the United Kingdom, a region in a European country, and a region within North or South America.",
      "curriculum_context": "Place knowledge at KS2 requires the in-depth study of three distinct regions at different scales and in different parts of the world: a UK region, a European region, and a region in North or South America. Each region study develops pupils' ability to describe, explain and compare the human and physical characteristics of a place, considering how physical geography shapes human activity and how human activity transforms physical landscapes. The comparison of regions from different continents ensures that pupils encounter genuinely diverse human geographies, challenging assumptions based on their own experience and developing the broader perspectives that characterise geographical understanding. These region studies also develop pupils' knowledge of specific places, giving them concrete geographical reference points that support broader spatial learning.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "GE-KS2-D003",
      "domain_name": "Human and Physical Geography",
      "description": "Describing and understanding key aspects of physical geography including climate zones, biomes, vegetation belts, rivers, mountains, volcanoes, earthquakes and the water cycle; and human geography including settlement types, land use, trade and the distribution of natural resources.",
      "curriculum_context": "The scope of physical and human geography content expands substantially at KS2, moving from descriptive knowledge of features to explanatory understanding of processes. In physical geography, pupils learn about the major climate zones and biomes of the world, the geomorphological processes that shape rivers, mountains, coasts and volcanoes, and the hydrological cycle that connects land, sea and atmosphere. In human geography, pupils understand how settlements grow, how different types of economic activity are distributed, and how trade and natural resources shape human geography at global scales. This shift from description to explanation marks the most significant progression in geographical thinking at KS2, as pupils learn not just what the world looks like but why it is as it is.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "GE-KS2-D004",
      "domain_name": "Geographical Skills and Fieldwork",
      "description": "Using maps, atlases, globes and digital/computer mapping to locate countries and describe features; using 8-point compass, 4 and 6-figure grid references, symbols and key features of Ordnance Survey maps; planning and conducting fieldwork in the local environment and further afield.",
      "curriculum_context": "Geographical skills at KS2 develop substantially in precision and range. Pupils extend their use of compass directions from four to eight points; they learn to use grid references to locate specific points on Ordnance Survey maps with increasing precision; and they develop the ability to interpret the conventional symbols and topographic information on standard UK maps. Digital and computer mapping tools introduce pupils to GIS (geographical information systems) and satellite mapping as contemporary geographical technologies. Fieldwork at KS2 extends beyond the school grounds to include the wider local environment, incorporating the collection of primary data through observation, sketch maps, plans, graphs and digital technologies. These skills equip pupils to conduct genuine geographical enquiry, asking questions about the world and gathering evidence to answer them.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    }
  ],
  "objectives": [
    {
      "objective_id": "GE-KS2-O001",
      "domain_id": "GE-KS2-D001",
      "objective_text": "locate the world's countries, using maps to focus on Europe (including the location of Russia) and North and South America, concentrating on their environmental regions, key physical and human characteristics, countries, and major cities",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "GE-KS2-O002",
      "domain_id": "GE-KS2-D001",
      "objective_text": "name and locate counties and cities of the United Kingdom, geographical regions and their identifying human and physical characteristics, key topographical features (including hills, mountains, coasts and rivers), and land-use patterns; and understand how some of these aspects have changed over time",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "GE-KS2-O003",
      "domain_id": "GE-KS2-D001",
      "objective_text": "identify the position and significance of latitude, longitude, Equator, Northern Hemisphere, Southern Hemisphere, the Tropics of Cancer and Capricorn, Arctic and Antarctic Circle, the Prime/Greenwich Meridian and time zones (including day and night)",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "GE-KS2-O004",
      "domain_id": "GE-KS2-D002",
      "objective_text": "understand geographical similarities and differences through the study of human and physical geography of a region of the United Kingdom, a region in a European country, and a region within North or South America",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "GE-KS2-O005",
      "domain_id": "GE-KS2-D003",
      "objective_text": "describe and understand key aspects of physical geography, including: climate zones, biomes and vegetation belts, rivers, mountains, volcanoes and earthquakes, and the water cycle",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "GE-KS2-O006",
      "domain_id": "GE-KS2-D003",
      "objective_text": "describe and understand key aspects of human geography, including: types of settlement and land use, economic activity including trade links, and the distribution of natural resources including energy, food, minerals and water",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "GE-KS2-O007",
      "domain_id": "GE-KS2-D004",
      "objective_text": "use maps, atlases, globes and digital/computer mapping to locate countries and describe features studied",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "GE-KS2-O008",
      "domain_id": "GE-KS2-D004",
      "objective_text": "use the eight points of a compass, four and six-figure grid references, symbols and key (including the use of Ordnance Survey maps) to build their knowledge of the United Kingdom and the wider world",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "GE-KS2-O009",
      "domain_id": "GE-KS2-D004",
      "objective_text": "use fieldwork to observe, measure, record and present the human and physical features in the local area using a range of methods, including sketch maps, plans and graphs, and digital technologies",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "GE-KS2-C001",
      "domain_id": "GE-KS2-D001",
      "concept_name": "Latitude, Longitude and the Global Grid",
      "description": "Latitude and longitude are a coordinate system used to identify any location on Earth's surface. Lines of latitude run parallel to the Equator and measure distance north or south (0-90 degrees); lines of longitude run from Pole to Pole and measure distance east or west of the Prime Meridian (0-180 degrees). Special lines of latitude - the Equator, Tropics of Cancer and Capricorn, and the Arctic and Antarctic Circles - mark significant climatic boundaries. The Prime Meridian (0 degrees longitude) divides the Eastern and Western Hemispheres and is the reference for time zones. At KS2, pupils learn to use this system to locate and describe global position.",
      "teaching_guidance": "Teach latitude and longitude together as a coordinate system, drawing parallels with grid references on UK maps. Use a globe with clearly marked latitude and longitude lines. Explain the significance of the key lines: the Equator (maximum solar heating), the Tropics (limits of overhead sun), the Arctic/Antarctic Circles (limits of midnight sun). Connect to time zones by showing how 15 degrees of longitude equals one hour of time difference. Use digital mapping tools to give coordinates for familiar places.",
      "key_vocabulary": "latitude, longitude, Equator, hemisphere, tropic, Arctic, Antarctic, Prime Meridian, coordinate, degree, north, south, east, west, time zone, parallel, meridian",
      "common_misconceptions": "Pupils frequently confuse latitude (horizontal lines, measuring north-south) with longitude (vertical lines, measuring east-west). A consistent mnemonic (latitude = flat/horizontal) helps. The fact that the Equator is 0 degrees latitude while the Poles are 90 degrees is sometimes reversed; connecting 0 degrees to 'no tilt' and 90 degrees to 'maximum distance from equator' helps. Pupils may not understand why time zones exist; connecting them to the Earth's rotation and the 24-hour day makes the concept concrete.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "GE-KS2-C002",
      "domain_id": "GE-KS2-D003",
      "concept_name": "Climate Zones and Biomes",
      "description": "Climate zones are large areas of the Earth characterised by similar patterns of temperature and rainfall, determined primarily by latitude. The main climate zones are tropical, subtropical, temperate, continental, polar and mountainous. Biomes are large ecological communities defined by their climate and vegetation: rainforest, savannah, desert, grassland, deciduous forest, coniferous forest, tundra and polar ice. At KS2, pupils develop understanding of how climate shapes the vegetation and wildlife of different regions, connecting physical and biological geography.",
      "teaching_guidance": "Use world climate and biome maps to show the distribution of different zones. Connect climate zones to latitude using the global grid: equatorial regions are typically tropical, polar regions are cold. Study specific biomes in depth: what are the characteristics, adaptations of plants and animals, human uses? Explore how climate change is altering biome boundaries. Compare a UK biome (temperate deciduous forest) with a contrasting global biome (tropical rainforest or desert). Connect to human geography by exploring how people adapt to different climate zones.",
      "key_vocabulary": "climate zone, biome, tropical, temperate, polar, arctic, desert, rainforest, savannah, tundra, vegetation belt, adaptation, precipitation, temperature, ecosystem",
      "common_misconceptions": "Pupils may confuse climate zone with biome; clarifying that climate determines what biome can exist in an area resolves this. Pupils may think deserts are always hot; cold deserts (Gobi, Antarctica) challenge this assumption. The idea that tropical regions are always wet is also inaccurate; tropical wet and dry seasons should be distinguished. Pupils may underestimate how dramatically human activity has altered natural biomes; discussing deforestation and agriculture develops critical awareness.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "GE-KS2-C003",
      "domain_id": "GE-KS2-D003",
      "concept_name": "River Systems and the Water Cycle",
      "description": "A river system comprises a river and all its tributaries, flowing through a drainage basin from source to mouth. Rivers shape the landscape through the processes of erosion, transportation and deposition, creating characteristic landforms including valleys, meanders, ox-bow lakes, deltas and floodplains. The water cycle describes the continuous movement of water between ocean, atmosphere, land and rivers through processes of evaporation, condensation, precipitation, run-off and infiltration. At KS2, pupils develop understanding of both river processes and the wider hydrological cycle that sustains freshwater systems.",
      "teaching_guidance": "Use diagrams and models to explain the water cycle, connecting the processes to observable phenomena (clouds, rain, rivers, evaporation). Study a specific river system in detail: trace it from source to mouth on a map, identify key tributaries and settlements, study the features at different stages. Use photographs to study river landforms at different locations. Connect rivers to human activity: water supply, settlements, trade, flooding. Investigate local rivers or streams through fieldwork.",
      "key_vocabulary": "river, source, mouth, tributary, drainage basin, meander, flood plain, erosion, deposition, transportation, water cycle, evaporation, condensation, precipitation, run-off, infiltration",
      "common_misconceptions": "Pupils often think rivers flow uphill at some point; careful explanation of how gravity determines flow direction addresses this. The water cycle is often presented too simplistically; exploring the variety of pathways water can take (groundwater, evapotranspiration, run-off) develops more accurate understanding. Pupils may not connect rivers to the water cycle; linking the discussion of river flow to rainfall and precipitation makes the connection explicit.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "GE-KS2-C004",
      "domain_id": "GE-KS2-D003",
      "concept_name": "Settlement and Economic Geography",
      "description": "Settlements are places where people live and work, ranging from small hamlets to megacities. Their location, growth and character are shaped by physical factors (water supply, defensibility, flat land, resources) and human factors (trade routes, industry, government decisions). Economic activity is classified into sectors: primary (extracting raw materials), secondary (manufacturing), tertiary (services) and quaternary (knowledge-based). The distribution of natural resources including food, minerals, energy and water shapes economic activity and trade between places at global scales. At KS2, pupils develop conceptual frameworks for understanding why places are where they are and how economies work.",
      "teaching_guidance": "Study local settlement history: why was the town/city located here? What factors drove its growth? Compare settlement patterns in different environments: how do desert settlements differ from coastal or riverside ones? Use examples of global trade to illustrate economic interdependence. Investigate the origin of food and goods in the classroom or school. Map the distribution of specific natural resources (oil, minerals, food production) and connect to trade patterns. Explore how economic activity changes over time in a specific area.",
      "key_vocabulary": "settlement, hamlet, village, town, city, conurbation, urbanisation, primary sector, secondary sector, tertiary sector, trade, import, export, natural resource, energy, mineral, distribution",
      "common_misconceptions": "Pupils may think cities grow randomly rather than for geographical reasons. Studying the historical reasons for settlement location challenges this. The concept of comparative advantage in trade can be difficult; concrete examples of why one place might specialise in particular goods make it accessible. Pupils may not appreciate the scale of global economic interdependence; tracking the journey of a familiar product from raw material to consumer makes global connections tangible.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "GE-KS2-C005",
      "domain_id": "GE-KS2-D004",
      "concept_name": "Ordnance Survey Maps and Grid References",
      "description": "Ordnance Survey (OS) maps are detailed topographic maps of Great Britain produced to standard conventions, using a national grid reference system, contour lines to represent relief, and a comprehensive set of conventional symbols. Four-figure grid references identify a 1km grid square; six-figure grid references identify a 100m square within that. The OS map is the primary tool for geographical fieldwork and navigation in the UK context, and the skills required to use it effectively - reading symbols, using grid references, interpreting contours - are core geographical competencies at KS2.",
      "teaching_guidance": "Teach grid references systematically: 'along the corridor and up the stairs' as a mnemonic for reading eastings before northings. Practice with familiar local OS maps before unfamiliar ones. Teach contour interpretation by connecting the map to photographs and the real landscape. Build proficiency progressively: four-figure references before six-figure. Use the OS map symbol key and test recognition of common symbols. Plan routes using OS maps, calculating distances using scale. Combine with fieldwork by using OS maps in the local area.",
      "key_vocabulary": "Ordnance Survey, grid reference, easting, northing, contour, elevation, symbol, key, scale, relief, topographic, national grid, four-figure, six-figure, spot height",
      "common_misconceptions": "Pupils consistently confuse the order of grid references, giving northings before eastings. The 'along the corridor and up the stairs' mnemonic helps, but consistent practice is essential. Contour interpretation is challenging; many pupils cannot readily visualise three-dimensional relief from two-dimensional contour lines. Building up from simple cross-sections and physical models helps. Pupils may not understand that the scale bar means different things at different zoom levels.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "GE-KS1-C001",
      "dependent_concept": "GE-KS2-C001",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS1 knowledge of continents and oceans provides the global framework within which the more precise coordinate system of latitude and longitude is learned at KS2."
    },
    {
      "prerequisite_concept": "GE-KS1-C003",
      "dependent_concept": "GE-KS2-C002",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "KS1 weather and climate knowledge including the relationship between latitude and temperature is prerequisite to the more detailed study of global climate zones and biomes at KS2."
    },
    {
      "prerequisite_concept": "GE-KS2-C001",
      "dependent_concept": "GE-KS2-C002",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.8,
      "rationale": "Understanding latitude is essential to understanding why climate zones and biomes are distributed as they are, since temperature varies systematically with latitude."
    },
    {
      "prerequisite_concept": "GE-KS1-C005",
      "dependent_concept": "GE-KS2-C005",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 skills of using maps, compass directions and simple symbols are the foundation on which the more demanding Ordnance Survey map skills and grid references of KS2 are built."
    }
  ]
}
