{
  "metadata": {
    "subject": "Geography",
    "key_stage": "KS1",
    "years_covered": [
      1,
      2
    ],
    "document_reference": "DFE-00186-2013",
    "extraction_date": "2026-02-17",
    "structure_rating": 8
  },
  "domains": [
    {
      "domain_id": "GE-KS1-D001",
      "domain_name": "Locational Knowledge",
      "description": "Naming and locating the world's seven continents and five oceans; naming, locating and identifying characteristics of the four countries and capital cities of the United Kingdom and its surrounding seas.",
      "curriculum_context": "Locational knowledge provides the spatial framework within which all other geographical learning is situated. At KS1, pupils build a mental map of the world at the broadest scale, learning the names and positions of the seven continents and five oceans that structure global geography. Within this global framework, pupils also develop detailed locational knowledge of the United Kingdom itself - its four constituent countries, their capitals and the surrounding seas. This dual focus on global and local scales is characteristic of geographical thinking: understanding where places are relative to each other is the foundation for understanding how the physical and human world is organised. Accurate locational knowledge enables pupils to make sense of news, travel and global connections they encounter in everyday life.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "GE-KS1-D002",
      "domain_name": "Place Knowledge",
      "description": "Understanding the human and physical similarities and differences between a small area of the United Kingdom and a small area in a contrasting non-European country.",
      "curriculum_context": "Place knowledge involves understanding specific places in depth, including their physical and human characteristics, and developing the ability to compare and contrast places at different locations. At KS1, pupils study a locality in the United Kingdom and compare it with a contrasting area in a non-European country, developing the twin skills of description and comparison. The requirement to study a non-European location is significant: it ensures that pupils' experience of world geography goes beyond European perspectives from the earliest stages of education, building openness to diverse human geographies. Through place study, pupils learn that geography is not merely about memorising facts but about understanding how and why places are as they are, and how they are similar to and different from each other.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "GE-KS1-D003",
      "domain_name": "Human and Physical Geography",
      "description": "Identifying seasonal and daily weather patterns in the United Kingdom and the location of hot and cold areas in relation to the Equator and North and South Poles; using basic vocabulary to refer to key physical and human features.",
      "curriculum_context": "Human and physical geography at KS1 introduces pupils to the two great divisions of the subject: the study of the natural world (physical geography) and the study of human activity in places (human geography). Pupils learn to observe and describe seasonal and daily weather patterns - a familiar and observable physical phenomenon - and understand the relationship between latitude and temperature by considering the Equator and the Poles. The explicit vocabulary requirements for both physical features (beach, cliff, coast, forest, hill, mountain, sea, ocean, river, soil, valley, vegetation, season, weather) and human features (city, town, village, factory, farm, house, office, port, harbour, shop) establish the disciplinary language that pupils need to describe and discuss the world around them with precision.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "GE-KS1-D004",
      "domain_name": "Geographical Skills and Fieldwork",
      "description": "Using world maps, atlases and globes; using compass directions (North, South, East and West) and locational and directional language; using aerial photographs and plan perspectives; carrying out simple fieldwork.",
      "curriculum_context": "Geographical skills are the methods and tools geographers use to collect, present and analyse spatial information. At KS1, pupils learn to use the fundamental tools of geographical enquiry: maps, atlases and globes as representations of the world; compass directions as a system for describing spatial relationships; aerial photographs and plan perspectives as ways of seeing the world from above. These tools are complementary: maps represent the world symbolically, photographs show it visually, and compass directions provide a shared language for describing location and movement. Fieldwork at KS1 brings geographical skills into the local environment, giving pupils direct experience of observing, recording and questioning the world around them, establishing the enquiry habits that are central to geographical study.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    }
  ],
  "objectives": [
    {
      "objective_id": "GE-KS1-O001",
      "domain_id": "GE-KS1-D001",
      "objective_text": "name and locate the world's seven continents and five oceans",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "GE-KS1-O002",
      "domain_id": "GE-KS1-D001",
      "objective_text": "name, locate and identify characteristics of the four countries and capital cities of the United Kingdom and its surrounding seas",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "GE-KS1-O003",
      "domain_id": "GE-KS1-D002",
      "objective_text": "understand geographical similarities and differences through studying the human and physical geography of a small area of the United Kingdom, and of a small area in a contrasting non-European country",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "GE-KS1-O004",
      "domain_id": "GE-KS1-D003",
      "objective_text": "identify seasonal and daily weather patterns in the United Kingdom and the location of hot and cold areas of the world in relation to the Equator and the North and South Poles",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "GE-KS1-O005",
      "domain_id": "GE-KS1-D003",
      "objective_text": "use basic geographical vocabulary to refer to: key physical features, including: beach, cliff, coast, forest, hill, mountain, sea, ocean, river, soil, valley, vegetation, season and weather; key human features, including: city, town, village, factory, farm, house, office, port, harbour and shop",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "GE-KS1-O006",
      "domain_id": "GE-KS1-D004",
      "objective_text": "use world maps, atlases and globes to identify the United Kingdom and its countries, as well as the countries, continents and oceans studied at this key stage",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "GE-KS1-O007",
      "domain_id": "GE-KS1-D004",
      "objective_text": "use simple compass directions (North, South, East and West) and locational and directional language [for example, near and far; left and right], to describe the location of features and routes on a map",
      "non_statutory_guidance": null,
      "examples": "near and far; left and right",
      "is_statutory": true
    },
    {
      "objective_id": "GE-KS1-O008",
      "domain_id": "GE-KS1-D004",
      "objective_text": "use aerial photographs and plan perspectives to recognise landmarks and basic human and physical features; devise a simple map; and use and construct basic symbols in a key",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "GE-KS1-O009",
      "domain_id": "GE-KS1-D004",
      "objective_text": "use simple fieldwork and observational skills to study the geography of their school and its grounds and the key human and physical features of its surrounding environment",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "GE-KS1-C001",
      "domain_id": "GE-KS1-D001",
      "concept_name": "World Geography: Continents and Oceans",
      "description": "The Earth's surface is divided into seven large landmasses called continents (Africa, Antarctica, Asia, Australia/Oceania, Europe, North America, South America) and five major oceans (Arctic, Atlantic, Indian, Pacific, Southern). These are the fundamental units of world geography, providing the spatial framework within which countries, cities and physical features are located. At KS1, pupils learn to name, locate and recall these major global features, building the mental map that underpins all subsequent geographical learning.",
      "teaching_guidance": "Use large world maps and globes regularly. Teach continent and ocean names through songs, chants and repeated mapping activities. Use a globe to reinforce the spherical nature of the Earth and why the Equator, Poles and Tropics matter. Play games where pupils place labels on unlabelled world maps. Connect continents to relevant contexts: which continent is our school in? Which ocean would you cross to get to Australia? Use aerial and satellite images to show what continents look like from space.",
      "key_vocabulary": "continent, ocean, Africa, Antarctica, Asia, Australia, Europe, North America, South America, Pacific, Atlantic, Indian, Arctic, Southern, globe, world map",
      "common_misconceptions": "Pupils may confuse countries with continents, for example thinking 'Africa' is a country. Regular comparison of political and physical maps helps clarify the distinction. The status of Australia as both a continent and a country causes confusion; explicit teaching of this as a special case is needed. Pupils may not understand that the Equator divides the globe into hemispheres; connecting this to temperature zones makes it meaningful.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 1,
      "co_teach_hints": []
    },
    {
      "concept_id": "GE-KS1-C002",
      "domain_id": "GE-KS1-D001",
      "concept_name": "United Kingdom: Countries and Capitals",
      "description": "The United Kingdom is a political union comprising four countries: England, Scotland, Wales and Northern Ireland, each with its own capital city (London, Edinburgh, Cardiff and Belfast respectively). The UK is surrounded by the North Sea, English Channel, Irish Sea and Atlantic Ocean. At KS1, pupils learn to identify the four countries, their capitals and their positions within the UK, alongside awareness of the surrounding seas.",
      "teaching_guidance": "Use maps of the UK regularly, pointing out and naming the four countries and their capitals. Make connections to pupils' own location: which country do we live in? What is our capital? Use physical outline maps for pupils to label. Connect to current events and news that reference specific UK countries. Explore the flags of the four countries and the Union Flag. Link to the surrounding seas by tracing routes on maps.",
      "key_vocabulary": "United Kingdom, England, Scotland, Wales, Northern Ireland, London, Edinburgh, Cardiff, Belfast, capital, country, border, sea, coast, English Channel, North Sea, Irish Sea, Atlantic",
      "common_misconceptions": "Pupils frequently confuse England with the United Kingdom and with Britain. Deliberate and consistent use of precise terms - UK, Britain, Great Britain, England - with clear definitions addresses this. Some pupils may not know that Northern Ireland is part of the UK; using maps that clearly show all four countries together prevents this misunderstanding.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 1,
      "co_teach_hints": []
    },
    {
      "concept_id": "GE-KS1-C003",
      "domain_id": "GE-KS1-D003",
      "concept_name": "Weather and Climate",
      "description": "Weather describes the atmospheric conditions at a specific place and time - whether it is sunny, rainy, windy or cloudy - while climate describes the typical or average weather pattern of a place over a longer period. At KS1, pupils observe and record daily and seasonal weather patterns in the UK, developing understanding of why weather varies through the day and through the year. The relationship between latitude and temperature - how places nearer the Equator are generally warmer than places nearer the Poles - provides the foundational explanation for global climate variation.",
      "teaching_guidance": "Carry out regular weather observation and recording: daily weather symbols, temperature readings, rainfall records. Create weather diaries and simple graphs over time. Discuss seasonal patterns: what is different in winter and summer? Use photographs from around the world to explore how climate varies with latitude. Connect to the Equator and Poles on a globe to explain why some places are hot (near Equator) and some cold (near Poles). Relate weather to people's activities: how do seasonal changes affect farming, clothing, outdoor activities?",
      "key_vocabulary": "weather, climate, season, spring, summer, autumn, winter, temperature, rainfall, sunshine, wind, cloud, forecast, Equator, poles, latitude, hot, cold, warm, cool",
      "common_misconceptions": "Pupils often confuse weather and climate. Using the phrase 'weather is what you get, climate is what you expect' helps establish the distinction. Pupils may think the UK has no summer or no winter based on extreme contrasts with other countries; a nuanced discussion of the UK's temperate climate is needed. The relationship between latitude and temperature can seem counterintuitive when placed on a flat map; a globe makes this relationship much clearer.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 1,
      "co_teach_hints": []
    },
    {
      "concept_id": "GE-KS1-C004",
      "domain_id": "GE-KS1-D003",
      "concept_name": "Physical and Human Features",
      "description": "Geography categorises features of the world into physical features - those created by natural processes including landforms, water bodies and vegetation - and human features - those created by people including settlements, buildings and land uses. At KS1, pupils learn the key vocabulary for both types of feature, developing the language to describe and categorise the world around them and in studied places. Understanding the distinction between physical and human geography is foundational to the discipline.",
      "teaching_guidance": "Use photographs of local and distant places to identify and classify physical and human features. Sort feature cards into physical and human categories. Take pupils outdoors to observe and name physical and human features in the school environment and local area. Use the vocabulary list actively: say and write the words alongside images. Connect vocabulary to pupils' direct experience: 'We live in a city/town/village' - which is our human feature? What physical features can we see from the window?",
      "key_vocabulary": "beach, cliff, coast, forest, hill, mountain, sea, ocean, river, soil, valley, vegetation, city, town, village, factory, farm, house, office, port, harbour, shop, physical, human, feature, landscape",
      "common_misconceptions": "Pupils may find the distinction between physical and human features unclear for some cases - a canal is human but a river is physical; a park could be either. Discussing borderline cases develops more sophisticated understanding. Pupils may not recognise common local features as 'geographical' until they are pointed out and named. Building observation skills through regular local fieldwork develops geographical awareness.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 1,
      "co_teach_hints": []
    },
    {
      "concept_id": "GE-KS1-C005",
      "domain_id": "GE-KS1-D004",
      "concept_name": "Maps, Atlases and Globes",
      "description": "Maps, atlases and globes are the primary tools geographers use to represent and communicate spatial information. A map is a flat, symbolic representation of a part of the Earth's surface; an atlas is a collection of maps in book form; a globe is a three-dimensional spherical representation. Each has different advantages: globes accurately show the relative sizes of continents and the shape of the Earth, while maps are more portable and convenient for showing detailed information. At KS1, pupils learn to use and interpret each type of representation, developing their ability to extract locational information.",
      "teaching_guidance": "Make atlases, maps and a globe available as regular classroom resources. Teach pupils how to use a contents page and index in an atlas. Practice using compass directions on maps. Teach pupils to recognise and construct simple map symbols and keys. Use aerial photographs alongside maps to connect the plan view to the real environment. Progressively increase the complexity of maps pupils use: from picture maps to simple symbol maps to more conventional representations.",
      "key_vocabulary": "map, atlas, globe, symbol, key, compass, north, south, east, west, direction, scale, aerial, plan view, represent, location, grid, legend",
      "common_misconceptions": "Pupils may not understand that maps are simplified representations that omit detail. Comparing a photograph with a map of the same area makes the process of abstraction visible. The convention of north at the top of a map is not universal; explaining why it is conventional helps pupils understand maps as human constructions. Some pupils may struggle to interpret the top-down (plan) perspective of maps; relating it to the aerial photographs they see helps bridge this.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 1,
      "co_teach_hints": []
    },
    {
      "concept_id": "GE-KS1-C006",
      "domain_id": "GE-KS1-D002",
      "concept_name": "Place Study and Comparison",
      "description": "Place study involves developing detailed knowledge of a specific location, understanding its human geography (how people live and work there) and its physical geography (its natural landscape, climate and environment). At KS1, pupils compare a small area of the United Kingdom with a contrasting small area in a non-European country. Comparing places reveals both the universal features of human settlement (all communities need food, shelter, places to work and play) and the differences that arise from location, culture and natural environment. This introduces pupils to the geographical concept of place as somewhere with particular character, not merely a dot on a map.",
      "teaching_guidance": "Choose a contrasting non-European locality that offers genuine differences: a Kenyan village, an Indian town, an area of rural China. Gather photographs, maps and accounts of daily life in both areas. Structure comparisons using consistent frameworks: what people do for work, what children's lives look like, what the landscape looks like, what the weather is like. Avoid stereotyping: show the diversity within the contrasting location, not only its most exotic or dramatic features. Enable pupils to see both similarities and differences: children in both places go to school, families in both places share meals, people in both places play and celebrate. Making the familiar strange (looking at the UK through fresh eyes) and the strange familiar (finding shared human experiences across distance) develops geographical empathy.",
      "key_vocabulary": "place, compare, contrast, similarities, differences, human, physical, local area, country, non-European, settlement, community, landscape, environment, characteristics",
      "common_misconceptions": "Pupils may focus only on differences between places, ignoring the fundamental similarities in human needs and activities. Explicitly identifying shared human experiences across both localities prevents the othering of distant places. Pupils may believe that more distant places are automatically more different; showing that some non-European localities share characteristics with the UK (urban density, similar climates) challenges this assumption. Stereotyping of non-European localities is a persistent risk; using specific, contemporary photographic evidence rather than generalised descriptions maintains accuracy.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 1,
      "co_teach_hints": []
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "GE-KS1-C001",
      "dependent_concept": "GE-KS1-C002",
      "confidence": "inferred",
      "relationship_type": "logical",
      "strength": 0.7,
      "rationale": "Understanding that the world is divided into continents, with the UK located in Europe, provides the global context within which the more detailed locational knowledge of the UK's four countries and capitals is situated."
    },
    {
      "prerequisite_concept": "GE-KS1-C004",
      "dependent_concept": "GE-KS1-C003",
      "confidence": "inferred",
      "relationship_type": "logical",
      "strength": 0.6,
      "rationale": "Identifying and naming physical features of the landscape provides the vocabulary and observational framework within which weather and climate patterns can be studied and described."
    },
    {
      "prerequisite_concept": "GE-KS1-C005",
      "dependent_concept": "GE-KS1-C001",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.8,
      "rationale": "Using world maps, atlases and globes is the primary method through which pupils locate and learn the names of the seven continents and five oceans."
    },
    {
      "prerequisite_concept": "GE-KS1-C001",
      "dependent_concept": "GE-KS1-C006",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.7,
      "rationale": "Understanding where continents are and how the world is divided into large geographical regions provides the locational context for understanding where the UK locality and the contrasting non-European locality sit relative to each other."
    }
  ]
}
