{
  "metadata": {
    "subject": "History",
    "key_stage": "KS2",
    "years_covered": [
      3,
      4,
      5,
      6
    ],
    "document_reference": "DFE-00173-2013",
    "extraction_date": "2026-02-17",
    "structure_rating": 8
  },
  "domains": [
    {
      "domain_id": "HI-KS2-D002",
      "domain_name": "British History",
      "description": "Studying the history of Britain from the Stone Age through the Romans, Anglo-Saxons, Vikings and Normans, with attention to local history and a specific aspect or theme extending beyond 1066.",
      "curriculum_context": "British history at KS2 covers the sweep of British prehistory and early history from the Stone Age to the Norman period, supplemented by a local history study and a thematic study extending beyond 1066. Each period of British history specified in the curriculum has distinctive content: Stone Age to Iron Age covers prehistoric Britain before written records; Roman Britain examines the impact of a major empire on the British Isles; Anglo-Saxons and Vikings covers the transformative period of migration, conversion and conflict between the fifth and eleventh centuries. Pupils develop understanding of how Britain has been shaped by successive waves of migration, invasion and settlement, and how different peoples have contributed to British identity and culture. The requirement to study a local history and a post-1066 theme gives schools flexibility to connect national history to pupils' own environments and to develop longer-range chronological understanding.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "HI-KS2-D003",
      "domain_name": "World History",
      "description": "Studying the achievements of ancient civilisations including Ancient Egypt, Sumer, the Indus Valley and Shang Dynasty; Ancient Greece; and one non-European society that contrasts with British history.",
      "curriculum_context": "World history at KS2 gives pupils knowledge and understanding of some of the great civilisations of the ancient world beyond Europe. The curriculum requires study of the earliest civilisations (with choice from Ancient Sumer, Indus Valley, Ancient Egypt, or Shang Dynasty China), Ancient Greece (as a foundational civilisation for Western culture), and a non-European society that offers significant contrast with British history - with examples given as early Islamic civilisation centred on Baghdad around 900 AD, Mayan civilisation around 900 AD, and the kingdom of Benin from around 900 to 1300 AD. These requirements ensure that pupils encounter world history from diverse geographic and cultural perspectives, challenging any narrowly Eurocentric view of significant history. Studying these civilisations also develops pupils' understanding of the long-range development of human society, technology and culture.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "HI-KS2-D004",
      "domain_name": "Historical Enquiry and Disciplinary Skills",
      "description": "Continuing to develop historical enquiry skills including asking historical questions, using a range of sources, constructing informed responses, and understanding concepts of evidence, cause, consequence, significance and interpretation.",
      "curriculum_context": "At KS2, historical enquiry skills develop in sophistication and rigour. Pupils move beyond basic source use to more analytical engagement with historical evidence, beginning to question sources' reliability, purpose and perspective, and understanding that different historians can interpret the same evidence differently. The conceptual vocabulary of the discipline - cause, consequence, significance, change, continuity, similarity, difference, evidence, interpretation - gives pupils the intellectual tools to think about history as a discipline rather than merely a body of facts. Constructing informed responses to historical questions, and communicating those responses clearly in writing and discussion, develops pupils as active historical thinkers rather than passive recipients of historical narratives.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    }
  ],
  "objectives": [
    {
      "objective_id": "HI-KS2-O010",
      "domain_id": "HI-KS2-D004",
      "objective_text": "pupils should be taught to ask and answer historically valid questions, choosing and using parts of stories and other sources to show that they know and understand key features of events",
      "non_statutory_guidance": "Pupils should learn to generate their own historical questions and select relevant evidence to answer them, moving beyond retelling narrative towards analytical historical thinking.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS2-O011",
      "domain_id": "HI-KS2-D004",
      "objective_text": "pupils should construct informed responses that involve thoughtful selection and organisation of relevant historical information",
      "non_statutory_guidance": "Pupils should organise their historical knowledge into argued, evidence-based responses rather than simple narrative accounts. This includes written and oral responses to historical questions.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS2-O012",
      "domain_id": "HI-KS2-D004",
      "objective_text": "pupils should address and sometimes devise historically valid questions about change, cause, similarity and difference, and significance",
      "non_statutory_guidance": "The second-order concepts of cause, consequence, change, continuity, significance, similarity and difference should be taught explicitly and applied across all historical topics studied at KS2.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS2-O001",
      "domain_id": "HI-KS2-D002",
      "objective_text": "changes in Britain from the Stone Age to the Iron Age",
      "non_statutory_guidance": "This could include: late Neolithic hunter-gatherers and early farmers, for example, Skara Brae; Bronze Age religion, technology and travel, for example, Stonehenge; Iron Age hill forts: tribal kingdoms, farming, art and culture",
      "examples": "late Neolithic hunter-gatherers and early farmers, e.g. Skara Brae; Bronze Age religion, technology and travel, e.g. Stonehenge; Iron Age hill forts: tribal kingdoms, farming, art and culture",
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS2-O002",
      "domain_id": "HI-KS2-D002",
      "objective_text": "the Roman Empire and its impact on Britain",
      "non_statutory_guidance": "This could include: Julius Caesar's attempted invasion in 55-54 BC; the Roman Empire by AD 42 and the power of its army; successful invasion by Claudius and conquest, including Hadrian's Wall; British resistance, for example, Boudicca; 'Romanisation' of Britain: sites such as Camulodunum, Londinium, Eboracum",
      "examples": "Julius Caesar's attempted invasion; Claudius and conquest; Hadrian's Wall; Boudicca; Romanisation of Britain",
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS2-O003",
      "domain_id": "HI-KS2-D002",
      "objective_text": "Britain's settlement by Anglo-Saxons and Scots",
      "non_statutory_guidance": "This could include: Roman withdrawal from Britain in c. AD 410 and the fall of the western Roman Empire; Scots invasions from Ireland to north Britain (now Scotland); Anglo-Saxon invasions, settlements and kingdoms; place names and village life; Anglo-Saxon art and culture; Christian conversion – Canterbury, Iona and Lindisfarne",
      "examples": "Roman withdrawal; Scots invasions; Anglo-Saxon invasions, settlements and kingdoms; Anglo-Saxon art and culture; Christian conversion",
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS2-O004",
      "domain_id": "HI-KS2-D002",
      "objective_text": "the Viking and Anglo-Saxon struggle for the Kingdom of England to the time of Edward the Confessor",
      "non_statutory_guidance": "This could include: Viking raids and invasion; resistance by Alfred the Great and Athelstan, first king of England; further Viking invasions and Danegeld; Anglo-Saxon laws and justice; Edward the Confessor and his death in 1066",
      "examples": "Viking raids and invasion; Alfred the Great; Athelstan; Edward the Confessor",
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS2-O005",
      "domain_id": "HI-KS2-D002",
      "objective_text": "a local history study",
      "non_statutory_guidance": "For example: a depth study linked to one of the British areas of study listed above; a study over time tracing how several aspects of national history are reflected in the locality; a study of an aspect of history or a site dating from a period beyond 1066 that is significant in the locality",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS2-O006",
      "domain_id": "HI-KS2-D002",
      "objective_text": "a study of an aspect or theme in British history that extends pupils' chronological knowledge beyond 1066",
      "non_statutory_guidance": "For example: the changing power of monarchs using Magna Carta, the English Civil War and the Glorious Revolution; a study of an aspect of social history, such as the impact of the Industrial Revolution; the lives of significant individuals in British history who have contributed to our nation's achievements",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS2-O007",
      "domain_id": "HI-KS2-D003",
      "objective_text": "the achievements of the earliest civilizations – an overview of where and when the first civilizations appeared and a depth study of one of the following: Ancient Sumer; The Indus Valley; Ancient Egypt; The Shang Dynasty of Ancient China",
      "non_statutory_guidance": null,
      "examples": "Ancient Sumer; The Indus Valley; Ancient Egypt; The Shang Dynasty of Ancient China",
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS2-O008",
      "domain_id": "HI-KS2-D003",
      "objective_text": "Ancient Greece – a study of Greek life and achievements and their influence on the western world",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS2-O009",
      "domain_id": "HI-KS2-D003",
      "objective_text": "a non-European society that provides contrasts with British history – one study chosen from: early Islamic civilization, including a study of Baghdad c. AD 900; Mayan civilization c. AD 900; Benin (West Africa) c. AD 900-1300",
      "non_statutory_guidance": null,
      "examples": "early Islamic civilization, including a study of Baghdad c. AD 900; Mayan civilization c. AD 900; Benin (West Africa) c. AD 900-1300",
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "HI-KS2-C001",
      "domain_id": "HI-KS2-D004",
      "concept_name": "Cause and Consequence",
      "description": "Historical causation involves understanding why events happened - identifying the factors that made an event or change more or less likely, and explaining how those factors combined to produce historical outcomes. Consequence refers to the effects of events or changes - what happened as a result, both immediately and over longer periods. At KS2, pupils develop the ability to identify multiple causes and consequences for historical events, understanding that history is driven by the complex interaction of political, economic, social, religious and individual factors rather than single causes.",
      "teaching_guidance": "Teach cause and consequence explicitly as analytical concepts, not just as narrative. Use 'because' and 'therefore' to structure causal arguments. Give pupils a range of possible causes and ask them to rank or categorise them. Distinguish between long-term and immediate causes. Explore unintended consequences: what happened that was not planned or predicted? Use historical examples from the periods studied to build up a bank of causal arguments. Help pupils express causal relationships in written historical argument.",
      "key_vocabulary": "cause, consequence, effect, result, factor, reason, led to, because, therefore, impact, outcome, trigger, long-term, short-term, significant, unintended",
      "common_misconceptions": "Pupils often identify single causes for complex historical events, when in reality multiple factors interact. Teaching that causes can be categorised (political, economic, social) and that they interact helps. Pupils may confuse correlation with causation; discussing examples where two things happened at the same time but were not causally related develops more precise thinking. The idea of unintended consequences can be surprising; good historical examples make it concrete.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "HI-KS2-C002",
      "domain_id": "HI-KS2-D004",
      "concept_name": "Significance",
      "description": "Historical significance refers to the importance of a person, event or development in history, assessed by criteria such as the scale and duration of its impact, how many people were affected, whether it changed the course of events, whether people at the time thought it important, and how it is remembered and commemorated. Significance is not fixed: what seems significant from one perspective or in one time period may appear less so from another. At KS2, pupils begin to develop explicit criteria for judging historical significance and apply them to the people and events they study.",
      "teaching_guidance": "Teach explicit criteria for significance: notable (was it important at the time?), remembered (is it still remembered?), resonant (do people connect with it?), resulting (did it have consequences?), remarkable (was it unusual?). Apply these criteria to historical examples. Discuss how significance can change over time - a battle that seemed decisive at the time may look less important with hindsight. Explore why some historical figures and events are remembered while others are forgotten, connecting to discussions of power and representation.",
      "key_vocabulary": "significance, important, memorable, lasting, impact, remember, commemorate, notable, evaluate, judge, criteria, perspective, evidence, why",
      "common_misconceptions": "Pupils often conflate significance with fame, assuming that well-known figures must be the most significant. Discussing overlooked historical figures who had major impacts challenges this. The idea that significance is judged rather than simply recognised can be counterintuitive; explicit discussion of the criteria for significance helps. Pupils may not realise that significance can be contested - different people may disagree about how significant an event was.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "HI-KS2-C003",
      "domain_id": "HI-KS2-D004",
      "concept_name": "Historical Evidence and Interpretation",
      "description": "Historians construct interpretations of the past from the evidence that survives. Evidence includes primary sources (created at the time) and secondary sources (created after the fact), each with distinctive strengths and limitations. Historians also interpret the same evidence differently based on their questions, frameworks and perspectives, which is why different historical accounts of the same events can reach different conclusions. At KS2, pupils develop the ability to work with and evaluate a range of historical sources, and to understand that historical knowledge is constructed through the interpretation of evidence rather than simply discovered.",
      "teaching_guidance": "Develop a systematic approach to source analysis: provenance (who, when, why), content (what does it say/show), utility (what can we learn from it) and reliability (how trustworthy is it and why). Compare sources that offer different perspectives on the same event. Discuss why sources can be biased or incomplete without being worthless. Help pupils understand that all historical accounts, including their textbooks, are interpretations. Use 'big question' enquiries that require pupils to evaluate evidence and construct argued responses.",
      "key_vocabulary": "source, evidence, primary, secondary, provenance, reliable, biased, perspective, interpretation, evaluate, corroborate, account, historian, partial, incomplete",
      "common_misconceptions": "Pupils may believe that written sources are more reliable than other types. Discussing how photographs can be staged, letters can be biased and accounts can be selective challenges this. The concept that a biased source is not necessarily useless requires explicit teaching: a source biased in a particular direction still tells us something about its author's perspective. Pupils may not understand why different historians reach different conclusions; discussing different perspectives and frameworks helps.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "HI-KS2-C004",
      "domain_id": "HI-KS2-D003",
      "concept_name": "Ancient Civilisations",
      "description": "The earliest civilisations - Ancient Sumer, the Indus Valley, Ancient Egypt and the Shang Dynasty of Ancient China - represent the first complex, literate human societies, emerging between approximately 3500 and 1200 BC in different parts of the world. They share characteristic features including writing systems, monumental architecture, complex religious and political hierarchies, specialised crafts and trade networks. Studying these civilisations develops pupils' understanding of how human societies developed from prehistoric hunter-gatherer communities to complex, literate, urban civilisations, and provides global perspective on the origins of human achievement.",
      "teaching_guidance": "Provide an overview of where and when the earliest civilisations appeared before conducting a depth study of one. Use maps to show that civilisations emerged independently in different parts of the world. Study the key features of the chosen civilisation in depth: its geography, political system, religious beliefs, achievements and daily life. Use artefacts, images of archaeological sites and translations of primary sources where available. Connect to pupils' general chronological framework: how long ago was this civilisation? What was happening in Britain at the same time?",
      "key_vocabulary": "civilisation, ancient, Bronze Age, settlement, city-state, pharaoh, hierarchy, irrigation, agriculture, trade, writing, archaeology, artefact, empire, legacy",
      "common_misconceptions": "Pupils often think ancient civilisations were primitive or unsophisticated. Studying their technological, artistic and intellectual achievements challenges this. The concept of civilisation can carry value judgements; it is important to discuss what the term means without implying that non-urban societies are inferior. Pupils may not connect ancient civilisations to the present; discussing legacies (alphabet, legal codes, mathematics, architecture) makes the connection explicit.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "HI-KS2-C005",
      "domain_id": "HI-KS2-D002",
      "concept_name": "British Historical Periods: Prehistoric to Medieval",
      "description": "Britain's history from the Stone Age to the Norman Conquest encompasses several distinct periods, each marked by major social, technological and political changes: Prehistoric Britain (Stone, Bronze and Iron Ages); Roman Britain (43-410 AD); Anglo-Saxon Britain (410-1066 AD); and Viking Age Britain (793-1066 AD). Each period represents a distinct phase in the long history of human habitation and society on the British Isles, with different peoples, technologies, political systems, religious beliefs and cultural practices. Understanding these periods gives pupils a foundation in British heritage and the capacity to recognise the long-range development of the society they live in.",
      "teaching_guidance": "Establish a clear chronological framework for the periods studied: use a timeline that runs from prehistoric times to 1066 and place each topic on it. Study each period in sufficient depth to understand its distinctive character, not just its sequence. Connect periods: how did the Roman occupation affect the Anglo-Saxon period? What did the Vikings find when they arrived? Use artefacts, reconstructions and archaeological evidence alongside textual sources. Connect to local history: are there local Roman roads, Anglo-Saxon place names, Viking settlements?",
      "key_vocabulary": "prehistoric, Stone Age, Bronze Age, Iron Age, Roman, Anglo-Saxon, Viking, Norman, invasion, settlement, tribe, kingdom, conquest, legacy, chronology, period",
      "common_misconceptions": "Pupils may see the historical periods as completely separate rather than as phases in a continuous story. Emphasising connections between periods - the Roman influence on Anglo-Saxon culture, the Viking influence on English - develops more integrated understanding. Pupils may have a romantic rather than realistic view of the Viking or Anglo-Saxon periods; a balanced approach using archaeological and textual evidence avoids both romanticisation and demonisation.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "HI-KS1-C001",
      "dependent_concept": "HI-KS2-C001",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Understanding chronological sequence at KS1 is the prerequisite for the more analytically demanding concept of historical causation at KS2, which requires placing events in temporal sequence before asking why they occurred."
    },
    {
      "prerequisite_concept": "HI-KS1-C004",
      "dependent_concept": "HI-KS2-C003",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS2 work on historical evidence and interpretation directly extends the KS1 introduction to historical sources, building on basic source observation towards more analytical evaluation of provenance, reliability and perspective."
    },
    {
      "prerequisite_concept": "HI-KS1-C002",
      "dependent_concept": "HI-KS2-C002",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.75,
      "rationale": "The KS2 concept of historical significance builds on KS1 understanding of change and continuity: significance is partly assessed by whether a development caused lasting change, which requires prior understanding of the change/continuity distinction."
    },
    {
      "prerequisite_concept": "HI-KS2-C003",
      "dependent_concept": "HI-KS2-C001",
      "confidence": "inferred",
      "relationship_type": "logical",
      "strength": 0.65,
      "rationale": "Constructing causal arguments about historical events requires the ability to evaluate historical evidence, since causal claims must be grounded in and tested against the available sources."
    },
    {
      "prerequisite_concept": "HI-KS1-C004",
      "dependent_concept": "HI-KS2-C002",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.7,
      "rationale": "Judging historical significance at KS2 requires the ability to interrogate sources about the scale and duration of a person's or event's impact, which builds on the basic source-handling skills developed at KS1."
    }
  ]
}
