{
  "metadata": {
    "subject": "Languages",
    "key_stage": "KS2",
    "years_covered": [
      3,
      4,
      5,
      6
    ],
    "document_reference": "DFE-00174-2013",
    "extraction_date": "2026-02-17",
    "structure_rating": 7
  },
  "domains": [
    {
      "domain_id": "LA-KS2-D001",
      "domain_name": "Listening and Speaking",
      "description": "Listening attentively to spoken language and showing understanding by joining in and responding; exploring the patterns and sounds of language through songs and rhymes; speaking in sentences; presenting ideas and information orally with accurate pronunciation and intonation.",
      "curriculum_context": "Oral language skills form the foundation of language acquisition, and the primary languages curriculum gives listening and speaking particular prominence at KS2. Pupils must listen attentively to authentic spoken language and respond appropriately, developing the ability to tolerate ambiguity and extract meaning even when not every word is understood. Exploring patterns and sounds through songs and rhymes is not merely motivational but develops phonological awareness of the new language's sound system, which differs from English in pitch, rhythm, stress and specific phonemes. The specification that pupils should speak with accurate pronunciation and intonation from the outset establishes high expectations: being understood in a foreign language requires phonological precision that must be developed through consistent feedback and modelling.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "LA-KS2-D002",
      "domain_name": "Reading",
      "description": "Reading carefully and showing understanding of words, phrases and simple writing; appreciating stories, songs, poems and rhymes in the language; broadening vocabulary and developing ability to understand new words using context.",
      "curriculum_context": "Reading in a foreign language at KS2 connects oral language acquisition to the written form, supporting pupils in making connections between sounds and their written representations. Pupils are expected to read carefully, bringing to bear the phonic awareness developed through listening and speaking. The requirement to appreciate stories, songs, poems and rhymes in the language introduces pupils to authentic literary and cultural texts, developing cultural awareness alongside language skills. Developing the ability to understand unfamiliar words through context is a key metacognitive strategy that enables learners to operate with increasing independence, rather than depending on translation for every unknown word.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "LA-KS2-D003",
      "domain_name": "Writing",
      "description": "Writing phrases from memory; adapting phrases to create new sentences; describing people, places, things and actions; understanding basic grammar and applying it in writing.",
      "curriculum_context": "Writing in a foreign language at KS2 develops through the adaptation and creation of phrases rather than free composition. Pupils begin by writing phrases from memory - demonstrating that they can reproduce language without copying - and progress to adapting learned phrases to create new sentences, demonstrating productive competence rather than merely reproductive ability. The requirement to describe people, places, things and actions across a range of contexts ensures that writing develops in breadth. Understanding and applying basic grammar - including feminine, masculine and neuter forms, the conjugation of high-frequency verbs, key features of sentence structure, and the use of conjunctions to extend sentences - develops the structural understanding that enables creative language use beyond set phrases.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "LA-KS2-D004",
      "domain_name": "Grammar and Vocabulary",
      "description": "Understanding and applying grammar including gender, number and case; conjugating high-frequency verbs; understanding and using a wide vocabulary across a range of topics and contexts.",
      "curriculum_context": "Grammar and vocabulary are the structural and lexical building blocks of language proficiency. At KS2, pupils develop understanding of key grammatical features of the target language, which typically differ substantially from English: grammatical gender (feminine, masculine, neuter), number (singular and plural), case (where relevant), verb conjugation and sentence structure. This grammatical knowledge is not taught for its own sake but to enable pupils to communicate with greater accuracy and flexibility. Vocabulary development is equally important: a broad vocabulary spanning personal, social, environmental and cultural domains provides the lexical resources for authentic communication. Developing the habit of learning new vocabulary systematically, and strategies for remembering and using it, is as important as the specific vocabulary learned.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    }
  ],
  "objectives": [
    {
      "objective_id": "LA-KS2-O001",
      "domain_id": "LA-KS2-D001",
      "objective_text": "listen attentively to spoken language and show understanding by joining in and responding",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS2-O002",
      "domain_id": "LA-KS2-D001",
      "objective_text": "explore the patterns and sounds of language through songs and rhymes and link the spelling, sound and meaning of words",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS2-O003",
      "domain_id": "LA-KS2-D001",
      "objective_text": "engage in conversations; ask and answer questions; express opinions and respond to those of others; seek clarification and help",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS2-O004",
      "domain_id": "LA-KS2-D001",
      "objective_text": "speak in sentences, using familiar vocabulary, phrases and basic language structures",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS2-O005",
      "domain_id": "LA-KS2-D001",
      "objective_text": "develop accurate pronunciation and intonation so that others understand when they are talking",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS2-O006",
      "domain_id": "LA-KS2-D001",
      "objective_text": "present ideas and information orally to a range of audiences",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS2-O007",
      "domain_id": "LA-KS2-D002",
      "objective_text": "read carefully and show understanding of words, phrases and simple writing",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS2-O008",
      "domain_id": "LA-KS2-D002",
      "objective_text": "appreciate stories, songs, poems and rhymes in the language",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS2-O009",
      "domain_id": "LA-KS2-D002",
      "objective_text": "broaden their vocabulary and develop their ability to understand new words that are introduced into familiar written material, including through using a dictionary",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS2-O010",
      "domain_id": "LA-KS2-D003",
      "objective_text": "write phrases from memory, and adapt these to create new sentences, to express ideas clearly",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS2-O011",
      "domain_id": "LA-KS2-D003",
      "objective_text": "describe people, places, things and actions orally and in writing",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "LA-KS2-O012",
      "domain_id": "LA-KS2-D004",
      "objective_text": "understand basic grammar appropriate to the language being studied, including (where relevant): feminine, masculine and neuter forms and the conjugation of high-frequency verbs; key features and patterns of the language; how to apply these, for instance, to build sentences; and how these differ from or are similar to English",
      "non_statutory_guidance": null,
      "examples": "feminine, masculine and neuter forms and the conjugation of high-frequency verbs; key features and patterns of the language",
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "LA-KS2-C001",
      "domain_id": "LA-KS2-D001",
      "concept_name": "Phonology and Pronunciation",
      "description": "Each language has a distinctive phonological system: the set of sounds (phonemes) it uses, the rules for combining them, and the patterns of stress and intonation that give spoken language its characteristic sound. Learning a foreign language requires developing a new phonological awareness that may include sounds not present in English, different stress patterns and different intonation contours. At KS2, systematic attention to pronunciation from the earliest stages prevents the fossilisation of incorrect patterns and develops the phonological foundation for authentic spoken communication.",
      "teaching_guidance": "Use songs, rhymes and chants to introduce and practise the sound system of the target language. Model pronunciation precisely and ask pupils to echo-repeat. Use minimal pairs (words that differ by one sound) to develop discrimination of similar sounds. Record pupils speaking and play back so they can hear their own pronunciation. Teach the specific sounds of the target language that differ from English (nasal vowels in French, the rolled r in Spanish). Connect spelling to sound regularly: what does this letter combination sound like in this language? Use phonics-style activities adapted for the target language.",
      "key_vocabulary": "pronunciation, intonation, stress, phoneme, sound, syllable, rhythm, accent, tone, vowel, consonant, nasal, rolling, liaison, elision",
      "common_misconceptions": "Pupils may assume that letters in the target language are pronounced as in English. Systematic attention to differences in sound-spelling correspondence prevents fossilisation of incorrect patterns. Some pupils may feel embarrassed to make unfamiliar sounds; creating a playful, low-stakes environment for sound exploration reduces inhibition. Teachers may unconsciously accept poor pronunciation as adequate; consistently modelling and expecting accurate pronunciation maintains high standards.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 1,
      "co_teach_hints": []
    },
    {
      "concept_id": "LA-KS2-C002",
      "domain_id": "LA-KS2-D004",
      "concept_name": "Vocabulary Acquisition and Use",
      "description": "Vocabulary is the core building material of language: without words, grammar cannot operate and communication is impossible. Effective vocabulary acquisition involves encountering new words in context, understanding their meaning, form and use, practising them in a variety of ways, and storing them in long-term memory for retrieval in communication. At KS2, pupils build a working vocabulary across a range of topics (personal information, family, school, food, animals, weather, place and time), developing both receptive vocabulary (words recognised when heard or read) and productive vocabulary (words actively used in speaking and writing).",
      "teaching_guidance": "Teach vocabulary in meaningful chunks (phrases, sentences, contexts) rather than isolated word lists. Use multiple modalities for vocabulary practice: hear it, say it, read it, write it, act it out. Introduce vocabulary in manageable sets and revise regularly using spaced practice. Use picture flashcards, word games, memory techniques (association, visualisation) and word maps. Connect new vocabulary to words pupils already know in English or other languages. Teach pupils to use dictionaries and simple vocabulary lists independently. Develop pupils' awareness of patterns in vocabulary across the language.",
      "key_vocabulary": "vocabulary, word, phrase, meaning, context, translate, dictionary, category, topic, receptive, productive, revise, memorise, association, cognate",
      "common_misconceptions": "Pupils may believe that learning vocabulary means translating word lists. Teaching vocabulary in context and through use challenges this. Pupils may not use deliberate strategies to memorise vocabulary; teaching a range of memory techniques (visual associations, spaced practice, self-testing) develops more effective vocabulary learning habits. The distinction between receptive and productive vocabulary is important: recognising a word when heard is different from being able to use it spontaneously.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "LA-KS2-C003",
      "domain_id": "LA-KS2-D004",
      "concept_name": "Grammar: Gender, Number and Verb Conjugation",
      "description": "Many languages assign grammatical gender to nouns (masculine, feminine, and in some languages neuter), which affects the form of articles, adjectives and pronouns that accompany them. Number (singular and plural) affects verb and noun forms. Verb conjugation refers to the way verbs change their form depending on the subject (person and number). These grammatical structures are fundamental to producing grammatically correct speech and writing in most European languages. At KS2, pupils develop understanding of these features and learn to apply them in the context of the language being studied.",
      "teaching_guidance": "Teach grammatical gender systematically from the first introduction of nouns: always introduce a noun with its article (le chat, la maison). Use colour-coding to help pupils distinguish masculine and feminine. Provide extensive practice of high-frequency verbs (to be, to have, to go, to want, to like) in all their conjugated forms. Highlight patterns within paradigms: verbs that share endings, nouns that share gender markers. Connect grammar to communication: knowing that adjectives agree with nouns enables pupils to describe things accurately. Use grammatical metalanguage (gender, conjugate, plural) from the start.",
      "key_vocabulary": "gender, masculine, feminine, neuter, singular, plural, article, noun, verb, conjugate, subject, agree, tense, person, form",
      "common_misconceptions": "Pupils accustomed to English may not understand why nouns have gender in other languages. Explaining that grammatical gender is a linguistic feature, not a reflection of real-world gender, prevents confusion. Pupils may not see the relevance of learning verb conjugation; connecting it to the ability to talk about different people (I, you, he, she) makes the functional purpose clear. Irregular verbs (which are often the most common) require extra attention; pupils may apply regular patterns to irregular forms.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "LA-KS2-C004",
      "domain_id": "LA-KS2-D001",
      "concept_name": "Communicative Competence",
      "description": "Communicative competence is the ability to use language effectively in real communicative situations, combining linguistic accuracy with the social and cultural knowledge needed to communicate appropriately in different contexts. It encompasses grammatical competence (correct forms), sociolinguistic competence (appropriate register and context), discourse competence (organising longer stretches of language coherently) and strategic competence (managing communication despite gaps in knowledge). At KS2, pupils begin to develop communicative competence through structured interaction, role-play and authentic communication tasks.",
      "teaching_guidance": "Design tasks that require genuine communication: information gaps, problem-solving activities, surveys. Use role-play scenarios that develop contextually appropriate language (shopping, asking directions, at a restaurant). Develop pupils' ability to manage communication difficulties: use of circumlocution, asking for clarification, using cognates. Encourage pupils to take communicative risks and reward successful communication even when grammatically imperfect. Connect language learning to cultural awareness: how do greetings, politeness conventions and social norms differ in the target language culture?",
      "key_vocabulary": "communicate, conversation, question, answer, response, opinion, clarify, understand, explain, describe, interact, context, appropriate, fluent, confident",
      "common_misconceptions": "Pupils may believe that making a grammatical error means they have failed to communicate. Distinguishing between grammatical accuracy and communicative success, and valuing both, develops more confident communicators. Some pupils are reluctant to speak without certainty of accuracy; developing tolerance of ambiguity and risk-taking in communication is important. Pupils may see languages as sets of rules to be memorised rather than tools for communication; keeping the communicative purpose central prevents this.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "LA-KS2-C005",
      "domain_id": "LA-KS2-D004",
      "concept_name": "Language Awareness and Transfer",
      "description": "Language awareness refers to an explicit understanding of how languages work as systems, including how the target language is similar to and different from English and from other languages the pupil may know. This metalinguistic awareness supports language learning in multiple ways: it helps pupils to identify cognates (words similar across languages), to apply understanding of grammatical categories across languages, and to develop strategies for tackling unfamiliar language. Language transfer - applying knowledge from one language to another - can both facilitate learning (positive transfer) and cause errors (negative transfer or interference).",
      "teaching_guidance": "Regularly draw attention to similarities and differences between the target language and English. Explore cognates: words that are similar in form and meaning. Discuss how the grammatical concepts introduced in the target language (gender, verb conjugation, case) relate to or differ from English. Use linguistic metalanguage consistently: verb, noun, adjective, sentence, tense. Develop pupils' awareness of their own language learning processes: what strategies work for them? Encourage pupils who speak other languages to share how their languages compare. Connect to English grammar teaching to develop integrated understanding.",
      "key_vocabulary": "language, similar, different, compare, cognate, translate, pattern, structure, metalanguage, transfer, strategy, bilingual, multilingual, grammar, system",
      "common_misconceptions": "Pupils may assume that the target language works like English in all respects. Drawing attention to systematic differences prevents negative transfer errors. Pupils may see cognates as confusing rather than helpful; teaching that cognates are a resource for decoding unfamiliar text develops a positive strategy. Pupils who speak languages other than English at home may have significant knowledge that is not recognised or drawn upon; making space for multilingual comparison enriches the learning of all pupils.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": [
        "LA-KS2-C002",
        "LA-KS2-C003"
      ]
    },
    {
      "concept_id": "LA-KS2-C006",
      "domain_id": "LA-KS2-D002",
      "concept_name": "Reading in the Target Language",
      "description": "Reading in a foreign language requires pupils to decode written text using their phonological knowledge of the target language's sound-spelling correspondences, while simultaneously applying vocabulary and grammatical knowledge to construct meaning. At KS2, pupils develop the ability to read words, phrases and simple texts in the target language with careful attention to meaning, making use of context and dictionaries to resolve unfamiliar vocabulary. Engagement with stories, songs, poems and rhymes in the written form of the target language develops both decoding skill and cultural engagement, as pupils encounter the imaginative and literary traditions of the target language community.",
      "teaching_guidance": "Connect reading to the oral language pupils have already encountered: what they can say, they should be able to read. Build reading from familiar phrases and vocabulary before introducing unfamiliar written material. Use shared reading of simple texts with visual support (images, diagrams) to develop reading for meaning. Teach dictionary use as a strategy for resolving unfamiliar vocabulary, including the skill of identifying headwords and selecting the correct meaning from multiple options. Engage pupils with songs, poems and simple stories in the target language as authentic reading material that is motivating and culturally rich. Develop the ability to read aloud with accurate pronunciation, connecting spelling to sound in the target language.",
      "key_vocabulary": "read, text, word, phrase, sentence, meaning, understand, dictionary, vocabulary, story, poem, song, rhyme, decode, pronunciation, spelling",
      "common_misconceptions": "Pupils may attempt to read target language text using English sound-spelling correspondences, producing systematic mispronunciation. Consistent phonics-based teaching of the target language's sound system prevents this. Some pupils may believe that understanding every word is necessary before any meaning can be extracted; teaching reading for gist and the use of context to infer meaning develops more effective reading strategies. Dictionary use may be seen as admitting failure rather than as a competent reading strategy; normalising dictionary use as a skilled behaviour encourages its effective application.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 1,
      "co_teach_hints": []
    },
    {
      "concept_id": "LA-KS2-C007",
      "domain_id": "LA-KS2-D003",
      "concept_name": "Writing in the Target Language",
      "description": "Writing in a foreign language at KS2 begins with reproducing and adapting learned phrases, developing pupils' ability to express ideas in the written form of the target language without copying from a visual prompt. Starting with phrases from memory demonstrates that language has been internalised, not merely copied. Adapting learned phrases to create new sentences is a crucial step towards productive competence: pupils apply their grammatical knowledge (of gender, verb forms, word order) to create language beyond the specific examples they have been taught. Describing people, places, things and actions across a range of topics develops the breadth of written productive ability.",
      "teaching_guidance": "Scaffold the progression from copying to independent writing carefully: begin with supported writing frames, move to partially completed sentences, then to writing from memory prompts, then to unprompted writing. Teach pupils to check their writing for accuracy: does the adjective agree with the noun? Is the verb conjugated correctly? Is the word order correct? Use writing as consolidation after oral practice: what pupils can say, they should be able to write. Develop pupils' use of a bilingual dictionary or glossary for self-checking rather than for word-by-word translation. Celebrate writing as a means of communication: display and share what pupils write, and where possible use writing for real communicative purposes (pen pal letters, class books, display captions).",
      "key_vocabulary": "write, phrase, sentence, describe, adapt, create, express, memory, idea, topic, people, place, action, accurate, check, grammar",
      "common_misconceptions": "Pupils may produce writing by copying from classroom displays or books rather than from memory; building in activities that require independent recall (covering the model before writing) develops genuine productive competence. Pupils may view written accuracy as the only criterion for good writing; developing the ability to communicate meaning effectively even with some errors alongside developing accuracy produces more confident writers. Some pupils may feel that they cannot write in a foreign language; scaffolded, achievable writing tasks with clear success criteria build confidence before demanding more extended production.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": []
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "LA-KS2-C001",
      "dependent_concept": "LA-KS2-C004",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.8,
      "rationale": "Accurate pronunciation is a prerequisite for effective oral communication; pupils cannot engage in genuine conversation if their speech is not intelligible to a listener, making phonological competence foundational to communicative competence."
    },
    {
      "prerequisite_concept": "LA-KS2-C002",
      "dependent_concept": "LA-KS2-C004",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.85,
      "rationale": "Vocabulary is the primary building material of communication; without sufficient vocabulary, pupils cannot express the ideas needed for genuine communicative interaction even if grammar is understood."
    },
    {
      "prerequisite_concept": "LA-KS2-C003",
      "dependent_concept": "LA-KS2-C004",
      "confidence": "inferred",
      "relationship_type": "logical",
      "strength": 0.7,
      "rationale": "Grammatical knowledge - particularly of verb conjugation - enables pupils to communicate about different people and time frames, expanding the scope of communicative competence beyond fixed phrases."
    },
    {
      "prerequisite_concept": "LA-KS2-C002",
      "dependent_concept": "LA-KS2-C005",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.65,
      "rationale": "Vocabulary acquisition provides the practical experience of encountering similarities and differences between languages (cognates, false friends, different conceptual mappings) from which language awareness and transfer insights develop."
    },
    {
      "prerequisite_concept": "LA-KS2-C001",
      "dependent_concept": "LA-KS2-C006",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.85,
      "rationale": "Phonological knowledge of the target language's sound system is the foundation for reading: pupils need to understand how the target language's spelling represents sounds in order to decode written text with accurate pronunciation."
    },
    {
      "prerequisite_concept": "LA-KS2-C002",
      "dependent_concept": "LA-KS2-C006",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.8,
      "rationale": "Vocabulary knowledge is prerequisite to reading comprehension: pupils cannot extract meaning from written text without recognising a sufficient proportion of the vocabulary it contains."
    },
    {
      "prerequisite_concept": "LA-KS2-C003",
      "dependent_concept": "LA-KS2-C007",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.8,
      "rationale": "Grammatical knowledge of gender, number and verb conjugation is prerequisite to producing accurate written language: writing phrases from memory and adapting them to new sentences requires applying grammatical rules, not merely reproducing memorised forms."
    },
    {
      "prerequisite_concept": "LA-KS2-C006",
      "dependent_concept": "LA-KS2-C007",
      "confidence": "inferred",
      "relationship_type": "logical",
      "strength": 0.7,
      "rationale": "Reading and writing in the target language are mutually reinforcing skills: reading exposes pupils to correctly written examples of the language that provide models for their own written production, and the process of reading develops awareness of correct spelling and grammar."
    }
  ]
}
