{
  "metadata": {
    "subject": "Mathematics",
    "key_stage": "KS2",
    "years_covered": [
      4
    ],
    "document_reference": "DFE-00180-2013",
    "extraction_date": "2026-02-17",
    "structure_rating": 9
  },
  "domains": [
    {
      "domain_id": "MA-Y4-D001",
      "domain_name": "Number - Number and Place Value",
      "description": "Understanding place value in four-digit numbers, counting in larger multiples (6, 7, 9, 25, 1000), negative numbers in context, rounding to nearest 10 and 100, and Roman numerals to 100.",
      "curriculum_context": "In Year 4, pupils extend place value understanding from three-digit numbers to four-digit numbers (thousands, hundreds, tens, ones), significantly expanding the range of numbers they can work with. The non-statutory guidance specifies that pupils should practise reading Roman numerals to 100 (I to C) and begin to understand the year written in Roman numerals. Pupils work with negative numbers in contexts such as temperature and debt, and with rounding — to the nearest 10, 100 and 1000 — which develops estimation skills and understanding of approximation. This domain forms the essential prerequisite for place value work with numbers up to a million in Year 5, and the rounding skills introduced here are used throughout the upper key stage.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical"
    },
    {
      "domain_id": "MA-Y4-D002",
      "domain_name": "Number - Addition and Subtraction",
      "description": "Formal written methods of columnar addition and subtraction for numbers with up to four digits, estimation, inverse operations, and two-step problems including missing number problems.",
      "curriculum_context": "In Year 4, pupils consolidate and extend the formal columnar methods introduced in Year 3 to four-digit numbers. The non-statutory guidance emphasises that pupils should practise adding and subtracting increasingly large numbers to aid fluency and develop their mental arithmetic, using jottings to support calculation where necessary. Pupils are expected to use efficient methods and to select the most appropriate approach for each calculation — mental, jottings or formal written. The extension to four-digit numbers means exchanges can occur in more columns simultaneously, making rigorous understanding of place value even more important. This consolidation prepares pupils for the multi-step addition and subtraction in contexts across all domains of Year 4 and the transition to larger numbers in Year 5.",
      "is_cross_cutting": false,
      "structure_type": "sequential"
    },
    {
      "domain_id": "MA-Y4-D003",
      "domain_name": "Number - Multiplication and Division",
      "description": "All multiplication tables to 12 × 12, using place value and multiplication facts to derive related calculations, mental methods including commutativity and associativity, and formal written methods for multiplication and division.",
      "curriculum_context": "Year 4 is the statutory point by which pupils must know all multiplication tables to 12 × 12, making it a landmark year for multiplicative fluency. The non-statutory guidance states that pupils should practise mental methods and should be able to derive quickly all multiplication and division facts from the tables they know, and should understand the distributive and commutative laws. Pupils are introduced to short multiplication (long multiplication is in Year 5) and short division, building on the mental and partial methods from Year 3. This thorough foundation in all multiplication facts is essential for fraction calculations, long division, ratio, and algebra throughout upper KS2 and into secondary school.",
      "is_cross_cutting": false,
      "structure_type": "sequential"
    },
    {
      "domain_id": "MA-Y4-D004",
      "domain_name": "Number - Fractions (including Decimals)",
      "description": "Equivalent fractions using multiples and factors, hundredths as fractions and decimals, fractions greater than one, tenths and hundredths as decimal place value, rounding decimals, and comparing decimals.",
      "curriculum_context": "In Year 4, the fractions domain expands significantly to include decimals for the first time. Pupils learn that the decimal system extends the place value system to the right of the decimal point — tenths (one tenth = 0.1) and hundredths (one hundredth = 0.01). The non-statutory guidance explains that pupils connect tenths to place value and decimal measures, and understand that decimal notation is an alternative to fraction notation for parts of a whole. Pupils learn to find equivalent fractions systematically by multiplying numerator and denominator by the same number, and to add and subtract fractions and mixed numbers with the same denominator. This domain bridges the fraction understanding of Year 3 with the percentages and fraction operations of Year 5.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical"
    },
    {
      "domain_id": "MA-Y4-D005",
      "domain_name": "Measurement",
      "description": "Converting between units of metric measurement, calculating perimeter and area of rectilinear shapes, reading scales with increasing accuracy, analogue and digital time, and solving money and time problems.",
      "curriculum_context": "In Year 4, measurement extends to calculating area (introduced formally for the first time) alongside perimeter, converting between standard metric units (e.g. km to m, l to ml, kg to g), and reading scales more accurately. The non-statutory guidance explains that pupils should connect decimals to metric measures (e.g. 1.25 km = 1 km and 250 m). Time work includes converting between analogue and digital formats and between units of time (minutes to hours, hours to days). The introduction of area — counting squares and using length × width for rectangles — is a major new concept that connects geometry and number, and pupils must distinguish clearly between perimeter (distance around) and area (space inside). Practical measurement contexts reinforce number concepts throughout the year.",
      "is_cross_cutting": true,
      "structure_type": "mixed"
    },
    {
      "domain_id": "MA-Y4-D006",
      "domain_name": "Geometry - Properties of Shapes",
      "description": "Comparing and classifying geometric shapes using angles and sides, identifying acute and obtuse angles, comparing and ordering angles, symmetry, and coordinate geometry in the first quadrant.",
      "curriculum_context": "In Year 4, geometry develops from the Year 3 foundation of angles and line types to classifying shapes according to their properties and working with coordinates. Pupils compare and classify triangles (equilateral, isosceles, scalene, right-angled) and quadrilaterals (square, rectangle, rhombus, parallelogram, trapezium), identifying properties such as parallel and perpendicular sides and types of angles. Coordinates in the first quadrant (positive x and y values) are introduced as a means of describing position precisely, preparing for reflections and translation in Year 5. The non-statutory guidance emphasises that pupils should use right angles, acute angles and obtuse angles to classify shapes, and should use coordinate notation (x, y) correctly.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical"
    },
    {
      "domain_id": "MA-Y4-D007",
      "domain_name": "Geometry - Position and Direction",
      "description": "Plotting and describing coordinates in the first quadrant, and describing movements between positions as translations.",
      "curriculum_context": "In Year 4, position and direction is formalised through the introduction of coordinates in the first quadrant of a grid. Pupils learn to plot and read points using (x, y) notation, with x measuring horizontal distance from the origin and y measuring vertical distance. The curriculum specifies that pupils should describe movements between positions as translations (moving left/right and up/down). This is the first formal algebraic representation pupils encounter — an ordered pair of numbers describing a unique position. Coordinate geometry provides the geometric language needed for Year 5 reflections and translations, and ultimately for graphing linear functions in secondary school.",
      "is_cross_cutting": true,
      "structure_type": "hierarchical"
    },
    {
      "domain_id": "MA-Y4-D008",
      "domain_name": "Statistics",
      "description": "Interpreting and presenting discrete and continuous data using appropriate graphical methods including bar charts, time graphs, and tables; solving comparison, sum and difference problems.",
      "curriculum_context": "In Year 4, statistics introduces continuous data and time graphs alongside the bar charts and tables of Year 3. The non-statutory guidance clarifies that pupils should understand the difference between discrete data (individual counts, shown as bar charts) and continuous data (measurements over time, shown as line graphs). Pupils solve comparison, sum and difference problems using information from graphs and tables. The introduction of line graphs to show how a quantity changes over time (e.g. temperature through the day) prepares pupils for the more complex data interpretation of Years 5 and 6. Pupils also practise choosing appropriate representations for their data.",
      "is_cross_cutting": true,
      "structure_type": "sequential"
    }
  ],
  "objectives": [
    {
      "objective_id": "MA-Y4-O001",
      "domain_id": "MA-Y4-D001",
      "objective_text": "count in multiples of 6, 7, 9, 25 and 1000",
      "non_statutory_guidance": "Using a variety of representations, including measures, pupils become fluent in the order and place value of numbers beyond 1000, including counting in tens and hundreds, and maintaining fluency in other multiples through varied and frequent practice.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O002",
      "domain_id": "MA-Y4-D001",
      "objective_text": "find 1000 more or less than a given number",
      "non_statutory_guidance": "Using a variety of representations, including measures, pupils become fluent in the order and place value of numbers beyond 1000.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O003",
      "domain_id": "MA-Y4-D001",
      "objective_text": "count backwards through zero to include negative numbers",
      "non_statutory_guidance": "Using the number line, pupils count in negative numbers and use negative numbers in context, for example temperature.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O004",
      "domain_id": "MA-Y4-D001",
      "objective_text": "recognise the place value of each digit in a four-digit number (thousands, hundreds, tens, and ones)",
      "non_statutory_guidance": "Using a variety of representations, including measures, pupils become fluent in the order and place value of numbers beyond 1000, including counting in tens and hundreds.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O005",
      "domain_id": "MA-Y4-D001",
      "objective_text": "order and compare numbers beyond 1000",
      "non_statutory_guidance": "Using a variety of representations, including measures, pupils become fluent in the order and place value of numbers beyond 1000.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O006",
      "domain_id": "MA-Y4-D001",
      "objective_text": "identify, represent and estimate numbers using different representations",
      "non_statutory_guidance": "Using a variety of representations, including measures, pupils become fluent in the order and place value of numbers beyond 1000.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O007",
      "domain_id": "MA-Y4-D001",
      "objective_text": "round any number to the nearest 10, 100 or 1000",
      "non_statutory_guidance": "Pupils develop the vocabulary of approximation and rounding. They use rounding to check the reasonableness of answers.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O008",
      "domain_id": "MA-Y4-D001",
      "objective_text": "solve number and practical problems that involve all of the above and with increasingly large positive numbers",
      "non_statutory_guidance": "Using a variety of representations, including measures, pupils become fluent in the order and place value of numbers beyond 1000.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O009",
      "domain_id": "MA-Y4-D001",
      "objective_text": "read Roman numerals to 100 (I to C) and know that over time, the numeral system changed to include the concept of zero and place value",
      "non_statutory_guidance": "Pupils are introduced to the numeral system used by the Romans, which has no concept of zero or place value. They understand that our current number system uses Arabic numerals and has benefited from the concept of zero.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O010",
      "domain_id": "MA-Y4-D002",
      "objective_text": "add and subtract numbers with up to 4 digits using the formal written methods of columnar addition and subtraction where appropriate",
      "non_statutory_guidance": "Pupils practise adding and subtracting increasingly large numbers to aid fluency. Pupils are encouraged to use mental arithmetic where possible and to select an appropriate written or mental method for the calculation.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O011",
      "domain_id": "MA-Y4-D002",
      "objective_text": "estimate and use inverse operations to check answers to a calculation",
      "non_statutory_guidance": "Pupils continue to develop their use of estimation and checking. They use inverse operations (addition and subtraction, multiplication and division) to check the accuracy of their calculations.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O012",
      "domain_id": "MA-Y4-D002",
      "objective_text": "solve addition and subtraction two-step problems in contexts, deciding which operations and methods to use and why",
      "non_statutory_guidance": "Pupils are encouraged to decide which operations and methods to use, and to explain why. They solve addition and subtraction problems in a range of contexts.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O013",
      "domain_id": "MA-Y4-D003",
      "objective_text": "recall multiplication and division facts for multiplication tables up to 12 × 12",
      "non_statutory_guidance": "Pupils continue to practise recalling and using multiplication tables and related division facts to aid fluency. They should be able to recall multiplication facts up to 12 × 12 and the associated division facts.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O014",
      "domain_id": "MA-Y4-D003",
      "objective_text": "use place value, known and derived facts to multiply and divide mentally, including: multiplying by 0 and 1; dividing by 1; multiplying together three numbers",
      "non_statutory_guidance": "Pupils practise mental methods and extend this to three-digit numbers to derive facts. They also practise and extend their ability to write statements about the equality of expressions.",
      "examples": "multiplying by 0 and 1; dividing by 1; multiplying together three numbers",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O015",
      "domain_id": "MA-Y4-D003",
      "objective_text": "recognise and use factor pairs and commutativity in mental calculations",
      "non_statutory_guidance": "Pupils use and explain the relationship between multiplication and division. They apply commutativity and associativity to mental calculations and problem solving.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O016",
      "domain_id": "MA-Y4-D003",
      "objective_text": "multiply two-digit and three-digit numbers by a one-digit number using formal written layout",
      "non_statutory_guidance": "Pupils practise to become fluent in the formal written methods of short multiplication and short division with exact answers. They also begin to use long multiplication and long division, including dividing a three-digit number by a one-digit number.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O017",
      "domain_id": "MA-Y4-D003",
      "objective_text": "solve problems involving multiplying and adding, including using the distributive law to multiply two-digit numbers by one digit, integer scaling problems and harder correspondence problems such as n objects are connected to m objects",
      "non_statutory_guidance": "Pupils work with more complex correspondence problems, using multiplication and division. They apply the distributive law to perform calculations more efficiently.",
      "examples": "n objects are connected to m objects",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O018",
      "domain_id": "MA-Y4-D004",
      "objective_text": "recognise and show, using diagrams, families of common equivalent fractions",
      "non_statutory_guidance": "Pupils should connect hundredths to tenths and place value and decimal measure. They extend their understanding of the part-whole relationship to fractions with denominators that are multiples of each other.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O019",
      "domain_id": "MA-Y4-D004",
      "objective_text": "count up and down in hundredths; recognise that hundredths arise when dividing an object by one hundred and dividing tenths by ten",
      "non_statutory_guidance": "Pupils should connect hundredths to tenths and place value and decimal measure. They recognise the relationship between hundredths and tenths.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O020",
      "domain_id": "MA-Y4-D004",
      "objective_text": "solve problems involving increasingly harder fractions to calculate quantities, and fractions to divide quantities, including non-unit fractions where the answer is a whole number",
      "non_statutory_guidance": "Pupils use factors and multiples to recognise equivalent fractions and simplify where appropriate (for example, 6/9 = 2/3 or 1/4 = 2/8). Pupils should be able to use a fraction to divide a quantity, for example 3/4 of 28 = 21.",
      "examples": "3/4 of 28 = 21",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O021",
      "domain_id": "MA-Y4-D004",
      "objective_text": "add and subtract fractions with the same denominator",
      "non_statutory_guidance": "Pupils should practise adding and subtracting fractions with the same denominator and related fractions (for example, 5/6 + 1/6 = 1). They use the number line to locate fractions and should understand fractions as parts of a whole.",
      "examples": "5/6 + 1/6 = 1",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O022",
      "domain_id": "MA-Y4-D004",
      "objective_text": "recognise and write decimal equivalents of any number of tenths or hundredths",
      "non_statutory_guidance": "Pupils should connect hundredths to tenths and place value and decimal measure. They recognise that tenths are 0.1, 0.2 etc. and hundredths are 0.01, 0.02 etc.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O023",
      "domain_id": "MA-Y4-D004",
      "objective_text": "recognise and write decimal equivalents to 1/4, 1/2, 3/4",
      "non_statutory_guidance": "Pupils should recognise that 1/2 = 0.5, 1/4 = 0.25 and 3/4 = 0.75, and should be able to convert between these forms.",
      "examples": "1/4, 1/2, 3/4",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O024",
      "domain_id": "MA-Y4-D004",
      "objective_text": "find the effect of dividing a one- or two-digit number by 10 and 100, identifying the value of the digits in the answer as ones, tenths and hundredths",
      "non_statutory_guidance": "Pupils should be able to understand the effect of dividing by 10 and 100, linking to their understanding of place value.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O025",
      "domain_id": "MA-Y4-D004",
      "objective_text": "round decimals with one decimal place to the nearest whole number",
      "non_statutory_guidance": "Pupils should develop the use of rounding to check the reasonableness of answers. They should be able to round decimals with one decimal place to the nearest whole number.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O026",
      "domain_id": "MA-Y4-D004",
      "objective_text": "compare numbers with the same number of decimal places up to two decimal places",
      "non_statutory_guidance": "Pupils should compare numbers with up to two decimal places and order them on a number line.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O027",
      "domain_id": "MA-Y4-D004",
      "objective_text": "solve simple measure and money problems involving fractions and decimals to two decimal places",
      "non_statutory_guidance": "Pupils should apply their knowledge of fractions and decimals to solve problems involving measures and money. They connect decimals to metric measures (for example, 1.25 km = 1 km and 250 m).",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O028",
      "domain_id": "MA-Y4-D005",
      "objective_text": "convert between different units of measure [for example, kilometre to metre; hour to minute]",
      "non_statutory_guidance": "Pupils should be able to convert between standard metric units and know that kilo- means 1000, so 1 kilometre = 1000 metres, 1 kilogram = 1000 grams, and 1 litre = 1000 millilitres. They should also be able to convert between units of time.",
      "examples": "kilometre to metre; hour to minute",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O029",
      "domain_id": "MA-Y4-D005",
      "objective_text": "measure and calculate the perimeter of a rectilinear figure (including squares) in centimetres and metres",
      "non_statutory_guidance": "Pupils should be able to measure and calculate the perimeter of rectilinear shapes, using addition.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O030",
      "domain_id": "MA-Y4-D005",
      "objective_text": "find the area of rectilinear shapes by counting squares",
      "non_statutory_guidance": "Pupils should be able to find the area of rectilinear shapes by counting squares. They should understand the difference between area and perimeter.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O031",
      "domain_id": "MA-Y4-D005",
      "objective_text": "estimate, compare and calculate different measures, including money in pounds and pence",
      "non_statutory_guidance": "Pupils should continue to use measuring tools with greater accuracy, reading scales in a range of contexts. They should solve money problems involving fractions and decimals.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O032",
      "domain_id": "MA-Y4-D005",
      "objective_text": "read, write and convert time between analogue and digital 12- and 24-hour clocks",
      "non_statutory_guidance": "Pupils should be able to read and write times in both analogue and digital 12- and 24-hour formats and convert between them. They should also solve problems involving converting from hours to minutes, minutes to seconds, and years to months.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O033",
      "domain_id": "MA-Y4-D005",
      "objective_text": "solve problems involving converting from hours to minutes; minutes to seconds; years to months; weeks to days",
      "non_statutory_guidance": "Pupils should be able to solve problems involving converting from hours to minutes, minutes to seconds, and years to months.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O034",
      "domain_id": "MA-Y4-D006",
      "objective_text": "compare and classify geometric shapes, including quadrilaterals and triangles, based on their properties and sizes",
      "non_statutory_guidance": "Pupils should be able to describe, classify and compare a wide range of shapes including triangles (equilateral, isosceles, scalene, right-angled) and quadrilaterals (square, rectangle, rhombus, parallelogram, trapezium), using mathematical vocabulary including parallel, perpendicular, right angle, acute angle, obtuse angle.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O035",
      "domain_id": "MA-Y4-D006",
      "objective_text": "identify acute and obtuse angles and compare and order angles up to two right angles by size",
      "non_statutory_guidance": "Pupils should be able to identify angles that are less than a right angle (acute), equal to a right angle, greater than a right angle but less than two right angles (obtuse). They should compare and order angles.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O036",
      "domain_id": "MA-Y4-D006",
      "objective_text": "identify lines of symmetry in 2-D shapes presented in different orientations",
      "non_statutory_guidance": "Pupils should be able to identify lines of symmetry in 2-D shapes, including shapes presented in different orientations and sizes. They should understand that a line of symmetry divides a shape into two equal halves that are mirror images of each other.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O037",
      "domain_id": "MA-Y4-D006",
      "objective_text": "complete a simple symmetric figure with respect to a specific line of symmetry",
      "non_statutory_guidance": "Pupils should be able to complete symmetrical figures using a given line of symmetry, drawing mirror image sections on squared paper or with a mirror.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O038",
      "domain_id": "MA-Y4-D007",
      "objective_text": "describe positions on a 2-D grid as coordinates in the first quadrant",
      "non_statutory_guidance": "Pupils should use coordinates (x, y) to describe positions on a grid. They should understand that the x-coordinate describes the horizontal distance from the origin and the y-coordinate describes the vertical distance from the origin.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O039",
      "domain_id": "MA-Y4-D007",
      "objective_text": "describe movements between positions as translations of a given unit to the left/right and up/down",
      "non_statutory_guidance": "Pupils should be able to describe movements between positions on a grid as translations, using the language of left, right, up and down.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O040",
      "domain_id": "MA-Y4-D007",
      "objective_text": "plot specified points and draw sides to complete a given polygon",
      "non_statutory_guidance": "Pupils should be able to plot points on a coordinate grid and connect them to draw polygons.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O041",
      "domain_id": "MA-Y4-D008",
      "objective_text": "interpret and present discrete and continuous data using appropriate graphical methods, including bar charts and time graphs",
      "non_statutory_guidance": "Pupils should understand the difference between discrete and continuous data. They should be able to interpret bar charts (for discrete data) and time graphs/line graphs (for continuous data), and choose appropriate representations for given datasets.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y4-O042",
      "domain_id": "MA-Y4-D008",
      "objective_text": "solve comparison, sum and difference problems using information presented in bar charts, pictograms, tables and other graphs",
      "non_statutory_guidance": "Pupils should apply their calculation knowledge to solve comparison, sum and difference problems using information from graphs and tables. They should be able to interpret time graphs to answer questions about how a quantity changes over time.",
      "examples": "",
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "MA-Y4-C001",
      "domain_id": "MA-Y4-D001",
      "concept_name": "Place value in four-digit numbers",
      "description": "Four-digit numbers have digits in the thousands, hundreds, tens and ones positions (e.g. 3,472 = 3000 + 400 + 70 + 2). Understanding this extends the place value system one column to the left. Mastery means pupils can identify the value of any digit in a four-digit number, partition it in standard and flexible ways, and use this understanding as the basis for all four-digit calculations.",
      "teaching_guidance": "Extend the Dienes blocks to include thousands cubes (a 10 × 10 × 10 block). Use place value mats with Th, H, T, O columns. Arrow cards now include 1000, 2000, 3000... cards. Place value charts and number lines up to 10,000 provide pictorial support. Key: the thousands digit value is always a multiple of 1000, not simply the digit read as a single number. Practise partitioning in multiple ways (3472 = 3000 + 472 = 2000 + 1472 etc.).",
      "key_vocabulary": "thousands, hundreds, tens, ones, four-digit number, place value, partition, digit, value, represent",
      "common_misconceptions": "Pupils sometimes say 3,472 has a 3 'worth 3' rather than 3000. In four-digit numbers, the zero placeholder causes confusion in numbers like 3,072 (no hundreds) — pupils may write this as 372 or 3720. Writing numbers in words becomes more complex (three thousand, four hundred and seventy-two — note 'and' placement).",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "MA-Y4-C002",
      "domain_id": "MA-Y4-D001",
      "concept_name": "Counting in multiples of 6, 7, 9, 25 and 1000",
      "description": "Year 4 extends skip-counting to the six, seven, nine, twenty-five and one thousand times tables. Counting in 6s, 7s and 9s consolidates the corresponding multiplication tables; counting in 25s connects to money and measurement; counting in 1000s extends place value. Mastery means pupils can count fluently in all these multiples from different starting points and in both directions.",
      "teaching_guidance": "For 6s and 9s, use the connection to the 3 times table (6 = 2 × 3; 9 = 3 × 3). The '9 times table finger trick' helps some pupils. For 25s, connect to money: 25p, 50p, 75p, £1.00 — four 25ps make £1. For 1000s, extend the place value understanding to counting in thousands on a number line up to 10,000. Practise all multiples with a mix of 'continue the sequence' and 'what comes after/before?' questions.",
      "key_vocabulary": "multiples of six, seven, nine, twenty-five, thousand, skip count, sequence, count on, count back",
      "common_misconceptions": "The 7 times table is the hardest for most pupils and has no obvious pattern to aid memorisation. Counting in 25s causes errors at 100 (some pupils say 100, 125, 150... but then say 275, 300, 325... — correct — having been unsure at 200 and 225). Counting backwards in 9s is particularly challenging.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": [
        "MA-Y4-C004"
      ]
    },
    {
      "concept_id": "MA-Y4-C003",
      "domain_id": "MA-Y4-D001",
      "concept_name": "Negative numbers in context",
      "description": "Negative numbers extend the number line below zero. In Year 4, pupils encounter them in contexts such as temperature below freezing, below sea level, and financial debt. Pupils must be able to count through zero in both directions and compare negative numbers. Mastery means pupils can read and record negative numbers in context, compare negative numbers (e.g. –3 > –7), count through zero, and calculate intervals crossing zero.",
      "teaching_guidance": "Use a vertical number line (like a thermometer) as the primary visual tool — the physical analogy of temperature falling below zero is highly effective. Number lines on the floor (walk below zero) and horizontal number lines that extend left of zero both help. Practise reading temperatures on a thermometer scale. Compare pairs of temperatures: 'Which is colder, –3°C or –7°C?' Establish: numbers get smaller the further left (or down) you go, even below zero.",
      "key_vocabulary": "negative, below zero, minus, temperature, degrees Celsius, thermometer, number line, count through zero, compare, less than",
      "common_misconceptions": "Pupils commonly think –7 is greater than –3 because 7 > 3 — they apply the absolute value comparison rather than the signed comparison. The language 'minus seven' is confused with 'take away seven', so some pupils treat –7 as a subtraction instruction rather than a number. The word 'negative' itself is important to use alongside 'minus' to make the distinction clear.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "MA-Y4-C004",
      "domain_id": "MA-Y4-D001",
      "concept_name": "Rounding to nearest 10, 100 and 1000",
      "description": "Rounding is the process of approximating a number to the nearest multiple of 10, 100 or 1000. The rule is: if the digit in the column to the right of the target column is 5 or more, round up; if it is 4 or less, round down. Mastery means pupils can round any number to the specified degree of accuracy, explain the rule with reference to the number line, and use rounding as a checking and estimation tool.",
      "teaching_guidance": "Use a number line to show rounding as finding the nearer of the two bounding multiples. For rounding 347 to the nearest 100: it is between 300 and 400, closer to 300, so it rounds to 300. The 'five is on the right side of the hill' mnemonic helps establish the convention for 5. Practise rounding to different degrees of accuracy on the same number. Connect to estimation: before computing 347 + 256, round both to nearest 100 to estimate 300 + 300 = 600.",
      "key_vocabulary": "round, nearest, approximate, ten, hundred, thousand, digit, round up, round down, boundary, midpoint",
      "common_misconceptions": "Pupils frequently look at the wrong digit when rounding (rounding to nearest 100, they look at the ones digit rather than the tens digit). The midpoint convention (when the digit is exactly 5, round up) is not understood conceptually, only as a rule. Rounding to the nearest 1000 can produce 0 for numbers less than 500, which surprises pupils.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_weight": 2,
      "co_teach_hints": [
        "MA-Y4-C002"
      ]
    },
    {
      "concept_id": "MA-Y4-C005",
      "domain_id": "MA-Y4-D001",
      "concept_name": "Roman numerals to 100 (I to C)",
      "description": "Roman numerals use letters to represent values: I=1, V=5, X=10, L=50, C=100. The system uses additive (VI = 5+1 = 6) and subtractive (IV = 5-1 = 4) principles. In Year 4, pupils read Roman numerals to 100 and understand historically how this differs from our place value system. Mastery means pupils can convert any number from 1-100 to and from Roman numerals and explain why the Roman system does not have place value.",
      "teaching_guidance": "Display the seven basic Roman numeral symbols prominently (I, V, X, L, C, D, M — though D and M are not required until later). Teach the subtractive rule: when a smaller numeral precedes a larger one, it is subtracted (IV = 4, IX = 9, XL = 40, XC = 90). Practise conversions in both directions. Connect to history: discuss why the Roman system had no zero and how that limited mathematical development. Contrast with our positional/place value system.",
      "key_vocabulary": "Roman numerals, I, V, X, L, C, additive, subtractive, symbol, convert, place value, zero",
      "common_misconceptions": "Pupils frequently forget the subtractive rule and read IV as 6 (I + V) rather than 4 (V – I). They may apply the subtractive rule incorrectly: IIX is not a valid Roman numeral (the convention is that only one smaller numeral precedes a larger one). Some pupils confuse Roman numeral C (100) with the letter and assign it other values.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "MA-Y4-C006",
      "domain_id": "MA-Y4-D002",
      "concept_name": "Formal columnar addition and subtraction of four-digit numbers",
      "description": "Columnar addition and subtraction are extended to four-digit numbers in Year 4, requiring exchanges (carries) to occur in up to three columns simultaneously. Pupils must apply the method reliably for any combination of four-digit numbers. Mastery means pupils can set out and solve any four-digit addition or subtraction using formal written methods, with correct alignment, carrying and borrowing, and can check answers using the inverse operation.",
      "teaching_guidance": "Revisit and consolidate three-digit columnar methods before extending to four digits. The structure of the method is identical — simply add a thousands column on the left. Emphasise alignment: use squared paper, printed column frames or turn plain paper landscape with hand-drawn columns. For subtraction with four digits, cascading exchanges (e.g. 3000 – 1 requires exchanging through three columns: 3000 = 2 thousands, 9 hundreds, 9 tens, 10 ones) need explicit practice. Check using the inverse.",
      "key_vocabulary": "column addition, column subtraction, carry, exchange, borrow, align, thousands, hundreds, tens, ones, digit",
      "common_misconceptions": "The most common error remains forgetting the carry in addition. For subtraction, the cascading exchange through zeros (4000 – 1 = ?) is the most challenging case and requires step-by-step practice. Some pupils align the digits from the left rather than the right, corrupting the place value structure.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "MA-Y4-C007",
      "domain_id": "MA-Y4-D003",
      "concept_name": "All multiplication tables to 12 × 12",
      "description": "By end of Year 4, pupils must know all multiplication facts to 12 × 12 and the corresponding division facts to immediate recall. This is a statutory requirement and represents a major milestone in mathematical fluency. Mastery means automatic, accurate recall of any multiplication or division fact within the 12 × 12 grid without counting or deriving, enabling rapid computation and problem-solving.",
      "teaching_guidance": "By Year 4, pupils should know the 2, 3, 4, 5, 8 and 10 times tables from Year 3. New tables are 6, 7, 9, 11 and 12. Use commutativity to reduce the learning load: knowing 6 × 7 = 42 gives 7 × 6 = 42 for free. Highlight patterns: 9 times table (digit sum always 9; ones digits decrease by 1 as tens digits increase by 1). 11 times table (to 9 × 11 = 99, the digits repeat: 11, 22, 33...). 12 times table (connect to 10× and 2×: 12 × n = 10 × n + 2 × n). Use a range of practice methods: games, cards, rapid-fire oral tests, written grids.",
      "key_vocabulary": "multiplication table, times table, multiplication fact, division fact, recall, product, quotient, factor, multiple, fluency, 12 × 12",
      "common_misconceptions": "The 6 × 7 = 42 and 7 × 8 = 56 facts are the most commonly misremembered in the 12 × 12 grid. Pupils who have memorised facts by rote without connections confuse similar-sounding facts (6 × 8 = 48 vs 6 × 7 = 42). Division facts are frequently less secure than multiplication facts, even when the multiplication is known — pupils must practise division recall explicitly.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 4,
      "co_teach_hints": [
        "MA-Y4-C008"
      ]
    },
    {
      "concept_id": "MA-Y4-C008",
      "domain_id": "MA-Y4-D003",
      "concept_name": "Short multiplication (2- and 3-digit × 1-digit)",
      "description": "Short multiplication is the compact formal written method for multiplying a multi-digit number by a single-digit number, working right to left and carrying any value of 10 or more into the next column. In Year 4, this is used for two-digit and three-digit numbers multiplied by one-digit numbers. Mastery means pupils can reliably set out and complete any such calculation using the formal compact method.",
      "teaching_guidance": "Build from the grid method (used in Year 3) to the compact method. Show how the grid method's partial products combine into carries in the compact layout. The CPA sequence: Dienes blocks for physical regrouping → grid as pictorial → compact method. Emphasise: multiply the ones digit first, carry to the tens; multiply the tens digit, add the carry, carry to the hundreds; and so on. Carry digits written small above the relevant column. Example: 247 × 3 — ones: 7×3=21 (write 1, carry 2); tens: 4×3=12+2=14 (write 4, carry 1); hundreds: 2×3=6+1=7; answer 741.",
      "key_vocabulary": "short multiplication, formal method, carry, digit, ones, tens, hundreds, thousands, compact, multiply",
      "common_misconceptions": "The most common error is forgetting to add the carried digit. Some pupils multiply from left to right, which works but produces the wrong carry sequence. Others carry the complete partial product rather than just the tens digit (e.g. 7 × 3 = 21, carrying the '21' rather than writing 1 and carrying 2).",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "MA-Y4-C009",
      "domain_id": "MA-Y4-D003",
      "concept_name": "Factor pairs and commutativity in mental calculation",
      "description": "A factor pair of a number is a pair of integers that multiply to give that number (e.g. factor pairs of 24 include 1 × 24, 2 × 12, 3 × 8, 4 × 6). Commutativity means a × b = b × a. Together, these allow pupils to reorder and regroup calculations for efficiency: 4 × 17 × 5 = 4 × 5 × 17 = 20 × 17 = 340 (reordering to create a convenient factor pair). Mastery means pupils can identify factor pairs of numbers up to 100, apply commutativity to reorder calculations, and explain why these strategies work.",
      "teaching_guidance": "Use arrays to demonstrate commutativity: a 4 × 6 array is identical to a 6 × 4 array, just rotated. For factor pairs, systematic listing from 1 upwards helps ensure completeness: factors of 24: 1 and 24, 2 and 12, 3 and 8, 4 and 6 — stop when the smaller factor reaches the square root. Connect factor pairs to the multiplication table grid: every entry in the grid corresponds to a factor pair of that number.",
      "key_vocabulary": "factor, factor pair, product, commutative, commutative law, associative, reorder, mental calculation, efficient",
      "common_misconceptions": "Pupils often confuse factors and multiples (a factor of 24 divides 24 exactly; a multiple of 24 is 24 times a whole number). When listing factor pairs, pupils frequently miss pairs or stop before reaching all pairs. Some pupils do not spontaneously apply commutativity in mental calculation, missing opportunities to create simpler calculations.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "MA-Y4-C010",
      "domain_id": "MA-Y4-D004",
      "concept_name": "Hundredths and decimal place value",
      "description": "A hundredth is one of one hundred equal parts of a whole (1/100 = 0.01). The second decimal place (hundredths) extends the decimal place value system established with tenths in Year 3. Mastery means pupils understand that 0.01 = 1/100, can count up and down in hundredths, understand that 10 hundredths = 1 tenth, and can identify the value of any digit in a decimal number with two decimal places.",
      "teaching_guidance": "Use a 10 × 10 grid (like a hundred square but representing one whole): each small square is 1/100 = 0.01, each row/column of 10 squares is 1/10 = 0.1. Hundredths number lines (0 to 1 marked in 0.01 steps) provide pictorial support. Connect to metric measures: 1 cm = 0.01 m, since 100 cm = 1 m. Money provides a natural context: £1.47 means 1 pound, 4 tenths of a pound and 7 hundredths of a pound. Practise reading and writing decimal numbers with up to two decimal places.",
      "key_vocabulary": "hundredth, one hundredth, 0.01, 1/100, decimal place, tenths, hundredths, decimal point, column, value",
      "common_misconceptions": "Pupils often think 0.17 is 'zero point seventeen' and therefore larger than 0.9 (which they read as 'zero point nine') because 17 > 9. This is the most critical misconception in decimal place value. Pupils may also think 0.1 = 0.10 but not understand why (the zero adds no value). The connection between fraction and decimal notation (1/100 = 0.01) is often procedural rather than conceptual.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": [
        "MA-Y4-C012"
      ]
    },
    {
      "concept_id": "MA-Y4-C011",
      "domain_id": "MA-Y4-D004",
      "concept_name": "Equivalent fractions using multiples and factors",
      "description": "Equivalent fractions can be generated by multiplying or dividing both numerator and denominator by the same non-zero number. For example, 1/2 = 2/4 = 3/6 = 4/8 (multiplying by 2, 3, 4 respectively). Families of equivalent fractions share a common value. Mastery means pupils can generate equivalent fractions systematically, recognise whether two fractions are equivalent, and use equivalence to compare and order fractions with different denominators.",
      "teaching_guidance": "Use fraction walls and fraction circles to show equivalence visually. The rule: multiplying numerator and denominator by the same number (×n/n = 1) preserves the value. Generate families: 1/3, 2/6, 3/9, 4/12... Practice: find three fractions equivalent to 2/5 (4/10, 6/15, 8/20). Connect to simplifying fractions (divide both by the same number). Use equivalent fractions to add fractions with different but related denominators: 1/3 + 1/6 = 2/6 + 1/6 = 3/6 = 1/2.",
      "key_vocabulary": "equivalent, fraction, numerator, denominator, multiply, divide, simplify, fraction wall, family, common value",
      "common_misconceptions": "Pupils understand that multiplying both parts works but struggle to explain why it preserves value. They may think only one specific fraction in a family is 'correct'. When using equivalence to compare fractions, pupils may use trial and error rather than a systematic approach.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "MA-Y4-C012",
      "domain_id": "MA-Y4-D004",
      "concept_name": "Decimal equivalents to common fractions",
      "description": "Certain common fractions have well-known decimal equivalents: 1/2 = 0.5, 1/4 = 0.25, 3/4 = 0.75, 1/10 = 0.1, 1/100 = 0.01. These equivalences must be known to automaticity. Mastery means pupils can convert between fraction and decimal notation for these key fractions instantly and use these equivalences in measurement and money contexts.",
      "teaching_guidance": "Use money as the most natural context: £0.50 = £1/2; £0.25 = £1/4 (25p is a quarter of a pound). Use the hundredths grid: shade 50 squares for 1/2 = 0.50; shade 25 squares for 1/4 = 0.25. Connect to division: 1 ÷ 2 = 0.5; 1 ÷ 4 = 0.25. Extend to any tenths: 3/10 = 0.3, 7/10 = 0.7. Display a reference table until these are memorised.",
      "key_vocabulary": "decimal equivalent, fraction, one half, one quarter, three quarters, decimal point, convert, tenths, hundredths",
      "common_misconceptions": "Pupils often write 1/4 = 0.4 (reading the denominator as the decimal digit rather than dividing). They may know 1/2 = 0.5 but not connect 3/4 = 0.75 (which requires recognising it as 3 × 0.25). The equivalence 1/10 = 0.1 is usually secure; 1/100 = 0.01 is less so.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": [
        "MA-Y4-C010"
      ]
    },
    {
      "concept_id": "MA-Y4-C013",
      "domain_id": "MA-Y4-D005",
      "concept_name": "Area of rectilinear shapes",
      "description": "Area is the amount of space enclosed within a 2-D shape, measured in square units (cm², m²). In Year 4, pupils find area of rectilinear shapes by counting squares on a grid. They should also understand that area of a rectangle = length × width. Mastery means pupils can find area by counting, apply the formula for rectangles, and clearly distinguish area (space inside) from perimeter (distance around).",
      "teaching_guidance": "Begin by counting squares on squared paper — trace a shape onto squared paper and count every full square. Progress to L-shaped and irregular rectilinear shapes. Introduce the formula: a rectangle of length 5 cm and width 3 cm can be seen as 5 columns of 3 squares = 5 × 3 = 15 cm². Connect to multiplication: length × width uses the multiplication skills from the multiplication domain. Always compare with perimeter of the same shape to keep the distinction clear.",
      "key_vocabulary": "area, square centimetre, cm², square metre, m², length, width, multiply, rectilinear, rectangle, count squares, formula",
      "common_misconceptions": "Confusion between area and perimeter is the single most persistent misconception in measurement. Pupils may count perimeter squares instead of area squares, or use addition (l + w) for area and multiplication (l × w) for perimeter — exactly backwards. When shapes are not rectangles (L-shapes), pupils often struggle to decompose them into rectangles for calculating area.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "MA-Y4-C014",
      "domain_id": "MA-Y4-D005",
      "concept_name": "Converting between metric units",
      "description": "Metric unit conversion uses the prefix system: kilo- means × 1000 (km to m, kg to g), centi- means × 100 (m to cm), milli- means × 1000 (l to ml, m to mm). Pupils must convert in both directions (km to m and m to km). Mastery means pupils know the key conversion facts by heart and can perform conversions correctly in both directions, connecting to multiplication and division.",
      "teaching_guidance": "Use the memorable prefix facts: kilo- = 1000 (connect to the word 'kilogram' = 1000 grams, like a kilowatt = 1000 watts in science). Practice conversion tables: 1 km = 1000 m, 1 m = 100 cm, 1 m = 1000 mm, 1 kg = 1000 g, 1 l = 1000 ml. Converting down (larger unit to smaller) involves multiplication; converting up (smaller to larger) involves division. Connect to decimals: 1.5 km = 1500 m; 250 m = 0.25 km.",
      "key_vocabulary": "convert, kilometre, metre, centimetre, millimetre, kilogram, gram, litre, millilitre, kilo-, centi-, milli-, multiply, divide",
      "common_misconceptions": "Pupils frequently multiply when they should divide and vice versa (confusing which direction the conversion goes). They may think 1 m = 10 cm or 1 kg = 100 g (confusing the different prefix multipliers). The fact that both 'm' and 'mm' involve metres causes confusion: 1 m = 1000 mm (not 100 mm) because milli- = 1/1000.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "MA-Y4-C015",
      "domain_id": "MA-Y4-D007",
      "concept_name": "Coordinates in the first quadrant",
      "description": "A coordinate is an ordered pair of numbers (x, y) that uniquely describes a position on a 2-D grid. The first quadrant contains points with positive x (horizontal) and positive y (vertical) values. Pupils must plot and read coordinates accurately. Mastery means pupils can read any coordinate from a grid, plot any given coordinate, use coordinates to describe positions of shapes, and connect changes in coordinates to translations.",
      "teaching_guidance": "Teach the mnemonic 'along the corridor, then up the stairs' (x first, then y) to establish the conventional order. Use large grid paper and plot points physically. Start with integer coordinates, then extend to half-unit coordinates if pupils are secure. Plot the vertices of shapes and ask pupils to identify coordinates; give coordinates and ask pupils to draw shapes. Connect to the first quadrant specifically — all values positive. Introduce the origin (0, 0) as the reference point.",
      "key_vocabulary": "coordinate, x-coordinate, y-coordinate, origin, grid, first quadrant, horizontal, vertical, plot, ordered pair, axis, axes",
      "common_misconceptions": "Pupils frequently reverse x and y coordinates — plotting (3, 5) at the position (5, 3). This is very common and persistent. Some pupils count the grid lines rather than the spaces, giving coordinates one unit too large. Pupils may also confuse the x-axis (horizontal) with the y-axis (vertical).",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "MA-Y4-C016",
      "domain_id": "MA-Y4-D006",
      "concept_name": "Classifying triangles and quadrilaterals",
      "description": "Triangles are classified by side length (equilateral: all equal; isosceles: two equal; scalene: all different) and by angles (right-angled: contains a 90° angle; acute: all angles less than 90°; obtuse: one angle greater than 90°). Quadrilaterals include squares, rectangles, parallelograms, rhombuses and trapeziums. Mastery means pupils can classify any triangle or quadrilateral from a description or diagram, giving reasons based on measured properties.",
      "teaching_guidance": "Provide sets of triangles and quadrilaterals for sorting and classifying, including non-prototypical examples (an isosceles triangle pointing sideways; a tilted square). Use Venn diagrams for overlapping classifications (right-angled AND isosceles). For quadrilaterals, build a hierarchy: square is a special rectangle (all sides equal); rectangle is a special parallelogram (right angles); parallelogram is a special trapezium (both pairs of parallel sides). Measure angles and sides to verify classifications.",
      "key_vocabulary": "triangle, equilateral, isosceles, scalene, right-angled, acute, obtuse, quadrilateral, square, rectangle, parallelogram, rhombus, trapezium, parallel, perpendicular, classify, properties",
      "common_misconceptions": "Pupils frequently think squares and rectangles are entirely different (not recognising a square as a special rectangle). They may not accept an isosceles triangle as isosceles when it is presented pointing left or right rather than upward. Some pupils classify by appearance (prototype matching) rather than by measuring and checking properties.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "MA-Y4-C017",
      "domain_id": "MA-Y4-D006",
      "concept_name": "Lines of symmetry",
      "description": "A line of symmetry (also called a mirror line) divides a shape into two halves that are mirror images of each other. A shape may have zero, one or more lines of symmetry. Pupils in Year 4 identify lines of symmetry in 2-D shapes presented in different orientations and complete symmetric figures given one line of symmetry. Mastery means pupils can identify all lines of symmetry in common shapes, test whether a given line is a line of symmetry, and complete a half-shape accurately.",
      "teaching_guidance": "Use mirrors (Mira mirrors are ideal) to check symmetry practically. Folding: fold a shape along a proposed line of symmetry and check whether the two halves match exactly. On squared/dotted paper, completing a symmetric figure requires reflecting each key point the same distance on the other side of the line. Regular polygons: equilateral triangle has 3, square has 4, regular pentagon has 5, regular hexagon has 6. A scalene triangle has 0. Irregular shapes may have 0 or 1.",
      "key_vocabulary": "symmetry, line of symmetry, mirror line, reflect, reflection, fold, match, equal, half, shape, orientation",
      "common_misconceptions": "Pupils often identify only vertical lines of symmetry, not recognising diagonal or horizontal lines. They may think all shapes have at least one line of symmetry. When completing symmetric figures, pupils reflect the shape rather than the key points, leading to inaccurate completions. Shapes presented in non-standard orientations may be unrecognised as symmetric.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "MA-Y4-C018",
      "domain_id": "MA-Y4-D008",
      "concept_name": "Time graphs and continuous data",
      "description": "A time graph (line graph) shows how a quantity changes continuously over time, with time on the horizontal axis. The continuous line between plotted points implies values exist for all intermediate times. Pupils must read values from the graph, describe trends (rising, falling, constant) and calculate changes. Mastery means pupils can read and interpret a time graph accurately, describe the trend, and answer comparison and difference questions.",
      "teaching_guidance": "Use familiar real-world contexts: temperature through the day, plant growth over weeks, a car journey showing distance over time. Plot simple datasets (4-6 data points) and draw the line between them. Distinguish from bar charts (bar charts use bars for discrete categories; line graphs use a continuous line for values that change over time). Emphasise reading values between plotted points (interpolation) as a key feature of continuous graphs.",
      "key_vocabulary": "time graph, line graph, continuous data, trend, increase, decrease, constant, horizontal axis, vertical axis, read, interpolate, temperature",
      "common_misconceptions": "Pupils often try to draw bar charts for data that should be a line graph (not understanding the discrete/continuous distinction). They may read only the plotted points and not realise they can read values between them. Some pupils join points with a straight ruler between each pair correctly, but then interpret the joined-up shape as the 'answer' rather than as a visual representation of change.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "teaching_weight": 3,
      "co_teach_hints": []
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "MA-Y3-C007",
      "dependent_concept": "MA-Y4-C001",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "Understanding place value in three-digit numbers (hundreds, tens, ones) is directly extended to four-digit numbers (thousands, hundreds, tens, ones) in Year 4"
    },
    {
      "prerequisite_concept": "MA-Y3-C017",
      "dependent_concept": "MA-Y4-C002",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "The 3 times table from Year 3 is the foundation for counting in 6s (2×3s) and 9s (3×3s) in Year 4"
    },
    {
      "prerequisite_concept": "MA-Y3-C009",
      "dependent_concept": "MA-Y4-C003",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Ordering numbers to 1000 on a number line is extended through zero to negative numbers in Year 4"
    },
    {
      "prerequisite_concept": "MA-Y3-C010",
      "dependent_concept": "MA-Y4-C004",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 estimation and number line understanding is the direct foundation for Year 4 rounding, which formalises estimation as 'nearest multiple of 10, 100 or 1000'"
    },
    {
      "prerequisite_concept": "MA-Y3-C033",
      "dependent_concept": "MA-Y4-C005",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Year 3 Roman numerals I-XII (on clocks) are extended to I-C (1-100) in Year 4 with full understanding of the numeral system"
    },
    {
      "prerequisite_concept": "MA-Y3-C014",
      "dependent_concept": "MA-Y4-C006",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "Year 3 formal columnar addition for three-digit numbers is directly extended to four-digit numbers in Year 4"
    },
    {
      "prerequisite_concept": "MA-Y3-C015",
      "dependent_concept": "MA-Y4-C006",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "Year 3 formal columnar subtraction for three-digit numbers is directly extended to four-digit numbers in Year 4"
    },
    {
      "prerequisite_concept": "MA-Y3-C017",
      "dependent_concept": "MA-Y4-C007",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "The 3, 4 and 8 times tables from Year 3 are prerequisites for completing all tables to 12 × 12 in Year 4"
    },
    {
      "prerequisite_concept": "MA-Y3-C021",
      "dependent_concept": "MA-Y4-C008",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 two-digit × one-digit multiplication using mental and early written methods is extended to formal short multiplication in Year 4"
    },
    {
      "prerequisite_concept": "MA-Y4-C007",
      "dependent_concept": "MA-Y4-C008",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.95,
      "rationale": "Automatic recall of all multiplication facts to 12×12 is essential for performing short multiplication efficiently"
    },
    {
      "prerequisite_concept": "MA-Y4-C007",
      "dependent_concept": "MA-Y4-C009",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Identifying factor pairs requires knowing multiplication facts; commutativity of multiplication is demonstrated through times table knowledge"
    },
    {
      "prerequisite_concept": "MA-Y3-C024",
      "dependent_concept": "MA-Y4-C010",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 understanding of tenths (1/10 = 0.1) is the direct prerequisite for hundredths (1/100 = 0.01) in Year 4"
    },
    {
      "prerequisite_concept": "MA-Y3-C027",
      "dependent_concept": "MA-Y4-C011",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 equivalent fractions using diagrams is extended to the systematic rule (multiply/divide numerator and denominator by the same number) in Year 4"
    },
    {
      "prerequisite_concept": "MA-Y4-C010",
      "dependent_concept": "MA-Y4-C012",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Understanding decimal place value (tenths and hundredths) is required before memorising the decimal equivalents of common fractions"
    },
    {
      "prerequisite_concept": "MA-Y3-C031",
      "dependent_concept": "MA-Y4-C013",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Year 3 perimeter as a measurement concept is extended in Year 4 to area, requiring pupils to clearly distinguish between the two measurements"
    },
    {
      "prerequisite_concept": "MA-Y4-C007",
      "dependent_concept": "MA-Y4-C013",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.85,
      "rationale": "Area of a rectangle = length × width requires multiplication skill; pupils use their times table knowledge to calculate areas efficiently"
    },
    {
      "prerequisite_concept": "MA-Y3-C030",
      "dependent_concept": "MA-Y4-C014",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 work with mixed units (m/cm/mm, kg/g, l/ml) is formalised in Year 4 as systematic metric unit conversion using multiplication and division by 10, 100 or 1000"
    },
    {
      "prerequisite_concept": "MA-Y4-C001",
      "dependent_concept": "MA-Y4-C015",
      "confidence": "inferred",
      "relationship_type": "logical",
      "strength": 0.7,
      "rationale": "Reading and writing ordered pairs of numbers requires understanding of number; four-digit place value provides the number sense for coordinate work"
    },
    {
      "prerequisite_concept": "MA-Y3-C039",
      "dependent_concept": "MA-Y4-C016",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 3 understanding of parallel and perpendicular lines is the direct basis for classifying quadrilaterals and triangles by these properties in Year 4"
    },
    {
      "prerequisite_concept": "MA-Y3-C038",
      "dependent_concept": "MA-Y4-C016",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.85,
      "rationale": "Identifying right, acute and obtuse angles (from Year 3) is needed for classifying triangles and quadrilaterals by their angle types in Year 4"
    },
    {
      "prerequisite_concept": "MA-Y3-C036",
      "dependent_concept": "MA-Y4-C017",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Year 3 drawing and making shapes develops the spatial reasoning needed to identify and complete symmetric figures in Year 4"
    },
    {
      "prerequisite_concept": "MA-Y3-C040",
      "dependent_concept": "MA-Y4-C018",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Year 3 scaled bar charts and pictograms prepare pupils for the more complex continuous data representation using time graphs in Year 4"
    }
  ]
}
