{
  "metadata": {
    "subject": "Mathematics",
    "key_stage": "KS1",
    "years_covered": [
      1
    ],
    "document_reference": "DFE-00180-2013",
    "extraction_date": "2026-02-17",
    "structure_rating": 9
  },
  "domains": [
    {
      "domain_id": "MA-Y1-D001",
      "domain_name": "Number and Place Value",
      "description": "Pupils develop confidence and fluency in counting, reading, writing and representing numbers to 100, understanding one more and one less, and using the language of comparison.",
      "curriculum_context": "The principal focus of mathematics teaching in key stage 1 is to ensure that pupils develop confidence and mental fluency with whole numbers, counting and place value. In Year 1, this domain establishes the foundational number sense pupils will build on throughout their schooling. Pupils practise counting as both reciting numbers and as enumerating objects, developing their understanding that counting forwards and backwards, beginning from 0, 1 or any given number, underpins all arithmetic. They begin to recognise place value in numbers beyond 20 by reading, writing, counting and comparing numbers up to 100, supported by concrete objects and pictorial representations. By exploring patterns in counting sequences — including in twos, fives and tens — pupils lay the groundwork for multiplication and for recognising odd and even numbers in later years. The non-statutory guidance emphasises that pupils should practise counting, ordering and indicating quantity (e.g. 3 apples, 2 centimetres) through increasingly complex concrete problems until they are fluent, and should also recognise and create repeating patterns with objects and shapes.",
      "is_cross_cutting": false,
      "structure_type": "sequential"
    },
    {
      "domain_id": "MA-Y1-D002",
      "domain_name": "Addition and Subtraction",
      "description": "Pupils learn to read, write and interpret addition and subtraction statements, use number bonds within 20, and solve simple one-step problems using concrete objects and pictorial representations.",
      "curriculum_context": "In Year 1, addition and subtraction are introduced as related operations grounded in practical experience and the manipulation of concrete objects. Pupils memorise and reason with number bonds to 10 and 20 in multiple forms — for example, 9 + 7 = 16; 16 – 7 = 9; 7 = 16 – 9 — realising the effect of adding or subtracting zero and understanding that addition and subtraction are inverse operations. They combine and increase numbers by counting forwards and backwards, and discuss and solve problems in familiar practical contexts using the language: put together, add, altogether, total, take away, distance between, difference between, more than and less than. This rich vocabulary enables pupils to develop the concept of addition and subtraction flexibly, so they can apply these operations in varied contexts. One-step missing number problems — such as 7 = ? – 9 — begin to develop algebraic thinking from the earliest stage, challenging pupils to work backwards and reason about unknowns.",
      "is_cross_cutting": false,
      "structure_type": "sequential"
    },
    {
      "domain_id": "MA-Y1-D003",
      "domain_name": "Multiplication and Division",
      "description": "Pupils begin to understand multiplication and division through grouping, sharing and arrays, connecting these to counting in twos, fives and tens.",
      "curriculum_context": "In Year 1, multiplication and division are introduced informally through grouping and sharing small quantities, with the full support of the teacher and through the use of concrete objects, pictorial representations and arrays. Pupils begin to understand doubling numbers and quantities, and finding simple fractions of objects, numbers and quantities, which naturally connects to multiplicative thinking. The non-statutory guidance makes explicit that pupils should make connections between arrays, number patterns, and their counting in twos, fives and tens — creating a coherent thread from counting through to multiplication. At this stage there is no expectation that pupils record formal multiplication or division statements; the focus is on building intuitive understanding of equal groups and sharing through exploration and discussion. This exploratory approach prepares pupils for the more formal work with multiplication tables and written methods that begins in Year 2.",
      "is_cross_cutting": false,
      "structure_type": "exploratory"
    },
    {
      "domain_id": "MA-Y1-D004",
      "domain_name": "Fractions",
      "description": "Pupils recognise, find and name halves and quarters as equal parts of objects, shapes and quantities.",
      "curriculum_context": "In Year 1, fractions are introduced through the practical concept of equal sharing and fair division, rather than as abstract notation. Pupils are taught half and quarter as 'fractions of' discrete and continuous quantities by solving problems using shapes, objects and quantities — for example, recognising and finding half a length, a quantity, a set of objects or a shape. The curriculum emphasises that pupils should connect halves and quarters to equal sharing and grouping of sets of objects and to measures, as well as recognising and combining halves and quarters as parts of a whole. This conceptual grounding — built entirely on equality and physical partitioning — is critical because it establishes the meaning of the fraction before any notation is introduced. Pupils use language such as 'one half' and 'one quarter' to describe what they find, preparing them for the written fraction notation and equivalences that follow in Year 2.",
      "is_cross_cutting": false,
      "structure_type": "conceptual"
    },
    {
      "domain_id": "MA-Y1-D005",
      "domain_name": "Measurement",
      "description": "Pupils compare, describe and solve practical problems involving length, mass, capacity, time and money, and begin to record measurements using non-standard and then standard units.",
      "curriculum_context": "Measurement in Year 1 is rooted in practical, real-world experience, with pupils moving from using and comparing different types of quantities using non-standard units — including discrete and continuous measurement — to using manageable common standard units. Pupils compare and describe lengths and heights, mass/weight, capacity and volume, and time using appropriate comparative language (long/short, heavier than, full/empty, quicker/slower), and they begin to record these measurements using standard tools such as rulers, weighing scales and containers. The domain also encompasses money — specifically recognising the value of different denominations of coins and notes — and time, including sequencing events using everyday language (before and after, morning, afternoon, evening), recognising and using the days of the week, weeks, months and years, and telling the time to the hour and half past the hour. The pairs of terms mass and weight, volume and capacity, are used interchangeably at this stage, reflecting the non-statutory guidance. By embedding measurement in practical problem-solving contexts, this domain strengthens pupils' conceptual understanding of number and its real-world applications.",
      "is_cross_cutting": true,
      "structure_type": "applied"
    },
    {
      "domain_id": "MA-Y1-D006",
      "domain_name": "Geometry: Properties of Shapes",
      "description": "Pupils recognise and name common 2-D and 3-D shapes, handling them in different orientations and sizes.",
      "curriculum_context": "In Year 1, pupils develop their geometric understanding by handling common 2-D and 3-D shapes, naming them fluently and connecting them to related everyday objects. The statutory requirements specify that pupils should recognise and name 2-D shapes including rectangles (including squares), circles and triangles, and 3-D shapes including cuboids (including cubes), pyramids and spheres. A key aspect of this domain is that pupils should recognise these shapes in different orientations and sizes, and come to understand that rectangles, triangles, cuboids and pyramids are not always similar to each other — combating the common misconception that a triangle is only 'pointy upward' or a rectangle is only 'landscape'. This practical, exploratory approach to geometry — holding, turning and describing shapes — builds the vocabulary and spatial reasoning that pupils will need for the more detailed analysis of shape properties in Year 2 and beyond.",
      "is_cross_cutting": false,
      "structure_type": "conceptual"
    },
    {
      "domain_id": "MA-Y1-D007",
      "domain_name": "Geometry: Position and Direction",
      "description": "Pupils describe position, direction and movement including whole, half, quarter and three-quarter turns.",
      "curriculum_context": "In Year 1, position and direction are developed through physical experience and the language of spatial reasoning. Pupils learn to use positional language including left and right, top, middle and bottom, on top of, in front of, above, between, around, near, close and far, up and down, forwards and backwards, inside and outside. They make whole, half, quarter and three-quarter turns in both directions — physically experiencing rotation — and they connect turning clockwise with movement on a clock face, creating an important cross-domain link with time in the measurement domain. This embodied approach to direction and movement underpins pupils' later work on angles as a measure of turn in Year 2, and establishes the directional vocabulary needed for navigating coordinates and transformations in later key stages. The use of fractions of a turn (half, quarter, three-quarter) also provides a concrete context in which fraction language is applied meaningfully.",
      "is_cross_cutting": true,
      "structure_type": "conceptual"
    }
  ],
  "objectives": [
    {
      "objective_id": "MA-Y1-O001",
      "domain_id": "MA-Y1-D001",
      "objective_text": "count to and across 100, forwards and backwards, beginning with 0 or 1, or from any given number",
      "non_statutory_guidance": "Pupils practise counting (1, 2, 3…), ordering (for example, first, second, third…), and to indicate a quantity (for example, 3 apples, 2 centimetres), including solving simple concrete problems, until they are fluent.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y1-O002",
      "domain_id": "MA-Y1-D001",
      "objective_text": "count, read and write numbers to 100 in numerals; count in multiples of twos, fives and tens",
      "non_statutory_guidance": "They practise counting as reciting numbers and counting as enumerating objects, and counting in twos, fives and tens from different multiples to develop their recognition of patterns in the number system (for example, odd and even numbers), including varied and frequent practice through increasingly complex questions.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y1-O003",
      "domain_id": "MA-Y1-D001",
      "objective_text": "given a number, identify one more and one less",
      "non_statutory_guidance": "Pupils begin to recognise place value in numbers beyond 20 by reading, writing, counting and comparing numbers up to 100, supported by objects and pictorial representations.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y1-O004",
      "domain_id": "MA-Y1-D001",
      "objective_text": "identify and represent numbers using objects and pictorial representations including the number line, and use the language of: equal to, more than, less than (fewer), most, least",
      "non_statutory_guidance": "Pupils begin to recognise place value in numbers beyond 20 by reading, writing, counting and comparing numbers up to 100, supported by objects and pictorial representations.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y1-O005",
      "domain_id": "MA-Y1-D001",
      "objective_text": "read and write numbers from 1 to 20 in numerals and words.",
      "non_statutory_guidance": "They recognise and create repeating patterns with objects and with shapes.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y1-O006",
      "domain_id": "MA-Y1-D002",
      "objective_text": "read, write and interpret mathematical statements involving addition (+), subtraction (–) and equals (=) signs",
      "non_statutory_guidance": "Pupils memorise and reason with number bonds to 10 and 20 in several forms (for example, 9 + 7 = 16; 16 – 7 = 9; 7 = 16 – 9). They should realise the effect of adding or subtracting zero. This establishes addition and subtraction as related operations.",
      "examples": "9 + 7 = 16; 16 – 7 = 9; 7 = 16 – 9",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y1-O007",
      "domain_id": "MA-Y1-D002",
      "objective_text": "represent and use number bonds and related subtraction facts within 20",
      "non_statutory_guidance": "Pupils memorise and reason with number bonds to 10 and 20 in several forms (for example, 9 + 7 = 16; 16 – 7 = 9; 7 = 16 – 9). They should realise the effect of adding or subtracting zero. This establishes addition and subtraction as related operations.",
      "examples": "9 + 7 = 16; 16 – 7 = 9; 7 = 16 – 9",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y1-O008",
      "domain_id": "MA-Y1-D002",
      "objective_text": "add and subtract one-digit and two-digit numbers to 20, including zero",
      "non_statutory_guidance": "Pupils combine and increase numbers, counting forwards and backwards.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y1-O009",
      "domain_id": "MA-Y1-D002",
      "objective_text": "solve one-step problems that involve addition and subtraction, using concrete objects and pictorial representations, and missing number problems such as 7 = ? – 9.",
      "non_statutory_guidance": "They discuss and solve problems in familiar practical contexts, including using quantities. Problems should include the terms: put together, add, altogether, total, take away, distance between, difference between, more than and less than, so that pupils develop the concept of addition and subtraction and are enabled to use these operations flexibly.",
      "examples": "7 = ? – 9",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y1-O010",
      "domain_id": "MA-Y1-D003",
      "objective_text": "solve one-step problems involving multiplication and division, by calculating the answer using concrete objects, pictorial representations and arrays with the support of the teacher.",
      "non_statutory_guidance": "Through grouping and sharing small quantities, pupils begin to understand: multiplication and division; doubling numbers and quantities; and finding simple fractions of objects, numbers and quantities. They make connections between arrays, number patterns, and counting in twos, fives and tens.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y1-O011",
      "domain_id": "MA-Y1-D004",
      "objective_text": "recognise, find and name a half as one of two equal parts of an object, shape or quantity",
      "non_statutory_guidance": "Pupils are taught half and quarter as 'fractions of' discrete and continuous quantities by solving problems using shapes, objects and quantities. For example, they could recognise and find half a length, quantity, set of objects or shape. Pupils connect halves and quarters to the equal sharing and grouping of sets of objects and to measures, as well as recognising and combining halves and quarters as parts of a whole.",
      "examples": "recognise and find half a length, quantity, set of objects or shape",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y1-O012",
      "domain_id": "MA-Y1-D004",
      "objective_text": "recognise, find and name a quarter as one of four equal parts of an object, shape or quantity.",
      "non_statutory_guidance": "Pupils are taught half and quarter as 'fractions of' discrete and continuous quantities by solving problems using shapes, objects and quantities. For example, they could recognise and find half a length, quantity, set of objects or shape. Pupils connect halves and quarters to the equal sharing and grouping of sets of objects and to measures, as well as recognising and combining halves and quarters as parts of a whole.",
      "examples": "recognise and find quarter of a length, quantity, set of objects or shape",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y1-O013",
      "domain_id": "MA-Y1-D005",
      "objective_text": "compare, describe and solve practical problems for: lengths and heights [for example, long/short, longer/shorter, tall/short, double/half]; mass/weight [for example, heavy/light, heavier than, lighter than]; capacity and volume [for example, full/empty, more than, less than, half, half full, quarter]; time [for example, quicker, slower, earlier, later]",
      "non_statutory_guidance": "The pairs of terms: mass and weight, volume and capacity, are used interchangeably at this stage. Pupils move from using and comparing different types of quantities and measures using non-standard units, including discrete (for example, counting) and continuous (for example, liquid) measurement, to using manageable common standard units.",
      "examples": "long/short, longer/shorter, tall/short, double/half; heavy/light, heavier than, lighter than; full/empty, more than, less than, half, half full, quarter; quicker, slower, earlier, later",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y1-O014",
      "domain_id": "MA-Y1-D005",
      "objective_text": "measure and begin to record the following: lengths and heights; mass/weight; capacity and volume; time (hours, minutes, seconds)",
      "non_statutory_guidance": "In order to become familiar with standard measures, pupils begin to use measuring tools such as a ruler, weighing scales and containers.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y1-O015",
      "domain_id": "MA-Y1-D005",
      "objective_text": "recognise and know the value of different denominations of coins and notes",
      "non_statutory_guidance": "",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y1-O016",
      "domain_id": "MA-Y1-D005",
      "objective_text": "sequence events in chronological order using language [for example, before and after, next, first, today, yesterday, tomorrow, morning, afternoon and evening]",
      "non_statutory_guidance": "Pupils use the language of time, including telling the time throughout the day, first using o'clock and then half past.",
      "examples": "before and after, next, first, today, yesterday, tomorrow, morning, afternoon and evening",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y1-O017",
      "domain_id": "MA-Y1-D005",
      "objective_text": "recognise and use language relating to dates, including days of the week, weeks, months and years",
      "non_statutory_guidance": "",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y1-O018",
      "domain_id": "MA-Y1-D005",
      "objective_text": "tell the time to the hour and half past the hour and draw the hands on a clock face to show these times.",
      "non_statutory_guidance": "Pupils use the language of time, including telling the time throughout the day, first using o'clock and then half past.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y1-O019",
      "domain_id": "MA-Y1-D006",
      "objective_text": "recognise and name common 2-D and 3-D shapes, including: 2-D shapes [for example, rectangles (including squares), circles and triangles]; 3-D shapes [for example, cuboids (including cubes), pyramids and spheres].",
      "non_statutory_guidance": "Pupils handle common 2-D and 3-D shapes, naming these and related everyday objects fluently. They recognise these shapes in different orientations and sizes, and know that rectangles, triangles, cuboids and pyramids are not always similar to each other.",
      "examples": "2-D shapes: rectangles (including squares), circles and triangles; 3-D shapes: cuboids (including cubes), pyramids and spheres",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y1-O020",
      "domain_id": "MA-Y1-D007",
      "objective_text": "describe position, direction and movement, including whole, half, quarter and three-quarter turns.",
      "non_statutory_guidance": "Pupils use the language of position, direction and motion, including: left and right, top, middle and bottom, on top of, in front of, above, between, around, near, close and far, up and down, forwards and backwards, inside and outside. Pupils make whole, half, quarter and three-quarter turns in both directions and connect turning clockwise with movement on a clock face.",
      "examples": "",
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "MA-Y1-C001",
      "domain_id": "MA-Y1-D001",
      "concept_name": "Counting forwards and backwards to 100",
      "description": "Counting forwards and backwards is the foundational number skill upon which all arithmetic is built. Pupils must be able to count fluently — reciting the number sequence (1, 2, 3...) and applying it to enumerate real objects — beginning from 0, 1 or any given number, and across the boundary of 100. Mastery means a pupil can continue a count from any starting point without hesitation, count backwards without losing the thread, and apply their counting to practical situations such as counting out objects or measuring quantities.",
      "teaching_guidance": "Begin with concrete resources — counters, cubes, beads on a string — so that pupils associate each count with a physical object (one-to-one correspondence). Use number tracks and hundred squares as pictorial supports. Practise counting backwards from various starting points as this is harder and less intuitive than counting forwards. Regular oral counting practice (as a class, in pairs, individually) and songs/rhymes reinforce the sequence. Gradually move from counting concrete objects to counting without objects (abstract), but ensure the concrete-pictorial-abstract (CPA) progression is followed at the pupil's own pace.",
      "key_vocabulary": "count, number, sequence, forwards, backwards, next, before, after, one more, one less, zero, one hundred",
      "common_misconceptions": "Pupils often struggle with transitions across decade boundaries (e.g. 29 to 30, 39 to 40) because the tens digit changes. They may also stumble at 100 itself, not knowing what comes after 99. When counting backwards, pupils frequently make errors at decade boundaries (e.g. saying 29, 28, 17 instead of 27). Some pupils confuse 'counting on' with 'counting all', always restarting from 1 rather than continuing from a given number.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": [
        "MA-Y1-C012"
      ]
    },
    {
      "concept_id": "MA-Y1-C002",
      "domain_id": "MA-Y1-D001",
      "concept_name": "Counting in multiples of 2, 5 and 10",
      "description": "Counting in multiples introduces pupils to the structure of the number system and the foundations of multiplication. Counting in twos develops recognition of odd and even numbers; counting in fives connects to the clock face and money; counting in tens establishes place value intuition. Mastery means pupils can recite these skip-counting sequences from different starting multiples (not just from zero) and recognise the rhythmic patterns involved.",
      "teaching_guidance": "Use concrete resources such as pairs of socks, hands (groups of 5 fingers), or ten frames to make the grouping physical before abstracting to verbal counting. Number tracks with every 2nd, 5th or 10th square shaded help pupils see the pattern pictorially. Counting sticks and counting on a hundred square with coloured multiples highlighted are effective. Move from always starting at zero to starting at other multiples. Connect counting in tens to place value (each count of ten adds a new ten to the tens column).",
      "key_vocabulary": "count in twos, count in fives, count in tens, multiple, even, odd, pattern, sequence",
      "common_misconceptions": "Pupils often count in twos starting at 1 (1, 3, 5...) rather than 0 or 2, confusing counting in twos with counting odd numbers. They may struggle to continue a count in fives that does not begin at zero (e.g. starting from 15). When counting in tens from non-zero starting points (e.g. from 7: 7, 17, 27...) pupils frequently revert to the standard 10, 20, 30 sequence.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_weight": 2,
      "co_teach_hints": [
        "MA-Y1-C012"
      ]
    },
    {
      "concept_id": "MA-Y1-C003",
      "domain_id": "MA-Y1-D001",
      "concept_name": "Reading and writing numbers to 100 in numerals",
      "description": "Pupils must be able to read (decode) and write (encode) the numerals 0–100. This involves recognising each digit symbol and understanding that two-digit numbers use a tens digit and a units digit (early place value). Mastery means a pupil can both read a numeral shown to them and independently write any number to 100 when told its name, with correct digit formation.",
      "teaching_guidance": "Use numeral cards, digit tiles and number lines as concrete/pictorial supports. Practise matching number names (spoken) to numerals, and written names (e.g. 'twelve') to numerals. Draw attention to the 'teen' numbers (thirteen to nineteen) which are often confused because the spoken word places the units digit first (e.g. 'four-teen' sounds like 4 should come first, but the numeral is 14 — tens first). Provide regular handwriting practice for digit formation. Connect reading and writing to ordering on a number line.",
      "key_vocabulary": "numeral, digit, tens, ones, units, write, read, number name",
      "common_misconceptions": "Teen numbers cause persistent reversal errors: pupils write 41 when they mean 14, or 31 for 13, because they encode the spoken order (ones first in speech: 'four-teen') into the written numeral. Pupils may also write 100 as '1 hundred' or conflate the numeral 0 with the letter O.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 1,
      "co_teach_hints": []
    },
    {
      "concept_id": "MA-Y1-C004",
      "domain_id": "MA-Y1-D001",
      "concept_name": "Reading and writing numbers from 1 to 20 in words",
      "description": "Pupils must be able to read and write the number words for 1 to 20 (one, two, three... twenty). This requires both decoding the written word and encoding it from spoken or numeral form. Mastery is demonstrated when pupils can match numerals to their word form and write the word independently and correctly, consistent with their developing literacy at KS1.",
      "teaching_guidance": "Treat number words as high-frequency sight words in early reading/writing, displaying them prominently in the classroom (a number word wall). Use matching activities pairing numeral cards to word cards. Highlight the irregular spellings: 'eight', 'twelve', 'fourteen', 'fifteen', 'sixteen', 'eighteen' all have non-phonetic elements. Connect to the pupil's word-reading programme and spelling knowledge, as the curriculum specifies these should be consistent with growing literacy skills.",
      "key_vocabulary": "one, two, three, four, five, six, seven, eight, nine, ten, eleven, twelve, thirteen, fourteen, fifteen, sixteen, seventeen, eighteen, nineteen, twenty",
      "common_misconceptions": "Pupils commonly misspell teen numbers and decade numbers, often writing 'forteen', 'eigteen', 'twelv'. They may confuse twelve and twenty (both start with 'tw'). Some pupils who can read the words cannot produce the written form independently and need regular rehearsal.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 1,
      "co_teach_hints": [
        "MA-Y1-C003"
      ]
    },
    {
      "concept_id": "MA-Y1-C005",
      "domain_id": "MA-Y1-D001",
      "concept_name": "One more and one less",
      "description": "Identifying one more and one less than a given number is a foundational arithmetic concept that underpins addition and subtraction by 1. Pupils must be able to instantly state the number that is one greater or one smaller than any given number up to 100 without recounting from the beginning. Mastery means pupils respond rapidly and accurately, treating one more/less as a known relationship rather than a counting process.",
      "teaching_guidance": "Use a number line or hundred square to show the physical step of moving one place right (one more) or one place left (one less). Bead strings and number tracks are valuable concrete resources. Practise at pace using flash cards, partner games and digit displays. Particularly target decade boundaries (one more than 9 is 10, one more than 19 is 20) as these require the tens digit to change. Connect explicitly to addition and subtraction of 1 so pupils see this as a special case of addition/subtraction.",
      "key_vocabulary": "one more, one less, before, after, next, previous, greater, smaller, increase, decrease",
      "common_misconceptions": "Pupils frequently make errors at decade boundaries, saying one more than 19 is 110 or 10 (confusing place value). They may not recognise 'one more' and 'add 1' as equivalent, so they apply one strategy but not the other. Some pupils still recount from 1 to find one more, revealing a lack of number sense that needs targeted practice.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 1,
      "co_teach_hints": [
        "MA-Y1-C001",
        "MA-Y1-C002",
        "MA-Y1-C003",
        "MA-Y1-C006",
        "MA-Y1-C007"
      ]
    },
    {
      "concept_id": "MA-Y1-C006",
      "domain_id": "MA-Y1-D001",
      "concept_name": "Representing numbers on a number line",
      "description": "The number line is a fundamental mathematical representation that shows numbers as positions in an ordered, continuous sequence. Pupils learn to place numbers on a number line and use it to compare the relative size of numbers. Mastery means pupils can locate any number to 100 on a number line, estimate where a number should appear on an unnumbered or partially numbered line, and use the number line to support addition, subtraction and comparison.",
      "teaching_guidance": "Begin with physical number lines on the floor where pupils can walk along the line. Progress to large classroom number lines, then to individual printed number lines, and eventually to blank or partially labelled number lines that require estimation and reasoning. Connect the number line to the hundred square so pupils see multiple representations of the same number order. Use the number line actively as a tool for addition (count on), subtraction (count back) and comparison (which number is further right?).",
      "key_vocabulary": "number line, position, between, estimate, place, order, greater than, less than, equal to",
      "common_misconceptions": "Pupils often place numbers by counting intervals rather than by understanding magnitude, which causes errors on longer number lines. They may not understand that the spacing of intervals on a number line should be equal. Some pupils place numbers at the marks on the line rather than understanding the line represents a continuum.",
      "concept_type": "representation",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_weight": 2,
      "co_teach_hints": [
        "MA-Y1-C007"
      ]
    },
    {
      "concept_id": "MA-Y1-C007",
      "domain_id": "MA-Y1-D001",
      "concept_name": "Language of comparison: equal to, more than, less than, most, least",
      "description": "The comparative language of mathematics — equal to, more than, less than (fewer), most, least — allows pupils to express relationships between quantities precisely. Pupils need to both understand these terms when they hear or read them and use them accurately in their own mathematical talk and writing. Mastery is demonstrated when pupils use this vocabulary unprompted to describe and justify number comparisons.",
      "teaching_guidance": "Embed comparative language in all counting and number activities from the start of Year 1. Use concrete comparisons (towers of cubes, groups of objects) before moving to numerical comparisons. Display vocabulary prominently and require pupils to use full sentences: 'There are more red cubes than blue cubes.' Connect 'more than' and 'less than' to the greater than (>) and less than (<) symbols, which pupils will formally encounter in Year 2, but can be informally introduced via the 'hungry crocodile' or similar memorable image.",
      "key_vocabulary": "equal to, more than, less than, fewer, most, least, greater, smaller, same as",
      "common_misconceptions": "Pupils often confuse 'less' and 'fewer': 'fewer' is the correct term for discrete countable quantities (fewer apples) and 'less' for continuous quantities (less water). The curriculum explicitly mentions 'less than (fewer)' to acknowledge this. Pupils may also use 'biggest' and 'smallest' rather than 'greatest' and 'least' in numerical contexts, and may not recognise that 'equal to' applies when two different-looking representations have the same value.",
      "concept_type": "language",
      "complexity_level": 1,
      "is_cross_cutting": true,
      "teaching_weight": 1,
      "co_teach_hints": [
        "MA-Y1-C006"
      ]
    },
    {
      "concept_id": "MA-Y1-C008",
      "domain_id": "MA-Y1-D002",
      "concept_name": "Number bonds within 20",
      "description": "Number bonds are pairs of numbers that add together to make a given total. Knowing number bonds to 10 and to 20 fluently — both the addition facts and the related subtraction facts — is one of the most important early arithmetic skills. Mastery means pupils can instantly recall any number bond to 20 (e.g. 7 + 13 = 20, 20 – 13 = 7, 13 = 20 – 7) without counting, and can use these known facts flexibly to derive related calculations.",
      "teaching_guidance": "Use ten frames and double ten frames as primary concrete tools because their structure (5+5 per frame) makes complements visible. Part-whole models (bar model) help pupils see the relationship between the parts and the whole. Practise bonds to 10 first until secure, then extend to 20. Use 'bond collector' games, missing number activities and rapid-fire oral practice. Ensure pupils see all three forms of each bond: a + b = c, c – b = a, b = c – a. The curriculum explicitly states pupils should reason with bonds in 'several forms'.",
      "key_vocabulary": "number bond, total, sum, part, whole, make, add, plus, subtract, minus, equals, missing number",
      "common_misconceptions": "Pupils memorise addition bonds but do not automatically recognise the related subtraction fact (e.g. knowing 7 + 6 = 13 but not knowing 13 – 6 = 7). They may know bonds to 10 but not extend them: knowing 3 + 7 = 10 but not recognising 13 + 7 = 20. Pupils often rely on counting on rather than instant recall, which is appropriate initially but must give way to automatic recall by end of KS1.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": [
        "MA-Y1-C009",
        "MA-Y1-C010",
        "MA-Y1-C011"
      ]
    },
    {
      "concept_id": "MA-Y1-C009",
      "domain_id": "MA-Y1-D002",
      "concept_name": "Addition as combining and augmenting",
      "description": "Addition describes two distinct situations: combining two separate groups into one (aggregation: 3 apples + 4 apples = 7 apples) and increasing a quantity by adding more (augmentation: I had 3 apples and got 4 more). Pupils need to recognise and work with both structures. Mastery means pupils can represent addition in multiple ways (concrete objects, number line, number sentence) and select appropriate strategies for different problems.",
      "teaching_guidance": "Use rich problem-solving contexts to expose both structures. For combining: use two groups of objects and physically push them together. For augmenting: begin with a set and add objects one at a time, counting on. Connect the '+' symbol to the action of combining or adding. Teach pupils to 'count on from the larger number' (e.g. for 3 + 7, start from 7 and count on 3) rather than always starting from the first addend. Connect to number bonds for quick recall without counting.",
      "key_vocabulary": "add, plus, addition, combine, total, altogether, more than, put together, count on, sum",
      "common_misconceptions": "Pupils often treat addition as only 'putting two groups together', not recognising the augmentation (adding to) structure. They may count all objects from the beginning rather than counting on, which is inefficient and error-prone. Pupils frequently forget that addition is commutative (3 + 7 = 7 + 3), restarting a count rather than choosing the more efficient order.",
      "concept_type": "concept",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": [
        "MA-Y1-C008",
        "MA-Y1-C010",
        "MA-Y1-C011"
      ]
    },
    {
      "concept_id": "MA-Y1-C010",
      "domain_id": "MA-Y1-D002",
      "concept_name": "Subtraction as taking away and finding the difference",
      "description": "Subtraction also describes two distinct situations: taking away (removing objects from a group: 7 – 3 = 4, removing 3 from a group of 7) and finding the difference (how many more is 7 than 3?). Both structures result in the same calculation but require different reasoning and contexts. Mastery means pupils can interpret subtraction problems correctly and choose appropriate strategies.",
      "teaching_guidance": "Use concrete objects for 'take away' problems — physically removing objects from a group. For 'difference', place two rows of objects side by side and count the gap. Use the number line: count back for take away, count the distance between two numbers for difference. The curriculum requires problems to use the language 'take away', 'distance between' and 'difference between', so expose pupils to all these terms explicitly. Connect to missing number problems (7 = ? – 9) to develop flexible thinking.",
      "key_vocabulary": "subtract, take away, minus, less, fewer, difference, distance between, how many more, count back",
      "common_misconceptions": "Pupils often interpret all subtraction as 'taking away' and cannot solve 'difference' problems by subtraction (they count instead). They may always compute the larger minus the smaller, even when the context requires the smaller from the larger (e.g. computing 9 – 7 = 2 correctly but not knowing how to interpret 7 – 9 in context). Subtracting zero also causes confusion — some pupils think 'taking away nothing means you get zero'.",
      "concept_type": "concept",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": [
        "MA-Y1-C008",
        "MA-Y1-C009",
        "MA-Y1-C011"
      ]
    },
    {
      "concept_id": "MA-Y1-C011",
      "domain_id": "MA-Y1-D002",
      "concept_name": "Missing number problems",
      "description": "Missing number problems, such as 7 = ? – 9, require pupils to reason about the relationship between numbers in an equation rather than simply computing an answer. These problems lay the foundations of algebraic thinking, requiring pupils to understand the equals sign as expressing equivalence (not just 'the answer comes after') and to use inverse operations to find unknowns. Mastery means pupils can work flexibly with the equals sign in all positions and use known facts to deduce missing values.",
      "teaching_guidance": "Use bar models (part-whole diagrams) to make the structure of the problem visible before presenting it as an equation. Start with missing addends (? + 3 = 7) as these are more intuitive, then progress to missing subtrahends and to problems where the missing number is at the start or in the middle of the equation. Connect explicitly to known number bonds — if pupils know 7 + 9 = 16, they can solve 7 = 16 – 9. Avoid always writing equations as a + b = c; mix the position of the equals sign.",
      "key_vocabulary": "missing number, equals, equivalent, unknown, balance, equation, inverse",
      "common_misconceptions": "Pupils often interpret the equals sign as meaning 'write the answer here' (operational understanding) rather than as expressing a balanced relationship (relational understanding). This means they are confused by equations where the equals sign is in the middle or at the left (e.g. 7 = 3 + 4). They may write expressions like 3 + 4 = 7 + 2 = 9 (running the equals sign on) which represents a fundamental misconception about equality.",
      "concept_type": "concept",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "teaching_weight": 3,
      "co_teach_hints": [
        "MA-Y1-C008",
        "MA-Y1-C009",
        "MA-Y1-C010"
      ]
    },
    {
      "concept_id": "MA-Y1-C012",
      "domain_id": "MA-Y1-D003",
      "concept_name": "Grouping and sharing (early multiplication and division)",
      "description": "Grouping (how many groups of 3 in 12?) and sharing (share 12 equally among 4) are the two fundamental structures of division, and repeated grouping underpins multiplication. In Year 1, pupils explore these concepts informally using concrete objects and with teacher support. Mastery at this stage means pupils can physically group objects into equal groups and explain what they have done, connecting their actions to the vocabulary of multiplication and division.",
      "teaching_guidance": "Use concrete manipulatives exclusively at this stage — cubes, counters, toys — to model grouping and sharing. Present 'grouping' problems (put these 12 cubes into groups of 3, how many groups?) and 'sharing' problems (share these 12 cubes equally between 4 people) as practical activities before any numerical recording. Connect to arrays — a 3 by 4 arrangement shows both 3 groups of 4 and 4 groups of 3. Link to counting in twos, fives and tens as skip counting being 'repeated addition'. Connect doubling to multiplying by 2 and halving to dividing by 2.",
      "key_vocabulary": "group, share, equal groups, sharing, doubling, halving, array, rows, columns, each, altogether",
      "common_misconceptions": "Pupils often confuse grouping and sharing: in grouping you know the size of each group (and count the groups); in sharing you know the number of groups (and count the size of each). Pupils may share unequally (giving more to some recipients) and not recognise this as incorrect. They may not connect their concrete grouping activity to the word 'multiplication' or see it as connected to counting in multiples.",
      "concept_type": "concept",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": [
        "MA-Y1-C001",
        "MA-Y1-C002",
        "MA-Y1-C013"
      ]
    },
    {
      "concept_id": "MA-Y1-C013",
      "domain_id": "MA-Y1-D003",
      "concept_name": "Doubling and halving",
      "description": "Doubling (adding a quantity to itself) and halving (splitting a quantity into two equal parts) are the first multiplicative concepts pupils encounter and are deeply connected to the 2 times table, fractions (one half) and the relationship between multiplication and division. Mastery means pupils can quickly double and halve any number up to at least 10, recognise halving as the inverse of doubling, and connect these operations to their emerging knowledge of fractions and grouping.",
      "teaching_guidance": "Use mirrors to show doubling visually: place a row of cubes in front of a mirror and the image doubles the collection. Use two matching groups placed side by side. Connect doubling to addition: double 4 is 4 + 4 = 8. Connect halving to sharing equally between 2. Practise with small numbers (double 1 through 10) using concrete resources first, then pictorial representations, then as mental arithmetic. Explicitly connect 'half of' to the fraction one half introduced in the fractions domain.",
      "key_vocabulary": "double, twice, halve, half, equal, split, share between two, twice as many",
      "common_misconceptions": "Pupils may double by counting all rather than using addition (double 6: count 6 objects then count 6 more, then count all 12 from the beginning). They may confuse halving with 'cutting in half' in an informal sense that doesn't require equality. Some pupils do not recognise that halving is the inverse of doubling — knowing double 6 is 12 but not using this to halve 12.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_weight": 2,
      "co_teach_hints": [
        "MA-Y1-C012"
      ]
    },
    {
      "concept_id": "MA-Y1-C014",
      "domain_id": "MA-Y1-D004",
      "concept_name": "Recognising one half",
      "description": "One half is the first fraction pupils encounter formally and is defined as one of two equal parts. The critical understanding is that the two parts must be equal — not merely two parts. Pupils must be able to find one half of a shape, object, quantity or set of objects, recognising that halving means dividing into two equal parts. Mastery at Year 1 level means pupils can identify whether a shape or quantity has been halved correctly (both parts equal) and can find half of small even numbers.",
      "teaching_guidance": "Begin with concrete folding: fold paper shapes in half and show that the two parts match exactly when overlaid. Extend to physical sharing: share 8 counters equally between 2 people and establish that each gets 4 — one half of 8 is 4. Use fraction language from the start: 'one whole divided into two equal parts; each part is one half.' Include examples of incorrect halving (two unequal parts) and ask pupils to judge whether it shows 'a half'. Connect to the fraction notation 1/2 when pupils are ready, but the statutory requirement is recognition and naming without formal notation.",
      "key_vocabulary": "half, one half, equal parts, whole, fair share, divide equally",
      "common_misconceptions": "Pupils frequently think any partition into two parts constitutes a half, regardless of whether the parts are equal. They may accept an asymmetric fold as 'a half' if it looks roughly similar. Some pupils confuse 'half' as an adjective describing a size ('half-size') with 'one half' as a fraction of a specific whole.",
      "concept_type": "concept",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": [
        "MA-Y1-C015"
      ]
    },
    {
      "concept_id": "MA-Y1-C015",
      "domain_id": "MA-Y1-D004",
      "concept_name": "Recognising one quarter",
      "description": "One quarter is the second fraction pupils encounter and is defined as one of four equal parts. Pupils must recognise that a whole can be divided into four equal parts and that each part is called a quarter. Mastery at Year 1 level means pupils can identify and find one quarter of shapes, objects and quantities (particularly sets of objects with a number divisible by 4), and can describe what they have done in appropriate fraction language.",
      "teaching_guidance": "Connect to halving: a quarter is half of a half — establish this by folding paper in half, then in half again, and counting the four equal parts. Use physical sharing between 4: share 12 objects equally among 4 and find that each gets 3 — one quarter of 12 is 3. Extend the range of representations: quarter of a shape (fold), quarter of a length (mark the quarter point on a strip of paper), quarter of a set (12 counters shared among 4). Connect explicitly to the language of turns: a quarter turn is a rotation of one right angle.",
      "key_vocabulary": "quarter, one quarter, four equal parts, whole, fair share, divide equally",
      "common_misconceptions": "Similar to halving, pupils may accept any division into four parts as 'quarters' without checking equality. They may confuse the spoken word 'quarter' with 'four' (misremembering 'quarter past' on a clock as 'four past'). Pupils who understand half but not quarter may guess that a quarter is bigger than a half because the number 4 is bigger than 2.",
      "concept_type": "concept",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": [
        "MA-Y1-C014",
        "MA-Y1-C024"
      ]
    },
    {
      "concept_id": "MA-Y1-C016",
      "domain_id": "MA-Y1-D005",
      "concept_name": "Comparing and measuring length and height",
      "description": "Measurement of length and height begins with direct comparison (this stick is longer than that stick) and progresses to using non-standard and then standard units. Pupils learn the specific vocabulary for comparing length and height and begin to use a ruler to measure. Mastery at Year 1 means pupils can use comparative language correctly, select an appropriate unit and tool, and record measurements.",
      "teaching_guidance": "Start with direct comparison — place objects side by side from the same baseline to compare length, stand pupils back-to-back to compare height. Establish the importance of consistent baseline and alignment. Move to measuring with non-standard units (e.g. handspans, cubes, paperclips) before introducing rulers. When introducing rulers, connect to number lines and counting. The non-statutory guidance confirms pupils move from non-standard to standard units. Key language includes: long/short, longer/shorter, longest/shortest, tall/short, taller/shorter, tallest/shortest, double/half (connecting to fractions).",
      "key_vocabulary": "length, height, long, short, tall, longer, shorter, taller, longest, shortest, tallest, measure, ruler, centimetre, metre, compare, double, half",
      "common_misconceptions": "Pupils commonly compare lengths without aligning from the same baseline (especially when one object is placed further forward), giving incorrect comparisons. They may confuse height (vertical) and length (horizontal) as distinct concepts. When using non-standard units, pupils often leave gaps or overlap units, getting inaccurate measurements.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": [
        "MA-Y1-C017",
        "MA-Y1-C018",
        "MA-Y1-C019"
      ]
    },
    {
      "concept_id": "MA-Y1-C017",
      "domain_id": "MA-Y1-D005",
      "concept_name": "Comparing and measuring mass and weight",
      "description": "Mass/weight measurement begins with direct comparison using a balance scale and progresses to using non-standard and standard units. Pupils learn vocabulary for comparing mass and begin to use weighing scales. The curriculum notes that mass and weight are used interchangeably at this stage. Mastery means pupils can compare masses using a balance, describe the result using appropriate language, and begin to measure using non-standard and standard units.",
      "teaching_guidance": "Use a balance scale as the primary concrete tool — the visual metaphor of one side going down because it is heavier is powerful. Allow pupils to hold objects and feel their weight before using the balance. Introduce non-standard units (e.g. cubes, conkers) before standard units (grams, kilograms). Connect to number when recording measurements. The key vocabulary includes: heavy, light, heavier, lighter, heaviest, lightest, balance, mass, weight, grams, kilograms.",
      "key_vocabulary": "heavy, light, heavier, lighter, heaviest, lightest, balance, mass, weight, grams, kilograms, measure, scales",
      "common_misconceptions": "Pupils often confuse size with mass (a larger object must be heavier), not understanding that density affects mass. They may predict incorrectly which of two objects is heavier based on appearance. Pupils sometimes misread a balance scale, thinking the side that goes up is the heavier one (it is actually lighter).",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": [
        "MA-Y1-C016",
        "MA-Y1-C018"
      ]
    },
    {
      "concept_id": "MA-Y1-C018",
      "domain_id": "MA-Y1-D005",
      "concept_name": "Comparing and measuring capacity and volume",
      "description": "Capacity is the maximum amount a container can hold; volume is the amount of space a substance occupies. In Year 1, these terms are used interchangeably as the curriculum specifies. Pupils compare containers by filling and pouring, and use language such as full, empty, half full, more than and less than. Mastery means pupils can compare the capacity of containers using appropriate language and begin to use standard units such as millilitres and litres.",
      "teaching_guidance": "Use water or sand play as the primary concrete context — pupils pour from one container to another, compare levels and build intuitive understanding. Use containers of different shapes but similar capacity to challenge intuitive assumptions (a tall thin container may hold more or less than a short wide one). Introduce standard measuring jugs with clear markings once non-standard comparison is secure. Connect to fraction language (half full, quarter full).",
      "key_vocabulary": "capacity, volume, full, empty, half full, more than, less than, container, holds, litres, millilitres, pour, fill",
      "common_misconceptions": "Pupils almost universally believe that taller containers hold more — the conservation of liquid volume is a developmental milestone. They may pour liquid from a short wide container into a tall thin one and conclude the second container holds more because the level is higher. This is a normal stage of development; practical experience with many containers gradually builds correct understanding.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": [
        "MA-Y1-C016",
        "MA-Y1-C017",
        "MA-Y1-C019"
      ]
    },
    {
      "concept_id": "MA-Y1-C019",
      "domain_id": "MA-Y1-D005",
      "concept_name": "Time: sequencing events and reading clocks to the hour and half past",
      "description": "Time in Year 1 covers two related areas: the language of time and sequence (ordering events using vocabulary like before, after, yesterday, tomorrow) and reading an analogue clock to the hour and half past the hour. Mastery means pupils can reliably sequence events using everyday time vocabulary, read analogue clock times to the hour and half past, and correctly draw clock hands to show given times.",
      "teaching_guidance": "Use the daily classroom timetable as a concrete, meaningful context for sequencing events in time. Use real analogue clocks, large class clocks and individual clock-face manipulatives (geared so the minute and hour hand move together). Establish the hour hand first — 'the short hand points to the hour.' Then introduce the half past position of the minute hand (pointing straight down). Connect the minute hand moving a half turn to the language of 'half past'. Connect quarter and three-quarter turns (from geometry) to quarter-past and quarter-to (not statutory until Year 2, but the turning language is introduced in Year 1).",
      "key_vocabulary": "time, clock, hour, minute, second, o'clock, half past, before, after, next, first, today, yesterday, tomorrow, morning, afternoon, evening, days of the week, months",
      "common_misconceptions": "Pupils often confuse the hour and minute hands, particularly when both are similar in size. They may read 6 o'clock as 12:30 (reading the minute hand position as the hour). Half past causes confusion because the hour hand is between two numbers — pupils read the number it has passed (e.g. half past 3, but the hour hand is between 3 and 4 so they say 4 o'clock). When drawing clock hands, pupils often draw both hands the same length.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "MA-Y1-C020",
      "domain_id": "MA-Y1-D005",
      "concept_name": "Recognising coins and notes",
      "description": "Pupils must recognise all UK coins (1p, 2p, 5p, 10p, 20p, 50p, £1, £2) and notes (£5, £10, £20, £50) and know their values. This is a practical life skill embedded in the mathematical domain of measurement. Mastery means pupils can name any coin or note, state its value and use this knowledge in simple practical contexts such as 'finding' a given value using known coins.",
      "teaching_guidance": "Use real coins whenever possible — the feel, weight and visual appearance of real money is important. Practise sorting coins by denomination and ordering them by value. Connect coin recognition to number: the value printed on each coin or note is the amount it is worth. Play shopkeeper games where pupils pay using coins. Highlight that the same value can be made in different ways (two 5p coins equal one 10p coin), laying foundations for Year 2 money work.",
      "key_vocabulary": "coin, note, penny, pence, pound, value, denomination, worth, 1p, 2p, 5p, 10p, 20p, 50p, £1, £2, £5, £10",
      "common_misconceptions": "Pupils often think larger coins are worth more (confusing physical size with value — a 5p coin is larger than a 2p but worth more; a 1p coin is similar in size to other coins but worth least). They may not recognise that the same amount can be made in different ways. Some pupils confuse the pound symbol (£) with other letters.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "MA-Y1-C021",
      "domain_id": "MA-Y1-D006",
      "concept_name": "Recognising and naming 2-D shapes",
      "description": "Pupils recognise and name rectangles (including squares), circles and triangles as the primary 2-D shapes in Year 1, and develop awareness of their properties in an exploratory way. A critical understanding is that shapes are defined by their properties, not by a single prototype image — a triangle is any closed 3-sided figure regardless of orientation or proportions. Mastery means pupils can reliably name these shapes in any orientation and size and connect them to everyday objects.",
      "teaching_guidance": "Provide a wide variety of shape examples, especially non-prototypical ones: triangles pointing sideways or downwards, tall and narrow rectangles, nearly-square rectangles. Also provide non-examples: shapes with curved sides alongside triangles, to sharpen categorisation. Handle physical shape tiles and solid shapes. Sort shapes by name using Venn diagrams or sorting hoops. The non-statutory guidance explicitly states pupils should recognise shapes in different orientations and sizes and know that rectangles, triangles, cuboids and pyramids are not always similar to each other.",
      "key_vocabulary": "shape, 2-D, flat, side, corner, rectangle, square, circle, triangle, round, straight, curved",
      "common_misconceptions": "Pupils develop prototypical shape images: a triangle is only recognised when it points upward with a horizontal base; a rectangle is only recognised in a landscape orientation. They may not recognise a square as a special rectangle. Circles with scalloped edges or ovals are sometimes accepted as circles. Pupils often use the word 'diamond' for a rotated square, not recognising it as a square.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 1,
      "co_teach_hints": [
        "MA-Y1-C022"
      ]
    },
    {
      "concept_id": "MA-Y1-C022",
      "domain_id": "MA-Y1-D006",
      "concept_name": "Recognising and naming 3-D shapes",
      "description": "Pupils recognise and name cuboids (including cubes), pyramids and spheres as primary 3-D shapes in Year 1, and develop awareness that 3-D shapes have faces, edges and vertices (though these terms are not formally required until Year 2). Mastery means pupils can name these shapes in any orientation, connect them to everyday 3-D objects (a box is a cuboid, a ball is a sphere) and describe them using informal language.",
      "teaching_guidance": "Handle actual 3-D solid shapes — allow pupils to feel the faces, edges and corners. Connect to everyday objects: dice (cube), cereal box (cuboid), Egyptian pyramid (pyramid), football (sphere). Sort 3-D shapes by whether they roll, stack or slide to develop intuitive understanding of their properties. The non-statutory guidance emphasises handling shapes and naming related everyday objects fluently. Note that 'pyramids' includes both square-based and triangular-based (tetrahedron) pyramids — expose both.",
      "key_vocabulary": "3-D, solid, shape, cuboid, cube, pyramid, sphere, face, edge, corner (vertex), flat, curved, roll, slide, stack",
      "common_misconceptions": "Pupils often call any pyramid a 'triangle' or confuse a pyramid with a 3-D triangle. They may not recognise that a cube is a special cuboid (all faces square). A cylinder and a sphere may both be called 'round' and confused with each other. Pupils may think 3-D shapes become different shapes when rotated.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "teaching_weight": 1,
      "co_teach_hints": [
        "MA-Y1-C021"
      ]
    },
    {
      "concept_id": "MA-Y1-C023",
      "domain_id": "MA-Y1-D007",
      "concept_name": "Position, direction and movement language",
      "description": "Spatial language — including left, right, above, below, between, inside, outside, forwards, backwards — enables pupils to communicate about the position and movement of objects precisely. In Year 1, this is embedded in practical activities and physical movement. Mastery means pupils use this vocabulary accurately and consistently in their own descriptions of position and movement, and can follow and give instructions using directional language.",
      "teaching_guidance": "Embed positional language in physical activities: navigate through an obstacle course using directional instructions, describe where objects are placed in the room, play 'guess the position' games. Use programmable toys (Beebots) to give directional instructions. The full vocabulary listed in the non-statutory guidance is: left and right, top, middle and bottom, on top of, in front of, above, between, around, near, close and far, up and down, forwards and backwards, inside and outside. Practise both giving and following instructions.",
      "key_vocabulary": "left, right, top, middle, bottom, above, below, between, on top of, in front of, behind, near, far, up, down, forwards, backwards, inside, outside",
      "common_misconceptions": "Left and right are consistently the most problematic positional concepts for young children and many adults — they are relative to the observer's orientation and reverse when facing someone. Pupils may confuse above/below and in front of/behind in different orientations. Spatial language that is relational (near, far, between) requires a reference point that pupils may not establish clearly.",
      "concept_type": "language",
      "complexity_level": 1,
      "is_cross_cutting": true,
      "teaching_weight": 1,
      "co_teach_hints": []
    },
    {
      "concept_id": "MA-Y1-C024",
      "domain_id": "MA-Y1-D007",
      "concept_name": "Whole, half, quarter and three-quarter turns",
      "description": "A turn is a rotation — a change of direction — and pupils in Year 1 explore whole, half, quarter and three-quarter turns as physical movements. A quarter turn is equivalent to a right angle; a half turn reverses direction; a three-quarter turn is the same as a quarter turn in the opposite direction. Mastery means pupils can make and describe these turns reliably, understand that turns can be clockwise or anticlockwise, and connect the fraction of a turn to the fraction language used elsewhere in mathematics.",
      "teaching_guidance": "Make turns physical first: pupils stand up and make whole, half, quarter and three-quarter turns in response to instructions. Use a compass or arrow on a card to show the turn visually. Connect explicitly to the clock face: a clockwise quarter turn is 'the way clock hands go' — this directly connects position and direction to the time domain. The non-statutory guidance confirms pupils should make whole, half, quarter and three-quarter turns in both directions and connect turning clockwise with movement on a clock face. Connect the fraction language of 'quarter turn' to one quarter from the fractions domain.",
      "key_vocabulary": "turn, rotate, whole turn, half turn, quarter turn, three-quarter turn, clockwise, anticlockwise, direction",
      "common_misconceptions": "Pupils often confuse a quarter turn and a half turn, particularly when not physically making the turn. They may not understand that the same endpoint can be reached by a quarter turn clockwise or a three-quarter turn anticlockwise. The concept of 'anticlockwise' is often much harder to establish than 'clockwise', as clockwise matches the movement of all analogue clock hands that pupils encounter daily.",
      "concept_type": "concept",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "teaching_weight": 2,
      "co_teach_hints": [
        "MA-Y1-C015",
        "MA-Y1-C023"
      ]
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "MA-Y1-C001",
      "dependent_concept": "MA-Y1-C002",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Counting forwards and backwards in ones must be secure before pupils count in multiples of 2, 5 and 10, as skip counting is an extension of the sequential counting concept"
    },
    {
      "prerequisite_concept": "MA-Y1-C001",
      "dependent_concept": "MA-Y1-C003",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Pupils need to know the counting sequence fluently before they can read and write the numerals that represent those numbers"
    },
    {
      "prerequisite_concept": "MA-Y1-C001",
      "dependent_concept": "MA-Y1-C005",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Fluent counting is a prerequisite for identifying one more and one less, as pupils initially use counting to find these values before developing instant recall"
    },
    {
      "prerequisite_concept": "MA-Y1-C003",
      "dependent_concept": "MA-Y1-C004",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.7,
      "rationale": "Reading numerals is required before pupils can write the corresponding number words, as the literacy task of writing number words is typically linked to being able to identify the number from its numeral"
    },
    {
      "prerequisite_concept": "MA-Y1-C005",
      "dependent_concept": "MA-Y1-C008",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Understanding one more and one less is a prerequisite for building number bonds, as pupils need secure number relationships before memorising specific bond pairs"
    },
    {
      "prerequisite_concept": "MA-Y1-C008",
      "dependent_concept": "MA-Y1-C009",
      "confidence": "explicit",
      "relationship_type": "enabling",
      "strength": 0.9,
      "rationale": "Number bonds within 20 provide the recalled facts that underpin addition without counting, moving pupils from procedural counting-on to recalled arithmetic facts"
    },
    {
      "prerequisite_concept": "MA-Y1-C008",
      "dependent_concept": "MA-Y1-C010",
      "confidence": "explicit",
      "relationship_type": "enabling",
      "strength": 0.9,
      "rationale": "Number bonds establish the addition-subtraction relationship (9 + 7 = 16; 16 – 7 = 9), making subtraction accessible through inverse reasoning"
    },
    {
      "prerequisite_concept": "MA-Y1-C009",
      "dependent_concept": "MA-Y1-C011",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.75,
      "rationale": "Understanding addition as a concept is required before pupils can reason about missing addends in equations, as missing number problems require working backwards through an addition or subtraction"
    },
    {
      "prerequisite_concept": "MA-Y1-C010",
      "dependent_concept": "MA-Y1-C011",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Understanding subtraction is required for missing number problems that involve subtraction, as pupils use inverse operations to find unknown values"
    },
    {
      "prerequisite_concept": "MA-Y1-C001",
      "dependent_concept": "MA-Y1-C012",
      "confidence": "explicit",
      "relationship_type": "enabling",
      "strength": 0.7,
      "rationale": "Counting fluency underpins grouping and sharing activities, as pupils count objects into groups and count the resulting groups or shares"
    },
    {
      "prerequisite_concept": "MA-Y1-C002",
      "dependent_concept": "MA-Y1-C012",
      "confidence": "inferred",
      "relationship_type": "enabling",
      "strength": 0.8,
      "rationale": "The curriculum explicitly connects arrays and multiplication to counting in twos, fives and tens, establishing skip counting as the foundation for multiplicative reasoning"
    },
    {
      "prerequisite_concept": "MA-Y1-C014",
      "dependent_concept": "MA-Y1-C015",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Understanding one half is prerequisite to understanding one quarter, as the curriculum and non-statutory guidance connect quarters to halving twice, and the concept of two equal parts precedes four equal parts"
    },
    {
      "prerequisite_concept": "MA-Y1-C013",
      "dependent_concept": "MA-Y1-C012",
      "confidence": "explicit",
      "relationship_type": "enabling",
      "strength": 0.7,
      "rationale": "The curriculum explicitly states that through grouping and sharing, pupils begin to understand doubling and finding simple fractions, connecting fractions to early multiplication and division"
    },
    {
      "prerequisite_concept": "MA-Y1-C006",
      "dependent_concept": "MA-Y1-C007",
      "confidence": "inferred",
      "relationship_type": "enabling",
      "strength": 0.65,
      "rationale": "The number line provides a concrete representation for the abstract comparative language of more than, less than and equal to, supporting pupils in transitioning from positional understanding to comparative vocabulary"
    },
    {
      "prerequisite_concept": "MA-Y1-C024",
      "dependent_concept": "MA-Y1-C015",
      "confidence": "inferred",
      "relationship_type": "enabling",
      "strength": 0.6,
      "rationale": "The concept of a quarter turn in position and direction uses the same fraction language as one quarter in fractions, and the curriculum's non-statutory guidance explicitly connects turning to clock face movement, reinforcing the cross-domain connection"
    }
  ]
}
