{
  "metadata": {
    "subject": "Music",
    "key_stage": "KS1",
    "years_covered": [
      1,
      2
    ],
    "document_reference": "DFE-00175-2013",
    "extraction_date": "2026-02-17",
    "structure_rating": 7
  },
  "domains": [
    {
      "domain_id": "MU-KS1-D001",
      "domain_name": "Performing and Singing",
      "description": "Using voices expressively and creatively through singing and speaking, and playing tuned and untuned instruments musically.",
      "curriculum_context": "This domain establishes performing as the core practical skill of music education at KS1. Pupils use their voices as their primary instrument, developing expressive and creative vocal production through singing songs, speaking chants and rhymes. They also learn to play both tuned instruments (such as glockenspiels and recorders) and untuned percussion instruments musically rather than merely making noise. The word 'musically' is significant: it implies that pupils are attending to musical qualities such as rhythm, pulse, pitch and dynamics in their playing. Performing builds physical skill, musical understanding and the social experience of making music together, establishing the habits and enjoyment that support lifelong musical engagement.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "MU-KS1-D002",
      "domain_name": "Listening and Appraising",
      "description": "Listening with concentration and understanding to a range of high-quality live and recorded music.",
      "curriculum_context": "Active listening is a distinct skill in music education, requiring pupils to engage with music with concentration and developing understanding rather than passive hearing. At KS1, pupils listen to a range of high-quality live and recorded music from different traditions, styles and historical periods, building a mental library of musical experiences. This domain develops the ability to hear musical features such as pitch, rhythm, tempo and timbre, and to respond to and discuss music using appropriate vocabulary. Listening is the foundation for all other musical activities, as pupils who listen widely and discriminately have more resources to draw on in performing and composing.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "MU-KS1-D003",
      "domain_name": "Composing and Creating",
      "description": "Experimenting with, creating, selecting and combining sounds using the inter-related dimensions of music.",
      "curriculum_context": "Composition at KS1 is introduced through exploration and experimentation rather than formal compositional techniques. Pupils experiment with sounds, learn to create their own sound sequences, and develop their ability to select and combine sounds with intention using the inter-related dimensions of music - pitch, duration, dynamics, tempo, timbre, texture and structure. This domain develops pupils' creativity, imagination and ability to make musical choices, giving them agency as music-makers rather than only as interpreters of others' music. The inter-related dimensions provide both a creative toolkit and a vocabulary for discussing and evaluating musical choices.",
      "is_cross_cutting": false,
      "structure_type": "process"
    }
  ],
  "objectives": [
    {
      "objective_id": "MU-KS1-O001",
      "domain_id": "MU-KS1-D001",
      "objective_text": "use their voices expressively and creatively by singing songs and speaking chants and rhymes",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "MU-KS1-O002",
      "domain_id": "MU-KS1-D001",
      "objective_text": "play tuned and untuned instruments musically",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "MU-KS1-O003",
      "domain_id": "MU-KS1-D002",
      "objective_text": "listen with concentration and understanding to a range of high-quality live and recorded music",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "MU-KS1-O004",
      "domain_id": "MU-KS1-D003",
      "objective_text": "experiment with, create, select and combine sounds using the inter-related dimensions of music",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "MU-KS1-C001",
      "domain_id": "MU-KS1-D001",
      "concept_name": "Pulse and Rhythm",
      "description": "Pulse is the steady beat underlying music, like a heartbeat. Rhythm is the pattern of long and short sounds that occurs over the pulse. Understanding the relationship between pulse and rhythm is foundational to all music making, as it enables performers to play in time with others and to understand how music is organised in time. At KS1, pupils develop awareness of pulse through physical movement and clapping, and begin to distinguish between pulse and rhythm.",
      "teaching_guidance": "Use physical movement - clapping, marching, stepping - to establish a strong sense of pulse. Clap back rhythmic patterns and develop call-and-response activities. Use percussion instruments to distinguish between keeping the beat and clapping the rhythm of words. Use body percussion activities to build rhythm vocabulary. Connect rhythm to words and syllables by clapping the rhythm of names and familiar phrases.",
      "key_vocabulary": "pulse, beat, rhythm, pattern, steady, tempo, fast, slow, long, short, regular",
      "common_misconceptions": "Many pupils confuse pulse (the steady beat) with rhythm (the pattern of notes). Consistent use of these distinct terms alongside practical activities that separate them helps clarify the difference. Some pupils may clap the pulse when asked to clap the rhythm of a song, or vice versa; physical practice and verbal reinforcement of the distinction is needed.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MU-KS1-C002",
      "domain_id": "MU-KS1-D001",
      "concept_name": "Pitch",
      "description": "Pitch is the quality of sound determined by the frequency of vibration - whether a sound is high or low. In music, pitch determines melody and harmony. At KS1, pupils develop their ability to hear, match and produce different pitches through singing, playing tuned instruments and using their voices expressively. Understanding pitch is fundamental to singing in tune and to understanding how melody works.",
      "teaching_guidance": "Use hand signs (such as Kodaly hand signs) to show pitch direction. Sing songs with wide pitch ranges and step-wise melodic motion. Use tuned percussion (glockenspiels, xylophones) to play and explore pitch. Play pitch-matching games where pupils echo a sung note or phrase. Explore pitch through body movement - crouch low for low notes, reach high for high notes. Develop vocabulary for describing pitch: high, low, getting higher, getting lower.",
      "key_vocabulary": "high, low, pitch, melody, tune, note, higher, lower, rise, fall, match",
      "common_misconceptions": "Pupils often confuse pitch (high/low) with volume (loud/quiet). Consistent and deliberate use of the correct terms, with accompanying physical gestures, helps establish the distinction. Some pupils may struggle to match pitch when singing; a non-judgmental approach and regular practice are important. Not all pupils sing in tune initially, and this should be treated as a skill to develop rather than a fixed ability.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MU-KS1-C003",
      "domain_id": "MU-KS1-D001",
      "concept_name": "Dynamics and Tempo",
      "description": "Dynamics refer to the loudness or softness of music, and tempo refers to the speed at which music is performed. Both are expressive tools used by composers and performers to shape musical meaning and emotional effect. At KS1, pupils learn to recognise and use changes in dynamics and tempo as a means of making music more expressive and interesting.",
      "teaching_guidance": "Use Italian terms (piano, forte, crescendo, diminuendo) alongside English equivalents from the beginning. Play games that use dynamics - very loud, very quiet, gradually getting louder. Use conducting gestures to direct changes in dynamics and tempo. Connect tempo and dynamics to the character or story of a piece - fast and loud suggests excitement, slow and quiet suggests calm or sadness. Explore how changing the dynamics or tempo of a familiar song changes its character.",
      "key_vocabulary": "dynamics, loud, quiet, soft, forte, piano, crescendo, diminuendo, tempo, fast, slow, accelerando, rallentando, expressive",
      "common_misconceptions": "Pupils often think louder is always better in performance. Teaching that contrast, including quiet playing, is as musically important as loud playing addresses this. The relationship between tempo and mood is not always straightforward; a slow piece can be joyful and a fast piece can be tense, so exploring how context shapes interpretation is important.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MU-KS1-C004",
      "domain_id": "MU-KS1-D002",
      "concept_name": "Timbre and Texture",
      "description": "Timbre is the distinctive quality or tone colour of a sound that allows us to tell different instruments and voices apart. Texture describes how many sounds are heard simultaneously and how they interact - whether music is thin or thick, sparse or rich. At KS1, pupils develop their ability to recognise and describe different timbres and begin to understand how texture can vary in music.",
      "teaching_guidance": "Play identification games where pupils recognise instruments by sound alone. Explore how the same pitch sounds different on different instruments (violin vs. trumpet vs. voice). Build up layers of sound in composing activities to explore thin and thick textures. Discuss how adding or removing instruments changes the character of a piece. Use vocabulary cards with pictures of instruments to support verbal descriptions of timbre.",
      "key_vocabulary": "timbre, tone colour, instrument, voice, bright, dark, warm, harsh, thin, thick, texture, layer, blend",
      "common_misconceptions": "Pupils often lack vocabulary for describing timbre and fall back on subjective terms like 'nice'. Building a specific vocabulary for describing the quality of sounds (breathy, buzzy, bright, warm) helps pupils articulate what they hear more precisely. Texture as a musical concept may be confused with physical texture; the distinction needs to be explicitly taught.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MU-KS1-C005",
      "domain_id": "MU-KS1-D002",
      "concept_name": "Inter-Related Dimensions of Music",
      "description": "The inter-related dimensions of music are the building blocks used to create and describe music: pitch, duration, dynamics, tempo, timbre, texture, structure and notation. They are inter-related because changes to one dimension affect how others are perceived. At KS1, pupils begin to use these dimensions both as a creative toolkit for composing and as a vocabulary for discussing and appraising music.",
      "teaching_guidance": "Introduce dimensions progressively through practical musical activities. Use a visual display of the dimensions as a reference point. When listening to music, guide pupils to focus on one dimension at a time. When composing, challenge pupils to make a deliberate choice about one or two dimensions. Develop vocabulary lists for each dimension to support musical discussion. Use the dimensions to structure musical evaluations.",
      "key_vocabulary": "pitch, duration, dynamics, tempo, timbre, texture, structure, notation, dimension, inter-related",
      "common_misconceptions": "Pupils may treat the dimensions as separate boxes rather than as interconnected elements. Activities that explore how changing one dimension affects the perception of others help build understanding of their inter-related nature. The term 'structure' can be confusing at KS1; begin with simple examples such as verse and chorus before more complex formal structures.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MU-KS1-C006",
      "domain_id": "MU-KS1-D003",
      "concept_name": "Sound Exploration and Musical Composition",
      "description": "Musical composition at KS1 begins with free exploration and experimentation rather than formal musical notation. Pupils experiment with how sounds can be created, modified and combined: they try different ways of striking, blowing or scraping instruments; they explore how the inter-related dimensions of music (pitch, duration, dynamics, tempo, timbre, texture and structure) can be manipulated to create different effects; and they begin to make deliberate choices about which sounds to combine and how to organise them into a simple musical piece. This creative sound exploration develops musical imagination and prepares pupils for more structured composition in later years, building intuitive understanding of musical structure through doing rather than through abstract rules.",
      "teaching_guidance": "Provide rich opportunities for sound exploration with tuned and untuned percussion, body percussion, found sounds and voices. Give composition tasks with creative constraints rather than total freedom: 'make a sound picture of a storm using four instruments' or 'compose a piece that changes from quiet to loud'. Encourage pupils to reflect on their choices: why did you use that instrument there? What did you change and why? Develop the ability to perform compositions consistently: this requires some form of notation or memory strategy (graphic notation, memory cues, a sequence of pictures). Connect composition to listening and performing: analysing how a piece they have listened to is structured informs their own compositional choices.",
      "key_vocabulary": "compose, create, experiment, combine, select, sound, instrument, pitch, dynamics, tempo, timbre, texture, structure, improvise, musical idea",
      "common_misconceptions": "Pupils may believe that composition requires knowing how to write musical notation; at KS1, composition is about making musical decisions and can be recorded through graphic notation, memory or teacher transcription. Some pupils may feel that their musical ideas are wrong because they do not sound like familiar music; developing aesthetic confidence and valuing diverse musical outcomes prevents self-censorship. Pupils may not recognise that performing consistently requires some form of memory or notation: developing simple graphic notation or verbal sequencing makes composition more repeatable.",
      "concept_type": "process",
      "complexity_level": 1,
      "is_cross_cutting": false
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "MU-KS1-C001",
      "dependent_concept": "MU-KS1-C002",
      "confidence": "inferred",
      "relationship_type": "logical",
      "strength": 0.6,
      "rationale": "A secure sense of pulse and rhythm provides the temporal framework within which pitch can be explored as a distinct musical parameter."
    },
    {
      "prerequisite_concept": "MU-KS1-C001",
      "dependent_concept": "MU-KS1-C003",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.75,
      "rationale": "Tempo is a quality of the pulse, so understanding pulse is prerequisite to understanding how tempo can be varied as an expressive device."
    },
    {
      "prerequisite_concept": "MU-KS1-C002",
      "dependent_concept": "MU-KS1-C005",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.7,
      "rationale": "Understanding pitch is one of the central dimensions; practical experience of pitch as a musical parameter supports the conceptual grasp of the inter-related dimensions framework."
    },
    {
      "prerequisite_concept": "MU-KS1-C003",
      "dependent_concept": "MU-KS1-C005",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.7,
      "rationale": "Practical experience of dynamics and tempo as expressive tools supports the conceptual grasp of the inter-related dimensions as a whole."
    },
    {
      "prerequisite_concept": "MU-KS1-C005",
      "dependent_concept": "MU-KS1-C006",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.85,
      "rationale": "Understanding the inter-related dimensions of music (pitch, duration, dynamics, tempo, timbre, texture, structure) — which is what MU-KS1-C005 covers — is prerequisite to using those dimensions deliberately in composition and sound exploration."
    },
    {
      "prerequisite_concept": "MU-KS1-C001",
      "dependent_concept": "MU-KS1-C006",
      "confidence": "inferred",
      "relationship_type": "logical",
      "strength": 0.7,
      "rationale": "Understanding pulse and rhythm provides the temporal framework within which composition operates; pupils need some sense of musical time and pattern before they can create musical structures with coherent rhythmic organisation."
    }
  ]
}
