{
  "metadata": {
    "subject": "Music",
    "key_stage": "KS2",
    "years_covered": [
      3,
      4,
      5,
      6
    ],
    "document_reference": "DFE-00175-2013",
    "extraction_date": "2026-02-17",
    "structure_rating": 7
  },
  "domains": [
    {
      "domain_id": "MU-KS2-D001",
      "domain_name": "Performing in Solo and Ensemble Contexts",
      "description": "Playing and performing in solo and ensemble settings with increasing accuracy, fluency, control and expression using voices and instruments.",
      "curriculum_context": "At KS2, performance develops significantly in sophistication. Pupils perform both as soloists and in ensembles, and the curriculum specifies increasing accuracy, fluency, control and expression as the goals of this development. These four qualities mark the progression from competent playing to genuinely musical performance: accuracy concerns correctness of pitch and rhythm; fluency concerns smoothness and ease of delivery; control concerns management of the technical demands; and expression concerns communicating musical meaning and emotion. Pupils should have the opportunity to learn a musical instrument, and classroom ensembles provide the social and musical experience of playing with others, developing listening, coordination and responsibility for one's musical contribution.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "MU-KS2-D002",
      "domain_name": "Improvising and Composing",
      "description": "Improvising and composing music for a range of purposes using the inter-related dimensions of music, and developing understanding of musical composition.",
      "curriculum_context": "At KS2, pupils extend their KS1 sound exploration to more structured improvisation and composition, developing understanding of how musical ideas are organised into compositions. The curriculum specifies that pupils should organise and manipulate ideas within musical structures and reproduce sounds from aural memory, indicating a more deliberate and structurally aware approach to composition. Improvisation teaches pupils to make spontaneous musical decisions, developing musical fluency and creative confidence. Composition for a range of purposes introduces the idea that music is created in response to contexts, briefs and audiences, connecting music making to communication and expression.",
      "is_cross_cutting": false,
      "structure_type": "process"
    },
    {
      "domain_id": "MU-KS2-D003",
      "domain_name": "Listening and Aural Development",
      "description": "Listening with attention to detail to a wide range of music, recalling sounds with increasing aural memory and developing understanding of music history.",
      "curriculum_context": "Active and discriminating listening is central to KS2 music education. Pupils listen with attention to detail, identifying and describing musical features, structures and expressive devices with increasing sophistication. The development of aural memory - the ability to recall and reproduce sounds - is a specific target, connecting listening to performing and composing. Pupils are expected to appreciate and understand a wide range of high-quality live and recorded music drawn from different traditions and from great composers and musicians, and to develop an understanding of the history of music, giving listening a historical and cultural dimension that supports broader musical understanding.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "MU-KS2-D004",
      "domain_name": "Musical Notation",
      "description": "Using and understanding staff notation and other musical notations to read, write and communicate musical ideas.",
      "curriculum_context": "KS2 introduces formal staff notation as a tool for reading and recording musical ideas. Pupils learn to use both staff notation and other relevant notations, understanding that notation is a means of communicating musical ideas rather than an end in itself. The ability to read notation supports performance by allowing pupils to learn new pieces independently and to rehearse from written scores. Understanding notation also supports composition by giving pupils a way to record and share their musical ideas. Staff notation connects music education to a long written tradition and to the practice of professional musicians and composers.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    }
  ],
  "objectives": [
    {
      "objective_id": "MU-KS2-O001",
      "domain_id": "MU-KS2-D001",
      "objective_text": "play and perform in solo and ensemble contexts, using their voices and playing musical instruments with increasing accuracy, fluency, control and expression",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "MU-KS2-O002",
      "domain_id": "MU-KS2-D002",
      "objective_text": "improvise and compose music for a range of purposes using the inter-related dimensions of music",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "MU-KS2-O003",
      "domain_id": "MU-KS2-D003",
      "objective_text": "listen with attention to detail and recall sounds with increasing aural memory",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "MU-KS2-O004",
      "domain_id": "MU-KS2-D004",
      "objective_text": "use and understand staff and other musical notations",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "MU-KS2-O005",
      "domain_id": "MU-KS2-D003",
      "objective_text": "appreciate and understand a wide range of high-quality live and recorded music drawn from different traditions and from great composers and musicians",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "MU-KS2-O006",
      "domain_id": "MU-KS2-D003",
      "objective_text": "develop an understanding of the history of music",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "MU-KS2-C001",
      "domain_id": "MU-KS2-D001",
      "concept_name": "Ensemble Performance Skills",
      "description": "Ensemble performance requires musicians to listen to and coordinate with others while maintaining their own part, developing skills of listening, timing, balance and musical communication. At KS2, pupils develop the ability to play in groups, adjust their contribution to the ensemble, follow a conductor and manage the social and musical demands of collaborative music making.",
      "teaching_guidance": "Create regular ensemble opportunities in whole-class instrumental lessons, recorder groups, or percussion ensembles. Teach pupils to listen across the ensemble while playing their own part. Use simple conducting gestures to direct starts, stops and dynamic changes. Develop listening challenges: can pupils hear all the parts? Can they identify when their part is dominant and when it should blend? Use rounds and partner songs to develop independent part-playing.",
      "key_vocabulary": "ensemble, solo, blend, balance, part, conductor, cue, coordination, listen, independent, unison, harmony",
      "common_misconceptions": "Pupils often focus only on their own part and do not listen to others in an ensemble. Teaching that ensemble music requires active listening as well as playing is key. Some pupils may feel that playing quietly means playing badly; teaching about musical balance and the importance of dynamic blend within an ensemble addresses this.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "MU-KS2-C002",
      "domain_id": "MU-KS2-D002",
      "concept_name": "Improvisation",
      "description": "Improvisation is the creation of music spontaneously in performance, without prior written notation. It requires musical knowledge and skill, creative confidence and the ability to make instant decisions. At KS2, pupils develop improvisation skills through structured activities that provide a framework (scale, rhythm, harmonic context) within which they can make free musical choices.",
      "teaching_guidance": "Begin with very structured improvisation frameworks - improvise using only two or three notes over a drone or ostinato. Gradually increase freedom by expanding the note set or the rhythmic palette. Use call-and-response structures. Encourage pupils to improvise short phrases and to listen to and build on each other's ideas. Discuss the difference between improvisation (spontaneous) and composition (planned). Connect to listening by pointing out improvisation in jazz and world music examples.",
      "key_vocabulary": "improvise, spontaneous, phrase, motif, scale, drone, ostinato, response, idea, explore, create, structure",
      "common_misconceptions": "Pupils often fear improvisation because they believe there is a 'right answer'. Framing improvisation as creative exploration rather than performance of a correct sequence helps. Some pupils may produce random sequences of notes rather than musical phrases; teaching phrase length and resolution helps develop more musical improvisation.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": [
        "MU-KS2-C003"
      ]
    },
    {
      "concept_id": "MU-KS2-C003",
      "domain_id": "MU-KS2-D002",
      "concept_name": "Musical Structure and Composition",
      "description": "Musical structure refers to the way a composition is organised over time - how musical ideas are introduced, developed, contrasted and repeated. Common structural forms include binary (AB), ternary (ABA), rondo (ABACADA) and theme and variations. At KS2, pupils develop understanding of musical structure as they compose music for a range of purposes, learning to organise musical ideas intentionally.",
      "teaching_guidance": "Analyse structure in listening examples by identifying where ideas return, contrast and develop. Use graphic notation or simple letter notation (A, B, C) to map the structure of pieces. Set composition tasks that require pupils to use a specific structure. Encourage revision of compositional structure in the light of evaluation. Connect structure to the purpose of the music - a lullaby might have repetitive, soothing sections; a piece for a film chase scene would have contrasting fast and slow sections.",
      "key_vocabulary": "structure, form, binary, ternary, rondo, verse, chorus, bridge, motif, theme, variation, contrast, repetition, development",
      "common_misconceptions": "Pupils often compose music that simply continues without structural contrast or repetition, resulting in a stream of unconnected ideas. Teaching basic structural forms and asking pupils to plan structure before composing prevents this. Some pupils may repeat material too mechanically; discussing how professional composers introduce subtle variations of repeated material develops more sophisticated structural thinking.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "MU-KS2-C004",
      "domain_id": "MU-KS2-D004",
      "concept_name": "Staff Notation",
      "description": "Staff notation is the standardised system of writing music using a five-line stave, clefs, note heads and rhythmic values. It allows music to be written down accurately and communicated to performers who have not heard the piece. At KS2, pupils learn to read and write staff notation, beginning with treble clef notes and simple rhythmic values, connecting this to their instrumental learning and composition work.",
      "teaching_guidance": "Introduce staff notation in the context of instrumental learning, connecting written symbols to sounds pupils already know. Use mnemonics for note names (Every Good Boy Deserves Football for EGBDF). Practice reading short melodic fragments by ear first, then by sight. Teach rhythmic values (crotchet, minim, quaver) alongside their sound and feel. Use pupils' own compositions as a context for notation practice. Emphasise that notation represents sound; always connect written symbols to the sounds they represent.",
      "key_vocabulary": "stave, clef, treble, note, pitch, crotchet, minim, semibreve, quaver, bar line, time signature, rest, sharp, flat, natural",
      "common_misconceptions": "Pupils sometimes learn note names as abstract symbols without connecting them to specific sounds on their instrument. Always reinforcing the sound alongside the symbol prevents disconnected learning. The time signature is often misunderstood as a fraction rather than as information about pulse grouping; consistent practical activities reinforce its musical meaning.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": []
    },
    {
      "concept_id": "MU-KS2-C005",
      "domain_id": "MU-KS2-D003",
      "concept_name": "Music History and Cultural Context",
      "description": "Music has a rich history spanning many centuries and cultures, with different traditions, genres and styles each having distinctive features and contexts. At KS2, pupils develop understanding of the history of music and appreciation for a wide range of musical traditions, including the works of great composers and musicians. This historical and cultural knowledge enriches pupils' listening and informs their own musical making.",
      "teaching_guidance": "Use listening examples from a wide range of historical periods and musical traditions, including Western classical, folk, jazz, world music and popular music. Connect composers and their music to their historical context - what was happening in the world when this music was written? Use simple timelines to place music historically. Connect music history to history in other subjects. Encourage pupils to develop preferences and to articulate why they prefer certain music using musical vocabulary.",
      "key_vocabulary": "composer, period, Baroque, Classical, Romantic, contemporary, tradition, genre, style, culture, influence, folk, jazz, classical, heritage",
      "common_misconceptions": "Pupils may assume that 'good' music means Western classical music. Deliberately presenting diverse musical traditions as equally valid challenges this. Pupils may not understand that musical preferences are shaped by culture and experience; discussing how exposure influences taste develops critical musical understanding.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "teaching_weight": 2,
      "co_teach_hints": []
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "MU-KS1-C001",
      "dependent_concept": "MU-KS2-C001",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Secure pulse and rhythm are the foundation of ensemble performance, which requires all players to maintain a shared tempo and coordinate rhythmically."
    },
    {
      "prerequisite_concept": "MU-KS1-C002",
      "dependent_concept": "MU-KS2-C004",
      "confidence": "inferred",
      "relationship_type": "logical",
      "strength": 0.8,
      "rationale": "Staff notation represents pitch primarily; understanding what pitch is and how to produce it on an instrument is necessary before notation of pitch can be meaningful."
    },
    {
      "prerequisite_concept": "MU-KS1-C005",
      "dependent_concept": "MU-KS2-C002",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Improvisation at KS2 requires pupils to make deliberate choices using the musical dimensions introduced at KS1."
    },
    {
      "prerequisite_concept": "MU-KS2-C002",
      "dependent_concept": "MU-KS2-C003",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.7,
      "rationale": "Improvisation develops the ability to generate musical ideas spontaneously; composition extends this by requiring those ideas to be organised into deliberate structures."
    }
  ]
}
