{
  "metadata": {
    "subject": "Science",
    "key_stage": "KS2",
    "years_covered": [
      3,
      4,
      5,
      6
    ],
    "document_reference": "DFE-00182-2013",
    "extraction_date": "2026-02-17",
    "structure_rating": 9,
    "notes": "KS2 Science is organised into two tiers: (1) Working Scientifically — a cross-cutting process domain taught through substantive content, split into Lower KS2 (Y3-4) and Upper KS2 (Y5-6) bands; and (2) Content domains split across Biology (Living Things and Habitats, Animals including Humans, Plants, Evolution and Inheritance), Chemistry (Rocks, States of Matter, Properties and Changes of Materials), and Physics (Light, Forces and Magnets, Sound, Electricity, Earth and Space). Topics are distributed across specific years. Strong cross-key-stage prerequisite chains link back to KS1 concepts."
  },
  "domains": [
    {
      "domain_id": "SC-KS2-D001",
      "domain_name": "Working Scientifically",
      "description": "Practical scientific methods, processes and skills taught through and integrated with substantive science content. In Lower KS2 (Y3-4), pupils broaden enquiry skills including fair tests, standard measurements, data recording and drawing conclusions. In Upper KS2 (Y5-6), pupils plan enquiries, control variables, use increasing precision, and evaluate evidence. Must not be taught as a separate strand.",
      "is_cross_cutting": true,
      "structure_type": "mixed",
      "notes": "Split into two bands: Lower KS2 (Y3-4) and Upper KS2 (Y5-6). Progressive development from guided enquiry to increasingly independent scientific investigation.",
      "curriculum_context": "Working scientifically at KS2 underpins all science learning and requires pupils to use a range of scientific methods and processes, progressing from the exploratory approaches of KS1 to systematic, fair-test investigations. Pupils develop the ability to plan different types of scientific enquiry — including observing over time, pattern seeking, classifying, comparative and fair testing, and researching using secondary sources — selecting the most appropriate method for the question being asked. The statutory curriculum requires pupils to recognise that scientific evidence is used to support or refute ideas, to take measurements using standard units, to record and present data in a variety of graphical forms, and to draw conclusions consistent with their evidence. By the end of KS2, pupils should be able to report and present findings from enquiries using appropriate scientific language and representations."
    },
    {
      "domain_id": "SC-KS2-D002",
      "domain_name": "Plants",
      "description": "Biology domain covering plant structure and function, requirements for life and growth, water transport in plants, and the full life cycle of flowering plants including pollination, seed formation and seed dispersal. Year 3 only at KS2.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "notes": "Year 3 only. Builds directly on KS1 plant identification and structure. Moves from naming parts to understanding function and life cycle processes.",
      "curriculum_context": "The Plants domain at KS2 builds on the introductory plant knowledge from KS1 to develop a scientific understanding of the life processes, nutrition and reproduction of plants. Pupils investigate how plants grow and are structured, learning about the functions of the root, stem, leaf and flower in the plant's life cycle. The statutory content requires pupils to explore what plants need for life and growth, to understand photosynthesis as the process by which plants make food from sunlight, water and carbon dioxide, and to understand the process of seed dispersal and pollination. Pupils investigate and observe the growing of plants from seeds and bulbs, developing their ability to conduct systematic observations over time and record changes."
    },
    {
      "domain_id": "SC-KS2-D003",
      "domain_name": "Animals, Including Humans",
      "description": "Biology domain covering nutrition and skeletal/muscular systems (Y3), digestive system and food chains (Y4), human development to old age (Y5), and the circulatory system and healthy lifestyles (Y6). Progressive study of animal and human body systems across KS2.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "notes": "Covered across all four KS2 years with different focus each year. Systematic progression through body systems.",
      "curriculum_context": "Animals Including Humans at KS2 extends pupils' understanding from the basic needs and life processes studied at KS1 to a more detailed understanding of animal biology, nutrition, circulation and reproduction. Pupils learn about the digestive system and the role of nutrition in health, the structure and function of the skeletal and muscular systems, and the circulatory system including the heart and blood. The statutory curriculum requires pupils to investigate the effects of diet, exercise and lifestyle on health and wellbeing, and to understand how offspring inherit characteristics from parents through reproduction. By upper KS2, pupils understand the changes that occur as humans develop from birth to old age, providing a foundation for the more detailed human biology studied at KS3."
    },
    {
      "domain_id": "SC-KS2-D004",
      "domain_name": "Rocks",
      "description": "Chemistry/Earth science domain covering classification of rocks, fossil formation and soil composition. Year 3 only. Provides foundation for later work on evolution and inheritance in Year 6.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "notes": "Year 3 only. Links to geography fieldwork. Fossil knowledge feeds into Year 6 evolution topic.",
      "curriculum_context": "The Rocks domain introduces pupils to the geological materials that make up the Earth's surface, providing a foundation for understanding Earth processes, the rock cycle and the fossil record. Pupils compare and group rocks on the basis of their appearance and physical properties, and learn to distinguish between sedimentary, igneous and metamorphic rocks. The statutory curriculum requires pupils to describe how fossils are formed and understand what they tell us about living things that existed millions of years ago, connecting palaeontology to the concept of evolution. Pupils also study soil, understanding its composition and the role of living organisms and weathering processes in soil formation."
    },
    {
      "domain_id": "SC-KS2-D005",
      "domain_name": "Light",
      "description": "Physics domain covering light sources, reflection, shadows and Sun safety (Y3), progressing to light travelling in straight lines, how we see objects, and explanations of shadows (Y6). Taught in Y3 and revisited with deeper explanation in Y6.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "notes": "Taught in Year 3 (observable phenomena) and Year 6 (explanatory model). Clear conceptual progression.",
      "curriculum_context": "The Light domain at KS2 requires pupils to understand light as a physical phenomenon — how it is produced, how it travels and how it interacts with materials. Pupils discover that light travels in straight lines and that we see because light enters the eye, correcting common misconceptions from younger years. The statutory curriculum requires pupils to investigate how shadows are formed and how their size and shape relate to the position of the light source, and to understand reflection as the mechanism by which mirrors and smooth surfaces change the direction of light. Pupils also explore how light is refracted, providing the conceptual foundation for understanding how lenses and optical instruments work."
    },
    {
      "domain_id": "SC-KS2-D006",
      "domain_name": "Forces and Magnets",
      "description": "Physics domain covering contact and non-contact forces, magnetic attraction and repulsion, magnetic poles, and movement on surfaces. Year 3 only at KS2, with forces revisited more deeply in Year 5.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "notes": "Year 3 only for magnets. Forces (gravity, air/water resistance, friction, mechanisms) covered separately in Year 5.",
      "curriculum_context": "Forces and Magnets at KS2 introduces pupils to the concept of force as an interaction between objects, progressing from the intuitive, qualitative understanding of push and pull in KS1 to a more systematic, measurable account. Pupils investigate how objects move on different surfaces, understanding friction as a force that opposes motion, and explore the properties of magnets — attraction, repulsion and the existence of magnetic fields. The statutory curriculum requires pupils to distinguish between contact forces (friction, air resistance, water resistance) and non-contact forces (gravity, magnetic and electrostatic forces), comparing how objects move on different surfaces. This foundational understanding of forces prepares pupils for the more mathematical treatment of Newton's laws at KS3."
    },
    {
      "domain_id": "SC-KS2-D007",
      "domain_name": "Living Things and Their Habitats",
      "description": "Biology/ecology domain covering classification systems (Y4), life cycles of different animal types (Y5), and formal biological classification including micro-organisms (Y6). Progressive deepening of ecological and taxonomic understanding.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "notes": "Covered in Years 4, 5 and 6. Progression from informal grouping to formal classification systems.",
      "curriculum_context": "Living Things and Their Habitats at KS2 develops pupils' ecological understanding, moving from the simple identification of living and non-living things at KS1 to an understanding of the relationships between organisms and their environments. Pupils classify living things into broad groups (plants, animals, fungi, micro-organisms) using observable characteristics, and understand how classification systems are constructed and used by scientists. The statutory curriculum requires pupils to explore how habitats provide for the basic needs of different organisms, to construct and interpret food chains, and to understand how changes to an environment can affect the living things that depend on it. Pupils are introduced to the concepts of producer, consumer, predator and prey."
    },
    {
      "domain_id": "SC-KS2-D008",
      "domain_name": "States of Matter",
      "description": "Chemistry domain covering solids, liquids and gases, changes of state when heated or cooled, and the water cycle including evaporation and condensation. Year 4 only.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "notes": "Year 4 only. Builds on KS1 materials knowledge. Links to geography (water cycle) and Year 5 (properties and changes of materials).",
      "curriculum_context": "States of Matter at KS2 introduces pupils to the particle model as the scientific explanation for the properties and behaviour of solids, liquids and gases. Pupils compare and group materials together according to whether they are solid, liquid or gas at room temperature, and investigate the processes of evaporation and condensation in the context of the water cycle. The statutory curriculum requires pupils to observe that some materials change state when they are heated or cooled, and to measure or research the temperature at which this happens. This provides the conceptual foundation for understanding thermodynamics, chemical reactions and the physical geography of the water cycle at later stages."
    },
    {
      "domain_id": "SC-KS2-D009",
      "domain_name": "Sound",
      "description": "Physics domain covering vibrations as the source of sound, transmission through media, pitch and volume patterns, and the inverse relationship between distance and sound intensity. Year 4 only.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "notes": "Year 4 only. New topic at KS2 with no direct KS1 prerequisite content, though general observation and pattern-finding skills from KS1 apply.",
      "curriculum_context": "The Sound domain requires pupils to understand sound as a physical phenomenon produced by vibration, and to explore the properties of sound — pitch, volume and the materials through which sound travels. Pupils identify how sounds are made (all sounds result from something vibrating), and understand that vibrations travel through a medium to the ear. The statutory curriculum requires pupils to investigate the relationship between the vibration of a string and the pitch of the sound produced, and to understand how sound is attenuated by distance. Pupils develop the ability to design fair test investigations, measuring and recording sound levels and making predictions about variables that affect pitch and volume."
    },
    {
      "domain_id": "SC-KS2-D010",
      "domain_name": "Electricity",
      "description": "Physics domain covering electrical appliances, constructing series circuits, switches, conductors and insulators (Y4), progressing to voltage, component function and circuit diagrams with standard symbols (Y6).",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "notes": "Year 4 (practical circuits) and Year 6 (explanatory models and symbols). Clear conceptual progression between years.",
      "curriculum_context": "Electricity at KS2 introduces pupils to electric circuits as systems in which energy is transferred from a power source through components. Pupils construct simple series circuits and investigate the effects of adding or removing components, predicting whether a lamp will light based on whether the circuit is complete. The statutory curriculum requires pupils to understand the function of common circuit components — cells, wires, bulbs, switches and buzzers — and to use recognised circuit symbols to draw diagrams. By upper KS2, pupils investigate how circuit properties (voltage, number of cells, component type) affect the behaviour of the circuit, developing the quantitative understanding of electricity that is extended at KS3."
    },
    {
      "domain_id": "SC-KS2-D011",
      "domain_name": "Properties and Changes of Materials",
      "description": "Chemistry domain covering material properties (hardness, solubility, transparency, conductivity, magnetism), solutions, separating mixtures, reversible and irreversible changes. Year 5 only. Builds on KS1 materials and Y4 states of matter.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "notes": "Year 5 only. Major extension of materials knowledge from KS1 and Y4 states of matter.",
      "curriculum_context": "Properties and Changes of Materials at upper KS2 requires pupils to compare and group materials based on physical properties — hardness, solubility, thermal conductivity, response to magnets, transparency — and to investigate mixtures and methods of separating them. Pupils understand that some changes (dissolving, mixing, changes of state) are reversible while others (burning, rusting, reactions involving new substances) are not, and learn to describe the differences using appropriate scientific language. The statutory curriculum requires pupils to investigate whether dissolving, mixing and changes of state produce new materials, providing the foundation for understanding chemical change at KS3."
    },
    {
      "domain_id": "SC-KS2-D012",
      "domain_name": "Earth and Space",
      "description": "Physics/astronomy domain covering the solar system, Earth's rotation, day and night, movement of Moon relative to Earth, and approximately spherical bodies. Year 5 only.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "notes": "Year 5 only. New topic at KS2, though links to KS1 seasonal changes (day length variation, seasons).",
      "curriculum_context": "Earth and Space at upper KS2 provides pupils with an understanding of the solar system, Earth's movements and the phenomena associated with them — day and night, seasons, phases of the Moon. Pupils learn that the Earth, along with other planets, orbits the Sun, and that the Moon orbits the Earth, using models and research to understand the relative sizes, distances and movements of these bodies. The statutory curriculum requires pupils to explain day and night as the result of Earth rotating on its axis, and to understand how this differs from the annual orbit of the Earth around the Sun. This provides important foundations for astronomical and geographical concepts at KS3 and beyond."
    },
    {
      "domain_id": "SC-KS2-D013",
      "domain_name": "Forces",
      "description": "Physics domain covering gravity, air resistance, water resistance, friction, and mechanisms (levers, pulleys, gears). Year 5 only. Builds on Y3 forces and magnets work on contact/non-contact forces.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "notes": "Year 5 only. Extends Y3 forces concepts to include gravity and resistance forces.",
      "curriculum_context": "Forces at upper KS2 moves beyond the qualitative introduction of Year 3 to a more quantitative understanding, including gravity, air resistance, water resistance and mechanisms that can change the effect of forces. Pupils investigate how objects fall due to gravity and explore the effects of air resistance and water resistance in opposing motion. The statutory curriculum requires pupils to understand that some mechanisms — levers, pulleys and gears — allow a smaller force to have a greater effect, introducing the concept of mechanical advantage. Pupils design and evaluate fair tests investigating factors that affect the force of air resistance or water resistance, developing their scientific investigation skills."
    },
    {
      "domain_id": "SC-KS2-D014",
      "domain_name": "Evolution and Inheritance",
      "description": "Biology domain covering fossil evidence for change over time, variation in offspring, adaptation to environments, and the concept of evolution. Year 6 only. Builds on Y3 fossils and Y5 life cycles.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "notes": "Year 6 only. Synthesises fossil knowledge (Y3), life cycle knowledge (Y5) and classification (Y4/Y6) into evolutionary framework.",
      "curriculum_context": "Evolution and Inheritance at upper KS2 introduces pupils to Charles Darwin's theory of evolution by natural selection as the scientific explanation for the diversity of life on Earth. Pupils learn that living things have changed over millions of years and that fossils provide evidence of organisms that lived long ago, connecting this to the geological evidence studied in the Rocks domain. The statutory curriculum requires pupils to understand that offspring are not identical to their parents (variation), that some variations are advantageous in a particular environment (natural selection), and that this can lead to evolution over many generations. This domain provides the conceptual framework for understanding inheritance, genetics and biodiversity at KS3."
    }
  ],
  "objectives": [
    {
      "objective_id": "SC-KS2-O001",
      "domain_id": "SC-KS2-D001",
      "objective_text": "asking relevant questions and using different types of scientific enquiries to answer them",
      "is_statutory": true,
      "year": [
        3,
        4
      ],
      "notes": "Lower KS2 Working Scientifically. Develops from KS1 simple questioning to choosing appropriate enquiry type."
    },
    {
      "objective_id": "SC-KS2-O002",
      "domain_id": "SC-KS2-D001",
      "objective_text": "setting up simple practical enquiries, comparative and fair tests",
      "is_statutory": true,
      "year": [
        3,
        4
      ],
      "notes": "Lower KS2 Working Scientifically. Introduction to fair testing with identified variables."
    },
    {
      "objective_id": "SC-KS2-O003",
      "domain_id": "SC-KS2-D001",
      "objective_text": "making systematic and careful observations and, where appropriate, taking accurate measurements using standard units, using a range of equipment, including thermometers and data loggers",
      "is_statutory": true,
      "year": [
        3,
        4
      ],
      "notes": "Lower KS2 Working Scientifically. Introduces standard units and specific equipment including thermometers and data loggers."
    },
    {
      "objective_id": "SC-KS2-O004",
      "domain_id": "SC-KS2-D001",
      "objective_text": "gathering, recording, classifying and presenting data in a variety of ways to help in answering questions",
      "is_statutory": true,
      "year": [
        3,
        4
      ],
      "notes": "Lower KS2 Working Scientifically. Extends KS1 data recording to include presenting and classifying."
    },
    {
      "objective_id": "SC-KS2-O005",
      "domain_id": "SC-KS2-D001",
      "objective_text": "recording findings using simple scientific language, drawings, labelled diagrams, keys, bar charts, and tables",
      "is_statutory": true,
      "year": [
        3,
        4
      ],
      "notes": "Lower KS2 Working Scientifically. Introduces keys and bar charts as recording formats."
    },
    {
      "objective_id": "SC-KS2-O006",
      "domain_id": "SC-KS2-D001",
      "objective_text": "reporting on findings from enquiries, including oral and written explanations, displays or presentations of results and conclusions",
      "is_statutory": true,
      "year": [
        3,
        4
      ],
      "notes": "Lower KS2 Working Scientifically. Moves towards written explanations and formal presentations."
    },
    {
      "objective_id": "SC-KS2-O007",
      "domain_id": "SC-KS2-D001",
      "objective_text": "using results to draw simple conclusions, make predictions for new values, suggest improvements and raise further questions",
      "is_statutory": true,
      "year": [
        3,
        4
      ],
      "notes": "Lower KS2 Working Scientifically. Introduces prediction and iterative improvement of investigations."
    },
    {
      "objective_id": "SC-KS2-O008",
      "domain_id": "SC-KS2-D001",
      "objective_text": "identifying differences, similarities or changes related to simple scientific ideas and processes",
      "is_statutory": true,
      "year": [
        3,
        4
      ],
      "notes": "Lower KS2 Working Scientifically. Analytical comparison linked to scientific concepts."
    },
    {
      "objective_id": "SC-KS2-O009",
      "domain_id": "SC-KS2-D001",
      "objective_text": "using straightforward scientific evidence to answer questions or to support their findings",
      "is_statutory": true,
      "year": [
        3,
        4
      ],
      "notes": "Lower KS2 Working Scientifically. Introduction to evidence-based reasoning."
    },
    {
      "objective_id": "SC-KS2-O010",
      "domain_id": "SC-KS2-D001",
      "objective_text": "planning different types of scientific enquiries to answer questions, including recognising and controlling variables where necessary",
      "is_statutory": true,
      "year": [
        5,
        6
      ],
      "notes": "Upper KS2 Working Scientifically. Introduces variable control as a key concept of experimental design."
    },
    {
      "objective_id": "SC-KS2-O011",
      "domain_id": "SC-KS2-D001",
      "objective_text": "taking measurements, using a range of scientific equipment, with increasing accuracy and precision, taking repeat readings when appropriate",
      "is_statutory": true,
      "year": [
        5,
        6
      ],
      "notes": "Upper KS2 Working Scientifically. Introduces precision, accuracy and repeat readings."
    },
    {
      "objective_id": "SC-KS2-O012",
      "domain_id": "SC-KS2-D001",
      "objective_text": "recording data and results of increasing complexity using scientific diagrams and labels, classification keys, tables, scatter graphs, bar and line graphs",
      "is_statutory": true,
      "year": [
        5,
        6
      ],
      "notes": "Upper KS2 Working Scientifically. Adds scatter graphs and line graphs to recording repertoire."
    },
    {
      "objective_id": "SC-KS2-O013",
      "domain_id": "SC-KS2-D001",
      "objective_text": "using test results to make predictions to set up further comparative and fair tests",
      "is_statutory": true,
      "year": [
        5,
        6
      ],
      "notes": "Upper KS2 Working Scientifically. Iterative scientific process — results informing future investigations."
    },
    {
      "objective_id": "SC-KS2-O014",
      "domain_id": "SC-KS2-D001",
      "objective_text": "reporting and presenting findings from enquiries, including conclusions, causal relationships and explanations of and degree of trust in results, in oral and written forms such as displays and other presentations",
      "is_statutory": true,
      "year": [
        5,
        6
      ],
      "notes": "Upper KS2 Working Scientifically. Introduces causal relationships and critical evaluation of trust in results."
    },
    {
      "objective_id": "SC-KS2-O015",
      "domain_id": "SC-KS2-D001",
      "objective_text": "identifying scientific evidence that has been used to support or refute ideas or arguments",
      "is_statutory": true,
      "year": [
        5,
        6
      ],
      "notes": "Upper KS2 Working Scientifically. Critical evaluation of evidence — including secondary sources and the work of scientists."
    },
    {
      "objective_id": "SC-KS2-O016",
      "domain_id": "SC-KS2-D002",
      "objective_text": "identify and describe the functions of different parts of flowering plants: roots, stem/trunk, leaves and flowers",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Plants. Moves from KS1 naming of parts to understanding their functional roles."
    },
    {
      "objective_id": "SC-KS2-O017",
      "domain_id": "SC-KS2-D002",
      "objective_text": "explore the requirements of plants for life and growth (air, light, water, nutrients from soil, and room to grow) and how they vary from plant to plant",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Plants. Extends KS1 water/light/temperature to include air, nutrients and space. Adds variation between plant species."
    },
    {
      "objective_id": "SC-KS2-O018",
      "domain_id": "SC-KS2-D002",
      "objective_text": "investigate the way in which water is transported within plants",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Plants. Links structure (stem) to function (water transport). Example: white carnations in coloured water."
    },
    {
      "objective_id": "SC-KS2-O019",
      "domain_id": "SC-KS2-D002",
      "objective_text": "explore the part that flowers play in the life cycle of flowering plants, including pollination, seed formation and seed dispersal",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Plants. Introduces reproductive aspects of plant life cycle: pollination, seed formation, dispersal."
    },
    {
      "objective_id": "SC-KS2-O020",
      "domain_id": "SC-KS2-D003",
      "objective_text": "identify that animals, including humans, need the right types and amount of nutrition, and that they cannot make their own food; they get nutrition from what they eat",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Animals including Humans. Extends KS1 basic needs to distinguish animal nutrition from plant nutrition (animals cannot make own food)."
    },
    {
      "objective_id": "SC-KS2-O021",
      "domain_id": "SC-KS2-D003",
      "objective_text": "identify that humans and some other animals have skeletons and muscles for support, protection and movement",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Animals including Humans. Introduces skeletal and muscular systems and their functions."
    },
    {
      "objective_id": "SC-KS2-O022",
      "domain_id": "SC-KS2-D004",
      "objective_text": "compare and group together different kinds of rocks on the basis of their appearance and simple physical properties",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Rocks. New KS2 topic. Classification of rocks extends KS1 materials classification skills."
    },
    {
      "objective_id": "SC-KS2-O023",
      "domain_id": "SC-KS2-D004",
      "objective_text": "describe in simple terms how fossils are formed when things that have lived are trapped within rock",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Rocks. Introduction to fossil formation. Feeds into Y6 evolution topic."
    },
    {
      "objective_id": "SC-KS2-O024",
      "domain_id": "SC-KS2-D004",
      "objective_text": "recognise that soils are made from rocks and organic matter",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Rocks. Links rocks to soil composition. Connects to plant growth requirements (nutrients from soil)."
    },
    {
      "objective_id": "SC-KS2-O025",
      "domain_id": "SC-KS2-D005",
      "objective_text": "recognise that they need light in order to see things and that dark is the absence of light",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Light. Foundation concept: light enables vision; darkness is absence of light."
    },
    {
      "objective_id": "SC-KS2-O026",
      "domain_id": "SC-KS2-D005",
      "objective_text": "notice that light is reflected from surfaces",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Light. Observable reflection phenomena."
    },
    {
      "objective_id": "SC-KS2-O027",
      "domain_id": "SC-KS2-D005",
      "objective_text": "recognise that light from the sun can be dangerous and that there are ways to protect their eyes",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Light. Safety awareness about direct sunlight."
    },
    {
      "objective_id": "SC-KS2-O028",
      "domain_id": "SC-KS2-D005",
      "objective_text": "recognise that shadows are formed when the light from a light source is blocked by an opaque object",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Light. Explains shadow formation in terms of light blocking by opaque objects."
    },
    {
      "objective_id": "SC-KS2-O029",
      "domain_id": "SC-KS2-D005",
      "objective_text": "find patterns in the way that the size of shadows change",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Light. Pattern-seeking enquiry: how shadow size varies with position of light source or object."
    },
    {
      "objective_id": "SC-KS2-O030",
      "domain_id": "SC-KS2-D006",
      "objective_text": "compare how things move on different surfaces",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Forces and Magnets. Observing friction effects on movement."
    },
    {
      "objective_id": "SC-KS2-O031",
      "domain_id": "SC-KS2-D006",
      "objective_text": "notice that some forces need contact between two objects, but magnetic forces can act at a distance",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Forces and Magnets. Key distinction: contact vs non-contact forces."
    },
    {
      "objective_id": "SC-KS2-O032",
      "domain_id": "SC-KS2-D006",
      "objective_text": "observe how magnets attract or repel each other and attract some materials and not others",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Forces and Magnets. Observable magnetic behaviour: attraction and repulsion."
    },
    {
      "objective_id": "SC-KS2-O033",
      "domain_id": "SC-KS2-D006",
      "objective_text": "compare and group together a variety of everyday materials on the basis of whether they are attracted to a magnet, and identify some magnetic materials",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Forces and Magnets. Classification of materials by magnetic properties."
    },
    {
      "objective_id": "SC-KS2-O034",
      "domain_id": "SC-KS2-D006",
      "objective_text": "describe magnets as having two poles",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Forces and Magnets. Introduces concept of magnetic poles."
    },
    {
      "objective_id": "SC-KS2-O035",
      "domain_id": "SC-KS2-D006",
      "objective_text": "predict whether two magnets will attract or repel each other, depending on which poles are facing",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Forces and Magnets. Applying understanding of poles to make predictions — like poles repel, unlike poles attract."
    },
    {
      "objective_id": "SC-KS2-O036",
      "domain_id": "SC-KS2-D007",
      "objective_text": "recognise that living things can be grouped in a variety of ways",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Living Things and Their Habitats. Introduces flexible classification — different criteria yield different groupings."
    },
    {
      "objective_id": "SC-KS2-O037",
      "domain_id": "SC-KS2-D007",
      "objective_text": "explore and use classification keys to help group, identify and name a variety of living things in their local and wider environment",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Living Things and Their Habitats. Introduces classification keys as a tool for identification."
    },
    {
      "objective_id": "SC-KS2-O038",
      "domain_id": "SC-KS2-D007",
      "objective_text": "recognise that environments can change and that this can sometimes pose dangers to living things",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Living Things and Their Habitats. Environmental change and impact on living things. Includes human impact (positive and negative)."
    },
    {
      "objective_id": "SC-KS2-O039",
      "domain_id": "SC-KS2-D003",
      "objective_text": "describe the simple functions of the basic parts of the digestive system in humans",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Animals including Humans. Introduces digestive system: mouth, tongue, teeth, oesophagus, stomach, small and large intestine."
    },
    {
      "objective_id": "SC-KS2-O040",
      "domain_id": "SC-KS2-D003",
      "objective_text": "identify the different types of teeth in humans and their simple functions",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Animals including Humans. Types of teeth (incisors, canines, molars) and their functions in digestion."
    },
    {
      "objective_id": "SC-KS2-O041",
      "domain_id": "SC-KS2-D003",
      "objective_text": "construct and interpret a variety of food chains, identifying producers, predators and prey",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Animals including Humans. Extends KS1 simple food chains to include producer/predator/prey terminology."
    },
    {
      "objective_id": "SC-KS2-O042",
      "domain_id": "SC-KS2-D008",
      "objective_text": "compare and group materials together, according to whether they are solids, liquids or gases",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 States of Matter. Introduces three states of matter as a classification framework."
    },
    {
      "objective_id": "SC-KS2-O043",
      "domain_id": "SC-KS2-D008",
      "objective_text": "observe that some materials change state when they are heated or cooled, and measure or research the temperature at which this happens in degrees Celsius (°C)",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 States of Matter. Introduces temperature measurement linked to state changes."
    },
    {
      "objective_id": "SC-KS2-O044",
      "domain_id": "SC-KS2-D008",
      "objective_text": "identify the part played by evaporation and condensation in the water cycle and associate the rate of evaporation with temperature",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 States of Matter. Links state changes to the water cycle. Introduces evaporation rate as temperature-dependent."
    },
    {
      "objective_id": "SC-KS2-O045",
      "domain_id": "SC-KS2-D009",
      "objective_text": "identify how sounds are made, associating some of them with something vibrating",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Sound. Fundamental concept: sound is caused by vibration."
    },
    {
      "objective_id": "SC-KS2-O046",
      "domain_id": "SC-KS2-D009",
      "objective_text": "recognise that vibrations from sounds travel through a medium to the ear",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Sound. Sound transmission through media — solid, liquid, gas."
    },
    {
      "objective_id": "SC-KS2-O047",
      "domain_id": "SC-KS2-D009",
      "objective_text": "find patterns between the pitch of a sound and features of the object that produced it",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Sound. Pitch patterns: longer/larger objects produce lower pitch. Example: saucepan lids, elastic bands."
    },
    {
      "objective_id": "SC-KS2-O048",
      "domain_id": "SC-KS2-D009",
      "objective_text": "find patterns between the volume of a sound and the strength of the vibrations that produced it",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Sound. Volume/amplitude relationship to vibration strength."
    },
    {
      "objective_id": "SC-KS2-O049",
      "domain_id": "SC-KS2-D009",
      "objective_text": "recognise that sounds get fainter as the distance from the sound source increases",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Sound. Inverse relationship between distance and sound intensity."
    },
    {
      "objective_id": "SC-KS2-O050",
      "domain_id": "SC-KS2-D010",
      "objective_text": "identify common appliances that run on electricity",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Electricity. Contextual awareness of electrical devices in everyday life."
    },
    {
      "objective_id": "SC-KS2-O051",
      "domain_id": "SC-KS2-D010",
      "objective_text": "construct a simple series electrical circuit, identifying and naming its basic parts, including cells, wires, bulbs, switches and buzzers",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Electricity. Practical circuit construction. Components: cells, wires, bulbs, switches, buzzers."
    },
    {
      "objective_id": "SC-KS2-O052",
      "domain_id": "SC-KS2-D010",
      "objective_text": "identify whether or not a lamp will light in a simple series circuit, based on whether or not the lamp is part of a complete loop with a battery",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Electricity. Complete circuit concept — current requires an unbroken loop."
    },
    {
      "objective_id": "SC-KS2-O053",
      "domain_id": "SC-KS2-D010",
      "objective_text": "recognise that a switch opens and closes a circuit and associate this with whether or not a lamp lights in a simple series circuit",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Electricity. Function of switches in completing/breaking circuits."
    },
    {
      "objective_id": "SC-KS2-O054",
      "domain_id": "SC-KS2-D010",
      "objective_text": "recognise some common conductors and insulators, and associate metals with being good conductors",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Electricity. Introduces conductors and insulators. Metals as conductors. Links to Y5 properties of materials."
    },
    {
      "objective_id": "SC-KS2-O055",
      "domain_id": "SC-KS2-D007",
      "objective_text": "describe the differences in the life cycles of a mammal, an amphibian, an insect and a bird",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Living Things and Their Habitats. Comparative study of life cycles across four animal groups."
    },
    {
      "objective_id": "SC-KS2-O056",
      "domain_id": "SC-KS2-D007",
      "objective_text": "describe the life process of reproduction in some plants and animals",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Living Things and Their Habitats. Sexual and asexual reproduction in plants; sexual reproduction in animals."
    },
    {
      "objective_id": "SC-KS2-O057",
      "domain_id": "SC-KS2-D003",
      "objective_text": "describe the changes as humans develop to old age",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Animals including Humans. Full human life span from birth to old age, including puberty. Draws a timeline of growth stages."
    },
    {
      "objective_id": "SC-KS2-O058",
      "domain_id": "SC-KS2-D011",
      "objective_text": "compare and group together everyday materials on the basis of their properties, including their hardness, solubility, transparency, conductivity (electrical and thermal), and response to magnets",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Properties and Changes of Materials. Systematic material properties including solubility and conductivity — links to Y3 magnets and Y4 electricity."
    },
    {
      "objective_id": "SC-KS2-O059",
      "domain_id": "SC-KS2-D011",
      "objective_text": "know that some materials will dissolve in liquid to form a solution, and describe how to recover a substance from a solution",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Properties and Changes of Materials. Introduces dissolving, solutions and recovery (evaporation)."
    },
    {
      "objective_id": "SC-KS2-O060",
      "domain_id": "SC-KS2-D011",
      "objective_text": "use knowledge of solids, liquids and gases to decide how mixtures might be separated, including through filtering, sieving and evaporating",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Properties and Changes of Materials. Separation techniques using states of matter knowledge from Y4."
    },
    {
      "objective_id": "SC-KS2-O061",
      "domain_id": "SC-KS2-D011",
      "objective_text": "give reasons, based on evidence from comparative and fair tests, for the particular uses of everyday materials, including metals, wood and plastic",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Properties and Changes of Materials. Evidence-based reasoning about material selection — extends KS1 material suitability."
    },
    {
      "objective_id": "SC-KS2-O062",
      "domain_id": "SC-KS2-D011",
      "objective_text": "demonstrate that dissolving, mixing and changes of state are reversible changes",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Properties and Changes of Materials. Concept of reversibility in material changes."
    },
    {
      "objective_id": "SC-KS2-O063",
      "domain_id": "SC-KS2-D011",
      "objective_text": "explain that some changes result in the formation of new materials, and that this kind of change is not usually reversible, including changes associated with burning and the action of acid on bicarbonate of soda",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Properties and Changes of Materials. Irreversible chemical changes — burning, acid reactions. Contrasts with reversible changes."
    },
    {
      "objective_id": "SC-KS2-O064",
      "domain_id": "SC-KS2-D012",
      "objective_text": "describe the movement of the Earth, and other planets, relative to the Sun in the solar system",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Earth and Space. Heliocentric model of solar system. Eight planets named."
    },
    {
      "objective_id": "SC-KS2-O065",
      "domain_id": "SC-KS2-D012",
      "objective_text": "describe the movement of the Moon relative to the Earth",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Earth and Space. Moon as Earth's natural satellite — orbital relationship."
    },
    {
      "objective_id": "SC-KS2-O066",
      "domain_id": "SC-KS2-D012",
      "objective_text": "describe the Sun, Earth and Moon as approximately spherical bodies",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Earth and Space. Shape of celestial bodies — approximately spherical (not flat)."
    },
    {
      "objective_id": "SC-KS2-O067",
      "domain_id": "SC-KS2-D012",
      "objective_text": "use the idea of the Earth's rotation to explain day and night and the apparent movement of the sun across the sky",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Earth and Space. Earth's 24-hour rotation explains day/night cycle and apparent solar movement. Links to KS1 day length variation."
    },
    {
      "objective_id": "SC-KS2-O068",
      "domain_id": "SC-KS2-D013",
      "objective_text": "explain that unsupported objects fall towards the Earth because of the force of gravity acting between the Earth and the falling object",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Forces. Introduces gravity as a non-contact force acting between Earth and objects."
    },
    {
      "objective_id": "SC-KS2-O069",
      "domain_id": "SC-KS2-D013",
      "objective_text": "identify the effects of air resistance, water resistance and friction, that act between moving surfaces",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Forces. Resistance forces opposing motion. Builds on Y3 friction observations."
    },
    {
      "objective_id": "SC-KS2-O070",
      "domain_id": "SC-KS2-D013",
      "objective_text": "recognise that some mechanisms, including levers, pulleys and gears, allow a smaller force to have a greater effect",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Forces. Simple machines as force multipliers — levers, pulleys, gears."
    },
    {
      "objective_id": "SC-KS2-O071",
      "domain_id": "SC-KS2-D007",
      "objective_text": "describe how living things are classified into broad groups according to common observable characteristics and based on similarities and differences, including micro-organisms, plants and animals",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Living Things and Their Habitats. Formal classification system — micro-organisms, plants, animals; vertebrates and invertebrates."
    },
    {
      "objective_id": "SC-KS2-O072",
      "domain_id": "SC-KS2-D007",
      "objective_text": "give reasons for classifying plants and animals based on specific characteristics",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Living Things and Their Habitats. Justifying classification decisions using evidence of shared characteristics."
    },
    {
      "objective_id": "SC-KS2-O073",
      "domain_id": "SC-KS2-D003",
      "objective_text": "identify and name the main parts of the human circulatory system, and describe the functions of the heart, blood vessels and blood",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Animals including Humans. Circulatory system: heart, arteries, veins, capillaries, blood. Functions of each component."
    },
    {
      "objective_id": "SC-KS2-O074",
      "domain_id": "SC-KS2-D003",
      "objective_text": "recognise the impact of diet, exercise, drugs and lifestyle on the way their bodies function",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Animals including Humans. Extends KS1 health knowledge to include drugs and fuller lifestyle factors."
    },
    {
      "objective_id": "SC-KS2-O075",
      "domain_id": "SC-KS2-D003",
      "objective_text": "describe the ways in which nutrients and water are transported within animals, including humans",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Animals including Humans. Circulatory system as transport system for nutrients and water. Links digestive and circulatory systems."
    },
    {
      "objective_id": "SC-KS2-O076",
      "domain_id": "SC-KS2-D014",
      "objective_text": "recognise that living things have changed over time and that fossils provide information about living things that inhabited the Earth millions of years ago",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Evolution and Inheritance. Fossils as evidence of change over time. Builds on Y3 fossil formation."
    },
    {
      "objective_id": "SC-KS2-O077",
      "domain_id": "SC-KS2-D014",
      "objective_text": "recognise that living things produce offspring of the same kind, but normally offspring vary and are not identical to their parents",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Evolution and Inheritance. Introduces variation in offspring. Foundation for understanding natural selection. Note: genes/chromosomes not required at this stage."
    },
    {
      "objective_id": "SC-KS2-O078",
      "domain_id": "SC-KS2-D014",
      "objective_text": "identify how animals and plants are adapted to suit their environment in different ways and that adaptation may lead to evolution",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Evolution and Inheritance. Adaptation and evolution concept. Examples: giraffe necks, arctic fox fur."
    },
    {
      "objective_id": "SC-KS2-O079",
      "domain_id": "SC-KS2-D005",
      "objective_text": "recognise that light appears to travel in straight lines",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Light. Explanatory model — light travels in straight lines. Builds on Y3 observable light phenomena."
    },
    {
      "objective_id": "SC-KS2-O080",
      "domain_id": "SC-KS2-D005",
      "objective_text": "use the idea that light travels in straight lines to explain that objects are seen because they give out or reflect light into the eye",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Light. Applying the straight-line model to explain vision — distinguishes light sources from reflectors."
    },
    {
      "objective_id": "SC-KS2-O081",
      "domain_id": "SC-KS2-D005",
      "objective_text": "explain that we see things because light travels from light sources to our eyes or from light sources to objects and then to our eyes",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Light. Full model of vision: direct light sources and reflected light from objects."
    },
    {
      "objective_id": "SC-KS2-O082",
      "domain_id": "SC-KS2-D005",
      "objective_text": "use the idea that light travels in straight lines to explain why shadows have the same shape as the objects that cast them",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Light. Explains shadow shape using straight-line light model. Builds on Y3 shadow observations."
    },
    {
      "objective_id": "SC-KS2-O083",
      "domain_id": "SC-KS2-D010",
      "objective_text": "associate the brightness of a lamp or the volume of a buzzer with the number and voltage of cells used in the circuit",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Electricity. Introduces voltage concept as affecting component output."
    },
    {
      "objective_id": "SC-KS2-O084",
      "domain_id": "SC-KS2-D010",
      "objective_text": "compare and give reasons for variations in how components function, including the brightness of bulbs, the loudness of buzzers and the on/off position of switches",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Electricity. Systematic investigation of circuit components. Explaining variations in component behaviour."
    },
    {
      "objective_id": "SC-KS2-O085",
      "domain_id": "SC-KS2-D010",
      "objective_text": "use recognised symbols when representing a simple circuit in a diagram",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Electricity. Formal circuit diagrams with standard symbols — introduced here after pictorial representation in Y4."
    }
  ],
  "concepts": [
    {
      "concept_id": "SC-KS2-C001",
      "domain_id": "SC-KS2-D001",
      "concept_name": "Relevant Questioning and Enquiry Selection",
      "description": "The ability to ask relevant scientific questions and select the most appropriate type of scientific enquiry to answer them (observation over time, pattern seeking, classifying, fair testing, secondary research). Develops from KS1 simple questioning to active enquiry design.",
      "concept_type": "process",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "year": [
        3,
        4
      ],
      "teaching_guidance": "Introduce the five types of scientific enquiry explicitly: observation over time, pattern seeking, classifying and grouping, comparative and fair testing, and researching using secondary sources. Present pupils with a question and ask them to decide which type of enquiry would best answer it. Use a 'question sorter' display where pupils categorise questions by enquiry type. Model asking relevant questions by connecting to the content being studied — for example, during a rocks topic ask 'Which rock is the most permeable?' (fair test) versus 'How are fossils formed?' (secondary research).",
      "key_vocabulary": "enquiry, investigate, fair test, comparative test, observation over time, pattern seeking, classify, secondary source, relevant, variable, method, question",
      "common_misconceptions": "Pupils often believe that all scientific questions must be answered by carrying out an experiment. They need explicit teaching that observation over time, classification, pattern seeking and secondary research are equally valid enquiry types. Some pupils confuse 'relevant' questions with 'interesting' questions — relevant questions are those that can be investigated scientifically.",
      "teaching_weight": 3,
      "co_teach_hints": [
        "SC-KS2-C002",
        "SC-KS2-C004",
        "SC-KS2-C006",
        "SC-KS2-C009"
      ]
    },
    {
      "concept_id": "SC-KS2-C002",
      "domain_id": "SC-KS2-D001",
      "concept_name": "Fair and Comparative Testing",
      "description": "Setting up simple practical enquiries as fair tests, recognising and controlling variables. Understanding that a fair test changes only one variable at a time while keeping others constant, enabling valid comparisons.",
      "concept_type": "process",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "year": [
        3,
        4
      ],
      "teaching_guidance": "Begin with comparative tests (e.g., 'Which surface does the car travel furthest on?') before introducing fair tests with controlled variables. Use a planning framework that explicitly asks: 'What will I change? What will I measure? What will I keep the same?' Provide practical contexts such as testing which paper towel is most absorbent or which material is best for insulating a cup of warm water. Encourage pupils to predict outcomes before testing and to explain why the test must be fair to get reliable results.",
      "key_vocabulary": "fair test, comparative test, variable, change, measure, keep the same, control, predict, result, reliable, method, equipment",
      "common_misconceptions": "Pupils frequently change more than one variable at a time without recognising this invalidates the comparison. Some pupils believe that a test is 'fair' simply because everyone in the group gets a turn, rather than understanding it as controlling variables. Pupils may also confuse prediction with guessing — a prediction should be based on existing knowledge or prior observations.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C003",
      "domain_id": "SC-KS2-D001",
      "concept_name": "Systematic Measurement with Standard Units",
      "description": "Making systematic and careful observations using standard units (e.g., degrees Celsius, metres, grams). Using a range of equipment including thermometers and data loggers. Increasing accuracy over Lower KS2.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "year": [
        3,
        4
      ],
      "teaching_guidance": "Teach pupils to select appropriate equipment for the measurement being taken — rulers for length, thermometers for temperature, measuring cylinders for liquid volume, balances for mass. Practise reading scales with different intervals (ones, twos, fives, tens). Introduce data loggers for temperature and light investigations, demonstrating how they capture readings automatically over time. Link measurement to maths by reinforcing standard units (cm, m, g, kg, ml, l, °C) and by practising estimation before measuring.",
      "key_vocabulary": "measure, standard unit, centimetre, metre, gram, kilogram, millilitre, litre, degrees Celsius, thermometer, data logger, accurate, systematic, scale, interval, reading",
      "common_misconceptions": "Pupils commonly misread scales by counting lines rather than intervals, leading to systematic errors. Some pupils believe that digital instruments are always more accurate than analogue ones. Children may not understand that reading a thermometer requires waiting for the liquid to stop moving before recording the value.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C004",
      "domain_id": "SC-KS2-D001",
      "concept_name": "Data Classification and Presentation",
      "description": "Gathering, recording, classifying and presenting data in a variety of ways: simple scientific language, labelled diagrams, classification keys, bar charts, and tables. Moving from recording towards analytical presentation.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "year": [
        3,
        4
      ],
      "teaching_guidance": "Teach each data presentation format explicitly: tables with headings and units, bar charts with labelled axes, and classification keys. Use sorting and grouping activities with real specimens (leaves, rocks, minibeasts) before introducing branching databases or keys. Model how to construct a bar chart step by step — choosing a scale, labelling axes, drawing bars accurately. Encourage pupils to select the most appropriate format for their data type (categories → bar chart, yes/no questions → classification key).",
      "key_vocabulary": "table, bar chart, axis, label, scale, tally, key, classification key, data, record, present, category, diagram, heading, unit",
      "common_misconceptions": "Pupils often confuse bar charts with pictograms or line graphs and may draw bars that do not start from the baseline. Some pupils think a table is simply writing numbers in any arrangement — they need to understand that tables have clear headings, units and consistent formatting. Children may also believe that more elaborate presentation (colour, decoration) makes data 'better'.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C005",
      "domain_id": "SC-KS2-D001",
      "concept_name": "Drawing Conclusions and Predictions",
      "description": "Using results to draw simple conclusions, make predictions for new values, suggest improvements and raise further questions. Iterative development of scientific understanding through evidence-based reasoning.",
      "concept_type": "process",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "year": [
        3,
        4
      ],
      "teaching_guidance": "Scaffold conclusion-writing with sentence starters: 'Our results show that...', 'This happened because...', 'If we changed X, I predict that...' Teach the difference between describing results (what happened) and explaining them (why it happened). Introduce prediction for new values by asking pupils to extend patterns — for example, 'If we tested a fourth surface, what do you think would happen based on our results?' Encourage pupils to identify when results are unexpected and to suggest reasons or further tests.",
      "key_vocabulary": "conclusion, result, evidence, prediction, pattern, explain, because, support, suggest, further question, improve, unexpected, reason",
      "common_misconceptions": "Pupils often restate their prediction as their conclusion regardless of what the data actually shows. They may confuse correlation with causation — for example, concluding that one thing caused another simply because they occurred together. Some pupils think that if their prediction was wrong, the investigation has 'failed', rather than understanding that disconfirming evidence is equally valuable in science.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C006",
      "domain_id": "SC-KS2-D001",
      "concept_name": "Scientific Reporting and Communication",
      "description": "Reporting on findings from enquiries through oral and written explanations, displays and presentations. Using scientific language and illustrations to communicate findings to different audiences.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "year": [
        3,
        4
      ],
      "teaching_guidance": "Provide opportunities for both oral and written reporting. Use 'science conferences' where groups present findings to the class, encouraging questions from the audience. Teach the structure of a scientific report: question, method, results, conclusion. Model the use of scientific vocabulary in explanations and provide word banks. Encourage pupils to use labelled diagrams and data displays as part of their communication, not just written prose.",
      "key_vocabulary": "report, findings, present, explain, scientific language, diagram, display, audience, evidence, method, results, conclusion, communicate",
      "common_misconceptions": "Pupils often think that writing more equals better science communication. They need to understand that clarity and precision matter more than length. Some pupils believe that scientific reports should only contain text, not realising that diagrams, tables and charts are essential components of scientific communication.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C007",
      "domain_id": "SC-KS2-D001",
      "concept_name": "Variable Control in Enquiry Planning",
      "description": "Planning scientific enquiries by recognising and controlling variables where necessary. Understanding which variables to keep constant, which to change, and which to measure. Required for valid experimental design.",
      "concept_type": "process",
      "complexity_level": 4,
      "is_cross_cutting": true,
      "year": [
        5,
        6
      ],
      "teaching_guidance": "Use a structured planning template that requires pupils to explicitly name the independent variable (what I will change), the dependent variable (what I will measure), and the control variables (what I will keep the same). Provide practice in identifying variables across different contexts before asking pupils to plan independently. Use 'spot the error' activities where pupils critique a flawed investigation plan and identify uncontrolled variables. Connect variable control to the concept of reliability — explaining why uncontrolled variables make results untrustworthy.",
      "key_vocabulary": "independent variable, dependent variable, control variable, plan, enquiry, method, reliable, valid, change, measure, keep the same, systematic, accuracy, precision",
      "common_misconceptions": "Pupils often confuse the independent and dependent variables, or believe that 'keeping things the same' refers to getting the same results rather than controlling conditions. Some pupils think that controlling variables means nothing should change at all, not understanding that the independent variable must be deliberately changed. Upper KS2 pupils may struggle to identify hidden variables that they have not considered.",
      "teaching_weight": 4,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C008",
      "domain_id": "SC-KS2-D001",
      "concept_name": "Precision and Repeat Measurements",
      "description": "Taking measurements with increasing accuracy and precision using a range of scientific equipment. Understanding the value of repeat readings to improve reliability and identify anomalies.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": true,
      "year": [
        5,
        6
      ],
      "teaching_guidance": "Demonstrate the importance of repeat measurements by having different groups measure the same thing and comparing their results. Discuss why readings differ and how taking multiple measurements and calculating a mean improves reliability. Teach pupils to identify and discard anomalous results before calculating averages. Use contexts where precision matters — such as measuring the time for a pendulum swing or the distance a ball rolls — to motivate the need for careful, repeated measurement.",
      "key_vocabulary": "precision, accuracy, repeat, reliable, anomaly, mean, average, measurement, reading, consistent, error, equipment, range, unit",
      "common_misconceptions": "Pupils often confuse accuracy (closeness to the true value) with precision (consistency of repeat readings). Some pupils believe that taking more decimal places automatically makes a measurement more precise. Children may think that if their result differs from a classmate's, one of them must be 'wrong', rather than understanding natural variation in measurement.",
      "teaching_weight": 4,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C009",
      "domain_id": "SC-KS2-D001",
      "concept_name": "Complex Data Recording",
      "description": "Recording data and results of increasing complexity using scatter graphs, line graphs, bar charts, classification keys, tables and scientific diagrams. Selecting the most appropriate representation for different types of data.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": true,
      "year": [
        5,
        6
      ],
      "teaching_guidance": "Introduce scatter graphs and line graphs as tools for continuous data, distinguishing them from bar charts used for categorical data. Teach pupils to plot points accurately and, where appropriate, draw lines of best fit. Provide opportunities to select the most suitable graph type for different investigations. Use ICT tools (spreadsheets, graphing software) alongside hand-drawn graphs. Model how to read information from graphs, including interpolating between data points and identifying trends.",
      "key_vocabulary": "scatter graph, line graph, bar chart, axis, scale, plot, data point, trend, line of best fit, classification key, table, continuous, categorical, interpret",
      "common_misconceptions": "Pupils often join scatter graph points dot-to-dot rather than drawing a line of best fit. They may confuse line graphs (for continuous data) with bar charts (for categorical data), using the wrong type for their data. Some pupils believe that a graph must always go through the origin (0,0), not understanding that this depends on the data.",
      "teaching_weight": 4,
      "co_teach_hints": [
        "SC-KS2-C001",
        "SC-KS2-C003",
        "SC-KS2-C004",
        "SC-KS2-C006",
        "SC-KS2-C010"
      ]
    },
    {
      "concept_id": "SC-KS2-C010",
      "domain_id": "SC-KS2-D001",
      "concept_name": "Causal Relationships and Evidence Evaluation",
      "description": "Identifying causal relationships in data. Evaluating degree of trust in results. Identifying scientific evidence that supports or refutes ideas and arguments. Distinguishing opinion from fact in secondary sources.",
      "concept_type": "process",
      "complexity_level": 4,
      "is_cross_cutting": true,
      "year": [
        5,
        6
      ],
      "teaching_guidance": "Use investigations with clear causal links (e.g., increasing temperature speeds up dissolving) to model the difference between correlation and causation. Teach pupils to evaluate the trustworthiness of results by considering sample size, whether variables were controlled, and whether results are repeatable. Introduce the idea that scientific claims require evidence by examining real examples of scientific debate. Use newspaper or media science claims as stimuli for critical evaluation, asking 'What is the evidence? Is it strong enough?'",
      "key_vocabulary": "cause, effect, causal, correlation, evidence, evaluate, trust, reliable, secondary source, opinion, fact, argument, support, refute, scientific claim",
      "common_misconceptions": "Pupils commonly assume that correlation implies causation — for example, that because ice cream sales and sunburn both increase in summer, ice cream causes sunburn. They may also believe that a single investigation provides definitive proof, rather than understanding that scientific conclusions become stronger with repeated, independent evidence. Some pupils struggle to distinguish between scientific evidence and personal opinion.",
      "teaching_weight": 4,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C011",
      "domain_id": "SC-KS2-D002",
      "concept_name": "Plant Part Functions",
      "description": "Understanding that different parts of flowering plants have specific functions: roots (anchorage and water/nutrient uptake), stems/trunks (support and water transport), leaves (photosynthesis and gas exchange), flowers (reproduction). Structure-function relationship.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        3
      ],
      "teaching_guidance": "Investigate root function by growing plants in transparent containers so pupils observe root growth. Demonstrate water transport by placing white carnations or celery in coloured water and observing colour change in petals or leaves over 24 hours. Use leaf rubbings and close observation with hand lenses to explore leaf structure. Dissect flowers to connect flower parts to their reproductive function. Create annotated diagrams linking each plant part to its role: roots absorb water and anchor; stems transport water and support; leaves make food using light; flowers enable reproduction.",
      "key_vocabulary": "root, stem, leaf, flower, absorb, anchor, transport, support, photosynthesis, nutrition, reproduction, petal, stamen, carpel, pollen, function",
      "common_misconceptions": "Pupils often think that roots only absorb water, not realising they also anchor the plant and absorb dissolved minerals. Many children believe that plants get their food from the soil rather than making it in their leaves through photosynthesis. Some pupils think all flowers are decorative and do not understand their essential reproductive function.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C012",
      "domain_id": "SC-KS2-D002",
      "concept_name": "Plant Requirements for Life and Growth",
      "description": "Understanding that plants need air, light, water, nutrients from soil, and room to grow. These requirements vary between plant species. Plants can make their own food (photosynthesis concept introduced without detailed mechanism).",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        3
      ],
      "teaching_guidance": "Set up controlled investigations where plants are deprived of one requirement at a time — one group with no light, one with no water, one in a cold environment — while a control plant receives all requirements. Record observations over two to three weeks using a consistent observation schedule. Introduce the concept that plants make their own food using light (photosynthesis) without requiring the detailed mechanism. Compare plant nutrition with animal nutrition — plants make food, animals must eat. Discuss why different plants may need different amounts of light or water.",
      "key_vocabulary": "light, water, air, nutrients, soil, temperature, photosynthesis, food, grow, healthy, survive, requirements, conditions, minerals, carbon dioxide",
      "common_misconceptions": "The most persistent misconception is that plants get their food from the soil. Plants make their own food through photosynthesis — they absorb water and minerals from the soil but these are raw materials, not food. Some children think plants only need sunlight and water, forgetting that air (carbon dioxide) is also essential. Children may believe that fertiliser is plant food rather than a mineral supplement.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C013",
      "domain_id": "SC-KS2-D002",
      "concept_name": "Water Transport in Plants",
      "description": "Understanding that water is transported upward within plants through the stem to leaves and flowers. Observable through the coloured carnation investigation. Links root function to water availability and stem function to transport.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        3
      ],
      "teaching_guidance": "Conduct the classic coloured water investigation: place white carnations or celery sticks in water with food colouring and observe the results after several hours. Cut celery stalks crosswise to reveal the coloured transport vessels. Use magnifying glasses to examine the tiny tubes visible in cut stems. Connect this observation to the function of roots (absorbing water) and stems (transporting it upward). Discuss why plants wilt when they lack water — the transport system has nothing to carry.",
      "key_vocabulary": "transport, water, stem, root, absorb, vessel, tube, upward, wilt, leaf, flower, nutrients, dissolved, minerals",
      "common_misconceptions": "Pupils often think water travels through the centre of the stem rather than through specialised tubes (xylem vessels) near the outside. Some children believe the plant 'sucks' water up like a straw, rather than understanding that water is drawn up by evaporation from the leaves (transpiration pull). Children may not connect wilting to water transport failure.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C014",
      "domain_id": "SC-KS2-D002",
      "concept_name": "Flowering Plant Life Cycle",
      "description": "Understanding the complete life cycle of flowering plants: germination, growth, pollination, seed formation, seed dispersal, and back to germination. Understanding the role of flowers in reproduction and the variety of seed dispersal mechanisms.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        3
      ],
      "teaching_guidance": "Create a life cycle diagram as a circular flow chart, emphasising that it is a continuous cycle. Grow fast-cycling plants such as rapid-cycling brassicas (Wisconsin Fast Plants) that complete their life cycle in 35-40 days, allowing pupils to observe every stage. Dissect mature flowers to observe pollen and ovules. Collect seed heads and fruits to examine dispersal structures. Use time-lapse videos to show stages that are too slow to observe in real time. Compare the flowering plant life cycle with animal life cycles studied later.",
      "key_vocabulary": "life cycle, germination, growth, pollination, fertilisation, seed formation, seed dispersal, flower, fruit, pollen, ovule, reproduce, mature, cycle",
      "common_misconceptions": "Children often think of a life cycle as linear (seed → plant → death) rather than circular. Some pupils believe all plants grow from seeds, not recognising that bulbs, tubers and runners are also starting points. Children may confuse pollination (transfer of pollen) with fertilisation (fusion of male and female cells) or use the terms interchangeably.",
      "teaching_weight": 4,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C015",
      "domain_id": "SC-KS2-D002",
      "concept_name": "Pollination",
      "description": "Understanding that pollination is the transfer of pollen between flowers, enabling seed formation. Part of the flowering plant reproductive cycle. Includes wind and insect pollination.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        3
      ],
      "teaching_guidance": "Examine flowers with hand lenses to identify the pollen-producing stamens and the pollen-receiving stigma. Compare insect-pollinated flowers (bright petals, scent, nectar, sticky pollen) with wind-pollinated flowers (small petals or none, large amounts of light pollen, feathery stigmas). Observe bees visiting flowers in the school garden if possible, discussing how pollen is transferred on their bodies. Use role-play or models to demonstrate pollen transfer between flowers. Link pollination to fruit and seed formation as the next stage in the plant life cycle.",
      "key_vocabulary": "pollination, pollen, stamen, stigma, anther, insect pollination, wind pollination, nectar, transfer, flower, bee, reproduce, fertilisation",
      "common_misconceptions": "Children often confuse pollination with seed dispersal or think pollination is the same as fertilisation. Some pupils believe bees deliberately collect pollen to help plants, rather than understanding that pollination is an incidental consequence of bees feeding on nectar. Children may think that all flowers are insect-pollinated, not recognising wind pollination in grasses and many trees.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C016",
      "domain_id": "SC-KS2-D002",
      "concept_name": "Seed Dispersal",
      "description": "Understanding that seeds are dispersed from parent plants by various mechanisms including wind, water, animals (internally and externally) and explosive mechanisms. Structure of fruits relates to dispersal method.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        3
      ],
      "teaching_guidance": "Collect a variety of seeds and fruits and challenge pupils to identify their dispersal mechanism by examining their structures. Examples: dandelion (wind — parachute), sycamore (wind — helicopter), burdock (animal — hooks), cherry (animal — eaten), coconut (water — floats), pea pod (explosive — springs open). Design and make seed dispersal models (paper helicopters, parachutes) and test which designs travel furthest. Discuss why dispersal away from the parent plant is advantageous — reduced competition for light, water and space.",
      "key_vocabulary": "seed dispersal, wind, water, animal, explosive, parachute, hook, fruit, scatter, spread, structure, mechanism, advantage, competition, germination",
      "common_misconceptions": "Children often think fruits are only the sweet edible items found in supermarkets. In biology, a fruit is any structure that contains seeds — including sycamore wings, conkers and pea pods. Some pupils believe seeds need to land on soil to grow, rather than understanding that seeds can germinate in many substrates if conditions are right. Children may not understand why dispersal is beneficial, thinking it would be better for seeds to stay near the parent plant.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C017",
      "domain_id": "SC-KS2-D003",
      "concept_name": "Animal Nutrition",
      "description": "Understanding that animals, including humans, require the right types and amounts of nutrition and cannot make their own food — they obtain nutrition from what they eat. Contrasts with plants which can make their own food.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        3
      ],
      "teaching_guidance": "Explore the concept that animals, unlike plants, cannot make their own food and must eat other organisms. Classify foods into food groups (carbohydrates, proteins, fats, vitamins, minerals, fibre, water) and discuss the role of each in the body. Compare the diets of different animals and relate diet to body structure and habitat. Use food packaging labels to identify nutrients. Emphasise the contrast with plants — animals are consumers, plants are producers. Link to the concept of a balanced diet and why variety matters for health.",
      "key_vocabulary": "nutrition, nutrient, carbohydrate, protein, fat, vitamin, mineral, fibre, balanced diet, food group, energy, consumer, producer, diet, health",
      "common_misconceptions": "Pupils often think 'nutrition' means only eating healthy food, rather than understanding it as the process of obtaining the substances needed for growth and energy. Some children believe that fat and carbohydrates are always 'bad' rather than essential in appropriate amounts. Children may not understand the fundamental difference between plant and animal nutrition — that plants make their food while animals must consume it.",
      "teaching_weight": 3,
      "co_teach_hints": [
        "SC-KS2-C032",
        "SC-KS2-C033",
        "SC-KS2-C046",
        "SC-KS2-C060",
        "SC-KS2-C061",
        "SC-KS2-C062"
      ]
    },
    {
      "concept_id": "SC-KS2-C018",
      "domain_id": "SC-KS2-D003",
      "concept_name": "Skeletal and Muscular Systems",
      "description": "Understanding that humans and some other animals have skeletons for support, protection and movement. Muscles are attached to bones and enable movement by contracting and relaxing. Different body parts have different skeletal structures suited to their functions.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        3
      ],
      "teaching_guidance": "Use life-sized skeleton models or posters to identify major bones: skull, ribs, spine, pelvis, femur, humerus. Ask pupils to feel their own bones through their skin to connect the model to their bodies. Demonstrate how joints allow movement by comparing hinge joints (elbow, knee) with ball-and-socket joints (shoulder, hip). Use elastic bands attached to cardboard tubes to model how muscles pull on bones — showing that muscles can only pull (contract), not push. Investigate which animals have endoskeletons, exoskeletons, or no skeleton, and discuss the advantages of each.",
      "key_vocabulary": "skeleton, bone, muscle, joint, skull, ribs, spine, pelvis, femur, support, protect, movement, contract, relax, endoskeleton, exoskeleton, hinge, ball-and-socket",
      "common_misconceptions": "Children commonly think muscles both push and pull — in reality, muscles can only contract (pull) and work in antagonistic pairs to produce movement in both directions. Some pupils believe the skeleton is a dead, rigid structure rather than living tissue that grows and repairs. Children may not realise that some animals (insects, crabs) have their skeleton on the outside (exoskeleton) and that some animals (worms, jellyfish) have no skeleton at all.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C019",
      "domain_id": "SC-KS2-D004",
      "concept_name": "Rock Classification",
      "description": "Understanding that rocks can be grouped and compared based on appearance and physical properties such as grain size, crystal structure, hardness, porosity, and whether they contain fossils. Examples: igneous, sedimentary, metamorphic (informal introduction).",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        3
      ],
      "teaching_guidance": "Provide a collection of rock samples for hands-on investigation. Test rocks for hardness (scratch test), permeability (water drop test), appearance (crystal/grain examination with hand lens), and reaction to acid (vinegar test for limestone). Use the tests to group rocks rather than simply memorising names. Introduce the three rock types informally: rocks formed from cooled magma (igneous, e.g., granite, basalt), rocks formed from compressed layers (sedimentary, e.g., sandstone, chalk, limestone), and rocks changed by heat and pressure (metamorphic, e.g., marble, slate). Link to local geology where possible.",
      "key_vocabulary": "rock, mineral, grain, crystal, hard, soft, permeable, sedimentary, igneous, metamorphic, limestone, sandstone, granite, chalk, slate, marble, fossil, appearance, property",
      "common_misconceptions": "Children often think all rocks are hard and heavy — pumice floats on water, chalk crumbles easily. Some pupils believe rocks are unchanging and permanent, not understanding that rocks are slowly broken down by weathering and reformed over geological time. Children may confuse rocks with minerals, or think that 'sedimentary' means the rock contains mud rather than understanding the process of layers being compressed.",
      "teaching_weight": 3,
      "co_teach_hints": [
        "SC-KS2-C021"
      ]
    },
    {
      "concept_id": "SC-KS2-C020",
      "domain_id": "SC-KS2-D004",
      "concept_name": "Fossil Formation",
      "description": "Understanding in simple terms how fossils are formed when the remains or traces of living things are trapped within sedimentary rock over millions of years. Fossils provide evidence of past life on Earth.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        3
      ],
      "teaching_guidance": "Use a layered modelling activity to demonstrate fossil formation: press plastic animals or shells into soft clay or plaster of Paris, then layer 'sediment' on top. Discuss the timescale — millions of years — and why only hard parts (bones, shells, teeth) typically fossilise. Examine real or replica fossils and ask pupils to identify which living things they came from. Discuss Mary Anning's contributions to palaeontology as a historical case study. Link fossil evidence to the concept that Earth has changed over time and that organisms that lived long ago may differ from those alive today.",
      "key_vocabulary": "fossil, remains, sediment, sedimentary rock, preserved, impression, millions of years, palaeontologist, evidence, extinct, organism, shell, bone, trace, decay",
      "common_misconceptions": "Children often think fossils are the actual bones of the animal rather than mineralised replacements or impressions in rock. Some pupils believe dinosaur bones are found complete and assembled, rather than as scattered fragments requiring reconstruction. Children may not grasp the immense timescales involved — they tend to underestimate geological time by orders of magnitude.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C021",
      "domain_id": "SC-KS2-D004",
      "concept_name": "Soil Composition",
      "description": "Understanding that soils are made from rock particles (formed by weathering) and organic matter (decayed living material). Different soils have different properties depending on their rock and organic matter composition.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        3
      ],
      "teaching_guidance": "Collect soil samples from different locations around the school grounds and compare them. Shake soil in water to separate layers — gravel sinks first, then sand, then silt, with organic material floating. Use hand lenses to examine soil closely and identify fragments of rock, decayed leaves, roots and small organisms. Discuss how soil forms from the breakdown of rocks (physical and chemical weathering) combined with decomposed plant and animal material. Connect to the rock cycle and the role of living organisms (earthworms, fungi, bacteria) in soil formation.",
      "key_vocabulary": "soil, rock, particle, sand, silt, clay, organic matter, humus, weathering, decompose, earthworm, mineral, erosion, fertile, layer, compost",
      "common_misconceptions": "Children often think soil is just 'dirt' with no particular composition or structure. Some pupils believe soil has always existed and do not connect it to the breakdown of rocks. Children may not realise that soil contains living organisms — bacteria, fungi, worms — that are essential for its formation and fertility. Some pupils think all soils are the same, not recognising that different soils have different properties.",
      "teaching_weight": 3,
      "co_teach_hints": [
        "SC-KS2-C019",
        "SC-KS2-C020"
      ]
    },
    {
      "concept_id": "SC-KS2-C022",
      "domain_id": "SC-KS2-D005",
      "concept_name": "Light and Vision",
      "description": "Understanding that light is needed to see — dark is the absence of light. In Year 3, this is the observable phenomenon; in Year 6, it is explained using the model that light travels in straight lines from sources to eyes or via reflection.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        3
      ],
      "teaching_guidance": "Create a dark den or use a blacked-out area to explore the concept that we need light to see. Demonstrate that in complete darkness we cannot see at all — dark is the absence of light, not a substance. Introduce the idea that we see objects because light from a source reaches our eyes — either directly from a light source (sun, lamp, candle) or after reflecting off objects. Discuss sun safety: never look directly at the sun. Compare objects that produce their own light (luminous — sun, torch, candle) with those that reflect light (non-luminous — moon, most objects).",
      "key_vocabulary": "light, dark, light source, luminous, reflect, shadow, see, eye, torch, candle, sun, absence, visible, darkness, bright, dim",
      "common_misconceptions": "The most common misconception is that we can see in complete darkness if we 'wait long enough for our eyes to adjust'. In complete darkness (no light at all), we cannot see anything. Children often believe the Moon produces its own light — it reflects sunlight. Some pupils think darkness is a substance that can be 'pushed away' by light, rather than understanding darkness as the absence of light.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C023",
      "domain_id": "SC-KS2-D005",
      "concept_name": "Reflection of Light",
      "description": "Understanding that light is reflected from surfaces, including mirrors and other reflective materials. In Year 3 this is observed; in Year 6 it is explained using the straight-line travel model.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        3
      ],
      "teaching_guidance": "Investigate reflection using mirrors, torches and darkened rooms. Show that shiny, smooth surfaces (mirrors, foil, still water) reflect light well, while rough or dark surfaces reflect less light. Use mirrors to redirect a torch beam around obstacles. Introduce the idea that we see most objects because light bounces off them into our eyes — even non-shiny objects reflect some light. Compare reflections in flat mirrors (clear image) with curved mirrors (distorted image). Connect to everyday applications: bicycle reflectors, reflective clothing, cat's eyes on roads.",
      "key_vocabulary": "reflect, reflection, mirror, surface, shiny, smooth, light, bounce, torch, image, beam, direction, reflective, visible, angle",
      "common_misconceptions": "Children often think that only shiny objects like mirrors reflect light. In fact, all visible objects reflect some light — that is how we see them. Some pupils believe that light only comes from very bright sources and do not recognise that a candle or even a glow-worm is a light source. Children may think reflection only occurs in mirrors, not understanding that water, polished floors and even walls reflect light.",
      "teaching_weight": 3,
      "co_teach_hints": [
        "SC-KS2-C022",
        "SC-KS2-C024",
        "SC-KS2-C067"
      ]
    },
    {
      "concept_id": "SC-KS2-C024",
      "domain_id": "SC-KS2-D005",
      "concept_name": "Shadow Formation",
      "description": "Understanding that shadows are formed when light from a source is blocked by an opaque object. In Year 3, the pattern of shadow size changes is explored. In Year 6, shadow shape is explained using the straight-line travel model.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        3,
        6
      ],
      "teaching_guidance": "Investigate shadows using torches and opaque objects in a darkened area. Explore how shadow size changes with the distance between the light source and the object — closer to the light makes a larger shadow, closer to the screen makes a smaller shadow. Investigate how shadow shape relates to the shape of the object. Classify materials as opaque (blocks all light, creates shadow), translucent (lets some light through, creates faint shadow) or transparent (lets most light through, no shadow). In Year 6, revisit shadows and explain their sharp edges using the model that light travels in straight lines.",
      "key_vocabulary": "shadow, opaque, translucent, transparent, light source, block, screen, shape, size, dark, bright, edge, outline, torch, distance",
      "common_misconceptions": "Children often think shadows have colour or are reflections of objects rather than areas where light has been blocked. Some pupils believe shadows are always the same size as the object, not understanding how distance from the light source affects shadow size. Children may think transparent objects have no effect on light at all, when in fact they can refract (bend) light passing through them.",
      "teaching_weight": 3,
      "co_teach_hints": [
        "SC-KS2-C067"
      ]
    },
    {
      "concept_id": "SC-KS2-C025",
      "domain_id": "SC-KS2-D006",
      "concept_name": "Contact and Non-Contact Forces",
      "description": "Understanding that most forces require direct contact between objects (e.g., pushing, pulling, friction) but some forces, notably magnetic forces and gravity, can act at a distance without direct contact.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        3
      ],
      "teaching_guidance": "Explore contact forces through practical activities: pushing and pulling objects, observing friction between surfaces, and feeling the resistance of water when moving objects through it. Introduce non-contact forces using magnets (attraction and repulsion without touching) and dropping objects (gravity pulls without touching). Create a two-column sorting activity: 'forces that need touching' versus 'forces that act at a distance'. Use force arrows to represent the direction of forces on simple diagrams. Discuss everyday examples of both types.",
      "key_vocabulary": "force, push, pull, contact, non-contact, friction, gravity, magnetic, attract, repel, distance, surface, direction, strength, interaction",
      "common_misconceptions": "Children commonly think a force is needed to keep an object moving, rather than understanding that forces are needed to start, stop or change movement (a precursor to Newton's first law). Some pupils believe gravity only acts on heavy objects or only works at large distances. Children may think that magnetic force requires contact because they usually see magnets touching metal objects — they need to explore magnetic attraction through materials and at a distance.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C026",
      "domain_id": "SC-KS2-D006",
      "concept_name": "Magnetic Properties",
      "description": "Understanding that magnets attract some materials (magnetic materials, principally metals containing iron, nickel or cobalt) and not others. Magnets have two poles (north and south); like poles repel and unlike poles attract. Magnetic force acts at a distance.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        3
      ],
      "teaching_guidance": "Provide a collection of magnets (bar, horseshoe, ring) and a variety of materials for systematic testing. Challenge pupils to predict and then test which materials are attracted to magnets, recording results in a table. Investigate magnetic poles: demonstrate that like poles repel and unlike poles attract using bar magnets on a smooth surface or suspended from string. Explore the magnetic field using iron filings on paper above a bar magnet. Test whether magnetic force acts through materials (paper, wood, plastic, water) by trying to move a paper clip through a table. Investigate which metals are magnetic — only iron, nickel and cobalt, not all metals.",
      "key_vocabulary": "magnet, magnetic, attract, repel, pole, north, south, iron, nickel, cobalt, force, field, material, metal, non-magnetic, bar magnet, horseshoe magnet",
      "common_misconceptions": "The most widespread misconception is that all metals are magnetic. Only iron, nickel, cobalt and their alloys (e.g., steel) are magnetic — copper, aluminium, gold and silver are not. Children often think magnets are strongest in the middle rather than at the poles. Some pupils believe bigger magnets are always stronger than smaller ones, which is not necessarily true as strength depends on the material and magnetisation.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C027",
      "domain_id": "SC-KS2-D006",
      "concept_name": "Friction and Movement on Surfaces",
      "description": "Understanding that the surface of an object affects how it moves — rough surfaces produce more friction and slow objects down more than smooth surfaces. Friction is a contact force.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        3
      ],
      "teaching_guidance": "Investigate friction by rolling a toy car down a ramp onto different surfaces (carpet, sandpaper, smooth wood, lino) and measuring the distance it travels. Use force meters to pull objects across different surfaces and compare the readings. Discuss why shoes have treads, why tyres have grip patterns, and why ice is slippery. Explore the idea that friction can be both useful (brakes, grip) and a nuisance (wear, heat, slowing down). Connect to the concept that rougher surfaces produce more friction than smoother ones.",
      "key_vocabulary": "friction, surface, rough, smooth, grip, slide, resistance, force, contact, ramp, distance, slow down, speed up, useful, nuisance, force meter",
      "common_misconceptions": "Children often think that smooth objects have no friction at all, rather than understanding that all surfaces produce some friction when in contact. Some pupils believe friction only slows things down and do not recognise its essential role in enabling movement — without friction, we could not walk, drive or hold objects. Children may think friction is only related to the roughness of surfaces, not understanding that weight and surface area also play a role.",
      "teaching_weight": 3,
      "co_teach_hints": [
        "SC-KS2-C025",
        "SC-KS2-C026"
      ]
    },
    {
      "concept_id": "SC-KS2-C028",
      "domain_id": "SC-KS2-D007",
      "concept_name": "Classification Keys",
      "description": "Using and making simple branching keys (dichotomous keys) to identify and classify living things by asking yes/no questions about observable characteristics. An important tool in biological identification.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        4
      ],
      "teaching_guidance": "Begin with teacher-made branching keys that pupils use to identify specimens (leaves, minibeasts, shells). Progress to pupils creating their own keys by choosing yes/no questions based on observable characteristics. Start with familiar objects (e.g., sorting classroom items) before moving to living organisms. Emphasise that good key questions focus on observable, unambiguous features rather than subjective qualities. Use local habitats for fieldwork — identify organisms found in the school grounds using published keys, then create a key for the organisms found.",
      "key_vocabulary": "classification key, branching key, dichotomous, identify, characteristic, feature, observable, yes/no, question, group, sort, organism, specimen, distinguish",
      "common_misconceptions": "Pupils often write key questions based on subjective criteria ('Is it pretty?') rather than observable, measurable features ('Does it have more than six legs?'). Some children think a key must lead to only one correct answer at each branch, not understanding that keys are tools for narrowing down possibilities based on available evidence. Children may confuse classification keys with identification guides that use pictures rather than questions.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C029",
      "domain_id": "SC-KS2-D007",
      "concept_name": "Variety of Classification Criteria",
      "description": "Understanding that living things can be grouped in many different ways depending on the characteristics chosen as criteria. No single correct grouping — different criteria produce different and equally valid classifications.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        4
      ],
      "teaching_guidance": "Provide the same set of organisms (or pictures) and challenge groups to classify them using different criteria: habitat, diet, body covering, number of legs, method of reproduction. Compare the different groupings that result and discuss which are most useful for different purposes. Introduce the idea that scientists choose classification criteria carefully and that the system we use today is based on evolutionary relationships. Use Venn diagrams and Carroll diagrams to explore overlapping and non-overlapping criteria. Discuss why some organisms are difficult to classify.",
      "key_vocabulary": "classify, group, criteria, characteristic, feature, similar, different, sort, compare, habitat, structure, Venn diagram, Carroll diagram, category, organism",
      "common_misconceptions": "Children often think there is only one correct way to classify organisms, not recognising that different criteria produce different but equally valid groupings. Some pupils classify animals by where they live rather than by biological features — for example, grouping whales with fish because they live in water. Children may struggle with organisms that do not fit neatly into one group, such as platypuses (mammals that lay eggs).",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C030",
      "domain_id": "SC-KS2-D007",
      "concept_name": "Environmental Change and Impact",
      "description": "Understanding that environments change over time (seasonal changes, human impact) and that these changes can sometimes pose dangers to living things. Includes positive and negative human impacts on environments.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        4
      ],
      "teaching_guidance": "Study a local habitat over time and record seasonal changes in the organisms present. Discuss both positive human impacts (nature reserves, reforestation, wildlife corridors) and negative impacts (pollution, deforestation, littering, urbanisation). Use case studies of environmental change — for example, the effect of hedgerow removal on bird populations, or the impact of river pollution on aquatic invertebrates. Investigate how changes in one part of a food chain affect other organisms. Link to geography work on land use and sustainability.",
      "key_vocabulary": "environment, habitat, change, impact, pollution, deforestation, conservation, endangered, extinct, human, positive, negative, food chain, population, adapt, seasonal",
      "common_misconceptions": "Children often think environmental change is always negative and caused by humans, not recognising that natural changes (seasons, flooding, volcanic eruptions) also affect habitats. Some pupils believe that if an animal's habitat is destroyed, it can simply move to another habitat without difficulty. Children may not understand that changes to one species in a food chain have knock-on effects for other species in the same ecosystem.",
      "teaching_weight": 3,
      "co_teach_hints": [
        "SC-KS2-C059"
      ]
    },
    {
      "concept_id": "SC-KS2-C031",
      "domain_id": "SC-KS2-D003",
      "concept_name": "Digestive System",
      "description": "Understanding the functions of the basic parts of the human digestive system: mouth (chewing, saliva), oesophagus (transport), stomach (churning, digestion), small intestine (nutrient absorption), large intestine (water absorption). Food is broken down to release nutrients.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        4
      ],
      "teaching_guidance": "Use a large-scale diagram or model of the digestive system for pupils to trace the journey of food from mouth to large intestine. Create a physical simulation using a plastic bag (stomach) with bread and orange juice to show churning and chemical breakdown. Use tights filled with mashed banana to demonstrate the squeezing action of the oesophagus (peristalsis). Label the key organs and their functions: mouth (chewing and saliva), oesophagus (muscular tube), stomach (acid and churning), small intestine (nutrient absorption), large intestine (water absorption). Link to nutrition — digestion breaks food down so nutrients can be absorbed into the blood.",
      "key_vocabulary": "digestive system, mouth, oesophagus, stomach, small intestine, large intestine, saliva, chew, digest, absorb, nutrient, enzyme, acid, peristalsis, breakdown, organ",
      "common_misconceptions": "Children commonly think the stomach is the main organ of digestion, when in fact most chemical digestion and nearly all absorption occurs in the small intestine. Some pupils believe food passes through the body in one tube with the stomach at the bottom, rather than understanding the winding path through distinct organs with different functions. Children may think digestion is only mechanical (chewing), not understanding the role of chemical breakdown by enzymes and acid.",
      "teaching_weight": 3,
      "co_teach_hints": [
        "SC-KS2-C060",
        "SC-KS2-C062"
      ]
    },
    {
      "concept_id": "SC-KS2-C032",
      "domain_id": "SC-KS2-D003",
      "concept_name": "Types and Functions of Teeth",
      "description": "Understanding that humans have different types of teeth with different functions: incisors (cutting), canines (tearing), premolars and molars (grinding). Diet of carnivores and herbivores relates to different tooth structures.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        4
      ],
      "teaching_guidance": "Examine real or model teeth to identify the four types: incisors (flat, sharp, at the front — for cutting and biting), canines (pointed — for tearing), premolars and molars (flat, broad — for crushing and grinding). Use mirrors for pupils to examine their own teeth and identify each type. Compare human teeth with those of herbivores (flat, ridged molars for grinding plants) and carnivores (large canines and carnassials for tearing meat). Link tooth type to diet and feeding behaviour. Discuss dental health: the role of bacteria and sugar in tooth decay, and how brushing and diet protect teeth. Consider using disclosing tablets to show plaque.",
      "key_vocabulary": "incisor, canine, premolar, molar, cut, tear, grind, crush, tooth, teeth, enamel, decay, dentine, pulp, root, crown, carnivore, herbivore, omnivore, plaque",
      "common_misconceptions": "Children often think humans have only two types of teeth (front teeth and back teeth) rather than four types with distinct functions. Some pupils believe that baby teeth do not matter because they will fall out, not understanding that decay can affect the permanent teeth developing beneath. Children may think herbivores have no sharp teeth at all — in fact, many herbivores have sharp incisors for cutting grass and leaves.",
      "teaching_weight": 3,
      "co_teach_hints": [
        "SC-KS2-C017",
        "SC-KS2-C046",
        "SC-KS2-C060",
        "SC-KS2-C061"
      ]
    },
    {
      "concept_id": "SC-KS2-C033",
      "domain_id": "SC-KS2-D003",
      "concept_name": "Food Chains with Producers, Predators and Prey",
      "description": "Constructing and interpreting food chains that include producers (plants), consumers, predators and prey. Understanding that food chains show the flow of energy and that producers are always the starting point. Extends KS1 simple food chains.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        4
      ],
      "teaching_guidance": "Build food chains using real organisms from a local habitat, starting with a producer (green plant) and showing energy flow through arrows. Emphasise that the arrow means 'is eaten by' or 'provides energy for', not 'eats'. Introduce the terms producer, consumer, predator and prey explicitly. Construct multiple food chains from the same habitat and discuss what happens if one organism is removed — does the chain collapse? Use food chain card games where pupils assemble chains from shuffled organism cards. Link to habitats work and classification.",
      "key_vocabulary": "food chain, producer, consumer, predator, prey, energy, arrow, habitat, organism, plant, herbivore, carnivore, top predator, population, depend",
      "common_misconceptions": "The most common error is drawing food chain arrows in the wrong direction — arrows should point from the organism being eaten to the organism doing the eating, showing the direction of energy flow. Children often think predators are always large, fierce animals and do not recognise that a ladybird eating an aphid is also a predator-prey relationship. Some pupils believe removing one organism from a food chain only affects the organism directly above or below it, not understanding the cascading effects.",
      "teaching_weight": 3,
      "co_teach_hints": [
        "SC-KS2-C017",
        "SC-KS2-C062"
      ]
    },
    {
      "concept_id": "SC-KS2-C034",
      "domain_id": "SC-KS2-D008",
      "concept_name": "Three States of Matter",
      "description": "Understanding that materials can be classified as solids, liquids or gases based on their observable properties. Solids hold their shape; liquids form a pool but not a pile; gases escape from unsealed containers and are not visible.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        4
      ],
      "teaching_guidance": "Sort a collection of materials into solids, liquids and gases based on observable properties. Investigate borderline cases — is sand a solid or a liquid? (Solid, because each grain is solid even though sand pours.) Is toothpaste a solid or a liquid? Introduce the particle model informally: in solids, particles are closely packed and vibrate in fixed positions; in liquids, particles are close but can move around each other; in gases, particles are far apart and move freely. Use physical modelling (pupils acting as particles) to represent each state. Explore gases by trapping air in syringes and balloons.",
      "key_vocabulary": "solid, liquid, gas, state of matter, property, shape, volume, flow, pour, compress, particle, fixed, vibrate, container, material, classify",
      "common_misconceptions": "Children commonly think that powders (flour, sand, sugar) are liquids because they pour. They are collections of tiny solids. Some pupils think gases have no mass or do not exist because they are invisible — weighing a balloon before and after inflation can address this. Children may struggle with the concept that the same substance (e.g., water) can exist as a solid, liquid or gas depending on temperature.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C035",
      "domain_id": "SC-KS2-D008",
      "concept_name": "Changes of State",
      "description": "Understanding that materials change state when heated or cooled: melting (solid to liquid), freezing (liquid to solid), evaporation/boiling (liquid to gas), condensation (gas to liquid). Temperature at which state changes occur can be measured in degrees Celsius.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        4
      ],
      "teaching_guidance": "Investigate changes of state practically: melt ice and chocolate, freeze water and fruit juice, observe evaporation from wet surfaces, and collect condensation on a cold mirror held above steam. Measure temperatures at which changes occur using thermometers. Create a diagram showing the cycle of changes: solid ⇌ liquid ⇌ gas, with heating arrows in one direction and cooling arrows in the other. Use the terms melting, freezing, evaporating, boiling and condensing precisely. Investigate factors that affect evaporation rate (temperature, surface area, air movement) through fair test investigations.",
      "key_vocabulary": "melting, freezing, evaporation, boiling, condensation, solid, liquid, gas, change of state, temperature, degrees Celsius, thermometer, heat, cool, reversible, boiling point, melting point",
      "common_misconceptions": "Children often confuse evaporation with boiling — evaporation occurs at any temperature from the surface of a liquid, while boiling occurs throughout the liquid at a specific temperature. Some pupils think that when water evaporates it disappears or ceases to exist, rather than becoming invisible water vapour in the air. Children may believe that melting and dissolving are the same process — melting is a change of state caused by heat, while dissolving is a solid mixing into a liquid.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C036",
      "domain_id": "SC-KS2-D008",
      "concept_name": "The Water Cycle",
      "description": "Understanding that evaporation and condensation are key processes in the water cycle. Water evaporates from oceans, lakes and land when heated; water vapour condenses to form clouds; precipitation returns water to the surface. Rate of evaporation increases with temperature.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        4
      ],
      "teaching_guidance": "Create a physical model of the water cycle using a sealed container with warm water, ice placed on top, and a heat source. Observe evaporation, condensation on the cool surface, and 'precipitation' dripping back down. Label each stage of the cycle and connect to the scientific terms learned in states of matter. Discuss where water evaporates from in nature (oceans, lakes, rivers, soil, plants) and what causes condensation (cooling of water vapour as it rises in the atmosphere). Link to geography — rivers, rainfall patterns, clouds. Investigate how temperature affects evaporation rate.",
      "key_vocabulary": "water cycle, evaporation, condensation, precipitation, cloud, water vapour, temperature, heat, ocean, river, lake, rain, atmosphere, cycle, sun, energy",
      "common_misconceptions": "Children often think clouds are made of water vapour — clouds are actually made of tiny liquid water droplets or ice crystals; water vapour is invisible. Some pupils believe rain falls from clouds when they 'get too heavy' or 'burst', rather than understanding the role of further condensation and coalescence. Children may think the water cycle is a one-way process (evaporation → rain) rather than a continuous cycle with water endlessly recycling.",
      "teaching_weight": 3,
      "co_teach_hints": [
        "SC-KS2-C035"
      ]
    },
    {
      "concept_id": "SC-KS2-C037",
      "domain_id": "SC-KS2-D009",
      "concept_name": "Vibration as the Cause of Sound",
      "description": "Understanding that all sounds are made by vibrating objects. The vibration causes surrounding particles to vibrate, transmitting the sound as a wave through the medium (solid, liquid or gas) to the ear.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        4
      ],
      "teaching_guidance": "Explore sound production through hands-on activities: pluck a guitar string and watch it vibrate, strike a tuning fork and touch it to water to see splashing, tap a drum with rice grains on top to see them bounce, and hold a ruler over the edge of a desk and twang it. Use the common thread to establish the principle that all sounds come from something vibrating. Place a hand on the throat while humming to feel vocal cord vibration. Discuss how to stop a sound — stop the vibration (damping). Use the term 'vibration' consistently and ask pupils to identify what is vibrating in each example.",
      "key_vocabulary": "sound, vibration, vibrate, source, wave, ear, hear, loud, quiet, pitch, tuning fork, instrument, drum, string, vocal cords, energy",
      "common_misconceptions": "Children often think sounds just 'happen' without anything vibrating, or that only musical instruments vibrate. They may not connect everyday sounds (speech, traffic, wind) to vibration. Some pupils think that when they hear a sound, the vibrating object has sent something physical to their ear rather than understanding that vibrations pass through the air as a wave.",
      "teaching_weight": 4,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C038",
      "domain_id": "SC-KS2-D009",
      "concept_name": "Sound Transmission Through Media",
      "description": "Understanding that vibrations from sounds travel through a medium (solid, liquid or gas) to the ear. Sound cannot travel through a vacuum. Sound travels through different media at different speeds.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        4
      ],
      "teaching_guidance": "Investigate sound travelling through different media: use a 'string telephone' to demonstrate sound travelling through a taut string (solid); listen to sounds underwater in a large container (liquid); compare sounds heard through air (gas). Press an ear to a desk while a partner taps the other end to hear sound travelling through a solid. Discuss why astronauts cannot hear each other in space — sound needs a medium and space is a vacuum. Compare how well sound travels through solids, liquids and gases. Use a bell in a vacuum jar demonstration (video if equipment unavailable) to show that sound cannot travel without a medium.",
      "key_vocabulary": "sound, vibration, travel, medium, solid, liquid, gas, vacuum, ear, wave, transmit, air, speed, distance, string telephone, particle",
      "common_misconceptions": "Children often believe sound can travel through a vacuum (influenced by science fiction films showing explosions in space). Some pupils think sound travels only through air and are surprised it can travel through solids and liquids. Children may believe sound travels at the same speed through all materials — it actually travels faster through solids than liquids, and faster through liquids than gases.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C039",
      "domain_id": "SC-KS2-D009",
      "concept_name": "Pitch and Sound Source Features",
      "description": "Understanding that the pitch of a sound is related to features of the object producing it. Longer, larger or looser objects produce lower pitch sounds. Shorter, smaller or tighter objects produce higher pitch sounds. Patterns can be found and investigated.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        4
      ],
      "teaching_guidance": "Investigate pitch using musical instruments: pluck guitar strings of different thickness and tension, blow across bottles filled to different levels, and use chime bars of different lengths. Identify the pattern: shorter, thinner and tighter objects produce higher-pitched sounds. Make a simple instrument (e.g., an elastic band guitar on a shoebox) and systematically change one variable at a time to observe its effect on pitch. Use tuning forks of different sizes to demonstrate the relationship between size and pitch. Connect to music curriculum — high and low notes on a keyboard or recorder.",
      "key_vocabulary": "pitch, high, low, vibration, frequency, length, thickness, tension, tight, loose, long, short, thick, thin, instrument, note, tuning fork, pattern",
      "common_misconceptions": "Children commonly confuse pitch with volume — they may describe a high-pitched sound as 'loud' and a low-pitched sound as 'quiet'. Pitch and volume are independent properties. Some pupils think that only the length of an object affects pitch, not recognising that thickness and tension also play a role. Children may believe that bigger instruments always make lower sounds, which is generally true but not always (a piccolo is smaller than a flute but plays higher).",
      "teaching_weight": 3,
      "co_teach_hints": [
        "SC-KS2-C037",
        "SC-KS2-C040"
      ]
    },
    {
      "concept_id": "SC-KS2-C040",
      "domain_id": "SC-KS2-D009",
      "concept_name": "Volume and Vibration Strength",
      "description": "Understanding that the volume (loudness) of a sound is related to the strength (amplitude) of the vibrations producing it. Stronger vibrations produce louder sounds. Sound becomes fainter as distance from the source increases.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        4
      ],
      "teaching_guidance": "Investigate volume by striking a drum with different amounts of force and observing the effect. Use a tuning fork: strike it gently and then firmly, observing larger vibrations producing louder sounds. Place rice grains on a drum skin and observe them bouncing higher with louder hits. Investigate how sound becomes fainter with distance — have one pupil clap while others stand at increasing distances and describe the volume. Discuss everyday applications: why we shout to be heard across a playground, why walls muffle sound, why ear defenders work. Use decibel meters or apps to measure sound levels.",
      "key_vocabulary": "volume, loud, quiet, faint, vibration, amplitude, strength, force, distance, energy, decibel, sound level, ear, hear, muffle, absorb",
      "common_misconceptions": "Children often confuse volume (loudness) with pitch (high or low). They are independent — a sound can be loud and high, loud and low, quiet and high, or quiet and low. Some pupils think that louder sounds travel faster than quieter sounds — volume and speed of sound are unrelated. Children may not understand why sound gets fainter with distance, thinking the sound 'runs out' rather than understanding that sound energy spreads out over a larger area.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C041",
      "domain_id": "SC-KS2-D010",
      "concept_name": "Series Electrical Circuits",
      "description": "Understanding that a simple series electrical circuit consists of components (cells, bulbs, switches, buzzers, wires) connected in a single unbroken loop. A lamp will only light when part of a complete circuit. In Year 6, circuits can be represented using standard symbols.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        4,
        6
      ],
      "teaching_guidance": "Provide circuit-building kits (cells, wires, bulbs, switches, buzzers, motors) and challenge pupils to make a bulb light up. Investigate what happens when the circuit is broken — the bulb goes out, demonstrating the need for a complete loop. Add switches and discuss their function as deliberate circuit breakers. In Year 4, use pictorial representations of circuits. In Year 6, introduce standard circuit symbols and teach pupils to draw and interpret circuit diagrams. Investigate what happens when more bulbs or more cells are added to a series circuit.",
      "key_vocabulary": "circuit, series, cell, battery, wire, bulb, switch, buzzer, motor, loop, complete, break, component, electrical, current, flow, symbol, diagram",
      "common_misconceptions": "The most persistent misconception is that electricity 'flows out of' the battery into the bulb and is 'used up'. In fact, current flows in a complete loop and is not consumed — energy is transferred, not the charge itself. Some pupils think electricity flows from both ends of the battery and meets in the bulb ('clashing currents' model). Children may believe that the order of components in a series circuit matters — it does not for a simple series circuit.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C042",
      "domain_id": "SC-KS2-D010",
      "concept_name": "Conductors and Insulators",
      "description": "Understanding that some materials allow electricity to flow through them (conductors) while others do not (insulators). Metals tend to be good conductors. Insulators are used to protect us from electrical current and to prevent short circuits.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        4
      ],
      "teaching_guidance": "Build a test circuit with a gap and challenge pupils to test a variety of materials by placing them in the gap to see if the bulb lights. Test metals (copper, iron, aluminium, steel), non-metals (wood, plastic, rubber, glass, paper), and liquids (water, salt water). Record results in a table and look for patterns — metals generally conduct, non-metals generally do not. Discuss why electrical wires have metal cores (conductor) wrapped in plastic (insulator). Link to safety: insulators protect us from electric shocks; never touch bare wires or damaged cables.",
      "key_vocabulary": "conductor, insulator, conduct, electricity, metal, non-metal, material, test, circuit, bulb, flow, current, copper, plastic, rubber, safety, protection",
      "common_misconceptions": "Children often think all metals are conductors and all non-metals are insulators. While this is broadly true, graphite (a non-metal) conducts electricity, and some metal oxides are poor conductors. Some pupils confuse electrical conductors with thermal conductors — a material can be good at conducting one but not the other. Children may think that water always conducts electricity — pure water is a poor conductor, but dissolved salts (as in tap water) make it conductive.",
      "teaching_weight": 3,
      "co_teach_hints": [
        "SC-KS2-C041"
      ]
    },
    {
      "concept_id": "SC-KS2-C043",
      "domain_id": "SC-KS2-D010",
      "concept_name": "Voltage and Circuit Effects",
      "description": "Understanding that the brightness of a lamp and the volume of a buzzer are associated with the number and voltage of cells in a circuit. More cells/higher voltage produces brighter bulbs and louder buzzers. Voltage is introduced informally.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "year": [
        6
      ],
      "teaching_guidance": "Investigate the effect of adding more cells to a series circuit: with one cell the bulb is dim, with two cells it is brighter, with three cells it is very bright (and may blow). Use this to introduce the idea that more cells provide more 'push' (voltage) to the current. Compare circuits with different numbers of cells systematically, measuring brightness using a light sensor or ranking by observation. Discuss why we use different numbers of batteries in different devices (a torch needs fewer than a laptop). Introduce the volt as the unit of voltage. Predict and test what happens when cells are reversed.",
      "key_vocabulary": "voltage, volt, cell, battery, brightness, circuit, component, bulb, buzzer, current, push, energy, series, increase, decrease, effect, power",
      "common_misconceptions": "Children often confuse voltage with current, thinking they are the same thing. Voltage is the 'push' or energy given to the current; current is the flow of charge. Some pupils think that adding more bulbs to a series circuit makes them all brighter (it actually makes them dimmer because the voltage is shared). Children may not understand why batteries go flat — the chemical energy is gradually converted to other forms.",
      "teaching_weight": 5,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C044",
      "domain_id": "SC-KS2-D007",
      "concept_name": "Comparative Life Cycles",
      "description": "Describing and comparing the life cycles of four types of animals: mammals (live birth, parental care), amphibians (metamorphosis, aquatic larval stage), insects (complete or incomplete metamorphosis), birds (eggs, hatching, fledging). Understanding variety within the concept of life cycle.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "year": [
        5
      ],
      "teaching_guidance": "Compare life cycles of mammals (e.g., human — live birth, extended parental care), amphibians (e.g., frog — eggs → tadpole → froglet → adult frog, metamorphosis), insects (e.g., butterfly — egg → caterpillar → chrysalis → butterfly, complete metamorphosis), and birds (e.g., robin — eggs → chick → fledgling → adult, hatching). Use diagrams to show each life cycle as a circular process. Create comparison tables highlighting similarities and differences. If possible, observe real life cycles — frog spawn developing, caterpillars pupating, chick eggs hatching. Discuss why different animals have evolved such different strategies.",
      "key_vocabulary": "life cycle, mammal, amphibian, insect, bird, metamorphosis, larva, pupa, tadpole, chrysalis, caterpillar, egg, hatch, fledgling, adult, offspring, gestation, stage",
      "common_misconceptions": "Children often think metamorphosis only applies to butterflies, not recognising it in frogs, beetles, and many other animals. Some pupils believe all animals are born as miniature versions of the adult (like mammals), not understanding that many go through dramatically different larval stages. Children may think a chrysalis is a resting state where nothing happens, rather than understanding that major body restructuring occurs inside.",
      "teaching_weight": 5,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C045",
      "domain_id": "SC-KS2-D007",
      "concept_name": "Reproduction in Plants and Animals",
      "description": "Understanding the life process of reproduction. In plants: sexual reproduction (pollination, fertilisation, seed formation) and asexual reproduction (runners, bulbs, cuttings, tubers). In animals: sexual reproduction. Understanding that reproduction maintains species.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "year": [
        5
      ],
      "teaching_guidance": "Distinguish between sexual reproduction (two parents, offspring show variation) and asexual reproduction (one parent, offspring genetically identical to parent). For plants: review pollination and seed formation as sexual reproduction, then investigate asexual methods — take cuttings from geraniums, plant strawberry runners, grow new plants from potato tubers and garlic bulbs. For animals: discuss sexual reproduction without detailed mechanism (appropriate to Y5). Compare sexual and asexual reproduction in terms of the variety of offspring produced. Link to evolution — sexual reproduction produces variation, which is the raw material for natural selection.",
      "key_vocabulary": "reproduction, sexual, asexual, offspring, parent, variation, identical, pollination, fertilisation, seed, cutting, runner, tuber, bulb, clone, species, inherit",
      "common_misconceptions": "Children often think all reproduction requires two parents, not understanding that many organisms (plants, some animals) can reproduce asexually. Some pupils confuse growth with reproduction — a plant getting bigger is growth, not reproduction. Children may believe that cuttings from a plant will produce a different variety of plant rather than an identical clone of the parent.",
      "teaching_weight": 5,
      "co_teach_hints": [
        "SC-KS2-C059"
      ]
    },
    {
      "concept_id": "SC-KS2-C046",
      "domain_id": "SC-KS2-D003",
      "concept_name": "Human Development and Ageing",
      "description": "Understanding the full sequence of human development from birth through childhood, puberty, adulthood and old age. Changes at puberty are introduced. Timeline of growth stages. Gestation period concept.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "year": [
        5
      ],
      "teaching_guidance": "Create a human timeline showing the stages from birth through infancy, childhood, adolescence, adulthood and old age, using photographs to illustrate each stage. Discuss the physical changes at each stage — growth in height and weight, development of teeth, puberty changes (growth spurts, body shape changes, development of secondary sexual characteristics). Handle puberty sensitively, following school RSE policy and ensuring a safe environment for questions. Compare human development timelines with those of other animals — some develop rapidly (mice), others slowly (elephants). Discuss gestation periods of different mammals.",
      "key_vocabulary": "development, growth, baby, toddler, child, adolescent, teenager, adult, elderly, puberty, gestation, stage, life span, ageing, mature, reproduce",
      "common_misconceptions": "Children often think puberty happens at the same age for everyone, not understanding that there is a wide normal range (typically 8-14 for onset). Some pupils believe that growing old means the body simply wears out, rather than understanding that ageing involves specific biological processes. Children may not recognise that human development is much slower than most other mammals — a cat reaches adulthood in about one year.",
      "teaching_weight": 3,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C047",
      "domain_id": "SC-KS2-D011",
      "concept_name": "Extended Material Properties",
      "description": "Comparing and grouping materials based on a wider range of properties: hardness, solubility, transparency, electrical conductivity, thermal conductivity, and response to magnets. Builds on KS1 and Y4 materials knowledge with additional property types.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "year": [
        5
      ],
      "teaching_guidance": "Set up a systematic investigation of material properties using a range of tests: scratch test for hardness (compare wood, metal, plastic, stone), dissolving test for solubility (test sugar, sand, salt, chalk in water), transparency test (classify as transparent, translucent or opaque), thermal conductivity test (wrap identical cups of hot water in different materials and measure cooling rate), electrical conductivity test (insert into a circuit gap), and magnet test. Record results in a property comparison table. Discuss how property knowledge helps engineers and designers choose the right material for each purpose.",
      "key_vocabulary": "property, hardness, solubility, transparency, conductivity, thermal, electrical, magnetic, opaque, translucent, transparent, dissolve, soluble, insoluble, compare, group, material, purpose",
      "common_misconceptions": "Children often confuse thermal conductivity with temperature — a metal spoon feels cold not because it is colder than a wooden spoon but because it conducts heat away from your hand faster. Some pupils think that if a material dissolves it has disappeared or been destroyed, rather than understanding it has dispersed into the liquid. Children may believe that hardness and strength are the same thing — glass is hard but brittle, while rubber is soft but strong.",
      "teaching_weight": 5,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C048",
      "domain_id": "SC-KS2-D011",
      "concept_name": "Dissolving and Solutions",
      "description": "Understanding that some materials dissolve in liquid to form a solution — the solute appears to disappear but is not lost. Understanding that a dissolved substance can be recovered by evaporating the solvent. Dissolving is different from melting.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "year": [
        5
      ],
      "teaching_guidance": "Investigate dissolving by adding salt, sugar, sand and chalk to water, stirring and observing. Weigh the water before and after dissolving salt to show the mass has increased — the salt is still there even though invisible. Investigate factors that affect dissolving rate: temperature, stirring, grain size. Recover a dissolved substance by evaporating the water — leave a saucer of salt solution on a warm windowsill and observe salt crystals forming. Explicitly distinguish dissolving from melting: dissolving requires a solvent (liquid), melting requires heat. Use the terms solute, solvent and solution consistently.",
      "key_vocabulary": "dissolve, solution, solute, solvent, soluble, insoluble, filter, evaporate, recover, crystal, stir, temperature, rate, mass, disappear, transparent, mixture",
      "common_misconceptions": "The most common misconception is confusing dissolving with melting. Dissolving requires a liquid (solvent); melting requires heat to change a solid to a liquid. Sugar dissolves in water; ice melts in warm air. Children often think that when something dissolves it has gone forever or been destroyed — weighing before and after proves the dissolved substance is still present. Some pupils think stirring makes more solid dissolve rather than simply speeding up the process.",
      "teaching_weight": 5,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C049",
      "domain_id": "SC-KS2-D011",
      "concept_name": "Separating Mixtures",
      "description": "Understanding that mixtures of solids, liquids and gases can be separated using various techniques: filtering (remove insoluble solids from liquids), sieving (separate solids by particle size), evaporating (recover dissolved solids). Technique chosen depends on properties of components.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "year": [
        5
      ],
      "teaching_guidance": "Demonstrate each separation technique practically: use sieving to separate rice from flour; filtering to separate sand from water (using filter paper and funnel); evaporating to recover salt from salt water (using an evaporating dish over a water bath). Discuss which technique is appropriate for which mixture and why — sieving separates by particle size, filtering separates insoluble solids from liquids, evaporation separates dissolved solids from liquids. Challenge pupils with mystery mixtures to separate (e.g., salt, sand and iron filings — use magnet, then dissolve salt in water and filter, then evaporate). Link separation techniques to real-world applications: water purification, mining, recycling.",
      "key_vocabulary": "separate, mixture, filter, sieve, evaporate, dissolve, insoluble, soluble, technique, method, filter paper, funnel, residue, filtrate, solution, particle, purify",
      "common_misconceptions": "Children often think that filtering can separate dissolved substances from water — it cannot; only evaporation or distillation works for solutions. Some pupils confuse sieving with filtering, not recognising the difference in particle size involved. Children may believe that once mixed, substances can never be separated, rather than understanding that different properties allow different separation methods.",
      "teaching_weight": 5,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C050",
      "domain_id": "SC-KS2-D011",
      "concept_name": "Reversible Changes",
      "description": "Understanding that some material changes are reversible — the original materials can be recovered. Examples: dissolving, mixing, melting, freezing, evaporation, condensation. The material is changed in form but not in substance.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "year": [
        5
      ],
      "teaching_guidance": "Investigate a range of reversible changes: melt chocolate and let it re-solidify; dissolve salt and evaporate to recover it; freeze water and melt the ice. Create a concept map linking all reversible changes, emphasising that the original materials can always be recovered and no new substance is formed. Compare each reversible change with an equivalent irreversible change — melting chocolate (reversible) versus burning toast (irreversible). Use the criterion 'Can we get the original material back?' as the key test. Discuss everyday examples: drying wet clothes (reversible evaporation of water), recycling metals by melting and reshaping.",
      "key_vocabulary": "reversible, change, recover, original, material, melt, freeze, dissolve, evaporate, condense, mix, separate, substance, form, physical change, state",
      "common_misconceptions": "Children often think that all changes caused by heating are irreversible, not recognising that melting and evaporation are reversible. Some pupils believe dissolving is irreversible because they cannot see the solid, when in fact evaporation will recover it. Children may confuse reversible changes with the idea of 'undoing' something — reversibility means the original materials can be recovered, not that the exact same object is restored.",
      "teaching_weight": 5,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C051",
      "domain_id": "SC-KS2-D011",
      "concept_name": "Irreversible Changes",
      "description": "Understanding that some changes result in the formation of new materials and are not easily reversed. Examples: burning, rusting, acid reacting with bicarbonate of soda, cooking. New substances are formed that cannot easily be changed back.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "year": [
        5
      ],
      "teaching_guidance": "Demonstrate irreversible changes safely: burn a piece of paper or candle (adult-supervised), mix vinegar with bicarbonate of soda to observe gas production, cook an egg, and observe rusting of iron wool in damp conditions over several days. In each case, discuss what evidence shows a new substance has formed — change in colour, production of gas, change in temperature, production of light or smoke. Contrast with reversible changes done in parallel: melt ice alongside burning a candle. Emphasise that irreversible changes produce new materials with different properties. Introduce the term 'chemical change' informally.",
      "key_vocabulary": "irreversible, chemical change, new substance, burn, rust, react, gas, temperature change, permanent, original, material, evidence, property, formation, combustion",
      "common_misconceptions": "Children often struggle to distinguish irreversible from reversible changes. A useful test is: 'Has a new substance been formed with different properties?' Cooking an egg is irreversible — you cannot uncook it because the proteins have permanently changed. Some pupils think burning makes things disappear rather than producing new substances (ash, gases, smoke). Children may not recognise rusting as a chemical change because it happens slowly.",
      "teaching_weight": 5,
      "co_teach_hints": [
        "SC-KS2-C049",
        "SC-KS2-C050"
      ]
    },
    {
      "concept_id": "SC-KS2-C052",
      "domain_id": "SC-KS2-D012",
      "concept_name": "The Solar System",
      "description": "Understanding that the Sun is a star at the centre of our solar system and that eight planets (Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, Neptune) orbit it. Heliocentric model replaced earlier geocentric model. History of scientific ideas including Ptolemy, Alhazen, Copernicus.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "year": [
        5
      ],
      "teaching_guidance": "Create a scale model of the solar system using appropriately scaled spheres (or fruits) to show relative sizes, and use the school field or corridor to show relative distances (even scaled down, the distances are striking). Teach the order of the eight planets using a mnemonic (e.g., 'My Very Enthusiastic Mother Just Served Us Nachos'). Discuss the heliocentric model and its history — how Copernicus, Galileo and others challenged the geocentric model with evidence from observations. Use videos or planetarium software to visualise planetary orbits. Emphasise that the Sun is a star and that planets orbit it due to gravity.",
      "key_vocabulary": "solar system, Sun, star, planet, Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, Neptune, orbit, heliocentric, geocentric, satellite, gravity, astronomer, Copernicus",
      "common_misconceptions": "Children commonly believe that the Sun orbits the Earth (geocentric model) because that matches everyday observation of the Sun 'moving' across the sky. Pupils often dramatically underestimate the distances between planets and overestimate the relative size of Earth compared to Jupiter or Saturn. Some children think stars and planets are the same thing — stars produce light, planets reflect it. Children may believe Pluto is still classified as a planet.",
      "teaching_weight": 5,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C053",
      "domain_id": "SC-KS2-D012",
      "concept_name": "Earth's Rotation and Day/Night",
      "description": "Understanding that the Earth rotates on its axis once every 24 hours, causing day and night. The part of Earth facing the Sun experiences day; the opposite side experiences night. The Sun's apparent movement across the sky is explained by Earth's rotation, not the Sun moving.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "year": [
        5
      ],
      "teaching_guidance": "Use a globe and a torch in a darkened room to model Earth's rotation and day/night. Mark the pupils' location on the globe and slowly rotate it to show how their location moves from day (facing the torch) to night (facing away). Emphasise that it is Earth rotating, not the Sun moving around Earth. Discuss time zones as evidence of Earth's rotation. Use the model to explain why the Sun appears to move across the sky during the day — we are rotating beneath a stationary Sun. Link to KS1 work on seasonal day length changes. Use slow-motion videos of sunrises and sunsets to reinforce that these are caused by Earth's rotation.",
      "key_vocabulary": "Earth, rotate, rotation, axis, spin, day, night, Sun, globe, orbit, shadow, time zone, sunrise, sunset, 24 hours, apparent movement",
      "common_misconceptions": "The most persistent misconception is that day and night are caused by the Sun going around the Earth. Some children think night occurs because the Moon or clouds block the Sun. Pupils may confuse Earth's daily rotation (causing day/night) with its yearly orbit around the Sun (causing seasons). Some children think that different countries have day and night at different times because the Sun travels to different places, rather than because Earth rotates.",
      "teaching_weight": 5,
      "co_teach_hints": [
        "SC-KS2-C052",
        "SC-KS2-C054"
      ]
    },
    {
      "concept_id": "SC-KS2-C054",
      "domain_id": "SC-KS2-D012",
      "concept_name": "Moon's Orbit",
      "description": "Understanding that the Moon is a natural satellite that orbits the Earth. The Moon is approximately spherical. Other planets also have moons. The Moon's orbital relationship with Earth distinguishes it from planets.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "year": [
        5
      ],
      "teaching_guidance": "Use a model with a torch (Sun), a large ball (Earth) and a small ball (Moon) to demonstrate the Moon orbiting Earth while Earth orbits the Sun. Observe the Moon over a month and record its appearance — noting the phases from new moon through crescent, quarter, gibbous to full moon and back. Discuss why the Moon appears to change shape (different portions illuminated as it orbits). Compare the Moon with planets — the Moon is a natural satellite, not a planet. Research other moons in the solar system (Jupiter's Galilean moons, Saturn's Titan). Emphasise that the Moon is approximately spherical.",
      "key_vocabulary": "Moon, orbit, satellite, natural satellite, Earth, phase, full moon, new moon, crescent, sphere, spherical, reflect, illuminate, rotate, month, lunar",
      "common_misconceptions": "Children commonly believe the Moon produces its own light — it reflects sunlight. Some pupils think the Moon's phases are caused by Earth's shadow falling on the Moon (that is a lunar eclipse, which is rare). Children may believe the Moon is only visible at night, when in fact it is often visible during the day. Some pupils think the Moon does not rotate, but it does — once per orbit, which is why we always see the same face.",
      "teaching_weight": 5,
      "co_teach_hints": [
        "SC-KS2-C052"
      ]
    },
    {
      "concept_id": "SC-KS2-C055",
      "domain_id": "SC-KS2-D013",
      "concept_name": "Gravity",
      "description": "Understanding that gravity is a non-contact force of attraction acting between the Earth and objects. Unsupported objects fall towards Earth because of gravity. Gravity is responsible for keeping planets in orbit around the Sun and the Moon in orbit around Earth.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "year": [
        5
      ],
      "teaching_guidance": "Drop a range of objects (feather, ball, piece of paper, stone) and observe that unsupported objects fall due to gravity. Discuss why a feather falls more slowly than a ball — air resistance, not less gravity. Use the term 'gravitational force' or 'gravitational pull' and explain it as an attractive force between the Earth and all objects. Demonstrate that gravity acts on all objects regardless of mass by dropping two objects of different mass but similar shape from the same height. Discuss gravity's role in keeping planets orbiting the Sun and the Moon orbiting Earth. Connect to the concept of weight as a measure of gravitational force.",
      "key_vocabulary": "gravity, gravitational force, attract, pull, weight, mass, fall, unsupported, orbit, Earth, Sun, Moon, Newton, force, non-contact, downward",
      "common_misconceptions": "Children commonly believe heavier objects fall faster than lighter ones. In a vacuum they fall at the same rate — in air, differences are caused by air resistance, not gravity. Some pupils think gravity only exists on Earth or only works at the Earth's surface. Children may confuse mass and weight — mass is the amount of matter (measured in kg), weight is the gravitational force acting on that mass (measured in Newtons). Some pupils think there is no gravity in space.",
      "teaching_weight": 5,
      "co_teach_hints": [
        "SC-KS2-C056"
      ]
    },
    {
      "concept_id": "SC-KS2-C056",
      "domain_id": "SC-KS2-D013",
      "concept_name": "Resistance Forces",
      "description": "Understanding that air resistance, water resistance and friction are forces that act against motion between moving surfaces. These forces slow objects down and can be useful (parachutes, brakes) or a problem (inefficiency). Friction acts between surfaces in contact.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "year": [
        5
      ],
      "teaching_guidance": "Investigate air resistance by dropping paper shapes of different sizes and observing fall rates. Design and test parachutes of different sizes and materials, measuring the time they take to fall a fixed distance. Investigate water resistance by pulling different shapes through water and comparing the force required. Compare friction on different surfaces using a force meter to pull a shoe across carpet, wood, tile and sandpaper. Discuss the design features of real objects that minimise resistance (streamlined cars, cyclists' clothing) or maximise it (parachutes, brake pads, non-slip shoes). Link to fair testing — changing one variable at a time.",
      "key_vocabulary": "air resistance, water resistance, friction, streamlined, drag, force, surface, parachute, shape, area, speed, slow down, oppose, motion, force meter, Newton",
      "common_misconceptions": "Children often think that moving objects have a force pushing them forward even after the push has stopped. Once no force acts, the object slows due to friction and air resistance. Some pupils believe friction only acts when objects are moving — static friction also acts to prevent objects from starting to move. Children may think that air resistance only affects large objects like parachutes, not recognising it acts on all moving objects.",
      "teaching_weight": 5,
      "co_teach_hints": [
        "SC-KS2-C055",
        "SC-KS2-C057"
      ]
    },
    {
      "concept_id": "SC-KS2-C057",
      "domain_id": "SC-KS2-D013",
      "concept_name": "Mechanisms as Force Multipliers",
      "description": "Understanding that simple mechanisms — levers, pulleys and gears — allow a smaller input force to have a greater effect. These machines do not create energy but redistribute force and distance. Applications in everyday tools and machines.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "year": [
        5
      ],
      "teaching_guidance": "Investigate levers by using a ruler balanced on a pencil to lift objects — explore how moving the fulcrum changes the effort needed. Explore pulleys using a simple pulley system to lift a weight — compare the force needed with and without the pulley. Examine gears using construction kits (LEGO Technic, K'Nex) to see how different-sized gears change speed and force. Identify mechanisms in everyday objects: scissors (lever), bicycle gears, fishing rod (lever), flagpole (pulley), clock mechanism (gears). Emphasise that these mechanisms do not create energy — they trade force for distance. A small force over a large distance can move a large load a small distance.",
      "key_vocabulary": "mechanism, lever, pulley, gear, fulcrum, pivot, effort, load, force, distance, mechanical advantage, machine, simple machine, input, output, energy, transfer",
      "common_misconceptions": "Children often think that machines create energy or force from nothing — they actually redistribute force and distance. A lever does not reduce the total work done; it allows a smaller force to be applied over a larger distance. Some pupils think pulleys only change the direction of force, not recognising that pulley systems with multiple wheels also provide mechanical advantage. Children may not recognise everyday objects (scissors, wheelbarrows, bottle openers) as levers.",
      "teaching_weight": 5,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C058",
      "domain_id": "SC-KS2-D007",
      "concept_name": "Formal Biological Classification",
      "description": "Understanding the formal biological classification system: broad groups of living things (micro-organisms, plants, animals) can be subdivided. Animals classified as vertebrates (fish, amphibians, reptiles, birds, mammals) and invertebrates. Plants classified as flowering and non-flowering. Based on work of Carl Linnaeus.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "year": [
        6
      ],
      "teaching_guidance": "Introduce Linnaeus and his contribution to biological classification. Use a classification hierarchy diagram showing the broad groups: living things → plants and animals → further subdivisions. For animals, distinguish vertebrates (fish, amphibians, reptiles, birds, mammals) from invertebrates (insects, spiders, worms, snails, etc.). For plants, distinguish flowering from non-flowering plants (ferns, mosses, conifers). Introduce micro-organisms as a third major group alongside plants and animals. Use specimen collections or high-quality photographs to practise classification. Create classification posters showing the hierarchy with examples at each level.",
      "key_vocabulary": "classification, Linnaeus, vertebrate, invertebrate, fish, amphibian, reptile, bird, mammal, insect, flowering plant, non-flowering plant, micro-organism, kingdom, group, characteristic, hierarchy",
      "common_misconceptions": "Children often think invertebrates are less important or less complex than vertebrates — invertebrates actually make up about 97% of all animal species. Some pupils classify organisms by habitat rather than biological features (putting dolphins with fish because they live in water). Children may not recognise that fungi are a separate group, not plants — fungi do not photosynthesise. Some pupils think classification is about personal preference rather than observable shared characteristics.",
      "teaching_weight": 5,
      "co_teach_hints": [
        "SC-KS2-C044",
        "SC-KS2-C059"
      ]
    },
    {
      "concept_id": "SC-KS2-C059",
      "domain_id": "SC-KS2-D007",
      "concept_name": "Micro-organisms",
      "description": "Introduction to micro-organisms as a broad group of living things too small to see with the naked eye. Included in the formal classification of living things. Not yet expected to classify into bacteria, fungi, viruses etc. at this stage.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "year": [
        6
      ],
      "teaching_guidance": "Introduce micro-organisms through practical examples: grow bread mould, observe yeast producing bubbles when mixed with warm water and sugar, discuss bacteria in yoghurt-making. Use microscope images or videos to show the diversity of micro-organisms. Discuss both helpful micro-organisms (yeast for bread, bacteria for decomposition, gut bacteria for digestion) and harmful ones (bacteria causing food poisoning, viruses causing illness). Link to hygiene — handwashing, food safety. Emphasise that micro-organisms are living things that are too small to see without a microscope. At this stage, pupils need not classify them into bacteria, viruses and fungi.",
      "key_vocabulary": "micro-organism, microbe, bacteria, virus, fungi, yeast, mould, microscope, tiny, invisible, decompose, disease, hygiene, helpful, harmful, living",
      "common_misconceptions": "Children commonly believe that all micro-organisms are harmful 'germs', when many are essential for life — decomposition, digestion, food production. Some pupils think micro-organisms are not really alive because they cannot be seen. Children may confuse bacteria and viruses, thinking they are the same thing and can be treated the same way (antibiotics work against bacteria but not viruses). Some pupils think micro-organisms only exist in 'dirty' places.",
      "teaching_weight": 5,
      "co_teach_hints": [
        "SC-KS2-C030",
        "SC-KS2-C045",
        "SC-KS2-C058"
      ]
    },
    {
      "concept_id": "SC-KS2-C060",
      "domain_id": "SC-KS2-D003",
      "concept_name": "Circulatory System",
      "description": "Understanding the main parts of the human circulatory system: heart (pump), blood vessels (arteries carry oxygenated blood from heart, veins return deoxygenated blood, capillaries enable exchange). Blood transports nutrients, oxygen and waste. Functions of each component.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "year": [
        6
      ],
      "teaching_guidance": "Use a large diagram or 3D model of the heart showing its chambers, valves and connected blood vessels. Demonstrate the pumping action by squeezing a rubber ball to simulate heartbeats. Measure pulse rate before and after exercise to show the heart responds to the body's needs. Trace the route of blood: heart → arteries → capillaries (where exchange occurs) → veins → heart → lungs (for oxygen) → heart. Use red and blue to distinguish oxygenated and deoxygenated blood in diagrams. Discuss the role of blood in transporting oxygen, nutrients and waste. Link to the respiratory system — the lungs oxygenate blood before it returns to the heart.",
      "key_vocabulary": "heart, blood, blood vessel, artery, vein, capillary, pump, oxygenated, deoxygenated, oxygen, circulatory system, pulse, chamber, valve, lung, transport, cell",
      "common_misconceptions": "Children often think the heart is on the left side of the chest — it is actually roughly central, slightly to the left. Some pupils believe blood is blue in veins and red in arteries — blood is always red; deoxygenated blood is dark red, not blue (veins appear blue through the skin due to how light penetrates tissue). Children may think the heart only pumps blood one way, not understanding the double circulation through the lungs and around the body.",
      "teaching_weight": 5,
      "co_teach_hints": [
        "SC-KS2-C017",
        "SC-KS2-C018",
        "SC-KS2-C031",
        "SC-KS2-C032",
        "SC-KS2-C061",
        "SC-KS2-C062"
      ]
    },
    {
      "concept_id": "SC-KS2-C061",
      "domain_id": "SC-KS2-D003",
      "concept_name": "Diet, Exercise, Drugs and Lifestyle",
      "description": "Understanding that diet, exercise, drugs and lifestyle choices affect how the body functions. Both beneficial choices (regular exercise, balanced diet) and harmful choices (drugs, poor diet) have impacts on body function and health.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "year": [
        6
      ],
      "teaching_guidance": "Investigate the effects of exercise on heart rate and breathing rate through practical measurement — measure resting pulse, exercise for 2 minutes, then measure pulse again at intervals. Discuss the components of a balanced diet using the Eatwell Guide, linking nutrient types to body functions (protein for growth and repair, carbohydrates for energy, fats for insulation and energy). Discuss the impact of harmful substances — tobacco on lungs and circulation, alcohol on the liver and brain — using age-appropriate resources. Explore lifestyle choices: sleep, hydration, mental health. Use case studies or role-play scenarios where characters make different lifestyle choices and discuss the consequences.",
      "key_vocabulary": "diet, exercise, balanced, healthy, nutrient, drug, tobacco, alcohol, lifestyle, heart rate, breathing rate, energy, protein, carbohydrate, fat, vitamin, organ, wellbeing",
      "common_misconceptions": "Children often think 'drugs' only refers to illegal substances, not understanding that medicines, caffeine and alcohol are also drugs. Some pupils believe that exercise is only beneficial if you are overweight, rather than understanding its benefits for cardiovascular health, mental health and bone strength regardless of weight. Children may think a 'balanced diet' means eating equal amounts of all food groups, rather than proportions recommended in the Eatwell Guide.",
      "teaching_weight": 5,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C062",
      "domain_id": "SC-KS2-D003",
      "concept_name": "Nutrient and Water Transport in Animals",
      "description": "Understanding that the circulatory system transports nutrients (absorbed from the small intestine) and water to all cells in the body. Blood is the transport medium. This links the digestive system output to the circulatory system.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "year": [
        6
      ],
      "teaching_guidance": "Link the digestive system (studied in Y4) to the circulatory system: nutrients absorbed through the wall of the small intestine enter the blood and are transported to cells throughout the body. Use diagrams showing blood capillaries surrounding the small intestine to illustrate absorption. Discuss what happens to water — absorbed mainly in the large intestine and transported by blood. Trace the journey of a nutrient molecule from food on the plate through digestion, absorption, transport in blood and delivery to a cell. This concept bridges Y4 digestion knowledge with Y6 circulation knowledge, building an integrated understanding of body systems working together.",
      "key_vocabulary": "nutrient, water, transport, blood, circulatory system, digestive system, absorb, small intestine, large intestine, cell, capillary, dissolve, deliver, oxygen, waste, organ system",
      "common_misconceptions": "Children often think food goes directly from the stomach to the rest of the body without understanding the role of the small intestine in absorption and the blood in transport. Some pupils believe the body uses food in its original form (e.g., a piece of bread reaching the muscles) rather than understanding that food must be broken down into tiny dissolved nutrient molecules. Children may not connect the digestive and circulatory systems as working together.",
      "teaching_weight": 5,
      "co_teach_hints": [
        "SC-KS2-C031",
        "SC-KS2-C060"
      ]
    },
    {
      "concept_id": "SC-KS2-C063",
      "domain_id": "SC-KS2-D014",
      "concept_name": "Fossils as Evidence of Change Over Time",
      "description": "Understanding that fossils (introduced in Y3 as trapped remains in rock) provide evidence that living things have changed over time and that animals and plants that no longer exist once lived on Earth millions of years ago.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "year": [
        6
      ],
      "teaching_guidance": "Revisit fossil knowledge from Year 3 and extend it to the concept of change over time. Compare fossils of extinct organisms with their closest living relatives — for example, ammonites with modern nautilus, trilobites with modern woodlice. Use a geological timeline to show when major groups appeared and disappeared. Discuss what fossils tell us: the types of organisms that existed, the environments they lived in, and how life has changed over millions of years. Link to Darwin's use of fossil evidence in developing his theory of evolution. Examine the concept of extinction — why species disappear and what causes it.",
      "key_vocabulary": "fossil, evidence, extinct, change, time, millions of years, species, organism, geological, ancient, remains, compare, ancestor, descendant, evolution, palaeontology",
      "common_misconceptions": "Children often think dinosaurs and humans lived at the same time. Dinosaurs became extinct approximately 66 million years ago; modern humans appeared around 300,000 years ago. Some pupils believe that fossils are only of dinosaurs, not recognising the vast range of fossilised organisms (plants, shells, fish, insects). Children may think that if a species goes extinct, it was somehow 'inferior', rather than understanding that extinction results from environmental change exceeding a species' ability to adapt.",
      "teaching_weight": 5,
      "co_teach_hints": [
        "SC-KS2-C066"
      ]
    },
    {
      "concept_id": "SC-KS2-C064",
      "domain_id": "SC-KS2-D014",
      "concept_name": "Variation in Offspring",
      "description": "Understanding that living things reproduce offspring of the same kind, but that offspring vary and are not identical to their parents or to each other. This natural variation within species is the raw material for natural selection. Genes/chromosomes not required at this stage.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "year": [
        6
      ],
      "teaching_guidance": "Explore variation within the class — measure hand span, height, arm length, eye colour, and discuss why no two people are identical (except identical twins, who share DNA). Compare parents and offspring using photographs: children resemble their parents but are not identical to them. Investigate variation in other organisms — leaf size in a species of tree, shell patterns in snails. Distinguish between inherited variation (eye colour, nose shape) and environmental variation (scars, hairstyle, language). At this stage, genes and chromosomes are not required, but the idea that characteristics are passed from parent to offspring through reproduction should be established.",
      "key_vocabulary": "variation, offspring, parent, inherit, characteristic, feature, similar, different, species, reproduce, identical, unique, trait, generation, diversity",
      "common_misconceptions": "Children often think offspring are exact copies of their parents or an exact 50/50 mix. Offspring inherit a combination of characteristics but the expression is complex and not a simple blend. Some pupils confuse inherited characteristics with learned or environmental characteristics — speaking English is environmental, not inherited. Children may believe that individual organisms can change their characteristics during their lifetime and pass these changes to offspring (Lamarckian inheritance), which is incorrect.",
      "teaching_weight": 5,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C065",
      "domain_id": "SC-KS2-D014",
      "concept_name": "Adaptation",
      "description": "Understanding that animals and plants have features that help them survive in their particular environment. These adaptations may be structural (camouflage, body shape, insulation) or behavioural. Different environments select for different adaptations.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "year": [
        6
      ],
      "teaching_guidance": "Use striking examples of adaptation to engage pupils: polar bear fur (insulation and camouflage), cactus spines (reduced water loss), giraffe neck (reaching high vegetation), woodpecker beak (drilling into wood). Compare organisms from different environments — arctic versus desert, deep sea versus rainforest — and identify how their features help them survive. Challenge pupils to design an imaginary animal adapted to a specific environment, justifying each feature. Investigate examples of camouflage using peppered moth photographs. Distinguish between structural adaptations (physical features) and behavioural adaptations (migration, hibernation, nocturnal activity).",
      "key_vocabulary": "adaptation, adapted, environment, habitat, survive, feature, structural, behavioural, camouflage, predator, prey, competition, advantage, suited, desert, arctic, specialised",
      "common_misconceptions": "Children commonly think that individual animals deliberately adapt or choose to develop helpful features in response to their environment (e.g., 'giraffes stretched their necks to reach high leaves'). Adaptation occurs over many generations through natural selection, not within an individual's lifetime. Some pupils think adaptation means animals are perfectly suited to their environment — in reality, organisms are 'good enough' rather than optimal. Children may believe that adaptation is a conscious or intentional process.",
      "teaching_weight": 5,
      "co_teach_hints": []
    },
    {
      "concept_id": "SC-KS2-C066",
      "domain_id": "SC-KS2-D014",
      "concept_name": "Evolution",
      "description": "Understanding that adaptation may lead to evolution — that over very long periods of time, variation and natural selection can lead to populations becoming better adapted to their environments and to the development of new species. Work of Darwin and Wallace.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "year": [
        6
      ],
      "teaching_guidance": "Build from the concepts of variation, inheritance and adaptation to explain evolution by natural selection: organisms vary; those with advantageous variations are more likely to survive and reproduce; their offspring inherit these variations; over many generations, the population changes. Use the peppered moth example (light moths on soot-covered trees during the Industrial Revolution) as a well-documented case study. Discuss Darwin's and Wallace's contributions and the evidence they gathered. Use simulations (e.g., bird beak tools picking up different 'food' types) to model natural selection. Emphasise the timescale — evolution typically occurs over thousands or millions of years, not within a single lifetime.",
      "key_vocabulary": "evolution, natural selection, variation, adaptation, inherit, generation, species, survival, reproduce, population, change, Darwin, Wallace, evidence, theory, extinction, ancestor",
      "common_misconceptions": "The most common misconception is that individual organisms evolve during their lifetime — evolution occurs across populations over many generations. Children may think evolution has a goal or direction ('aiming' towards a perfect form), when it is an undirected process driven by environmental pressures. Some pupils confuse evolution with metamorphosis (a frog changing from tadpole) or with individual growth. Children may think that evolution means species 'improve' over time, rather than understanding that species become better adapted to their current environment.",
      "teaching_weight": 5,
      "co_teach_hints": [
        "SC-KS2-C065"
      ]
    },
    {
      "concept_id": "SC-KS2-C067",
      "domain_id": "SC-KS2-D005",
      "concept_name": "Light Travels in Straight Lines",
      "description": "The explanatory model that light travels in straight lines from sources. This model explains why we see objects (light reaches our eyes directly from sources or via reflection), why shadows have the same shape as the object casting them, and how optical instruments work.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "year": [
        6
      ],
      "teaching_guidance": "Demonstrate that light travels in straight lines by shining a torch through a series of cards with holes — the light only reaches the end if all holes are aligned. Use laser pointers (teacher-operated, safely) in a dusty or misty room to show the straight beam. Apply the straight-line model to explain how shadows have the same shape as the opaque object — draw ray diagrams showing light blocked by the object. Explain how we see objects: light from a source reflects off an object and travels in a straight line to our eyes. Use ray diagrams to model this process. Revisit shadow formation from Y3 and explain it using this model.",
      "key_vocabulary": "light, straight line, ray, beam, source, reflect, eye, shadow, opaque, ray diagram, travel, block, illuminate, direction, model, refract",
      "common_misconceptions": "Children often think light travels from the eye to the object (emission theory) rather than from the object to the eye. This misconception has deep historical roots and is very persistent. Some pupils believe light can bend around corners — it cannot without a reflective or refractive surface. Children may think shadows are dark because they contain something (a dark substance) rather than understanding that a shadow is simply an area where light does not reach.",
      "teaching_weight": 5,
      "co_teach_hints": [
        "SC-KS2-C024"
      ]
    },
    {
      "concept_id": "SC-KS2-C068",
      "domain_id": "SC-KS2-D010",
      "concept_name": "Circuit Symbols and Diagrams",
      "description": "Using recognised standard symbols to represent components in circuit diagrams: cell, battery, bulb, switch, buzzer, wire. Ability to draw and interpret circuit diagrams using standard symbols, building on pictorial representations from Year 4.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "year": [
        6
      ],
      "teaching_guidance": "Teach the standard circuit symbols systematically: cell (long and short parallel lines), battery (multiple cells), bulb (circle with cross), switch (break in line), buzzer (semicircle), wire (straight line), motor (circle with M). Provide printed symbol reference cards. Practise converting pictorial circuit drawings into standard symbol diagrams and vice versa. Build circuits from diagrams and draw diagrams from built circuits. Emphasise the advantages of standard symbols — they are understood internationally and remove ambiguity. Use circuit diagram puzzles where pupils predict whether a circuit will work based on the diagram. Link to Y4 practical circuit-building skills.",
      "key_vocabulary": "circuit diagram, symbol, cell, battery, bulb, switch, buzzer, motor, wire, component, series, standard, represent, draw, interpret, connect, international",
      "common_misconceptions": "Children often confuse the symbols for a cell and a battery — a single cell has one long and one short line; a battery (multiple cells) has several pairs. Some pupils draw circuit diagrams with gaps or components floating rather than connected in a complete loop. Children may think the diagram represents the physical layout of the circuit rather than understanding it as a schematic representation — components do not need to be in the same spatial positions as in the real circuit.",
      "teaching_weight": 4,
      "co_teach_hints": [
        "SC-KS2-C041",
        "SC-KS2-C043"
      ]
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "SC-KS1-C001",
      "dependent_concept": "SC-KS2-C001",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "KS1 asking simple questions is the direct predecessor to KS2 asking relevant questions and choosing enquiry type. The curriculum explicitly builds from simple to relevant questions and from single method to choosing the most appropriate enquiry type."
    },
    {
      "prerequisite_concept": "SC-KS1-C003",
      "dependent_concept": "SC-KS2-C002",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "KS1 simple testing is directly developed into KS2 fair and comparative testing with identified variables. The curriculum explicitly states this progression: from 'simple tests' to 'setting up simple practical enquiries, comparative and fair tests'."
    },
    {
      "prerequisite_concept": "SC-KS1-C039",
      "dependent_concept": "SC-KS2-C002",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 comparative testing method is the direct foundation for KS2 comparative and fair testing. The comparative test approach is formalised and extended."
    },
    {
      "prerequisite_concept": "SC-KS1-C041",
      "dependent_concept": "SC-KS2-C003",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 using simple measurements develops into KS2 systematic measurement with standard units using a wider range of equipment. Direct skill progression."
    },
    {
      "prerequisite_concept": "SC-KS1-C006",
      "dependent_concept": "SC-KS2-C004",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "KS1 data recording (tables, charts, drawings) is directly extended in KS2 to include classification, bar charts and keys. Explicit curriculum progression."
    },
    {
      "prerequisite_concept": "SC-KS1-C005",
      "dependent_concept": "SC-KS2-C005",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "KS1 drawing conclusions from observations develops into KS2 drawing conclusions and making predictions for new values. Prediction is the key addition."
    },
    {
      "prerequisite_concept": "SC-KS1-C042",
      "dependent_concept": "SC-KS2-C006",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 scientific communication develops into KS2 formal reporting with oral and written explanations and presentations for different audiences."
    },
    {
      "prerequisite_concept": "SC-KS2-C002",
      "dependent_concept": "SC-KS2-C007",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "Lower KS2 fair testing (identifying and controlling variables informally) is the direct prerequisite for Upper KS2 formal variable control in enquiry planning. Explicit curriculum progression from Y3-4 to Y5-6 Working Scientifically."
    },
    {
      "prerequisite_concept": "SC-KS2-C003",
      "dependent_concept": "SC-KS2-C008",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "Lower KS2 systematic measurement with standard units develops into Upper KS2 precision and repeat measurements. Explicit curriculum progression."
    },
    {
      "prerequisite_concept": "SC-KS2-C004",
      "dependent_concept": "SC-KS2-C009",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Lower KS2 data classification and presentation (bar charts, tables, keys) develops into Upper KS2 complex recording including scatter graphs and line graphs."
    },
    {
      "prerequisite_concept": "SC-KS2-C005",
      "dependent_concept": "SC-KS2-C010",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Lower KS2 drawing conclusions develops into Upper KS2 identifying causal relationships and evaluating evidence. Explicit curriculum progression in depth of analysis."
    },
    {
      "prerequisite_concept": "SC-KS1-C010",
      "dependent_concept": "SC-KS2-C011",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "KS1 plant structure (naming parts: roots, stem, leaves, flowers) is the direct prerequisite for KS2 plant part functions (what those parts do). Curriculum explicitly builds from identification to function."
    },
    {
      "prerequisite_concept": "SC-KS1-C013",
      "dependent_concept": "SC-KS2-C012",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 plant requirements (water, light, temperature) are directly extended in Y3 to include air, nutrients from soil, and room to grow. Explicit curriculum extension."
    },
    {
      "prerequisite_concept": "SC-KS2-C011",
      "dependent_concept": "SC-KS2-C013",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Understanding the function of stems (support and transport) is necessary before investigating water transport within plants. Structure-function relationship established first."
    },
    {
      "prerequisite_concept": "SC-KS1-C014",
      "dependent_concept": "SC-KS2-C014",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 germination (seeds beginning to grow) is incorporated into the full Y3 flowering plant life cycle which adds pollination, seed formation and seed dispersal. Direct content extension."
    },
    {
      "prerequisite_concept": "SC-KS1-C012",
      "dependent_concept": "SC-KS2-C014",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS1 plant growth from seeds and bulbs provides the growth phase context for the full plant life cycle studied in Year 3."
    },
    {
      "prerequisite_concept": "SC-KS2-C014",
      "dependent_concept": "SC-KS2-C015",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.95,
      "rationale": "Pollination is a component of the flowering plant life cycle — must understand the cycle before understanding individual components in detail."
    },
    {
      "prerequisite_concept": "SC-KS2-C014",
      "dependent_concept": "SC-KS2-C016",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Seed dispersal is a component of the plant life cycle — must understand the cycle context before studying individual dispersal mechanisms."
    },
    {
      "prerequisite_concept": "SC-KS1-C022",
      "dependent_concept": "SC-KS2-C017",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 basic needs of animals (water, food, air) is directly extended in Y3 to focus specifically on nutrition requirements — types and amounts — and the distinction between animal and plant nutrition."
    },
    {
      "prerequisite_concept": "SC-KS1-C018",
      "dependent_concept": "SC-KS2-C018",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.75,
      "rationale": "KS1 human body parts knowledge provides the context for Y3 skeletal and muscular systems, which require understanding of body part locations and functions."
    },
    {
      "prerequisite_concept": "SC-KS1-C025",
      "dependent_concept": "SC-KS2-C019",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS1 material identification (including rock) is the direct prerequisite for Y3 rock classification — pupils already know rocks as a material category, now they classify subtypes."
    },
    {
      "prerequisite_concept": "SC-KS1-C026",
      "dependent_concept": "SC-KS2-C019",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS1 material properties (hard/soft, rough/smooth, etc.) provide the vocabulary and approach for comparing rocks based on their physical properties in Year 3."
    },
    {
      "prerequisite_concept": "SC-KS1-C032",
      "dependent_concept": "SC-KS2-C020",
      "confidence": "inferred",
      "relationship_type": "foundational",
      "strength": 0.7,
      "rationale": "KS1 understanding that things can be living, dead or never alive provides the conceptual basis for understanding that fossils are the remains of once-living things."
    },
    {
      "prerequisite_concept": "SC-KS2-C020",
      "dependent_concept": "SC-KS2-C063",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "Y3 fossil formation knowledge is directly extended in Y6 evolution to use fossils as evidence of change in living things over time. The curriculum notes explicitly reference this connection."
    },
    {
      "prerequisite_concept": "SC-KS1-C026",
      "dependent_concept": "SC-KS2-C022",
      "confidence": "inferred",
      "relationship_type": "foundational",
      "strength": 0.7,
      "rationale": "KS1 material properties including transparent/opaque provides the vocabulary for Y3 light work distinguishing opaque objects that block light from transparent ones."
    },
    {
      "prerequisite_concept": "SC-KS2-C022",
      "dependent_concept": "SC-KS2-C067",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "Y3 observable light phenomena (need light to see, reflection, shadows) provide the experiential foundation that the Y6 straight-line travel model is designed to explain. Curriculum notes explicitly state Y6 builds on Y3 light work."
    },
    {
      "prerequisite_concept": "SC-KS2-C023",
      "dependent_concept": "SC-KS2-C067",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Y3 observed reflection is explained in Y6 using the straight-line light travel model — reflection is the basis for seeing non-luminous objects."
    },
    {
      "prerequisite_concept": "SC-KS2-C024",
      "dependent_concept": "SC-KS2-C067",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Y3 shadow formation observations are explained in Y6 using the straight-line light travel model. The Y6 objective explicitly references explaining why shadows have the same shape as the casting object."
    },
    {
      "prerequisite_concept": "SC-KS1-C026",
      "dependent_concept": "SC-KS2-C027",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.75,
      "rationale": "KS1 material properties (rough/smooth) provides vocabulary for understanding that surface texture affects friction. Smooth surfaces produce less friction than rough surfaces."
    },
    {
      "prerequisite_concept": "SC-KS2-C027",
      "dependent_concept": "SC-KS2-C056",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Y3 friction and surface observations are directly extended in Y5 Forces to include air resistance and water resistance as resistance forces. Friction is explicitly mentioned again in Y5."
    },
    {
      "prerequisite_concept": "SC-KS2-C025",
      "dependent_concept": "SC-KS2-C055",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Y3 concept of non-contact forces (magnetic forces act at a distance) provides the conceptual framework for Y5 gravity as another non-contact force acting at a distance."
    },
    {
      "prerequisite_concept": "SC-KS1-C004",
      "dependent_concept": "SC-KS2-C029",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS1 classification and grouping is the direct foundation for Y4 understanding that living things can be grouped in a variety of ways using different criteria."
    },
    {
      "prerequisite_concept": "SC-KS1-C015",
      "dependent_concept": "SC-KS2-C029",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS1 animal classification by vertebrate group provides specific experience of grouping animals that directly feeds into Y4 understanding of classification variety and flexibility."
    },
    {
      "prerequisite_concept": "SC-KS1-C036",
      "dependent_concept": "SC-KS2-C030",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS1 habitat suitability (living things need suitable habitats) is the direct predecessor for Y4 environmental change concept — if environments change, habitat suitability may be lost."
    },
    {
      "prerequisite_concept": "SC-KS2-C029",
      "dependent_concept": "SC-KS2-C028",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Understanding that living things can be classified by different criteria is necessary before classification keys (which formalise one approach to classification) can be used meaningfully."
    },
    {
      "prerequisite_concept": "SC-KS1-C022",
      "dependent_concept": "SC-KS2-C031",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "KS1 basic needs of animals includes food/nutrition. Y4 digestive system explains how the body processes food to extract nutrition — mechanistic explanation of the feeding need."
    },
    {
      "prerequisite_concept": "SC-KS2-C017",
      "dependent_concept": "SC-KS2-C031",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Y3 animal nutrition concept (animals need right types and amounts of food) provides the context for Y4 digestive system — digestion is how animals obtain nutrition from food."
    },
    {
      "prerequisite_concept": "SC-KS1-C038",
      "dependent_concept": "SC-KS2-C033",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "KS1 simple food chains are directly extended in Y4 to include producer/predator/prey vocabulary. The curriculum explicitly notes this as an extension of food chain understanding. Y4 adds formal ecological terminology."
    },
    {
      "prerequisite_concept": "SC-KS2-C017",
      "dependent_concept": "SC-KS2-C033",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.85,
      "rationale": "Y3 nutrition concept (animals get nutrition from what they eat) provides the underpinning rationale for food chains showing energy and nutrient flow through an ecosystem."
    },
    {
      "prerequisite_concept": "SC-KS1-C028",
      "dependent_concept": "SC-KS2-C034",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS1 physical transformation of materials (squashing, bending etc.) is prior knowledge for Y4 states of matter — pupils already know materials can be in different forms; now they learn the systematic framework of solid/liquid/gas."
    },
    {
      "prerequisite_concept": "SC-KS1-C027",
      "dependent_concept": "SC-KS2-C034",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.7,
      "rationale": "KS1 material suitability includes matching material properties to uses — understanding solids, liquids and gases as categories extends this classification system."
    },
    {
      "prerequisite_concept": "SC-KS2-C034",
      "dependent_concept": "SC-KS2-C035",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.95,
      "rationale": "Understanding the three states of matter is essential before understanding changes between states — pupils must know what the states are before they can understand transitions between them."
    },
    {
      "prerequisite_concept": "SC-KS2-C035",
      "dependent_concept": "SC-KS2-C036",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Understanding evaporation and condensation as changes of state is essential for understanding the water cycle, which is driven by these two state changes."
    },
    {
      "prerequisite_concept": "SC-KS2-C034",
      "dependent_concept": "SC-KS2-C049",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Y4 states of matter knowledge is explicitly referenced in Y5 separation of mixtures objective — pupils 'use knowledge of solids, liquids and gases to decide how mixtures might be separated'."
    },
    {
      "prerequisite_concept": "SC-KS2-C035",
      "dependent_concept": "SC-KS2-C050",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Y4 changes of state (melting, freezing, evaporation, condensation) are explicitly named as reversible changes in Y5. Y4 knowledge is categorised and explained in Y5."
    },
    {
      "prerequisite_concept": "SC-KS1-C026",
      "dependent_concept": "SC-KS2-C047",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 material properties (hard/soft, transparent/opaque etc.) directly feeds into Y5 extended material properties which adds solubility, conductivity and magnetic response. Systematic extension of the same conceptual framework."
    },
    {
      "prerequisite_concept": "SC-KS2-C026",
      "dependent_concept": "SC-KS2-C047",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Y3 magnetic properties (materials attracted to magnets) is explicitly referenced in Y5 material properties — response to magnets is one of the properties in the Y5 systematic framework. Curriculum notes reference Y3 magnetism link."
    },
    {
      "prerequisite_concept": "SC-KS2-C042",
      "dependent_concept": "SC-KS2-C047",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Y4 electrical conductors and insulators is explicitly referenced in Y5 material properties — electrical conductivity is one of the properties in the Y5 systematic framework. Curriculum notes reference Y4 electricity link."
    },
    {
      "prerequisite_concept": "SC-KS1-C020",
      "dependent_concept": "SC-KS2-C044",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 animal life cycles (offspring grow into adults, examples of egg-chick-chicken, spawn-tadpole-frog) is the direct prerequisite for Y5 comparative study of life cycles across mammals, amphibians, insects and birds."
    },
    {
      "prerequisite_concept": "SC-KS2-C014",
      "dependent_concept": "SC-KS2-C045",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Y3 flowering plant life cycle (including pollination and seed formation) provides the plant reproduction knowledge that Y5 reproduction topic formalises and extends to include asexual reproduction."
    },
    {
      "prerequisite_concept": "SC-KS2-C044",
      "dependent_concept": "SC-KS2-C045",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Y5 life cycle comparison provides the context for understanding reproduction — life cycles include reproductive stages that are then studied in more detail."
    },
    {
      "prerequisite_concept": "SC-KS1-C021",
      "dependent_concept": "SC-KS2-C046",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 human growth stages (baby to adult) is directly extended in Y5 to include puberty, ageing and the full timeline from birth to old age. Explicit curriculum extension."
    },
    {
      "prerequisite_concept": "SC-KS1-C031",
      "dependent_concept": "SC-KS2-C053",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "KS1 day length variation (longer in summer, shorter in winter) is explained in Y5 by Earth's rotation and orbital position. The observable phenomenon from KS1 is given its scientific explanation."
    },
    {
      "prerequisite_concept": "SC-KS1-C029",
      "dependent_concept": "SC-KS2-C052",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.7,
      "rationale": "KS1 the four seasons provides the prior understanding that Earth orbits the Sun annually (implied by seasonal cycle). Y5 solar system makes the Earth's orbital motion explicit and extends to the full solar system model."
    },
    {
      "prerequisite_concept": "SC-KS2-C028",
      "dependent_concept": "SC-KS2-C058",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Y4 classification keys are the practical tool that Y6 formal biological classification system relies on. The Y6 curriculum notes explicitly state it builds on Y4 grouping work."
    },
    {
      "prerequisite_concept": "SC-KS2-C029",
      "dependent_concept": "SC-KS2-C058",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Y4 understanding that living things can be grouped in various ways provides the foundation for Y6 formal classification — which formalises one specific hierarchical system. Curriculum explicitly links these."
    },
    {
      "prerequisite_concept": "SC-KS2-C018",
      "dependent_concept": "SC-KS2-C060",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.85,
      "rationale": "Y3 skeletal and muscular systems introduces pupils to internal body systems, preparing them for Y6 circulatory system study. Curriculum notes state Y6 builds on Y3/4 body systems knowledge."
    },
    {
      "prerequisite_concept": "SC-KS2-C031",
      "dependent_concept": "SC-KS2-C060",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Y4 digestive system knowledge is directly linked to Y6 circulatory system — the circulatory system transports nutrients absorbed by the digestive system. Curriculum explicitly links these systems."
    },
    {
      "prerequisite_concept": "SC-KS2-C031",
      "dependent_concept": "SC-KS2-C062",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Understanding how the digestive system absorbs nutrients is prerequisite for understanding how the circulatory system then transports those nutrients to cells throughout the body."
    },
    {
      "prerequisite_concept": "SC-KS1-C023",
      "dependent_concept": "SC-KS2-C061",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 human health requirements (exercise, diet, hygiene) is directly extended in Y6 to include drugs and wider lifestyle factors, and is linked to specific body system function rather than just general health."
    },
    {
      "prerequisite_concept": "SC-KS2-C063",
      "dependent_concept": "SC-KS2-C066",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Fossil evidence of change over time is the empirical basis for the concept of evolution — evolution is the scientific explanation for why living things have changed over millions of years as shown by the fossil record."
    },
    {
      "prerequisite_concept": "SC-KS2-C064",
      "dependent_concept": "SC-KS2-C066",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.95,
      "rationale": "Variation in offspring is the raw material for natural selection and evolution — without variation, natural selection cannot operate. The curriculum explicitly links these: 'adaptation may lead to evolution'."
    },
    {
      "prerequisite_concept": "SC-KS2-C065",
      "dependent_concept": "SC-KS2-C066",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Adaptation is the intermediate step between variation and evolution — the curriculum presents adaptation as leading to evolution. Adaptation must be understood before the fuller evolutionary concept."
    },
    {
      "prerequisite_concept": "SC-KS2-C041",
      "dependent_concept": "SC-KS2-C043",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "Y4 series circuit construction is the direct prerequisite for Y6 voltage and circuit effects — pupils need practical circuit experience before understanding voltage effects on component behaviour. Curriculum notes explicitly reference Y4 work."
    },
    {
      "prerequisite_concept": "SC-KS2-C041",
      "dependent_concept": "SC-KS2-C068",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Y4 pictorial circuit representations are explicitly referenced as the precursor to Y6 standard circuit symbols. Curriculum notes state conventional symbols are introduced in Y6 after pictorial representations in Y4."
    },
    {
      "prerequisite_concept": "SC-KS2-C001",
      "dependent_concept": "SC-KS2-C007",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Lower KS2 enquiry selection skill develops into Upper KS2 full enquiry planning with variable control. Each band's Working Scientifically builds directly on the previous."
    },
    {
      "prerequisite_concept": "SC-KS2-C006",
      "dependent_concept": "SC-KS2-C010",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Lower KS2 scientific reporting develops into Upper KS2 reporting with causal relationships and evaluation of trust in results — a deeper level of scientific communication."
    },
    {
      "prerequisite_concept": "SC-KS2-C044",
      "dependent_concept": "SC-KS2-C064",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Y5 comparative life cycles (offspring grow from reproduction) provides context for Y6 variation in offspring — pupils who understand reproduction understand that offspring are produced, setting up the concept that these offspring vary."
    },
    {
      "prerequisite_concept": "SC-KS2-C019",
      "dependent_concept": "SC-KS2-C021",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.85,
      "rationale": "Y3 rock classification introduces rock types and the fact that rocks can be broken down — prerequisite for understanding soil composition which requires knowing what rocks are and that they weather into smaller particles."
    },
    {
      "prerequisite_concept": "SC-KS2-C021",
      "dependent_concept": "SC-KS2-C012",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.75,
      "rationale": "Understanding soil composition (made from rock and organic matter) provides foundation for understanding how soil provides nutrients to plants — one of the plant growth requirements in Y3."
    },
    {
      "prerequisite_concept": "SC-KS2-C052",
      "dependent_concept": "SC-KS2-C053",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.95,
      "rationale": "Understanding the solar system model (Earth orbiting the Sun) is prerequisite for using Earth's rotation to explain day and night — both are part of the same Y5 topic and the orbital model provides necessary context."
    },
    {
      "prerequisite_concept": "SC-KS2-C037",
      "dependent_concept": "SC-KS2-C038",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.95,
      "rationale": "Understanding that vibration causes sound is prerequisite for understanding how vibrations travel through a medium to the ear — both are within Y4 Sound but vibration cause precedes transmission."
    },
    {
      "prerequisite_concept": "SC-KS2-C037",
      "dependent_concept": "SC-KS2-C039",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Understanding that vibration causes sound is necessary before investigating how features of the vibrating object affect the pitch of the sound produced."
    },
    {
      "prerequisite_concept": "SC-KS2-C037",
      "dependent_concept": "SC-KS2-C040",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Understanding that vibration causes sound is necessary before investigating how vibration strength (amplitude) relates to volume."
    }
  ]
}
