[
  {
    "suggestion_id": "TS-SC-KS2-001",
    "name": "Friction Investigation",
    "suggestion_type": "prescribed_topic",
    "subject": "Science",
    "key_stage": "KS2",
    "curriculum_status": "mandatory",
    "curriculum_reference": [
      "KS2 Science: Forces — notice that some forces need contact between two objects, but magnetic forces can act at a distance",
      "Y5 Forces: identify the effects of air resistance, water resistance and friction, that act between moving surfaces"
    ],
    "pedagogical_rationale": "Fair testing is the cornerstone enquiry type for KS2, and friction provides a concrete, measurable context that pupils can investigate with everyday materials. Varying surface type while measuring distance travelled builds understanding of variables, fair testing, and the concept of friction as a contact force that opposes motion.",
    "common_pitfalls": [
      "Pupils confuse friction with gravity or air resistance — clarify friction requires contact between two surfaces",
      "Inconsistent release of the car on the ramp leads to unreliable data — model a consistent release technique",
      "Pupils may think smooth surfaces have 'no friction' rather than 'less friction'"
    ],
    "cross_curricular_hooks": [
      "[Maths] Measuring in centimetres, recording in tables, drawing bar charts",
      "[English] Writing a scientific conclusion using causal connectives (because, therefore, as a result)",
      "[DT] Exploring friction in mechanisms and moving parts"
    ],
    "sensitive_content_notes": [],
    "definitions": ["friction", "force", "contact force", "surface", "fair test", "variable", "conclusion"],
    "display_category": "Topic Suggestion",
    "display_color": "#059669",
    "display_icon": "lightbulb",
    "enquiry_type": "fair_test",
    "science_discipline": "physics",
    "equipment": ["ramp", "toy car", "metre stick", "surface samples (carpet, wood, sandpaper, tile, fabric)", "masking tape"],
    "safety_notes": "Low risk. Ensure ramp is stable and surfaces are secured flat. Keep the floor area clear to prevent tripping over ramp equipment.",
    "hazard_level": "low",
    "expected_outcome": "Rougher surfaces produce more friction, so the car travels a shorter distance. Smooth surfaces produce less friction.",
    "recording_format": ["table of results", "bar chart", "written conclusion"],
    "misconceptions": [
      "Friction only happens when things are moving — in fact, static friction acts on stationary objects too",
      "Smooth surfaces have no friction — all surfaces have some friction, smooth surfaces just have less",
      "Friction is always unhelpful — friction is essential for walking, gripping, and braking"
    ],
    "variables": {
      "independent": "surface type (carpet, wood, sandpaper, tile, fabric)",
      "dependent": "distance travelled by toy car (cm)",
      "controlled": ["ramp angle", "car mass", "release point", "same car"]
    },
    "delivers_via": [
      {"concept_id": "SC-KS2-C025", "primary": true},
      {"concept_id": "SC-KS2-C027", "primary": false}
    ],
    "uses_template": ["VT-03"],
    "domain_ids": []
  },
  {
    "suggestion_id": "TS-SC-KS2-002",
    "name": "Plant Growth Enquiry",
    "suggestion_type": "prescribed_topic",
    "subject": "Science",
    "key_stage": "KS2",
    "curriculum_status": "mandatory",
    "curriculum_reference": [
      "KS2 Science: Living things and their habitats — explore the requirements of plants for life and growth",
      "Y3 Plants: investigate the way in which water is transported within plants; explore the requirements of plants for life and growth"
    ],
    "pedagogical_rationale": "Fair testing plant growth over several weeks develops pupils' ability to plan long-running investigations, take repeat measurements, and draw conclusions from real-world data that includes natural variation. The light variable is accessible and produces dramatic, visible results that motivate scientific explanation.",
    "common_pitfalls": [
      "Pupils water plants inconsistently across conditions, undermining the fair test — establish a watering rota",
      "Pupils expect results within days rather than weeks — set expectations and use a measurement schedule",
      "Confusing the plant growing tall in the dark (etiolation) with healthy growth — discuss what 'healthy growth' means"
    ],
    "cross_curricular_hooks": [
      "[Maths] Measuring height in centimetres, plotting line graphs to show change over time",
      "[English] Writing up a method using imperative verbs and time connectives",
      "[Geography] Discussing how climate and light availability affect plant growth globally"
    ],
    "sensitive_content_notes": [],
    "definitions": ["photosynthesis", "germination", "nutrients", "variable", "fair test", "prediction"],
    "display_category": "Topic Suggestion",
    "display_color": "#059669",
    "display_icon": "lightbulb",
    "enquiry_type": "fair_test",
    "science_discipline": "biology",
    "equipment": ["cress seeds or bean plants", "plant pots", "ruler", "watering can", "labels", "cupboard for dark condition"],
    "safety_notes": "Wash hands after handling soil. Avoid allergenic plants — check for allergies before choosing plant species. No consumption of experimental plants.",
    "hazard_level": "low",
    "expected_outcome": "Plants in full sunlight grow tallest. Plants in the dark grow tall and spindly (etiolated) but pale. Plants need light for healthy growth.",
    "recording_format": ["weekly measurement table", "line graph", "conclusion"],
    "misconceptions": [
      "Plants get their food from the soil — plants make their own food through photosynthesis; they absorb water and minerals from soil",
      "Plants only need water and sunlight to grow — plants also need carbon dioxide and minerals",
      "A tall plant is always a healthy plant — etiolated plants in the dark grow tall but are weak and pale"
    ],
    "variables": {
      "independent": "amount of light (dark cupboard, partial shade, full sunlight)",
      "dependent": "plant height (cm) measured over 3 weeks",
      "controlled": ["same type of plant", "same pot size", "same soil", "same amount of water"]
    },
    "delivers_via": [
      {"concept_id": "SC-KS2-C012", "primary": true}
    ],
    "uses_template": ["VT-03"],
    "domain_ids": []
  },
  {
    "suggestion_id": "TS-SC-KS2-003",
    "name": "Rocks and Fossils",
    "suggestion_type": "prescribed_topic",
    "subject": "Science",
    "key_stage": "KS2",
    "curriculum_status": "mandatory",
    "curriculum_reference": [
      "Y3 Rocks: compare and group together different kinds of rocks on the basis of their appearance and simple physical properties",
      "Y3 Rocks: describe in simple terms how fossils are formed when things that have lived are trapped within rock",
      "Y3 Rocks: recognise that soils are made from rocks and organic matter"
    ],
    "pedagogical_rationale": "Identifying and classifying is an essential science enquiry type that develops pupils' observational skills and ability to use evidence to sort and group. Rocks provide a tangible, hands-on context where pupils can handle real specimens, test properties, and connect classroom science to the real landscape around them.",
    "common_pitfalls": [
      "Pupils may assume all shiny rocks are the same type — encourage testing multiple properties before grouping",
      "Fossil formation is often oversimplified to 'a dead animal turns into rock' — model the sedimentation and mineralisation process step by step",
      "Pupils confuse 'soil' with 'dirt' and do not realise soil contains both rock fragments and decayed organic material"
    ],
    "cross_curricular_hooks": [
      "[Geography] Rock types in the local landscape and how geology shapes landforms",
      "[English] Non-chronological report writing about rock types or fossil formation",
      "[History] How fossils changed scientific understanding of Earth's history"
    ],
    "sensitive_content_notes": [],
    "definitions": ["igneous", "sedimentary", "metamorphic", "fossil", "soil", "mineral", "permeable", "erosion"],
    "display_category": "Topic Suggestion",
    "display_color": "#059669",
    "display_icon": "lightbulb",
    "enquiry_type": "identifying_and_classifying",
    "science_discipline": "chemistry",
    "equipment": ["rock samples (granite, chalk, sandstone, slate, marble)", "hand lenses", "vinegar (acid test for chalk)", "scratch test tools", "fossil samples"],
    "safety_notes": "Supervise scratch tests — tools can be sharp. Vinegar is a mild acid — avoid contact with eyes. Wash hands after handling rocks and soil samples.",
    "hazard_level": "low",
    "expected_outcome": "Pupils classify rocks by hardness, appearance, and reaction to acid. They understand that fossils form in sedimentary rock and that soil contains rock fragments plus organic material.",
    "recording_format": ["classification table with observable properties", "Venn diagram", "labelled diagrams of fossil formation"],
    "misconceptions": [
      "All rocks are the same — rocks differ in hardness, grain size, permeability, and formation process",
      "Fossils are dinosaur bones — fossils can be from any organism and include shells, plants, and trace fossils like footprints",
      "Rocks do not change — rocks are slowly broken down by weathering and erosion and can be reformed over geological time"
    ],
    "delivers_via": [
      {"concept_id": "SC-KS2-C019", "primary": true},
      {"concept_id": "SC-KS2-C020", "primary": false},
      {"concept_id": "SC-KS2-C021", "primary": false}
    ],
    "uses_template": ["VT-17"],
    "domain_ids": []
  },
  {
    "suggestion_id": "TS-SC-KS2-004",
    "name": "Sound Investigation",
    "suggestion_type": "prescribed_topic",
    "subject": "Science",
    "key_stage": "KS2",
    "curriculum_status": "mandatory",
    "curriculum_reference": [
      "Y4 Sound: identify how sounds are made, associating some of them with something vibrating",
      "Y4 Sound: find patterns between the pitch of a sound and features of the object that produced it",
      "Y4 Sound: find patterns between the volume of a sound and the strength of the vibrations that produced it",
      "Y4 Sound: recognise that sounds get fainter as the distance from the sound source increases"
    ],
    "pedagogical_rationale": "Pattern seeking develops pupils' ability to identify relationships in data without controlling all variables — an essential skill for real-world science. Sound provides an engaging, multi-sensory context where pupils can see, feel, and hear the evidence for vibrations, making abstract concepts about waves tangible.",
    "common_pitfalls": [
      "Pupils confuse pitch and volume — use clear examples to distinguish (e.g. whispering a high note vs shouting a low note)",
      "Pupils think sound only travels through air — demonstrate sound travelling through solids using string telephones or pressing an ear to a desk",
      "Difficulty seeing that 'vibration' is the cause of all sound — use rice on a drum skin and tuning forks in water to make vibrations visible"
    ],
    "cross_curricular_hooks": [
      "[Music] Pitch and dynamics in musical instruments — how instruments produce different notes",
      "[Maths] Measuring and ordering, recognising patterns in data",
      "[DT] Designing and building a simple musical instrument"
    ],
    "sensitive_content_notes": [
      "Be aware of pupils with hearing impairments — adapt activities to include visual and tactile ways to experience vibration"
    ],
    "definitions": ["vibration", "pitch", "volume", "sound wave", "medium", "ear drum", "frequency"],
    "display_category": "Topic Suggestion",
    "display_color": "#059669",
    "display_icon": "lightbulb",
    "enquiry_type": "pattern_seeking",
    "science_discipline": "physics",
    "equipment": ["tuning forks", "water tray", "rulers", "elastic bands", "shoe boxes (string telephones)", "rice on drum skin"],
    "safety_notes": "Keep volume levels reasonable to protect hearing. Tuning forks can be sharp at the prongs — demonstrate correct use before pupils handle them. Do not strike tuning forks on hard surfaces as they may chip.",
    "hazard_level": "low",
    "expected_outcome": "Sounds are caused by vibrations. Higher pitch = faster vibrations (shorter/tighter object). Louder sound = bigger vibrations. Sound travels through solids, liquids, and gases.",
    "recording_format": ["observations table", "pattern statement", "diagram of vibration"],
    "misconceptions": [
      "Sound can travel through space (a vacuum) — sound needs a medium (solid, liquid, or gas) to travel through",
      "Louder sounds travel faster than quieter sounds — volume does not affect the speed of sound",
      "Only musical instruments make pitched sounds — all sounds have a pitch, even noise"
    ],
    "variables": {
      "independent": "length of vibrating object (ruler overhang, elastic band tension)",
      "dependent": "pitch of sound produced",
      "controlled": ["same material", "same striking force"]
    },
    "delivers_via": [
      {"concept_id": "SC-KS2-C037", "primary": true},
      {"concept_id": "SC-KS2-C038", "primary": false},
      {"concept_id": "SC-KS2-C039", "primary": false},
      {"concept_id": "SC-KS2-C040", "primary": false}
    ],
    "uses_template": ["VT-05"],
    "domain_ids": []
  },
  {
    "suggestion_id": "TS-SC-KS2-005",
    "name": "Electrical Circuits",
    "suggestion_type": "prescribed_topic",
    "subject": "Science",
    "key_stage": "KS2",
    "curriculum_status": "mandatory",
    "curriculum_reference": [
      "Y4 Electricity: identify common appliances that run on electricity; construct a simple series electrical circuit",
      "Y6 Electricity: associate the brightness of a lamp or the volume of a buzzer with the number and voltage of cells used in the circuit",
      "Y6 Electricity: use recognised symbols when representing a simple circuit in a diagram"
    ],
    "pedagogical_rationale": "Electricity provides an ideal context for fair testing because pupils can systematically vary one component (number of batteries or bulbs) and immediately observe the effect on brightness. Building and troubleshooting real circuits develops practical skills alongside conceptual understanding of complete loops and conductors/insulators.",
    "common_pitfalls": [
      "Pupils think electricity is 'used up' by the bulb — current flows around a complete circuit and is not consumed",
      "Connecting wires incorrectly and concluding 'it doesn't work' — teach systematic troubleshooting of circuit connections",
      "Confusing voltage (push) with current (flow) — use a water pipe analogy at KS2 level"
    ],
    "cross_curricular_hooks": [
      "[Maths] Drawing circuit diagrams using standard symbols accurately",
      "[DT] Incorporating a simple circuit into a product (e.g. a torch or alarm)",
      "[English] Writing instructions for building a circuit using imperative verbs"
    ],
    "sensitive_content_notes": [
      "Emphasise that mains electricity is extremely dangerous — pupils must NEVER experiment with mains sockets or plug sockets",
      "Only use low-voltage cells (1.5V) in classroom activities"
    ],
    "definitions": ["circuit", "series", "battery", "voltage", "conductor", "insulator", "switch", "component", "circuit diagram"],
    "display_category": "Topic Suggestion",
    "display_color": "#059669",
    "display_icon": "lightbulb",
    "enquiry_type": "fair_test",
    "science_discipline": "physics",
    "equipment": ["batteries (1.5V cells)", "bulbs", "buzzers", "wires with crocodile clips", "switches", "materials for conductor/insulator testing"],
    "safety_notes": "Use only low-voltage cells (1.5V). Never connect directly across battery terminals (short circuit risk — wires can get hot). Do not use mains electricity. Ensure pupils understand the difference between safe classroom circuits and dangerous mains electricity.",
    "hazard_level": "standard",
    "expected_outcome": "More batteries = brighter bulb. More bulbs in series = dimmer each bulb. Metals conduct; plastic, rubber, wood insulate. Circuits need a complete loop.",
    "recording_format": ["circuit diagrams using symbols", "results table", "conclusion"],
    "misconceptions": [
      "Electricity is used up by the bulb — current is the same everywhere in a series circuit; energy is transferred, not consumed",
      "A single wire from the battery to the bulb is enough — a complete loop is needed for current to flow",
      "Thicker wires mean more electricity — wire thickness affects resistance, not the amount of electricity from the battery"
    ],
    "variables": {
      "independent": "number of batteries (voltage) or number of bulbs",
      "dependent": "brightness of bulb",
      "controlled": ["same type of bulb", "same wire length", "same circuit design"]
    },
    "delivers_via": [
      {"concept_id": "SC-KS2-C041", "primary": true},
      {"concept_id": "SC-KS2-C042", "primary": false},
      {"concept_id": "SC-KS2-C043", "primary": false},
      {"concept_id": "SC-KS2-C068", "primary": false}
    ],
    "uses_template": ["VT-03"],
    "domain_ids": []
  },
  {
    "suggestion_id": "TS-SC-KS2-006",
    "name": "States of Matter and the Water Cycle",
    "suggestion_type": "prescribed_topic",
    "subject": "Science",
    "key_stage": "KS2",
    "curriculum_status": "mandatory",
    "curriculum_reference": [
      "Y4 States of matter: compare and group materials together, according to whether they are solids, liquids or gases",
      "Y4 States of matter: observe that some materials change state when they are heated or cooled",
      "Y4 States of matter: identify the part played by evaporation and condensation in the water cycle"
    ],
    "pedagogical_rationale": "Observation over time is the ideal enquiry type for evaporation because the process is too slow for a single lesson but produces clear, measurable results over a week. Combining hands-on state change demonstrations with the longer evaporation investigation helps pupils connect everyday experiences (puddles drying, windows steaming) to the scientific model of particle behaviour.",
    "common_pitfalls": [
      "Pupils think the water 'disappears' during evaporation rather than understanding it becomes water vapour in the air",
      "Confusing melting and dissolving — melting is a change of state caused by heating, dissolving is a substance mixing into a liquid",
      "Difficulty classifying some materials (e.g. sand, jelly) — discuss that individual grains of sand are solid even though sand can be poured"
    ],
    "cross_curricular_hooks": [
      "[Maths] Measuring volume in millilitres, reading thermometers, plotting results",
      "[Geography] The water cycle as a geographical process — linking to rivers and weather",
      "[English] Explanation text writing about the water cycle"
    ],
    "sensitive_content_notes": [],
    "definitions": ["solid", "liquid", "gas", "melting", "freezing", "evaporation", "condensation", "water cycle", "temperature"],
    "display_category": "Topic Suggestion",
    "display_color": "#059669",
    "display_icon": "lightbulb",
    "enquiry_type": "observation_over_time",
    "science_discipline": "chemistry",
    "equipment": ["ice cubes", "kettle (teacher demonstration)", "thermometer", "containers for evaporation test", "measuring cylinder"],
    "safety_notes": "Teacher demonstrates boiling water — pupils do not handle hot water or kettles. Thermometers should be non-mercury. Supervise any activity involving hot liquids. Ensure pupils stand back during steam demonstrations.",
    "hazard_level": "standard",
    "expected_outcome": "Solids have fixed shape, liquids take container shape, gases fill available space. Heating causes melting/evaporation, cooling causes condensation/freezing. The water cycle is a continuous process.",
    "recording_format": ["particle diagrams for each state", "evaporation results table", "water cycle diagram with labels"],
    "misconceptions": [
      "Steam and water vapour are the same thing — steam is visible (tiny water droplets); water vapour is an invisible gas",
      "Melting and dissolving are the same process — melting is a state change caused by heat; dissolving is a substance mixing into a solvent",
      "Water only evaporates when it boils — evaporation happens at any temperature from the surface of a liquid"
    ],
    "variables": {
      "independent": "location of water sample (sunny windowsill, shaded shelf, cupboard)",
      "dependent": "water level after 1 week (ml)",
      "controlled": ["same volume of water", "same container size"]
    },
    "delivers_via": [
      {"concept_id": "SC-KS2-C034", "primary": true},
      {"concept_id": "SC-KS2-C035", "primary": false},
      {"concept_id": "SC-KS2-C036", "primary": false}
    ],
    "uses_template": ["VT-04"],
    "domain_ids": []
  },
  {
    "suggestion_id": "TS-SC-KS2-007",
    "name": "Light and Shadows",
    "suggestion_type": "prescribed_topic",
    "subject": "Science",
    "key_stage": "KS2",
    "curriculum_status": "mandatory",
    "curriculum_reference": [
      "Y3 Light: recognise that they need light in order to see things and that dark is the absence of light",
      "Y3 Light: recognise that shadows are formed when the light from a light source is blocked by an opaque object",
      "Y6 Light: recognise that light appears to travel in straight lines; use the idea that light travels in straight lines to explain why shadows have the same shape as the objects that cast them"
    ],
    "pedagogical_rationale": "Fair testing the relationship between distance and shadow size produces a clear, quantitative pattern that pupils can graph and explain using the model of light travelling in straight lines. The investigation bridges practical measurement skills with the abstract idea of ray diagrams, building towards the Y6 requirement to explain how we see objects.",
    "common_pitfalls": [
      "Pupils think their eyes send out light to see objects — reinforce that we see because light reflects off objects into our eyes",
      "Difficulty understanding that the shadow is not 'attached' to the object — use a torch and move both object and screen",
      "Assuming coloured filters make coloured shadows — the shadow is where light is blocked, not where colour appears"
    ],
    "cross_curricular_hooks": [
      "[Maths] Measuring shadow lengths, plotting line graphs, identifying proportional relationships",
      "[Art] Shadow puppetry and silhouette art",
      "[English] Descriptive writing using light and shadow imagery"
    ],
    "sensitive_content_notes": [],
    "definitions": ["light source", "opaque", "transparent", "translucent", "shadow", "reflection", "ray", "straight line"],
    "display_category": "Topic Suggestion",
    "display_color": "#059669",
    "display_icon": "lightbulb",
    "enquiry_type": "fair_test",
    "science_discipline": "physics",
    "equipment": ["torches", "opaque objects", "white screen/card", "mirrors", "ruler", "metre stick"],
    "safety_notes": "Do not shine torches directly into eyes. Supervise mirror use — reflected light can dazzle. Darken the room for best results but ensure safe movement.",
    "hazard_level": "low",
    "expected_outcome": "Shadows form when opaque objects block light. Shadow size increases as the object moves closer to the light source. Light travels in straight lines. We see objects because light reflects off them into our eyes.",
    "recording_format": ["results table", "line graph", "ray diagram showing light travel"],
    "misconceptions": [
      "Our eyes send out light beams to see things — we see because light enters our eyes after reflecting off objects",
      "Shadows have colour — shadows are areas where light is blocked and appear dark, not coloured",
      "Light only travels in straight lines from torches, not from the sun — all light travels in straight lines regardless of source"
    ],
    "variables": {
      "independent": "distance between light source and object",
      "dependent": "size of shadow (cm height)",
      "controlled": ["same light source", "same object", "same screen distance", "darkened room"]
    },
    "delivers_via": [
      {"concept_id": "SC-KS2-C022", "primary": true},
      {"concept_id": "SC-KS2-C023", "primary": false},
      {"concept_id": "SC-KS2-C024", "primary": false},
      {"concept_id": "SC-KS2-C067", "primary": false}
    ],
    "uses_template": ["VT-03"],
    "domain_ids": []
  },
  {
    "suggestion_id": "TS-SC-KS2-008",
    "name": "Human Body: Digestion and Teeth",
    "suggestion_type": "prescribed_topic",
    "subject": "Science",
    "key_stage": "KS2",
    "curriculum_status": "mandatory",
    "curriculum_reference": [
      "Y4 Animals including humans: describe the simple functions of the basic parts of the digestive system in humans",
      "Y4 Animals including humans: identify the different types of teeth in humans and their simple functions",
      "Y4 Animals including humans: construct and interpret a variety of food chains, identifying producers, predators and prey"
    ],
    "pedagogical_rationale": "Research enquiry is the appropriate approach here because the digestive system cannot be directly investigated through experiment in a primary classroom. Combining research with physical models (egg shell tooth decay experiment, food chain card sorting) ensures pupils engage actively with the content rather than passively reading, building both knowledge and scientific communication skills.",
    "common_pitfalls": [
      "Pupils think digestion only happens in the stomach — the process starts in the mouth and continues through the intestines",
      "Confusing food chains and food webs — start with simple chains before introducing the complexity of webs",
      "Pupils may think arrows in food chains show 'who eats who' rather than 'energy is transferred to' — clarify arrow direction"
    ],
    "cross_curricular_hooks": [
      "[English] Non-chronological report writing about the digestive system",
      "[Maths] Interpreting data about tooth decay from the egg shell experiment",
      "[PSHE] Healthy eating and dental hygiene"
    ],
    "sensitive_content_notes": [
      "Be sensitive to pupils with dietary restrictions or eating difficulties when discussing food and digestion",
      "Avoid framing food as 'good' or 'bad' — focus on the scientific process of digestion"
    ],
    "definitions": ["digestion", "oesophagus", "stomach", "intestine", "incisor", "canine", "molar", "enamel", "producer", "predator", "prey", "food chain"],
    "display_category": "Topic Suggestion",
    "display_color": "#059669",
    "display_icon": "lightbulb",
    "enquiry_type": "research",
    "science_discipline": "biology",
    "equipment": ["torso model or diagram", "mirror (tooth observation)", "egg shells + cola/water (tooth decay model)", "food chain cards"],
    "safety_notes": "Egg shell experiment uses cola — no drinking of experimental liquids. Hand washing after handling food items and models. If using mirrors for tooth observation, ensure they are unbreakable.",
    "hazard_level": "low",
    "expected_outcome": "Pupils can describe the journey of food through the digestive system, name and describe functions of different tooth types, and construct food chains with producers, predators and prey.",
    "recording_format": ["labelled diagram of digestive system", "tooth investigation results", "food chain diagram"],
    "misconceptions": [
      "The stomach is the only organ involved in digestion — digestion is a whole-body process involving mouth, oesophagus, stomach, small intestine, and large intestine",
      "Food chain arrows point from the predator to the prey — arrows show the direction of energy transfer, from prey to predator",
      "Humans only have one type of teeth — humans have incisors, canines, and molars, each with different functions"
    ],
    "delivers_via": [
      {"concept_id": "SC-KS2-C017", "primary": true},
      {"concept_id": "SC-KS2-C031", "primary": false},
      {"concept_id": "SC-KS2-C032", "primary": false},
      {"concept_id": "SC-KS2-C033", "primary": false}
    ],
    "uses_template": ["VT-06"],
    "domain_ids": []
  },
  {
    "suggestion_id": "TS-SC-KS2-009",
    "name": "Evolution and Adaptation",
    "suggestion_type": "prescribed_topic",
    "subject": "Science",
    "key_stage": "KS2",
    "curriculum_status": "mandatory",
    "curriculum_reference": [
      "Y6 Evolution and inheritance: recognise that living things have changed over time and that fossils provide information about living things that inhabited the Earth millions of years ago",
      "Y6 Evolution and inheritance: identify how animals and plants are adapted to suit their environment in different ways and that adaptation may lead to evolution"
    ],
    "pedagogical_rationale": "Research enquiry combined with hands-on modelling (the beak adaptation simulation) helps pupils understand natural selection through concrete experience rather than abstract explanation. The bird beak activity transforms a complex concept into a physical investigation where pupils can see variation, competition, and differential survival in action.",
    "common_pitfalls": [
      "Pupils think individual organisms evolve during their lifetime — evolution happens across populations over many generations",
      "Confusing adaptation (a trait that helps survival) with acclimatisation (a short-term response) — use clear examples",
      "Pupils may think evolution is a deliberate choice by organisms ('the giraffe stretched its neck') — emphasise random variation and natural selection"
    ],
    "cross_curricular_hooks": [
      "[History] How Darwin's theory changed scientific and religious thinking",
      "[Geography] How different environments around the world have shaped different adaptations",
      "[English] Writing a biography of a significant scientist (Darwin, Wallace, Mary Anning)"
    ],
    "sensitive_content_notes": [
      "Evolution can conflict with some religious beliefs — present it as the scientific explanation supported by evidence, while being respectful of pupils' faith backgrounds",
      "Focus on evidence and the scientific process rather than making value judgements about beliefs"
    ],
    "definitions": ["fossil", "evolution", "adaptation", "variation", "natural selection", "inherited", "species", "extinct"],
    "display_category": "Topic Suggestion",
    "display_color": "#059669",
    "display_icon": "lightbulb",
    "enquiry_type": "research",
    "secondary_enquiry_types": ["pattern_seeking"],
    "science_discipline": "biology",
    "equipment": ["fossil samples or images", "bird beak models (tweezers, pegs, chopsticks)", "seeds of different sizes", "images of adapted organisms"],
    "safety_notes": "No specific physical hazards. Handle fossil samples with care as they can be fragile and valuable. Ensure sensitivity around evolution and creation discussions — follow school RE policy.",
    "hazard_level": "low",
    "expected_outcome": "Fossils show how organisms have changed over time. Offspring vary from parents. Organisms are adapted to their environments. Over time, natural selection means better-adapted organisms survive and reproduce.",
    "recording_format": ["timeline of life on Earth", "beak adaptation results table", "explanation text"],
    "misconceptions": [
      "Evolution means an animal chose to change — evolution is driven by random variation and natural selection, not by choice or intention",
      "Humans evolved from modern monkeys — humans and modern apes share a common ancestor, but neither evolved from the other",
      "Fossils are just old bones — fossils can include shells, teeth, footprints, and even preserved plant material in sedimentary rock"
    ],
    "delivers_via": [
      {"concept_id": "SC-KS2-C063", "primary": true},
      {"concept_id": "SC-KS2-C064", "primary": false},
      {"concept_id": "SC-KS2-C065", "primary": false},
      {"concept_id": "SC-KS2-C066", "primary": false}
    ],
    "uses_template": ["VT-06"],
    "domain_ids": []
  },
  {
    "suggestion_id": "TS-SC-KS2-010",
    "name": "Separating Mixtures",
    "suggestion_type": "prescribed_topic",
    "subject": "Science",
    "key_stage": "KS2",
    "curriculum_status": "mandatory",
    "curriculum_reference": [
      "Y5 Properties and changes of materials: know that some materials will dissolve in liquid to form a solution, and describe how to recover a substance from a solution",
      "Y5 Properties and changes of materials: use knowledge of solids, liquids and gases to decide how mixtures might be separated",
      "Y5 Properties and changes of materials: demonstrate that dissolving, mixing and changes of state are reversible changes; explain that some changes result in the formation of new materials, and that this kind of change is not usually reversible"
    ],
    "pedagogical_rationale": "Fair testing separation methods gives pupils authentic problem-solving experience — they must choose the right technique for each mixture based on the properties of its components. This builds the critical KS2 skill of using scientific knowledge to make predictions and plan investigations, while the reversible/irreversible distinction develops understanding of chemical change.",
    "common_pitfalls": [
      "Pupils confuse dissolving and melting — dissolving involves a solute and solvent at the same temperature; melting involves a state change caused by heat",
      "Pupils think dissolved substances have 'disappeared' — demonstrate recovery by evaporation to prove the substance is still there",
      "Difficulty distinguishing reversible from irreversible changes — use concrete paired examples (ice melting vs egg cooking)"
    ],
    "cross_curricular_hooks": [
      "[Maths] Measuring volumes accurately, recording data in tables",
      "[DT] Choosing materials with appropriate properties for a purpose",
      "[Geography] Water purification and its importance in different parts of the world"
    ],
    "sensitive_content_notes": [],
    "definitions": ["dissolve", "solution", "soluble", "insoluble", "filter", "sieve", "evaporate", "reversible", "irreversible"],
    "display_category": "Topic Suggestion",
    "display_color": "#059669",
    "display_icon": "lightbulb",
    "enquiry_type": "fair_test",
    "secondary_enquiry_types": ["identifying_and_classifying"],
    "science_discipline": "chemistry",
    "equipment": ["salt", "sand", "water", "iron filings", "filter paper", "funnels", "sieves", "evaporating dishes", "magnets", "safety goggles"],
    "safety_notes": "Wear safety goggles during evaporation activities. Teacher supervises all heating. Do not taste solutions or mixtures. Iron filings can irritate eyes — handle carefully and keep magnets away from electronic devices.",
    "hazard_level": "standard",
    "expected_outcome": "Different mixtures require different separation methods based on particle size and solubility. Dissolving and filtering are reversible. Burning and cooking are irreversible.",
    "recording_format": ["method diagram for each separation", "results table", "reversible vs irreversible sorting activity"],
    "misconceptions": [
      "Dissolving and melting are the same thing — dissolving involves a solute mixing into a solvent; melting is a state change caused by heating",
      "When something dissolves it disappears — the substance is still present in solution and can be recovered by evaporation",
      "All changes can be undone if you try hard enough — some changes (burning, cooking) form new substances and are irreversible"
    ],
    "variables": {
      "independent": "separation method (filtering, sieving, evaporating, magnetic)",
      "dependent": "success of separation (observation)",
      "controlled": ["same amount of mixture"]
    },
    "delivers_via": [
      {"concept_id": "SC-KS2-C047", "primary": true},
      {"concept_id": "SC-KS2-C048", "primary": false},
      {"concept_id": "SC-KS2-C049", "primary": false},
      {"concept_id": "SC-KS2-C050", "primary": false},
      {"concept_id": "SC-KS2-C051", "primary": false}
    ],
    "uses_template": ["VT-03"],
    "domain_ids": []
  }
]
