{
  "metadata": {
    "node_type": "GeographicalSkill",
    "subject": "Geography",
    "key_stages": ["KS1", "KS2", "KS3"],
    "dfe_reference": "DFE-00186-2013 (primary); DFE-00193-2013 (KS3)",
    "source": "National Curriculum 2014",
    "extraction_date": "2026-02-18",
    "notes": "All skills are drawn exclusively from the 'Geographical Skills and Fieldwork' strand of the NC Geography programme (domain GE-KS1-D004, GE-KS2-D004, GE-KS3-D004). Content knowledge objectives from Locational Knowledge, Place Knowledge, and Human and Physical Geography are not included here. Progression threads are identified by strand label and cross-KS ID linkage."
  },
  "skills": [
    {
      "skill_id": "GS-KS1-001",
      "skill_name": "Using maps, atlases and globes",
      "description": "Locating and identifying places in the United Kingdom and wider world using world maps, atlases and globes as reference tools, understanding that these are representations of the real world at reduced scale.",
      "key_stage": "KS1",
      "complexity_level": 1,
      "source_reference": "National Curriculum 2014, DFE-00186-2013 — Geography KS1: Geographical Skills and Fieldwork",
      "progression_from": null,
      "progression_to": "GS-KS2-001",
      "nc_verbatim": "use world maps, atlases and globes to identify the United Kingdom and its countries, as well as the countries, continents and oceans studied at this key stage",
      "strand": "mapwork"
    },
    {
      "skill_id": "GS-KS1-002",
      "skill_name": "Using compass directions and locational language",
      "description": "Applying the four cardinal compass directions (North, South, East, West) and everyday directional language such as near, far, left and right to describe the location of features and routes on maps and in the environment.",
      "key_stage": "KS1",
      "complexity_level": 2,
      "source_reference": "National Curriculum 2014, DFE-00186-2013 — Geography KS1: Geographical Skills and Fieldwork",
      "progression_from": null,
      "progression_to": "GS-KS2-002",
      "nc_verbatim": "use simple compass directions (North, South, East and West) and locational and directional language [for example, near and far; left and right], to describe the location of features and routes on a map",
      "strand": "mapwork"
    },
    {
      "skill_id": "GS-KS1-003",
      "skill_name": "Using aerial photographs and making simple maps",
      "description": "Interpreting aerial photographs and plan-perspective images to recognise landmarks and physical and human features, and translating these observations into a simple hand-drawn map with a basic symbol key.",
      "key_stage": "KS1",
      "complexity_level": 3,
      "source_reference": "National Curriculum 2014, DFE-00186-2013 — Geography KS1: Geographical Skills and Fieldwork",
      "progression_from": null,
      "progression_to": "GS-KS2-003",
      "nc_verbatim": "use aerial photographs and plan perspectives to recognise landmarks and basic human and physical features; devise a simple map; and use and construct basic symbols in a key",
      "strand": "mapwork"
    },
    {
      "skill_id": "GS-KS1-004",
      "skill_name": "Simple fieldwork and observational skills",
      "description": "Going out into the school grounds and immediate surrounding environment to observe, describe and record human and physical geographical features at first hand, practising the habits of direct geographical enquiry.",
      "key_stage": "KS1",
      "complexity_level": 2,
      "source_reference": "National Curriculum 2014, DFE-00186-2013 — Geography KS1: Geographical Skills and Fieldwork",
      "progression_from": null,
      "progression_to": "GS-KS2-005",
      "nc_verbatim": "use simple fieldwork and observational skills to study the geography of their school and its grounds and the key human and physical features of its surrounding environment",
      "strand": "fieldwork"
    },
    {
      "skill_id": "GS-KS2-001",
      "skill_name": "Using maps, atlases, globes and digital mapping",
      "description": "Extending atlas and map use to locate countries and describe the features studied across the curriculum, and beginning to use digital and computer mapping tools — including online satellite maps — to access geographical information in a range of formats.",
      "key_stage": "KS2",
      "complexity_level": 2,
      "source_reference": "National Curriculum 2014, DFE-00186-2013 — Geography KS2: Geographical Skills and Fieldwork",
      "progression_from": "GS-KS1-001",
      "progression_to": "GS-KS3-001",
      "nc_verbatim": "use maps, atlases, globes and digital/computer mapping to locate countries and describe features studied",
      "strand": "mapwork"
    },
    {
      "skill_id": "GS-KS2-002",
      "skill_name": "Eight-point compass and Ordnance Survey map skills",
      "description": "Applying the eight compass points, four-figure and six-figure grid references, and the symbols and conventions of Ordnance Survey maps to build knowledge of the UK and the wider world, and to navigate and locate features on topographic maps.",
      "key_stage": "KS2",
      "complexity_level": 3,
      "source_reference": "National Curriculum 2014, DFE-00186-2013 — Geography KS2: Geographical Skills and Fieldwork",
      "progression_from": "GS-KS1-002",
      "progression_to": "GS-KS3-002",
      "nc_verbatim": "use the eight points of a compass, four and six-figure grid references, symbols and key (including the use of Ordnance Survey maps) to build their knowledge of the United Kingdom and the wider world",
      "strand": "mapwork"
    },
    {
      "skill_id": "GS-KS2-003",
      "skill_name": "Interpreting maps and plan perspectives",
      "description": "Reading and interpreting a range of cartographic representations including OS maps, sketch maps and plan views, identifying what they show and evaluating how conventional symbols and keys communicate geographical information.",
      "key_stage": "KS2",
      "complexity_level": 3,
      "source_reference": "National Curriculum 2014, DFE-00186-2013 — Geography KS2: Geographical Skills and Fieldwork",
      "progression_from": "GS-KS1-003",
      "progression_to": null,
      "nc_verbatim": "use the eight points of a compass, four and six-figure grid references, symbols and key (including the use of Ordnance Survey maps) to build their knowledge of the United Kingdom and the wider world",
      "strand": "mapwork"
    },
    {
      "skill_id": "GS-KS2-004",
      "skill_name": "Geographical enquiry",
      "description": "Asking geographical questions, selecting appropriate methods to investigate them, gathering primary and secondary information, and organising findings into a structured response that demonstrates geographical thinking.",
      "key_stage": "KS2",
      "complexity_level": 3,
      "source_reference": "National Curriculum 2014, DFE-00186-2013 — Geography KS2: Geographical Skills and Fieldwork",
      "progression_from": null,
      "progression_to": "GS-KS3-004",
      "nc_verbatim": "use fieldwork to observe, measure, record and present the human and physical features in the local area using a range of methods, including sketch maps, plans and graphs, and digital technologies",
      "strand": "enquiry"
    },
    {
      "skill_id": "GS-KS2-005",
      "skill_name": "Fieldwork: data collection and presentation",
      "description": "Conducting fieldwork in the local environment and beyond, collecting primary data through direct observation and measurement, and presenting findings using a range of methods including sketch maps, annotated plans, bar and line graphs, and digital technologies.",
      "key_stage": "KS2",
      "complexity_level": 4,
      "source_reference": "National Curriculum 2014, DFE-00186-2013 — Geography KS2: Geographical Skills and Fieldwork",
      "progression_from": "GS-KS1-004",
      "progression_to": "GS-KS3-005",
      "nc_verbatim": "use fieldwork to observe, measure, record and present the human and physical features in the local area using a range of methods, including sketch maps, plans and graphs, and digital technologies",
      "strand": "fieldwork"
    },
    {
      "skill_id": "GS-KS3-001",
      "skill_name": "Applying maps, atlases and globes routinely across contexts",
      "description": "Building on primary map skills to use a wide range of map types — physical, political, topographic, thematic — fluently and routinely in both classroom and fieldwork contexts, applying them to study geography at multiple scales from local to global.",
      "key_stage": "KS3",
      "complexity_level": 2,
      "source_reference": "National Curriculum 2014, DFE-00193-2013 — Geography KS3: Geographical Skills and Fieldwork",
      "progression_from": "GS-KS2-001",
      "progression_to": null,
      "nc_verbatim": "build on their knowledge of globes, maps and atlases and apply and develop this knowledge routinely in the classroom and in the field",
      "strand": "mapwork"
    },
    {
      "skill_id": "GS-KS3-002",
      "skill_name": "Interpreting Ordnance Survey maps with grid references and scale",
      "description": "Reading and interpreting OS maps in classroom and field settings, applying grid references precisely, understanding and using map scale, interpreting topographic contours and relief, and using thematic mapping and aerial and satellite photographs alongside standard OS maps.",
      "key_stage": "KS3",
      "complexity_level": 3,
      "source_reference": "National Curriculum 2014, DFE-00193-2013 — Geography KS3: Geographical Skills and Fieldwork",
      "progression_from": "GS-KS2-002",
      "progression_to": null,
      "nc_verbatim": "interpret Ordnance Survey maps in the classroom and the field, including using grid references and scale, topographical and other thematic mapping, and aerial and satellite photographs",
      "strand": "mapwork"
    },
    {
      "skill_id": "GS-KS3-003",
      "skill_name": "Geographical Information Systems (GIS)",
      "description": "Using GIS software and online digital mapping platforms to view spatial data in layered formats, query and filter data by geographical attributes, and produce analytical outputs that communicate geographical patterns and relationships.",
      "key_stage": "KS3",
      "complexity_level": 4,
      "source_reference": "National Curriculum 2014, DFE-00193-2013 — Geography KS3: Geographical Skills and Fieldwork",
      "progression_from": null,
      "progression_to": null,
      "nc_verbatim": "use Geographical Information Systems (GIS) to view, analyse and interpret places and data",
      "strand": "data"
    },
    {
      "skill_id": "GS-KS3-004",
      "skill_name": "Geographical enquiry using multiple and complex sources",
      "description": "Designing and conducting geographical investigations that draw on multiple sources of information of increasing complexity — including statistical datasets, satellite imagery, fieldwork data and published research — to answer substantive geographical questions.",
      "key_stage": "KS3",
      "complexity_level": 4,
      "source_reference": "National Curriculum 2014, DFE-00193-2013 — Geography KS3: Geographical Skills and Fieldwork",
      "progression_from": "GS-KS2-004",
      "progression_to": null,
      "nc_verbatim": "use fieldwork in contrasting locations to collect, analyse and draw conclusions from geographical data, using multiple sources of increasingly complex information",
      "strand": "enquiry"
    },
    {
      "skill_id": "GS-KS3-005",
      "skill_name": "Fieldwork in contrasting locations",
      "description": "Planning and carrying out fieldwork in at least two contrasting geographical settings — such as urban and rural, or coastal and inland — collecting and recording primary data systematically and drawing evidence-based geographical conclusions from the results.",
      "key_stage": "KS3",
      "complexity_level": 4,
      "source_reference": "National Curriculum 2014, DFE-00193-2013 — Geography KS3: Geographical Skills and Fieldwork",
      "progression_from": "GS-KS2-005",
      "progression_to": null,
      "nc_verbatim": "use fieldwork in contrasting locations to collect, analyse and draw conclusions from geographical data, using multiple sources of increasingly complex information",
      "strand": "fieldwork"
    },
    {
      "skill_id": "GS-KS3-006",
      "skill_name": "Analysing and presenting geographical data",
      "description": "Selecting and applying appropriate methods — including graphs, thematic maps, choropleth maps and statistical summaries — to organise, present and analyse geographical data, and communicating the findings of that analysis with precision and clarity.",
      "key_stage": "KS3",
      "complexity_level": 3,
      "source_reference": "National Curriculum 2014, DFE-00193-2013 — Geography KS3: Geographical Skills and Fieldwork",
      "progression_from": null,
      "progression_to": null,
      "nc_verbatim": "use fieldwork in contrasting locations to collect, analyse and draw conclusions from geographical data, using multiple sources of increasingly complex information",
      "strand": "data"
    }
  ]
}
