[
  {
    "concept_id": "MA-Y3-C030",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Measuring real objects using rulers (mm/cm/m), kitchen scales (g/kg) and measuring jugs (ml/l), recording measurements in mixed units and practising unit conversions with physical equipment",
        "resources": ["30 cm rulers (mm markings)", "metre sticks", "kitchen scales (g/kg)", "measuring jugs (ml/l)", "balance scales", "classroom objects to measure"],
        "example_activity": "Measure your pencil with a ruler: 14 cm and 5 mm = 14 cm 5 mm. Weigh a bag of rice on scales: 1 kg 350 g. Pour water into a jug to the 1 l 250 ml mark. How many millilitres is 1 l 250 ml altogether? 1250 ml.",
        "transition_cue": "Child reads measuring instruments accurately in mixed units and converts between units using the ×1000 relationship (1 kg = 1000 g, 1 l = 1000 ml, 1 km = 1000 m)"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Drawing scales on number lines showing conversions between units, recording measurements in tables, and using bar models to add and subtract mixed-unit measurements",
        "resources": ["number line templates (0-1000 for g/ml, 0-100 for cm)", "bar model template", "conversion tables", "scale-reading worksheets"],
        "example_activity": "Draw a number line from 0 g to 1000 g (= 1 kg). Mark 350 g. How far to 1 kg? 650 g. Use a bar model: 2 kg 450 g + 1 kg 700 g. Convert to grams: 2450 + 1700 = 4150 g = 4 kg 150 g.",
        "transition_cue": "Child records conversions and calculations on paper without measuring equipment, correctly converting between mixed units and single units"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Converting between metric units mentally, adding and subtracting measurements in mixed units, and selecting appropriate units for different contexts",
        "resources": [],
        "example_activity": "Convert 3 m 45 cm to centimetres. Add 2 kg 600 g and 1 kg 750 g. Which unit would you use to measure the length of a football pitch — mm, cm, m or km? 4500 ml = ? l ? ml.",
        "transition_cue": "Child converts between metric units fluently and selects the most appropriate unit for any given measurement context"
      }
    ]
  },
  {
    "concept_id": "MA-Y3-C031",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Walking the perimeter of the classroom, playground and large shapes taped on the floor, then measuring the perimeter of smaller shapes using string laid along edges and a ruler",
        "resources": ["string", "rulers", "metre sticks", "masking tape (for floor shapes)", "classroom objects (books, tables)"],
        "example_activity": "Lay masking tape in a rectangle on the floor: 3 m × 2 m. Walk all the way around it — that distance is the perimeter. Now measure each side with a metre stick: 3 + 2 + 3 + 2 = 10 m. Lay string around a book, cut the string, then measure it with a ruler.",
        "transition_cue": "Child measures all sides of a shape and adds them to find the perimeter without being reminded to include every side"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Drawing rectilinear shapes on squared paper and counting/adding side lengths to calculate perimeter, labelling each side measurement on the diagram",
        "resources": ["squared paper (1 cm grid)", "ruler", "rectilinear shape templates"],
        "example_activity": "Draw a rectangle 6 cm × 4 cm on squared paper. Label each side. Add all sides: 6 + 4 + 6 + 4 = 20 cm. Draw an L-shape on squared paper. Measure each side, label it, and find the total perimeter. Is the perimeter the same as the number of squares inside?",
        "transition_cue": "Child labels all sides of any rectilinear shape and calculates perimeter correctly, clearly distinguishing perimeter (distance around) from area (space inside)"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Calculating perimeters of shapes from given dimensions without drawing, including finding missing side lengths of rectilinear shapes",
        "resources": [],
        "example_activity": "A rectangle is 8 cm long and 5 cm wide. What is the perimeter? An L-shape has sides 6, 3, 4, 2, 2, 1 cm. What is its perimeter? A square has perimeter 24 cm. What is the length of one side?",
        "transition_cue": "Child calculates perimeters from given measurements and works backwards from a perimeter to find unknown side lengths"
      }
    ]
  },
  {
    "concept_id": "MA-Y3-C032",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Using play money (£1, £2 coins; 1p, 2p, 5p, 10p, 20p, 50p coins; £5, £10 notes) to set up shopkeeper role-plays, making totals and giving change by counting up",
        "resources": ["play money (full coin and note set)", "price labels", "shopping basket", "till/cash register"],
        "example_activity": "Price tags: apple 45p, bread £1.20, milk £1.35. Buy bread and milk: lay out £1.20 and £1.35 in coins. Total? £2.55. Pay with £5. Count up from £2.55: 5p to £2.60, 40p to £3.00, £2 to £5.00. Change = £2.45.",
        "transition_cue": "Child makes totals and gives change using coins fluently, selecting efficient coin combinations and counting up from the price to the amount paid"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Recording money calculations in columnar format with the decimal point aligned, drawing number lines to show counting-up change, and converting between pounds and pence on paper",
        "resources": ["squared paper", "number line template", "price list worksheets"],
        "example_activity": "Write £3.47 + £2.85 as a column addition, aligning the decimal points. Calculate: 7 + 5 = 12 (write 2, carry 1), 4 + 8 + 1 = 13 (write 3, carry 1), 3 + 2 + 1 = 6. Total: £6.32. Draw a number line from £1.37 to £2.00 to find the change from £2.",
        "transition_cue": "Child sets up money calculations in columns with the decimal point correctly aligned and uses number lines for change without play money"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Adding and subtracting money amounts mentally and in written form, converting fluently between pounds and pence, and solving multi-step money word problems",
        "resources": [],
        "example_activity": "£4.56 + £3.78? Change from £10 after spending £6.35? Convert 450p to pounds. Mia buys 3 notebooks at £1.25 each and a pen for 85p. How much does she spend? How much change from £5?",
        "transition_cue": "Child solves multi-step money problems fluently, converting between £ and p notation and calculating change without visual aids"
      }
    ]
  },
  {
    "concept_id": "MA-Y3-C033",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Handling real or large demonstration clocks with Roman numerals I-XII, matching Roman numeral cards to Hindu-Arabic number cards, and reading times on analogue clocks with moveable hands",
        "resources": ["demonstration clock with Roman numerals", "Roman numeral cards (I-XII)", "Hindu-Arabic number cards (1-12)", "individual pupil clocks"],
        "example_activity": "Match each Roman numeral card to its number: I=1, II=2, III=3, IV=4... XII=12. Now read the demonstration clock: the hour hand points to VII and the minute hand points to the 9 (45 minutes). The time is 7:45 or quarter to eight.",
        "transition_cue": "Child reads all Roman numerals I-XII instantly and tells the time to the nearest minute on a Roman numeral clock face"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Drawing clock faces with Roman numerals, recording times in words and in 12-hour digital notation, and labelling the minute scale (0-60) around the clock",
        "resources": ["blank clock face templates", "Roman numeral reference chart", "time recording frame"],
        "example_activity": "Draw a clock face with Roman numerals I-XII. Draw hands to show 3:17. Write the time in words: seventeen minutes past three. Now draw 10:42: the hour hand is between X and XI, the minute hand is on the 42nd minute mark. Write both the words and the digital form.",
        "transition_cue": "Child draws accurate clock faces and reads/records any time to the nearest minute without a reference chart for Roman numerals"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Reading and writing times in Roman numeral and analogue contexts without a clock, converting between words and notation, and answering time questions mentally",
        "resources": [],
        "example_activity": "What Roman numeral is on the clock at the 9 o'clock position? (IX). If the minute hand points to the 7, how many minutes past the hour is it? (35). Write twenty-three minutes to four in digital form (3:37).",
        "transition_cue": "Child converts between Roman numerals, analogue positions and digital time notation fluently without any visual reference"
      }
    ]
  },
  {
    "concept_id": "MA-Y3-C034",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Using a 24-hour number line from 00:00 to 23:59, sliding a marker along to show how 12-hour times map to 24-hour times, with analogue and digital clocks side by side",
        "resources": ["24-hour number line (wall display)", "analogue clock", "digital clock display", "time conversion cards"],
        "example_activity": "Set the analogue clock to 3:00 p.m. Find this on the 24-hour number line: count past 12 to reach 15:00. So 3:00 p.m. = 15:00. Try 9:00 a.m.: before noon, so it stays 09:00. Match cards: pair each 12-hour time with its 24-hour partner.",
        "transition_cue": "Child converts a.m. times (same number, add leading zero) and p.m. times (add 12) correctly without the number line"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Drawing a circular 24-hour diagram or parallel number lines (12-hour above, 24-hour below) and recording conversions in a two-column table",
        "resources": ["24-hour circle diagram template", "parallel number line template", "conversion table worksheet"],
        "example_activity": "Draw two parallel number lines: 12-hour (1 a.m. to 12 a.m./p.m.) and 24-hour (00:00 to 23:00). Draw arrows connecting: 2 p.m. → 14:00, 7 p.m. → 19:00, 11 a.m. → 11:00. Complete the conversion table for all hours.",
        "transition_cue": "Child completes 12-hour to 24-hour conversions on paper without the parallel number line, correctly handling midnight (00:00) and noon (12:00)"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Converting between 12-hour and 24-hour notation mentally, reading bus and train timetables in 24-hour format, and solving problems involving both systems",
        "resources": [],
        "example_activity": "Convert 6:45 p.m. to 24-hour time. Convert 21:30 to 12-hour time. A train departs at 14:20 and arrives at 16:05. What are those times in 12-hour notation? How long is the journey?",
        "transition_cue": "Child converts any time between 12-hour and 24-hour format within 3 seconds and reads real timetables without errors"
      }
    ]
  },
  {
    "concept_id": "MA-Y3-C035",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Using a demonstration clock to physically move the hands from a start time to an end time, counting the minutes in jumps, and using sand timers to experience durations",
        "resources": ["demonstration clock", "sand timers (1-minute, 5-minute)", "stopwatch", "timeline strips (paper)"],
        "example_activity": "Set the clock to 2:45. Move the minute hand forward to 3:00 — that is 15 minutes. Move it forward again to 3:20 — that is 20 more minutes. Total: 15 + 20 = 35 minutes from 2:45 to 3:20. Use a sand timer to feel how long 1 minute is, then 5 minutes.",
        "transition_cue": "Child calculates durations by counting on from the start time across the hour boundary, without moving the clock hands"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Drawing timeline number lines to show durations, marking the start time, end time and jumps across hours, and recording calculations",
        "resources": ["timeline number line template", "squared paper", "duration recording frame"],
        "example_activity": "Draw a timeline from 9:30 to 11:15. Jump from 9:30 to 10:00 (30 min), from 10:00 to 11:00 (60 min), from 11:00 to 11:15 (15 min). Total: 30 + 60 + 15 = 105 min = 1 hour 45 min. Compare two journeys on timelines: which took longer?",
        "transition_cue": "Child draws timeline jumps efficiently, bridging across hours, and converts between minutes and hours correctly (60 min = 1 hour, not 100)"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Calculating durations mentally using the counting-on strategy, converting between seconds/minutes/hours, and comparing durations expressed in different units",
        "resources": [],
        "example_activity": "How long from 10:35 to 12:10? A film starts at 14:20 and lasts 1 hour 45 minutes — when does it end? Which is longer: 95 minutes or 1 hour 30 minutes? Convert 3 minutes 20 seconds to seconds.",
        "transition_cue": "Child calculates durations mentally without drawing timelines, never treating time as base-10, and converts between time units fluently"
      }
    ]
  }
]
