[
  {
    "concept_id": "MA-Y3-C036",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Drawing 2-D shapes using rulers and set-squares on plain paper, and constructing 3-D shapes from straws/pipe cleaners (edges) and modelling clay (vertices) or Polydron panels (faces)",
        "resources": ["rulers", "set-squares", "protractors", "Polydron construction set", "straws and modelling clay", "Geomag set"],
        "example_activity": "Draw a rectangle with sides 5 cm and 3 cm: use a ruler to draw the first side, a set-square for the right angle, then complete the shape. Build a triangular prism from Polydron panels: count 5 faces, 9 edges, 6 vertices. Build a cube from straws and clay: count edges, faces, vertices.",
        "transition_cue": "Child draws 2-D shapes to given specifications with accurate measurements and builds 3-D shapes, naming the number of edges, faces and vertices"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Drawing 2-D shapes on squared and dotted paper with increasing accuracy, sketching 3-D shapes using oblique drawing, and recording properties in tables",
        "resources": ["squared paper", "dotted paper (isometric)", "property recording table", "ruler"],
        "example_activity": "On squared paper, draw a pentagon. On dotted paper, draw a hexagon with all sides 2 cm. Sketch a cuboid on plain paper showing the front face and one side. Complete a table: shape name, number of faces, edges, vertices for cube, cuboid, triangular prism, square-based pyramid.",
        "transition_cue": "Child draws 2-D shapes accurately on paper without construction kits and sketches 3-D shapes, listing their properties from the drawing"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Describing and classifying shapes using properties alone, predicting the properties of a 3-D shape from its name, and reasoning about relationships between 2-D and 3-D shapes",
        "resources": [],
        "example_activity": "I am a 3-D shape with 6 faces, 12 edges and 8 vertices. All my faces are rectangles. What am I? If a shape has 5 faces, could it be a prism or a pyramid? What 2-D shapes make up the faces of a triangular prism?",
        "transition_cue": "Child identifies and describes 2-D and 3-D shapes from their properties alone, without needing to draw or build them"
      }
    ]
  },
  {
    "concept_id": "MA-Y3-C037",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Physically turning the body (quarter turn, half turn, three-quarter turn, full turn) and using an arrow spinner to connect turns to angles, testing corners of shapes with a set-square",
        "resources": ["arrow spinner on a base", "set-square", "right-angle tester (folded card)", "programmable floor robot (Bee-Bot)"],
        "example_activity": "Stand facing the door. Make a quarter turn clockwise — you now face the window. That quarter turn is a right angle. Use the arrow spinner: spin it a half turn — it makes two right angles (a straight line). Programme a Bee-Bot to turn 90° at a corner. Test the corners of a book with a set-square.",
        "transition_cue": "Child connects quarter turn = right angle = 90° and identifies angles in both turning contexts and static shape contexts without physical turning"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Drawing angles as turns on paper, marking the amount of turn with an arc, and labelling angles found in 2-D shapes on diagrams",
        "resources": ["angle arc template", "2-D shape diagrams", "squared paper", "ruler"],
        "example_activity": "Draw an arrow pointing up. Draw it after a quarter turn clockwise — pointing right. Mark the angle between them with a small arc. Draw a square and mark all four right angles with small squares. Draw a triangle and mark each angle — are they right angles, bigger or smaller?",
        "transition_cue": "Child draws and marks angles as turns and as shape properties, identifying whether each is a right angle, less or more without a physical tester"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Describing angles as fractions of a turn, reasoning about how many right angles make a full turn, and identifying the number and type of angles in named shapes",
        "resources": [],
        "example_activity": "How many right angles in a full turn? (4). In a half turn? (2). A regular hexagon has 6 angles — are they right angles, acute or obtuse? If I face north and make a three-quarter turn clockwise, which direction do I face?",
        "transition_cue": "Child reasons about angles as fractions of a full turn and predicts the angles in shapes without drawing or testing"
      }
    ]
  },
  {
    "concept_id": "MA-Y3-C038",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Using a right-angle tester (folded paper corner) and set-square to test angles around the classroom and in shapes, sorting angles into 'right angle', 'less than' and 'more than' using physical comparison",
        "resources": ["right-angle tester (folded paper)", "set-square", "sorting hoops (3: acute, right, obtuse)", "shape cards"],
        "example_activity": "Fold a piece of paper to make a right-angle tester. Test the corner of a table — right angle. Test the corner of an open book (wider) — more than a right angle (obtuse). Test the point of a triangular shape (narrower) — less than a right angle (acute). Sort shape corners into three hoops.",
        "transition_cue": "Child classifies any angle as acute, right or obtuse by visual inspection, only using the right-angle tester to confirm borderline cases"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Marking right angles with the square symbol on diagrams, labelling acute and obtuse angles, and sorting drawn angles into the three categories",
        "resources": ["shape diagrams with angles marked", "angle sorting worksheet", "ruler", "set-square (for drawing)"],
        "example_activity": "On a diagram of a rectangle, mark each right angle with the □ symbol. On a diagram of a kite, identify which angles are acute and which are obtuse. Draw one acute angle, one right angle and one obtuse angle. Label each.",
        "transition_cue": "Child marks and classifies angles in any drawn shape correctly and draws accurate examples of each angle type"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Classifying angles from descriptions or shapes without measuring, reasoning about how many right angles equal other angle sizes, and predicting angle types in named shapes",
        "resources": [],
        "example_activity": "A triangle has one right angle. What types are the other two angles? (Both acute.) How many right angles make a straight line? (2.) An equilateral triangle — are its angles acute, right or obtuse? Can a triangle have two obtuse angles? Explain.",
        "transition_cue": "Child reasons about angle types using properties, explains why a triangle cannot have two obtuse angles, and classifies angles without visual aids"
      }
    ]
  },
  {
    "concept_id": "MA-Y3-C039",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Finding examples of horizontal, vertical, perpendicular and parallel lines in the classroom environment, testing with a set-square (perpendicular) and measuring distance apart at two points (parallel)",
        "resources": ["set-square", "ruler", "spirit level", "string", "classroom environment"],
        "example_activity": "Find a horizontal line in the classroom: the windowsill — check with a spirit level. Find a vertical line: the door frame. Are the windowsill and door frame perpendicular? Test with a set-square — yes, they meet at a right angle. Find parallel lines: the edges of the whiteboard. Measure the distance between them at two points — same distance, so parallel.",
        "transition_cue": "Child identifies horizontal, vertical, perpendicular and parallel lines in the environment and explains each term using the correct definition"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Drawing and labelling horizontal, vertical, perpendicular and parallel lines on paper, using correct notation (arrows for parallel, square symbol for perpendicular), and identifying these line types in shape diagrams",
        "resources": ["squared paper", "ruler", "set-square", "shape diagrams"],
        "example_activity": "Draw two parallel lines on squared paper — mark them with arrows. Draw two perpendicular lines — mark the right angle with a □. On a diagram of a rectangle, identify and label: 2 pairs of parallel sides, 4 pairs of perpendicular sides. Which lines in a triangle are perpendicular?",
        "transition_cue": "Child draws and labels all four line types with correct notation and identifies them in shapes without environmental examples"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Identifying line types from shape names alone, reasoning about which shapes have parallel or perpendicular sides, and distinguishing between line relationships without drawing",
        "resources": [],
        "example_activity": "Does a regular hexagon have parallel sides? How many pairs? Does a trapezium have perpendicular sides? Name a shape with exactly one pair of parallel sides. Are all perpendicular lines also vertical and horizontal? Explain.",
        "transition_cue": "Child reasons about line relationships in shapes from properties alone, correctly stating that perpendicular lines can be at any orientation, not just horizontal/vertical"
      }
    ]
  }
]
