[
  {
    "concept_id": "MA-Y3-C001",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Counting groups of 4 physical objects (cubes, counters, counting bears) arranged in equal groups, physically moving groups together to count in fours",
        "resources": ["counting cubes", "counters", "bead strings (grouped in 4s)", "hundred square"],
        "example_activity": "Place 4 cubes in a cup. Add another 4 cubes to a second cup. Keep going. Count the running total each time: 4, 8, 12, 16...",
        "transition_cue": "Child counts forwards and backwards in 4s from any given multiple of 4 without needing to arrange physical objects first"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Highlighting multiples of 4 on a hundred square, drawing jumps of 4 on a number line, using arrays to show groups of 4",
        "resources": ["hundred square (printed)", "number line (0-100)", "squared paper for arrays"],
        "example_activity": "Colour all multiples of 4 on a hundred square. Describe the pattern you see. Draw jumps of 4 on a number line starting from 20.",
        "transition_cue": "Child identifies multiples of 4 without colouring or marking, and can continue a sequence from any starting multiple"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Reciting and writing multiples of 4 from any starting point, answering rapid-fire oral questions about the 4s sequence",
        "resources": [],
        "example_activity": "What is the next multiple of 4 after 28? Count back in 4s from 48. Write the first 12 multiples of 4.",
        "transition_cue": "Child responds instantly to 'what comes after/before' questions for any multiple of 4 without hesitation or finger-counting"
      }
    ]
  },
  {
    "concept_id": "MA-Y3-C002",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Counting groups of 8 physical objects, using the doubling connection to the 4 times table with paired groups of cubes",
        "resources": ["counting cubes", "Numicon 8-plates", "bead strings"],
        "example_activity": "Build towers of 4 cubes. Now double each tower to make 8. Count the running total: 8, 16, 24, 32... Physically combine pairs of 4-towers.",
        "transition_cue": "Child counts in 8s fluently using the doubling strategy without needing to build the 4s towers first"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Drawing the doubling connection between 4s and 8s on parallel number lines, highlighting multiples of 8 on a hundred square",
        "resources": ["dual number line template", "hundred square (printed)", "squared paper"],
        "example_activity": "Draw two number lines: one showing jumps of 4, one showing jumps of 8. Draw arrows connecting each multiple of 4 to its double on the 8s line.",
        "transition_cue": "Child can identify whether a number is a multiple of 8 by checking the hundred square pattern, and can continue the 8s sequence from any multiple"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Reciting and writing multiples of 8, answering rapid-fire questions about the 8s sequence from any starting point",
        "resources": [],
        "example_activity": "What is 7 × 8? Count back in 8s from 96. If I am at 56, what are the next three multiples of 8?",
        "transition_cue": "Child recalls any multiple of 8 within 2 seconds and can count backwards in 8s through 0 without errors"
      }
    ]
  },
  {
    "concept_id": "MA-Y3-C003",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Counting stacks of 50p coins, grouping bundles of 50 straws, and using Dienes blocks to show groups of 50",
        "resources": ["50p coins (real or plastic)", "bundles of straws", "Dienes blocks (5 tens rods = 50)"],
        "example_activity": "Count out 50p coins one by one: 50, 100, 150, 200... Stack Dienes rods in groups of 5 tens to make 50 each time.",
        "transition_cue": "Child counts fluently in 50s up to 1000 and back, including crossing hundreds boundaries, without handling coins or blocks"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Drawing jumps of 50 on a number line, marking multiples of 50 on a scale diagram (like a measuring jug marked in 50ml)",
        "resources": ["number line (0-1000)", "measuring jug diagram", "hundred square extended to 1000"],
        "example_activity": "Draw a number line from 0 to 500. Mark jumps of 50. Now extend to 1000. Read the scale on a measuring jug marked in 50ml intervals.",
        "transition_cue": "Child reads scales marked in 50s fluently and continues 50s sequences from any starting multiple without drawing"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Mentally counting in 50s from any starting multiple, answering rapid questions about 50s sequences",
        "resources": [],
        "example_activity": "Start at 350 and count up in 50s to 700. What is 50 more than 650? What is 50 less than 400?",
        "transition_cue": "Child responds without hesitation to 50-more/50-less questions across hundreds boundaries"
      }
    ]
  },
  {
    "concept_id": "MA-Y3-C004",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Counting Dienes hundreds flats, physically stacking or lining them up to count in hundreds from 0 to 1000",
        "resources": ["Dienes hundreds flats", "place value mat"],
        "example_activity": "Place one hundred flat on the mat: 100. Add another: 200. Continue to 1000. Now remove one at a time: 1000, 900, 800...",
        "transition_cue": "Child counts forwards and backwards in hundreds without touching the blocks, including crossing 1000"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Drawing jumps of 100 on a 0-1000 number line, identifying multiples of 100 on place value charts",
        "resources": ["number line (0-1000)", "place value chart"],
        "example_activity": "Draw a number line from 0 to 1000 with marks at each hundred. Start at 300 and draw jumps of 100 forwards. Start at 900 and draw jumps back.",
        "transition_cue": "Child identifies any multiple of 100 on an unmarked number line by reasoning about position"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Mentally counting in hundreds from any starting number, answering '100 more' and '100 less' questions instantly",
        "resources": [],
        "example_activity": "What is 100 more than 700? Count back in hundreds from 1000. What number is 3 hundreds?",
        "transition_cue": "Child answers hundred-more/hundred-less questions for any three-digit number without pause"
      }
    ]
  },
  {
    "concept_id": "MA-Y3-C005",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Using Dienes blocks on a place value mat to physically add or remove a tens rod from a three-digit number",
        "resources": ["Dienes blocks (ones, tens, hundreds)", "place value mat (H, T, O)"],
        "example_activity": "Build 246 with Dienes blocks. Add one tens rod: now read the number (256). Remove one tens rod from 302: exchange a hundred for 10 tens first, then remove one ten (292).",
        "transition_cue": "Child finds 10 more/less for numbers requiring exchange (e.g. 10 less than 300) without physical blocks, explaining the exchange verbally"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Using a place value chart or number line to show the effect of adding/removing 10, circling the tens digit that changes",
        "resources": ["place value chart", "number line", "arrow cards"],
        "example_activity": "Write 196 in a place value chart. Circle the tens digit. Add 10: what changes? The tens digit goes from 9 to 0, and the hundreds digit increases by 1. Draw this on a number line.",
        "transition_cue": "Child explains the boundary crossing in their own words without needing the chart: 'The tens are full so I need to make another hundred'"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Answering rapid-fire '10 more' and '10 less' questions for any three-digit number, including boundary cases",
        "resources": [],
        "example_activity": "10 more than 196? 10 less than 300? 10 more than 990? Answer in under 3 seconds each.",
        "transition_cue": "Child answers all boundary cases (tens digit 9 or 0) without hesitation and can explain why the hundreds digit changes"
      }
    ]
  },
  {
    "concept_id": "MA-Y3-C006",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Using Dienes blocks on a place value mat to physically add or remove a hundreds flat from a three-digit number",
        "resources": ["Dienes blocks (ones, tens, hundreds)", "place value mat (H, T, O)"],
        "example_activity": "Build 324 with Dienes blocks. Add one hundreds flat: 424. Remove one hundreds flat from 324: 224. Try 100 more than 900 — you need a thousands cube!",
        "transition_cue": "Child finds 100 more/less without blocks, correctly identifying that tens and ones digits stay the same"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Using place value charts and arrow cards to show only the hundreds digit changing when adding/removing 100",
        "resources": ["place value chart", "arrow cards (100s, 10s, 1s)"],
        "example_activity": "Write 467 in a place value chart. What changes when you add 100? Only the hundreds column: 567. Use arrow cards: swap the 400 card for a 500 card.",
        "transition_cue": "Child consistently identifies the correct digit to change and handles the 900+100=1000 boundary correctly on paper"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Answering '100 more' and '100 less' questions instantly for any three-digit number",
        "resources": [],
        "example_activity": "100 more than 846? 100 less than 103? 100 more than 950? Answer each within 3 seconds.",
        "transition_cue": "Child answers all questions including boundary cases without hesitation and explains reasoning using place value language"
      }
    ]
  },
  {
    "concept_id": "MA-Y3-C007",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Building three-digit numbers with Dienes blocks (hundreds flats, tens rods, ones cubes) on a place value mat labelled H, T, O",
        "resources": ["Dienes blocks (ones, tens, hundreds)", "place value mat (H, T, O)"],
        "example_activity": "Build the number 347: place 3 hundreds flats, 4 tens rods and 7 ones cubes. Point to each group and say its value: three hundred, forty, seven.",
        "transition_cue": "Child correctly states the value of each digit (not just the digit itself) when shown any three-digit Dienes arrangement: 'The 3 is worth 300'"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Using arrow cards, place value charts and part-whole models to represent three-digit numbers and their partitions",
        "resources": ["arrow cards (100s, 10s, 1s)", "place value chart", "part-whole model template"],
        "example_activity": "Use arrow cards: combine 300 + 40 + 7 to make 347. Draw a part-whole model showing 347 = 300 + 40 + 7. Now draw 307: what happens to the tens?",
        "transition_cue": "Child partitions any three-digit number in standard form on paper without arrow cards, correctly handling zero placeholders"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Stating the value of any digit in a three-digit number and partitioning mentally in standard and flexible forms",
        "resources": [],
        "example_activity": "What is the value of the 4 in 482? Partition 653 in three different ways. What number has 5 hundreds, 0 tens and 8 ones?",
        "transition_cue": "Child instantly identifies digit values and partitions flexibly (e.g. 347 = 300 + 47 = 250 + 97) without written support"
      }
    ]
  },
  {
    "concept_id": "MA-Y3-C008",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Physically breaking Dienes block arrangements into different groupings to show standard and flexible partitions",
        "resources": ["Dienes blocks (ones, tens, hundreds)", "place value mat"],
        "example_activity": "Build 347. Standard partition: 3 hundreds, 4 tens, 7 ones. Now exchange one hundred for 10 tens: 2 hundreds, 14 tens, 7 ones. Is this still 347?",
        "transition_cue": "Child creates flexible partitions by exchanging blocks confidently and confirms the total is unchanged each time"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Recording multiple partitions using part-whole models and bar models, showing standard and flexible forms",
        "resources": ["part-whole model template", "bar model template"],
        "example_activity": "Draw three different part-whole models for 456: (400+50+6), (400+56), (300+156). Check each partition adds to 456.",
        "transition_cue": "Child writes at least three different partitions for any three-digit number on paper, checking totals independently"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Mentally partitioning three-digit numbers in multiple ways and applying partitioning as a calculation strategy",
        "resources": [],
        "example_activity": "Partition 482 in two non-standard ways. Use partitioning to calculate 347 + 200: 'I know 300 + 200 = 500, so 347 + 200 = 547.'",
        "transition_cue": "Child spontaneously uses flexible partitioning during mental addition and subtraction without prompting"
      }
    ]
  },
  {
    "concept_id": "MA-Y3-C009",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Placing Dienes block representations of different numbers on a physical number line and comparing by inspection",
        "resources": ["Dienes blocks", "floor number line (0-1000)", "number cards"],
        "example_activity": "Build 456 and 465 with Dienes blocks. Which has more hundreds? Same. Which has more tens? 465. Place them on the floor number line to check.",
        "transition_cue": "Child compares two three-digit numbers by checking hundreds first, then tens, then ones, without building them physically"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Placing numbers on a printed number line, using place value charts side by side, and introducing > < = symbols",
        "resources": ["number line (0-1000)", "place value comparison chart", "> < = symbol cards"],
        "example_activity": "Place 378, 387 and 738 on a number line. Write comparisons using > and <. Order from smallest to largest.",
        "transition_cue": "Child uses > < = symbols correctly and orders sets of 5+ numbers without a number line, explaining their systematic comparison"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Comparing and ordering any set of three-digit numbers using symbols and place value reasoning, without visual aids",
        "resources": [],
        "example_activity": "Order 456, 465, 546, 564, 645, 654 from smallest to largest. Insert > or < between 389 __ 398.",
        "transition_cue": "Child orders 6+ numbers correctly and explains their strategy: 'I compare hundreds first, then tens, then ones'"
      }
    ]
  },
  {
    "concept_id": "MA-Y3-C010",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Estimating quantities of physical objects (cubes in a jar, beads on a string) and marking estimated positions on a floor number line",
        "resources": ["jar of cubes", "bead strings", "floor number line (0-1000)"],
        "example_activity": "How many cubes are in this jar? Walk to where you think the number goes on the floor number line. Count to check. How close was your estimate?",
        "transition_cue": "Child consistently gives estimates within 100 of the actual count and uses benchmark reasoning: 'It looks like about half of 1000'"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Marking estimated positions on partially labelled number lines (marked only at 0, 500, 1000) and reading estimated values from scale diagrams",
        "resources": ["partially labelled number lines", "scale diagrams (measuring jugs, rulers)"],
        "example_activity": "This number line shows 0 and 1000. Mark where 750 goes. This jug is marked at 0 and 500ml. The water is here — estimate the amount.",
        "transition_cue": "Child places numbers on partially labelled number lines within 50 of the correct position and explains their reasoning using benchmarks"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Estimating answers to calculations and quantities in word problems without visual aids, using rounding to benchmarks",
        "resources": [],
        "example_activity": "Estimate: 487 + 315. Think: 487 is about 500, 315 is about 300, so about 800. Is 743 closer to 700 or 800?",
        "transition_cue": "Child routinely estimates before calculating, using rounding to the nearest hundred, and identifies unreasonable answers"
      }
    ]
  },
  {
    "concept_id": "MA-Y3-C011",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Building numbers with Dienes blocks and matching to printed word cards, physically associating blocks with words",
        "resources": ["Dienes blocks", "word cards (one to nine hundred, and, twenty, thirty... etc.)", "numeral cards"],
        "example_activity": "Build 347 with blocks. Find the word cards: 'three hundred', 'and', 'forty-seven'. Lay them out. Match to the numeral card 347.",
        "transition_cue": "Child reads the word form of any three-digit number shown in blocks and matches words to numerals without errors"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Writing numbers in words using a reference chart of ones and teens spellings, and converting between numeral and word forms on paper",
        "resources": ["number word reference chart", "conversion worksheets"],
        "example_activity": "Write 'three hundred and seven' as a numeral. Write 458 in words. Circle the numbers that need 'and' in their word form.",
        "transition_cue": "Child writes any three-digit number in words correctly, including those with zero in the tens place, without the reference chart"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Reading and writing any number to 1000 in words and numerals fluently, including dictated numbers",
        "resources": [],
        "example_activity": "Write in words: 906, 550, 111. Write as numerals: 'seven hundred and sixty-three'. Spell-check: is 'four hundred and fourty' correct?",
        "transition_cue": "Child spells all number words to 1000 correctly and converts between forms in both directions without errors"
      }
    ]
  }
]
