[
  {
    "concept_id": "MA-Y3-C040",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Collecting real data from class surveys, physically building scaled bar charts using stacking cubes (where each cube represents more than 1), and laying out pictograms with picture cards where each card represents a set number",
        "resources": ["stacking cubes (Unifix)", "pictogram picture cards", "large chart paper", "sticky notes", "data collection tallies"],
        "example_activity": "Survey: 'What is your favourite fruit?' Tally the results. Build a bar chart with cubes where each cube = 2 children: if 8 children chose apple, stack 4 cubes. Make a pictogram where each smiley face = 5 children: if 15 chose banana, draw 3 faces. What does half a face mean?",
        "transition_cue": "Child reads and builds scaled bar charts and pictograms correctly, interpreting half-symbols and values between marked intervals"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Drawing scaled bar charts and pictograms on paper with correct axis labels, keys and scales, reading values from charts including those between marked scale points",
        "resources": ["squared paper", "bar chart template", "pictogram template", "ruler"],
        "example_activity": "Draw a bar chart for the data: Red=10, Blue=15, Green=5, Yellow=20. Use a scale where each square = 5. Label both axes. Add a title. Draw a pictogram where each symbol = 4. How do you show 6? (1 full symbol and a half.) Read a given chart: if the bar reaches halfway between 20 and 30, what value is that?",
        "transition_cue": "Child draws scaled charts with correct labels, keys and scales, and reads intermediate values accurately"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Interpreting charts and tables from descriptions or partially given data, choosing appropriate scales for data sets, and reasoning about the advantages of different chart types",
        "resources": [],
        "example_activity": "A pictogram uses a scale where each circle = 10 people. There are 3.5 circles for Monday. How many people? (35.) What scale would you choose for data ranging from 0 to 50? Why not use a scale of 1? When would a bar chart be better than a pictogram?",
        "transition_cue": "Child selects appropriate scales for given data, interprets charts from descriptions without seeing them, and reasons about chart type choices"
      }
    ]
  },
  {
    "concept_id": "MA-Y3-C041",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Answering one-step and two-step questions from physical data displays (cube towers, object pictograms), physically comparing towers or groups to find differences and totals",
        "resources": ["data display (cube bar chart)", "pictogram with physical objects", "question cards"],
        "example_activity": "Look at the cube bar chart. How many children chose pizza? (One-step: read the bar.) How many more chose pizza than pasta? (Two-step: read both bars, subtract.) Stand the pizza tower and pasta tower side by side — the difference is the extra cubes sticking up above the shorter tower.",
        "transition_cue": "Child reads data displays and answers two-step questions by identifying the correct operation (add for 'altogether', subtract for 'how many more'), not just reading a single value"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Answering one-step and two-step questions from drawn bar charts, pictograms and tables, recording the reading and calculation steps on paper",
        "resources": ["bar chart worksheets", "pictogram worksheets", "table worksheets", "recording frame (read → calculate → answer)"],
        "example_activity": "From a bar chart: How many children altogether chose football and tennis? Read football = 24, tennis = 16. Calculate: 24 + 16 = 40. From a table: Which two categories have a total of 30? Record your steps: read, calculate, answer.",
        "transition_cue": "Child systematically reads values, identifies the operation needed, calculates and writes the answer for any two-step data question"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Solving multi-step data questions mentally, choosing the correct operations from question language, and explaining which data values are needed and why",
        "resources": [],
        "example_activity": "A bar chart shows: Football=30, Cricket=20, Tennis=15, Swimming=35. How many more chose swimming than cricket? How many chose ball sports altogether? If 10 more children join tennis, would it have more than cricket? Explain your reasoning.",
        "transition_cue": "Child interprets 'how many more', 'altogether', 'how many fewer' and 'times as many' correctly, selects the right operation, and solves without needing to see the chart"
      }
    ]
  }
]
