[
  {
    "concept_id": "MA-Y1-C001",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children count physical objects using one-to-one correspondence, touching each item as they say each number. Bead strings with colour changes every 10 beads help children feel the decade structure. Counting backwards is practised by physically removing one object at a time from a group.",
        "resources": ["Bead strings (100 beads, colour change every 10)", "Counters", "Interlocking cubes", "Buttons and shells for counting collections", "Number track (1-20, then 1-100)"],
        "example_activity": "Thread 20 beads onto a string, alternating colours every 10. Count forwards touching each bead, then count backwards sliding each bead along the string as you say its number.",
        "transition_cue": "Child counts forwards and backwards to at least 50 touching objects without skipping or repeating, and self-corrects when they notice an error at a decade boundary."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children count using printed number tracks and hundred squares, pointing to each number rather than touching a physical object. Partially filled number tracks encourage children to bridge across decade boundaries by filling in missing numbers.",
        "resources": ["Number tracks (0-20, 0-100)", "Hundred squares", "Partially completed number tracks with gaps at decade boundaries"],
        "example_activity": "Fill in the missing numbers on a number track that has gaps at every decade boundary: ...28, 29, __, 31, 32... and ...48, 49, __, 51, 52...",
        "transition_cue": "Child points along a hundred square counting forwards or backwards from any starting number to any ending number without hesitation at decade boundaries."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children recite the number sequence forwards and backwards from any given number up to 100 without any visual support. They can continue a count from a given starting point and change direction (forwards to backwards or vice versa) fluently.",
        "resources": ["Numeral cards for random starting points"],
        "example_activity": "Teacher says a random starting number (e.g. 67). Child counts forwards to 75, then immediately counts backwards to 58 without pausing.",
        "transition_cue": "Child counts fluently in either direction from any starting number within 100, responding within 2 seconds to a random start number and maintaining pace across decade boundaries."
      }
    ]
  },
  {
    "concept_id": "MA-Y1-C002",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children make physical groups to skip count: pairs of socks or shoes for counting in 2s, bundles of 5 pencils or hands (5 fingers) for counting in 5s, and Dienes ten-sticks or bundles of 10 straws for counting in 10s. Each group is added one at a time and the running total announced.",
        "resources": ["Pairs of socks, shoes or gloves", "5p coins", "Dienes ten-sticks", "Bundles of 10 straws", "Egg boxes (groups of 10)", "Counters for grouping"],
        "example_activity": "Place pairs of socks in a line. As each pair is added, count the running total: 2, 4, 6, 8, 10. Repeat with towers of 5 cubes for counting in 5s.",
        "transition_cue": "Child makes equal groups of 2, 5 or 10 from a pile of objects and announces the running total correctly as each group is added, without recounting from the beginning."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children use hundred squares with every 2nd, 5th or 10th number shaded in a different colour, revealing the visual pattern of multiples. Number tracks with highlighted multiples also support the transition from grouped objects to number patterns.",
        "resources": ["Hundred squares with multiples of 2 shaded", "Hundred squares with multiples of 5 shaded", "Hundred squares with multiples of 10 shaded", "Counting sticks with colour-coded groups"],
        "example_activity": "Shade every 5th square on a blank hundred square. Describe what pattern you see (a column pattern). Use the shaded squares to count in 5s from 0 to 100.",
        "transition_cue": "Child uses a hundred square to count in 2s, 5s or 10s from 0 without making errors, and can describe the visual pattern the multiples make on the grid."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children recite skip-counting sequences orally without any visual support, starting from 0 or from any given multiple. They can switch between counting in 2s, 5s and 10s on request.",
        "resources": [],
        "example_activity": "Rapid-fire oral practice: teacher says 'Count in 5s from 15', child responds '15, 20, 25, 30, 35...' Teacher says 'Stop. Now count in 10s from 30', child responds '30, 40, 50, 60...'",
        "transition_cue": "Child recites any skip-counting sequence (2s, 5s or 10s) from a given multiple without hesitation, and can continue the sequence across decade boundaries fluently."
      }
    ]
  },
  {
    "concept_id": "MA-Y1-C003",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children handle physical numeral cards and magnetic digits, matching them to groups of objects. Sandpaper numerals or textured digit cards allow children to trace the formation of each digit with their finger, building motor memory for writing numerals.",
        "resources": ["Numeral cards (0-100)", "Magnetic digits", "Sandpaper numerals (0-9)", "Digit tiles"],
        "example_activity": "Teacher places a group of 14 cubes on the table. Child selects the digit cards '1' and '4' and places them in the correct order to make 14. Child traces the sandpaper numeral to practise writing each digit.",
        "transition_cue": "Child consistently selects the correct digit cards to represent any number up to 20 shown as a group of objects, placing tens and ones digits in the correct order including teen numbers."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children read numerals on printed number lines and hundred squares, and practise writing numerals using lined paper. Number fans allow children to show a number quickly by selecting and displaying digit cards.",
        "resources": ["Number lines (0-100)", "Hundred squares", "Number fans", "Lined writing paper"],
        "example_activity": "Teacher calls out a number. Child finds it on the hundred square, reads it aloud, then writes the numeral on lined paper. Focus on teen numbers where reversal errors are common (e.g. writing 41 instead of 14).",
        "transition_cue": "Child reads any numeral from 0 to 100 on a hundred square or number line without error, and writes teen numbers with digits in the correct order."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children read any numeral from 0 to 100 on sight and write any number to 100 from dictation, with correct digit formation and no reversal of tens and ones.",
        "resources": ["Whiteboards for quick-write practice"],
        "example_activity": "Teacher dictates random numbers between 0 and 100. Child writes each numeral on a whiteboard and holds it up. Focus on tricky numbers: teens, decades (20, 30...), and numbers crossing 100.",
        "transition_cue": "Child writes any dictated number to 100 correctly within 5 seconds, including teen numbers and decade numbers, with no digit reversals."
      }
    ]
  },
  {
    "concept_id": "MA-Y1-C004",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children handle word cards for numbers 1-20, physically matching them to numeral cards. The word cards are displayed as high-frequency words on a number word wall, and children pick up and pair the card with its numeral partner.",
        "resources": ["Number word cards (one to twenty)", "Numeral cards (1-20)", "Number word wall display", "Matching trays"],
        "example_activity": "Spread numeral cards face-up on the table. Teacher holds up a word card ('twelve'). Child finds the matching numeral card (12) and places them together.",
        "transition_cue": "Child correctly matches all 20 word cards to their numeral partners without hesitation, including irregular words like 'eight', 'twelve' and 'fifteen'."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children read and write number words using illustrated flashcards and worksheets that pair the word with both the numeral and a picture showing the quantity. Tracing sheets help with spelling irregular number words.",
        "resources": ["Illustrated number word flashcards", "Word-numeral-picture matching worksheets", "Number word tracing sheets"],
        "example_activity": "Complete a worksheet: each row shows a picture of objects (e.g. 13 butterflies), a numeral (13), and a space to write the word ('thirteen'). Children write the word, checking against the word wall if needed.",
        "transition_cue": "Child reads all number words from 'one' to 'twenty' on flashcards without error and writes them with mostly correct spelling, needing help only with the most irregular words."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children read and write all number words from 'one' to 'twenty' independently from memory, including irregular spellings, without reference to a word wall or flashcards.",
        "resources": ["Whiteboards for spelling practice"],
        "example_activity": "Teacher dictates five random numbers between 1 and 20. Child writes the number word for each on a whiteboard: e.g. 'eight', 'twelve', 'fifteen', 'nineteen', 'seven'.",
        "transition_cue": "Child writes all number words from 'one' to 'twenty' from dictation with correct spelling, including the irregular forms 'eight', 'twelve', 'fifteen', 'eighteen' and 'twenty'."
      }
    ]
  },
  {
    "concept_id": "MA-Y1-C005",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children add one cube to a group to find 'one more' or remove one cube to find 'one less'. Numicon plates placed in order show the one-more/one-less pattern visually through their staircase shape. Bead strings where one bead slides across physically demonstrate the change.",
        "resources": ["Interlocking cubes", "Numicon plates", "Bead strings", "Counters"],
        "example_activity": "Build a tower of 8 cubes. Add one more cube — how many now? Take one away — how many now? Repeat with different starting towers, focusing on towers of 9, 19, 29 (decade boundaries).",
        "transition_cue": "Child adds or removes one cube from any group up to 20 and states the new total without recounting the whole group, including when the change crosses a decade boundary (e.g. 19 + 1 = 20)."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children use number tracks and hundred squares to find one more (one step to the right) and one less (one step to the left). Arrows drawn on the track or square show the direction of the step.",
        "resources": ["Number tracks (0-100)", "Hundred squares", "Arrow cards or stickers"],
        "example_activity": "On a hundred square, place a counter on 39. Draw an arrow one square to the right — what number is one more? Draw an arrow one square to the left from 40 — what number is one less? Notice how the row changes.",
        "transition_cue": "Child uses a hundred square to find one more or one less of any number up to 100 by moving one position, correctly navigating row changes at decade boundaries."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children respond instantly to 'one more than' and 'one less than' questions for any number up to 100 without any visual support, treating it as a known fact rather than a counting procedure.",
        "resources": [],
        "example_activity": "Rapid-fire partner game: one child says a number, the other says one more, then they swap. Increase speed. Target decade boundary numbers for extra practice.",
        "transition_cue": "Child states one more and one less than any given number up to 100 within 2 seconds, including across decade boundaries (e.g. one more than 59, one less than 40), without any visual support."
      }
    ]
  },
  {
    "concept_id": "MA-Y1-C006",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children walk along a large floor number line, stepping to each position as they count. Pegged number lines on washing lines allow children to physically clip numbers in the correct position. The physical movement builds understanding of numbers as positions in an ordered sequence.",
        "resources": ["Floor number line (chalk or tape, 0-20)", "Washing line with pegs and number cards", "Bead strings with numbered positions"],
        "example_activity": "Peg number cards 0, 5, 10, 15, 20 on the washing line at equal intervals. Give children the remaining cards (1-4, 6-9, 11-14, 16-19) and ask them to peg each card in its correct position.",
        "transition_cue": "Child pegs any number from 0 to 20 in its correct position on a partially labelled washing line, spacing it approximately evenly between its neighbours."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children use printed number lines from 0 to 20 (fully labelled) and then 0 to 100 (partially labelled at every 10). They mark, circle or point to given numbers, and estimate positions between labelled marks.",
        "resources": ["Printed number lines (0-20, fully labelled)", "Printed number lines (0-100, labelled at every 10)", "Blank number lines with only endpoints marked"],
        "example_activity": "On a number line labelled only at 0, 10, 20, 30, 40, 50, place a mark where 27 should go. Explain why you placed it there (it is between 20 and 30, closer to 30).",
        "transition_cue": "Child places numbers on a partially labelled number line (0-50 or 0-100) within one or two positions of the correct location, and explains their reasoning using the labelled reference points."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children estimate positions on a number line with only endpoints marked (e.g. 0 and 100), reasoning about relative magnitude. They use the number line as a mental model to support addition, subtraction and comparison without needing to see it drawn.",
        "resources": ["Blank number line templates"],
        "example_activity": "Draw a line with 0 at one end and 100 at the other. Estimate where 25, 50 and 75 should go. Then estimate where 38 should go relative to your marks.",
        "transition_cue": "Child estimates the position of any number on a 0-100 number line with only endpoints marked, placing it in approximately the correct quarter of the line, and uses number line reasoning to explain comparisons."
      }
    ]
  },
  {
    "concept_id": "MA-Y1-C007",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children build towers of cubes or lay out rows of counters to compare two quantities physically. Towers placed side by side from a common baseline make the 'more than' and 'less than' relationship visually obvious. Sorting hoops labelled 'more' and 'fewer' help organise comparisons.",
        "resources": ["Interlocking cubes for tower-building", "Counters", "Sorting hoops labelled 'more' and 'fewer'", "Buttons, shells or other small objects"],
        "example_activity": "Build two towers: 5 red cubes and 8 blue cubes. Stand them side by side. 'There are more blue cubes than red cubes. There are fewer red cubes than blue cubes. They are not equal.'",
        "transition_cue": "Child uses the words 'more than', 'fewer than' and 'equal to' correctly when comparing two groups of objects, without being prompted to use mathematical vocabulary."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children compare quantities shown in pictures, simple bar representations and number line positions. They begin to use comparison sentences without physical objects, using the terms 'more than', 'less than', 'equal to', 'most' and 'least' in written descriptions.",
        "resources": ["Comparison picture cards", "Simple bar representations", "Number lines for positional comparison"],
        "example_activity": "Look at two pictures: 12 apples and 9 oranges. Write a comparison sentence: 'There are more apples than oranges' or '9 is less than 12'.",
        "transition_cue": "Child writes or speaks complete comparison sentences using 'more than', 'less than' or 'equal to' when comparing pictured quantities, choosing the correct term without confusion."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children use the full comparative vocabulary (equal to, more than, less than, most, least) fluently in spoken and written mathematical statements when comparing and ordering numbers, without any concrete or pictorial support.",
        "resources": ["Numeral cards for comparison games"],
        "example_activity": "Order the numbers 45, 23, 67, 12 from least to most. State: '12 is the least. 67 is the most. 23 is less than 45. 45 is more than 23.'",
        "transition_cue": "Child spontaneously uses precise comparative vocabulary ('most', 'least', 'more than', 'less than', 'equal to') in mathematical discussions, self-correcting if they use informal language like 'bigger' or 'smaller'."
      }
    ]
  },
  {
    "concept_id": "MA-Y1-C008",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children use ten frames with two-colour counters to discover number bonds to 10: placing red counters in some cells and yellow in the rest makes the complement visible. Numicon plates show bonds through interlocking pairs that fill a 10-plate. Double ten frames extend the approach to bonds within 20.",
        "resources": ["Ten frames", "Double ten frames", "Two-colour counters (red/yellow)", "Numicon plates", "Interlocking cubes in two colours"],
        "example_activity": "Place 6 red counters on a ten frame. Fill the remaining spaces with yellow counters. How many yellow? Write the bond: 6 + 4 = 10. Now make all the bonds to 10 this way and record them.",
        "transition_cue": "Child builds any bond to 10 on a ten frame without counting the empty spaces one by one — they see the complement as a known fact and announce it immediately."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children draw ten frame diagrams and use part-whole models (bar models) to represent number bonds. Bond collector record sheets encourage systematic recording of all bonds to 10 and 20 in all three forms (addition and both subtractions).",
        "resources": ["Part-whole model diagrams", "Ten frame recording sheets", "Bond collector worksheets", "Number line diagrams"],
        "example_activity": "Draw a part-whole model with 15 as the whole. Write one part as 8. Find the missing part (7). Write all four facts in the fact family: 8 + 7 = 15, 7 + 8 = 15, 15 - 8 = 7, 15 - 7 = 8.",
        "transition_cue": "Child completes part-whole models for any bond within 20 without counting on, and writes all four facts in the fact family from a single drawn model."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children recall all addition and subtraction bonds within 20 instantly, in any form, without visual support. They respond to rapid-fire oral and written questions covering all three representations of each bond.",
        "resources": ["Flash cards for rapid recall practice"],
        "example_activity": "Rapid-fire: teacher says '9 + 6?', child responds '15'. Teacher says '15 minus 9?', child responds '6'. Teacher says 'What goes with 7 to make 13?', child responds '6'. All within 3 seconds per question.",
        "transition_cue": "Child recalls any bond within 20 in any form (addition, subtraction, missing number) within 3 seconds without counting on or using visual support."
      }
    ]
  },
  {
    "concept_id": "MA-Y1-C009",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children physically push two groups of objects together (combining) or start with a group and add more objects one at a time (augmenting). They count the total by touching each object. Both structures of addition are practised with real objects before any recording.",
        "resources": ["Counters", "Interlocking cubes", "Toy animals or buttons for combining", "Small bags or pots for augmenting"],
        "example_activity": "Combining: 'Put 4 blue cubes and 3 red cubes together. How many altogether?' Augmenting: 'Start with 5 counters in your pot. I give you 3 more. How many now?' Count all objects to find the total.",
        "transition_cue": "Child combines or augments two groups of objects and finds the correct total by counting on from the larger group rather than recounting all objects from the beginning."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children use number lines with drawn jumps to represent addition as counting on. Simple pictures of objects being joined together illustrate combining problems. Bar models (part-part-whole diagrams) begin to represent addition structure.",
        "resources": ["Number lines (0-20)", "Number line jump diagrams", "Part-whole model templates", "Picture addition cards"],
        "example_activity": "Use a number line: start at 8, draw 5 jumps forwards to find 8 + 5. Record: 8 + 5 = 13. Draw a bar model showing 8 and 5 as parts and 13 as the whole.",
        "transition_cue": "Child draws jumps on a number line to solve addition within 20, starting from the larger number and counting on the smaller number, landing on the correct answer consistently."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children write addition number sentences using the + and = symbols, solve addition problems mentally using recalled number bonds, and interpret addition word problems selecting the correct operation.",
        "resources": ["+ and = symbol cards"],
        "example_activity": "Solve word problems and write the number sentence: 'There are 9 children playing and 6 more join them. How many altogether? Write: 9 + 6 = 15.'",
        "transition_cue": "Child writes correct addition number sentences for word problems involving both combining and augmenting contexts, using recalled bonds rather than counting on."
      }
    ]
  },
  {
    "concept_id": "MA-Y1-C010",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "For 'take away': children remove objects from a group and count what remains. For 'difference': children line up two rows of objects side by side and count the gap between them. Both structures are practised physically so children understand subtraction has two distinct meanings.",
        "resources": ["Counters", "Interlocking cubes for comparison rows", "Small objects to remove from a group"],
        "example_activity": "Take away: 'Start with 11 cubes. Take away 4. How many left?' Difference: 'Build a tower of 9 and a tower of 5. Stand them next to each other. What is the difference? Count the gap.'",
        "transition_cue": "Child solves both take-away and difference problems with objects, correctly distinguishing between removing objects (take away) and comparing two groups (difference)."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children use number lines to count back for take-away problems and count the distance between two numbers for difference problems. Crossing-out pictures show removal; comparison bar diagrams show the gap between two quantities.",
        "resources": ["Number lines (0-20)", "Comparison bar diagrams", "Crossing-out picture worksheets"],
        "example_activity": "On a number line, start at 15 and count back 7 jumps for the take-away 15 - 7. For the difference between 12 and 8, mark both numbers and count the jumps between them.",
        "transition_cue": "Child uses a number line to solve subtraction within 20 by counting back (take away) or counting the gap (difference), selecting the appropriate strategy for the problem type."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children write subtraction number sentences using the – and = symbols, use subtraction vocabulary (take away, difference, how many more) in context, and solve word problems by selecting the correct operation.",
        "resources": ["– and = symbol cards"],
        "example_activity": "Solve: 'Ali has 16 stickers. Ben has 9 stickers. How many more does Ali have?' Write: 16 – 9 = 7. Ali has 7 more stickers.",
        "transition_cue": "Child writes correct subtraction number sentences for word problems involving both take-away and difference contexts, and explains which structure the problem uses."
      }
    ]
  },
  {
    "concept_id": "MA-Y1-C011",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children use part-whole models with physical objects: cubes in a tray divided into three sections (whole, part, part), with one section covered by a cup or cloth. They work out the hidden part using their knowledge of the visible parts and the whole.",
        "resources": ["Part-whole trays (three sections)", "Cups or cloths for covering", "Interlocking cubes", "Numicon plates showing complements"],
        "example_activity": "Place 7 cubes in the 'whole' section. Move 3 to one 'part' section and cover the other with a cup. 'How many are hiding under the cup?' Child works out 7 - 3 = 4 and checks by lifting the cup.",
        "transition_cue": "Child finds the hidden quantity in a part-whole model without needing to peek, using subtraction or known bonds, and explains: 'I know 3 and 4 make 7, so 4 must be hiding.'"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children solve missing number problems using drawn part-whole diagrams with a question mark in one section. They also work with number line diagrams showing a gap and equation cards with blanks in different positions.",
        "resources": ["Part-whole diagram worksheets with missing sections", "Number line gap diagrams", "Equation cards with blanks (? + 3 = 10, 10 - ? = 3, 7 = ? - 5)"],
        "example_activity": "Complete the part-whole diagram: whole = 14, one part = 9, other part = ?. Write the equation: 9 + ? = 14. Find the missing number: ? = 5.",
        "transition_cue": "Child solves missing number problems from a drawn part-whole model where the unknown is in any position (missing part or missing whole), writing the corresponding equation correctly."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children solve written missing number equations where the unknown can be at the start, middle or end, and where the equals sign can be on either side. They understand = as expressing equivalence, not as 'the answer comes after'.",
        "resources": ["= symbol reference card"],
        "example_activity": "Solve: 7 = ? – 9. Child reasons: 'If I take 9 away from something and get 7, I need to add 7 + 9 = 16. So 7 = 16 – 9.' Solve: ? + 5 = 12. Child reasons: '12 – 5 = 7.'",
        "transition_cue": "Child solves missing number equations with the unknown in any position and the equals sign on either side, explaining their reasoning using the inverse relationship between addition and subtraction."
      }
    ]
  },
  {
    "concept_id": "MA-Y1-C012",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children share objects equally between teddies, plates or people by dealing one at a time ('one for you, one for me'). They also make equal groups from a collection by counting out a fixed number of objects repeatedly. Toy sharing with real objects makes division tangible.",
        "resources": ["Teddies or toy figures for sharing between", "Plates or sorting hoops", "Counters, cubes, toy animals", "Small bags for grouping"],
        "example_activity": "Sharing: 'Share 12 cubes equally between 3 teddies. Deal one cube to each teddy, then another, until all cubes are given out. How many does each teddy get?' Grouping: 'Put these 15 cubes into groups of 5. How many groups did you make?'",
        "transition_cue": "Child shares objects equally between 2, 3, 4 or 5 recipients by one-at-a-time dealing without making errors, and groups objects into specified equal groups, stating the number of groups made."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children draw arrays of dots to represent equal groups and use ring diagrams to show grouping. They begin to connect their pictures to the language of multiplication and division: '3 groups of 4' and '12 shared between 3'.",
        "resources": ["Dot array templates", "Ring-the-groups worksheets", "Array drawing grids"],
        "example_activity": "Draw an array of 3 rows and 5 columns. Ring each row. 'How many groups? How many in each group? 3 groups of 5 is 15.' Now ring each column. '5 groups of 3 is also 15.'",
        "transition_cue": "Child draws arrays and ring diagrams to represent grouping and sharing problems, and uses the language 'groups of' and 'shared between' to describe what the picture shows."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children connect their grouping and sharing experience to multiplication and division vocabulary, beginning to describe situations using 'multiply', 'divide', 'groups of' and 'shared equally'. They may write informal multiplicative statements with teacher support.",
        "resources": ["Vocabulary cards: multiply, divide, groups of, shared between"],
        "example_activity": "Describe using mathematical words: '3 groups of 5 is 15, so 3 times 5 equals 15. If we share 15 between 3, each gets 5, so 15 divided by 3 equals 5.'",
        "transition_cue": "Child uses multiplication and division vocabulary unprompted when describing grouping and sharing situations, connecting the language to their concrete and pictorial experience."
      }
    ]
  },
  {
    "concept_id": "MA-Y1-C013",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children make two identical groups of objects to double: build a tower of 4 cubes, then build an identical tower and count the total. For halving, they split a group into two equal piles. Mirrors placed behind a row of objects visually demonstrate the doubling effect.",
        "resources": ["Interlocking cubes", "Counters", "Small mirrors", "Plates for splitting into two groups"],
        "example_activity": "Place 5 cubes in a row. Place a mirror at the end — the reflection 'doubles' the row. Build a second row of 5 to match. Count all: double 5 is 10. For halving: take 10 cubes and share equally between 2 plates. Half of 10 is 5.",
        "transition_cue": "Child makes two identical groups for any double up to double 10 without counting the second group one-by-one — they count out the same number as the first group confidently."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children draw butterfly-wing diagrams (mirrored patterns) showing doubles, and use simple drawings of matched groups. For halving, they draw a line down the middle of a group of pictures and count each side.",
        "resources": ["Butterfly-wing drawing templates", "Doubles and halves recording sheets", "Mirror-line drawing paper"],
        "example_activity": "Draw a butterfly wing with 6 spots. Draw the matching wing with 6 spots. How many spots altogether? Double 6 is 12. Now draw 12 circles and split them with a line. Half of 12 is 6.",
        "transition_cue": "Child draws doubles and halves diagrams accurately, and begins to state the double or half before drawing, using the picture to confirm rather than to discover the answer."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children rapidly recall doubles to 10 and the corresponding halves as known facts, and recognise that halving is the inverse of doubling. They connect doubling to addition (double 7 = 7 + 7 = 14) and halving to the fraction one half.",
        "resources": [],
        "example_activity": "Rapid-fire doubles: 'Double 3? 6. Double 8? 16. Half of 14? 7. How do you know half of 14 is 7? Because double 7 is 14.' Connect: 'Half of 14 is the same as finding one half of 14.'",
        "transition_cue": "Child states any double up to double 10 and the corresponding half instantly, and explains the inverse relationship: 'I know half of 16 is 8 because double 8 is 16.'"
      }
    ]
  },
  {
    "concept_id": "MA-Y1-C014",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children fold paper shapes in half and overlay the two parts to check they are exactly equal. They split real objects (playdough, fruit, ribbon) into two equal pieces. Sharing objects between 2 plates connects halving a quantity to the concept of one half.",
        "resources": ["Paper circles, squares and rectangles for folding", "Playdough", "Ribbon or string", "Plates for sharing between 2"],
        "example_activity": "Fold a paper circle in half. Open it and check: do the two parts match when you fold them together again? Now share 8 counters equally between 2 plates. Each plate has 4 — that is one half of 8.",
        "transition_cue": "Child folds shapes in half accurately so both parts match when overlaid, and shares small even quantities between 2 to find a half, stating 'Half of [number] is [answer]' with confidence."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children shade one of two equal parts in drawn shapes and draw lines to divide shapes in half. They draw sharing diagrams to find half of quantities, and identify correct and incorrect halvings in pictures.",
        "resources": ["Shape halving worksheets", "Fraction strips showing one half shaded", "Correct/incorrect halving pictures for sorting"],
        "example_activity": "Look at four pictures of shapes divided into two parts. Sort them: 'Is this a half? This shape has two EQUAL parts — yes, it is a half. This shape has two unequal parts — no, it is NOT a half.'",
        "transition_cue": "Child correctly identifies whether pictured shapes have been halved (both parts equal) or not, rejecting unequal partitions, and shades exactly half of drawn shapes."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children use the language 'one half' to describe equal division into two parts. They find half of even numbers up to 20 mentally, connecting halving to division by 2 and to the fraction notation 1/2 when ready.",
        "resources": ["Fraction notation card: 1/2"],
        "example_activity": "Find half of 14. Child says: 'Half of 14 is 7 because 7 + 7 = 14.' Explain: 'One half means one of two equal parts. If I split 14 into 2 equal groups, each group is 7.'",
        "transition_cue": "Child finds half of any even number up to 20 mentally without concrete support, and explains that 'half' means two equal parts using complete sentences."
      }
    ]
  },
  {
    "concept_id": "MA-Y1-C015",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children fold paper in half, then in half again, to make four equal parts — each part is one quarter. They share objects equally between 4 teddies or plates to find one quarter of a quantity. Cutting fruit (an apple) into quarters provides a real-world, tactile experience.",
        "resources": ["Paper squares and circles for double-folding", "4 plates or teddies for sharing between", "Counters and cubes", "Real fruit for quartering (with supervision)"],
        "example_activity": "Fold a paper square in half, then fold it in half again. Open it up: how many equal parts? Four. Each part is one quarter. Now share 12 cubes equally between 4 plates. One quarter of 12 is 3.",
        "transition_cue": "Child folds paper into four equal parts by halving twice, names each part 'one quarter', and shares objects equally between 4 to find one quarter of a quantity correctly."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children shade one of four equal parts in drawn shapes and use fraction strips showing one quarter. They draw diagrams to find one quarter of quantities and identify correct and incorrect partitions into quarters.",
        "resources": ["Quarter-shading shape worksheets", "Fraction strips showing quarters", "Correct/incorrect quarter pictures for sorting"],
        "example_activity": "Draw a circle divided into 4 equal parts. Shade one part. This is one quarter. Now find a quarter of 16 by drawing 16 dots split into 4 equal groups. One quarter of 16 is 4.",
        "transition_cue": "Child shades exactly one quarter of drawn shapes divided into four equal parts, and finds one quarter of multiples of 4 up to 20 using drawn sharing diagrams."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children use the language 'one quarter' to describe four equal parts. They find one quarter of small multiples of 4 mentally, connecting a quarter to 'half of a half' and to the fraction turn vocabulary (quarter turn = one right angle).",
        "resources": ["Fraction notation card: 1/4"],
        "example_activity": "Find a quarter of 20. Child says: 'A quarter of 20 is 5. I know because half of 20 is 10, and half of 10 is 5. A quarter is half of a half.' Connect: 'A quarter turn is one of four equal turns in a full turn.'",
        "transition_cue": "Child finds one quarter of multiples of 4 up to 20 mentally by halving twice, and connects the fraction quarter to quarter turns without prompting."
      }
    ]
  },
  {
    "concept_id": "MA-Y1-C016",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children compare objects by direct comparison, placing them side by side from a common baseline. They measure lengths using non-standard units (cubes, paperclips) placed end-to-end with no gaps or overlaps. They describe their findings using comparative language: longer, shorter, taller.",
        "resources": ["Interlocking cubes for non-standard measuring", "Paperclips", "Classroom objects to compare (pencils, books, ribbons)", "Rulers for introduction to standard units"],
        "example_activity": "Compare two ribbons: place them side by side starting at the same edge of the table. Which is longer? Now measure each ribbon in cubes laid end-to-end. 'The red ribbon is 8 cubes long. The blue ribbon is 12 cubes long. The blue ribbon is longer.'",
        "transition_cue": "Child aligns objects from a common baseline for comparison, measures using non-standard units with no gaps or overlaps, and uses 'longer', 'shorter', 'taller' correctly."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children draw objects alongside rulers in diagrams, record measurements in simple tables, and label pictures with comparative language. They begin to use centimetre rulers, connecting the ruler to a number line.",
        "resources": ["Ruler diagrams", "Measurement recording tables", "Pictures of objects to label with measurements"],
        "example_activity": "Draw a picture of your pencil next to a ruler. Write the measurement: 'My pencil is 15 cm long.' Record measurements of 5 classroom objects in a table. Order them from shortest to longest.",
        "transition_cue": "Child draws objects aligned with a ruler starting at 0, reads the correct measurement in centimetres, and records measurements in a table using the abbreviation 'cm'."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children estimate and measure lengths using centimetres and metres, selecting the appropriate unit and recording with standard abbreviations. They solve comparison problems using mathematical language without physical measuring tools.",
        "resources": ["cm and m abbreviation reference"],
        "example_activity": "Estimate the length of your desk in centimetres. Now measure. How close was your estimate? 'My desk is 60 cm long. My estimate was 50 cm — I was 10 cm too short.'",
        "transition_cue": "Child estimates lengths to within 5 cm for objects under 30 cm, measures accurately with a ruler starting from 0, and records using 'cm' without confusion."
      }
    ]
  },
  {
    "concept_id": "MA-Y1-C017",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children heft objects in each hand to feel which is heavier, then use a balance scale to confirm. Objects of different sizes but similar masses (a large sponge vs a small stone) challenge the misconception that bigger means heavier.",
        "resources": ["Balance scales", "Classroom objects of varied size and mass", "Cubes or conkers as non-standard weight units"],
        "example_activity": "Hold a large sponge in one hand and a small stone in the other. Predict which is heavier. Check with the balance scale. The stone is heavier even though it is smaller. 'I can see the stone side goes down.'",
        "transition_cue": "Child predicts and checks mass using a balance scale, correctly interpreting which side goes down as heavier, and recognises that size does not always determine mass."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children draw diagrams of balance scales showing which side is heavier or lighter, and record results in simple comparison tables. They draw pictures of objects ordered by mass.",
        "resources": ["Balance scale diagram templates", "Mass comparison recording tables", "Object ordering worksheets"],
        "example_activity": "Draw the balance scale showing: the apple is heavier than the pencil. Draw the apple side lower. Record in a table: 'Apple — heavier. Pencil — lighter.' Order three objects from lightest to heaviest.",
        "transition_cue": "Child draws balance scale diagrams correctly (heavier side lower) and records mass comparisons in tables using 'heavier' and 'lighter', ordering objects correctly."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children use comparative vocabulary (heavier, lighter, heaviest, lightest) in spoken and written statements. They begin to use standard units (grams and kilograms) and record masses using abbreviations.",
        "resources": ["g and kg abbreviation reference"],
        "example_activity": "State: 'The pencil case is lighter than the book. The book is heavier than the pencil case. The pencil case weighs about 200 grams. The book weighs about 500 grams.'",
        "transition_cue": "Child uses 'heavier', 'lighter', 'heaviest', 'lightest' correctly in descriptions, and begins to estimate and record masses in grams using the 'g' abbreviation."
      }
    ]
  },
  {
    "concept_id": "MA-Y1-C018",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children pour water or sand between different containers, comparing capacity by filling and emptying. They use vocabulary 'full', 'empty', 'half full', 'more than', 'less than'. Containers of different shapes but similar capacity challenge the misconception that taller means more.",
        "resources": ["Water tray or sand tray", "Containers of different shapes and sizes", "Cups for non-standard measuring", "Funnels"],
        "example_activity": "Fill a tall thin bottle and pour all the water into a short wide bowl. Does it all fit? If there is water left over, the bottle holds more. If the bowl is not full, the bottle holds less. Describe using: 'The bottle holds more than the bowl.'",
        "transition_cue": "Child compares capacity by pouring and uses 'holds more', 'holds less', 'full', 'empty', 'half full' correctly, recognising that a taller container does not always hold more."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children draw containers at different fill levels and label them (full, empty, half full, quarter full). They record the number of cups needed to fill different containers in simple tables and compare the numbers.",
        "resources": ["Container fill-level worksheets", "Capacity recording tables", "Labelled diagram templates"],
        "example_activity": "Draw three bottles: one full, one half full, one empty. Label each. Record: 'The jug holds 6 cups. The bowl holds 4 cups. The jug holds more than the bowl.'",
        "transition_cue": "Child labels container diagrams with correct fill-level vocabulary and records capacity measurements in cups, comparing quantities using 'more than' and 'less than'."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children use capacity vocabulary accurately in descriptions and begin to use the terms 'litres' and 'millilitres' as standard units. They solve simple comparison problems without physical containers.",
        "resources": ["l and ml abbreviation reference"],
        "example_activity": "'This bucket holds 5 litres. This jug holds 2 litres. Which holds more? How much more? The bucket holds 3 litres more than the jug.'",
        "transition_cue": "Child uses 'litres' and 'millilitres' as measurement terms, compares capacities using subtraction, and solves simple capacity comparison problems without physical pouring."
      }
    ]
  },
  {
    "concept_id": "MA-Y1-C019",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children order picture cards of daily events (breakfast, school, lunch, play, dinner, bedtime) using time vocabulary. They use real geared demonstration clocks and individual clock-face manipulatives to set and read o'clock times. The physical gearing shows how the minute hand movement drives the hour hand.",
        "resources": ["Daily routine picture cards", "Geared demonstration clock", "Individual clock-face manipulatives", "Daily timetable display"],
        "example_activity": "Order the picture cards: 'First breakfast, then school, then lunch, then play.' Set the clock to show 3 o'clock: short hand on 3, long hand on 12. Check: 'Is this what the classroom clock looks like at home time?'",
        "transition_cue": "Child sequences daily events in the correct order using 'before', 'after', 'first', 'next', and sets a clock manipulative to any o'clock time by placing the short hand on the correct number and the long hand on 12."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children read o'clock and half past times from drawn clock faces and draw hands on blank clock faces to show given times. Pictures of daily routines are labelled with clock times. Time vocabulary worksheets reinforce sequencing language.",
        "resources": ["Clock face worksheets", "Draw-the-hands clock templates", "Illustrated daily routine with clock times"],
        "example_activity": "Read the time on this clock face (drawn): the short hand is between 7 and 8, the long hand is on 6. 'It is half past 7.' Now draw the hands on a blank clock to show half past 4.",
        "transition_cue": "Child reads drawn clock faces showing o'clock and half past times correctly, and draws both hands in approximately the right positions for given times (hour hand between numbers for half past)."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children tell the time to the hour and half past using everyday language, without a physical or drawn clock in front of them. They use time vocabulary (morning, afternoon, evening, yesterday, today, tomorrow, days of the week, months) fluently in spoken descriptions.",
        "resources": ["Days of the week and months of the year reference"],
        "example_activity": "'What time do you wake up?' 'About 7 o'clock in the morning.' 'What time do you eat lunch?' 'Half past 12 in the afternoon.' Name the days of the week in order. What day was yesterday?",
        "transition_cue": "Child describes events using 'o'clock' and 'half past' times unprompted, sequences days of the week correctly, and uses 'morning', 'afternoon', 'evening', 'yesterday', 'tomorrow' in context."
      }
    ]
  },
  {
    "concept_id": "MA-Y1-C020",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children sort real UK coins by denomination, handling them to learn the size, colour, shape and weight differences between coins. Coin-rubbing activities create a permanent record. They name each coin and state its value.",
        "resources": ["Real UK coins (1p, 2p, 5p, 10p, 20p, 50p, £1, £2)", "Paper and crayons for coin rubbing", "Sorting trays"],
        "example_activity": "Sort all the coins into piles of the same type. Name each pile: '1p coins, 2p coins, 5p coins...' Do a coin rubbing of each denomination and write the value underneath.",
        "transition_cue": "Child sorts real coins into correct denomination piles, names each coin and states its value, including distinguishing between similar coins (1p and 2p, £1 and £2)."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children match pictures of coins to their values on worksheets and illustrated price lists. They circle the correct coins needed to make a given amount and draw coins to show a total.",
        "resources": ["Coin picture cards", "Illustrated price lists", "Coin-matching worksheets"],
        "example_activity": "Look at the shop price list: apple 5p, banana 10p, orange 20p. Circle the coins you need to buy an apple. Draw the coins you would use to pay for a banana.",
        "transition_cue": "Child identifies all UK coins from pictures and matches them to their values, selecting correct coin pictures to make small amounts up to 20p."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children name any coin or note and state its value without seeing it. They find simple totals by adding known coin values mentally and recognise that the same amount can be made with different coins.",
        "resources": [],
        "example_activity": "'I have a 10p, a 5p and a 2p. How much altogether?' Child says: '17p.' 'Can you make 10p using only 2p coins? How many do you need?' Child says: '5 two-pence coins.'",
        "transition_cue": "Child states the value of any UK coin or note from its name alone, calculates simple coin totals mentally, and suggests different coin combinations for the same amount."
      }
    ]
  },
  {
    "concept_id": "MA-Y1-C021",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children handle plastic or wooden shape tiles in many orientations and sizes, naming them by touch and sight. They sort shapes into labelled hoops, build shapes from lolly sticks (triangles, rectangles), and find shapes matching a given name from a mixed collection.",
        "resources": ["2-D shape tiles (various sizes, orientations, colours)", "Lolly sticks for building shapes", "Sorting hoops", "Shape posting boxes"],
        "example_activity": "Find all the triangles from this mixed collection. Some are pointing up, some sideways, some are tall and thin, some are wide and flat. They are all triangles because they have 3 straight sides and 3 corners.",
        "transition_cue": "Child picks out named shapes from a mixed collection including non-prototypical examples (e.g. triangles that do not point upwards, very thin rectangles) and names them correctly."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children identify and circle named shapes in pictures, colour shapes according to instructions, and complete shape-hunt worksheets where they find examples of each shape in drawings of scenes (houses, gardens, vehicles).",
        "resources": ["Shape-hunt picture worksheets", "Colouring-by-shape worksheets", "Shape pattern worksheets"],
        "example_activity": "Look at this picture of a house. Find and circle all the rectangles (windows, door, walls). Find and circle all the triangles (roof). How many circles can you find? (wheels, clock face).",
        "transition_cue": "Child identifies all instances of named shapes in complex pictures, including shapes in non-standard orientations, and does not confuse shapes with similar appearances."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children name shapes from verbal descriptions of their properties rather than from sight, and explain why a shape is or is not a given type by referring to its sides and corners.",
        "resources": [],
        "example_activity": "'I am thinking of a shape. It has 4 straight sides and 4 corners. Two sides are long and two are short. What is it?' 'A rectangle!' 'Is a square a rectangle?' 'Yes, because it has 4 sides and 4 corners too — all the sides are the same length.'",
        "transition_cue": "Child names shapes from property descriptions alone and explains their reasoning: 'It is a triangle because it has 3 straight sides and 3 corners, even though it looks different from the usual triangle.'"
      }
    ]
  },
  {
    "concept_id": "MA-Y1-C022",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children handle solid 3-D shapes, feeling faces, edges and corners with their fingers. They sort shapes by whether they roll, stack or slide. They match 3-D shapes to everyday objects: a dice is a cube, a cereal box is a cuboid, a football is a sphere.",
        "resources": ["Solid 3-D shapes (cube, cuboid, sphere, pyramid, cylinder, cone)", "Everyday objects for matching (dice, boxes, balls, tins)", "Sorting trays for roll/stack/slide"],
        "example_activity": "Sort the shapes: which ones roll? (sphere, cylinder, cone) Which ones stack? (cube, cuboid) Which ones slide on a flat surface? (cube, cuboid, pyramid). A sphere rolls in every direction because it is curved all over.",
        "transition_cue": "Child names cubes, cuboids, spheres, pyramids and cylinders on sight, matches them to everyday objects, and sorts them by physical properties (rolling, stacking, sliding)."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children identify 3-D shapes in pictures of everyday objects, label photographs of shapes with their mathematical names, and draw around faces of 3-D shapes to connect 3-D shapes to their 2-D faces.",
        "resources": ["Photographs of everyday objects labelled with 3-D names", "3-D shape matching worksheets", "Paper and 3-D shapes for face tracing"],
        "example_activity": "Press each face of a cuboid onto paper and trace around it. What shapes do you get? 'Rectangles! All the faces of a cuboid are rectangles.' Repeat with a pyramid: 'The bottom is a square and the sides are triangles.'",
        "transition_cue": "Child identifies 3-D shapes from photographs and drawings, names their faces by tracing, and begins to describe shapes using informal properties like 'all flat faces' or 'one curved surface'."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children name 3-D shapes from verbal descriptions and describe them using words like 'faces', 'curved', 'flat', 'roll', 'stack' without handling them. They explain the difference between 2-D and 3-D shapes.",
        "resources": [],
        "example_activity": "'Describe a cylinder without showing it.' 'A cylinder has 2 flat circular faces at each end and a curved surface around the middle. It can roll on the curved surface but stack on the flat faces.'",
        "transition_cue": "Child describes 3-D shapes using property words (faces, curved, flat) without handling them, and distinguishes between 2-D shapes (flat) and 3-D shapes (solid, with depth)."
      }
    ]
  },
  {
    "concept_id": "MA-Y1-C023",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children follow and give positional instructions using real objects and physical movement. They navigate obstacle courses, place toys in described positions ('put the teddy behind the box'), and use programmable floor robots (Beebots) to practise directional language.",
        "resources": ["Programmable floor robots (Beebots)", "Obstacle course equipment", "Toys and boxes for positional placement", "Direction instruction cards"],
        "example_activity": "Place the teddy on top of the cupboard. Put the ball between the two chairs. Walk forwards 3 steps, turn left, walk forwards 2 steps. Where are you?",
        "transition_cue": "Child follows multi-step positional instructions using 'above', 'below', 'between', 'in front of', 'behind', 'left', 'right', 'forwards', 'backwards' without confusion, and gives instructions for a partner to follow."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children describe positions and routes on simple picture maps and grid-based treasure hunts. They draw arrows showing routes and label positions using the full positional vocabulary.",
        "resources": ["Simple picture maps", "Grid-based treasure hunt sheets", "Arrow stickers for route marking"],
        "example_activity": "On this picture map, draw the route from the house to the park: 'Go forwards past the shop, turn right at the tree, go forwards to the park.' Label the positions: 'The shop is between the house and the tree.'",
        "transition_cue": "Child describes positions and routes on picture maps using the full range of positional vocabulary, and draws routes that match their verbal descriptions."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children give and follow verbal directions using positional language without any visual prompts. They describe relative positions in everyday contexts and explain routes to familiar places.",
        "resources": [],
        "example_activity": "Give directions from the classroom to the hall without looking at a map. 'Go out of the door, turn left, walk forwards past the library, turn right, and the hall is in front of you.'",
        "transition_cue": "Child gives clear multi-step directions using 'left', 'right', 'forwards', 'backwards', 'between', 'above', 'below' to navigate someone to a destination, without visual prompts or gestures."
      }
    ]
  },
  {
    "concept_id": "MA-Y1-C024",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children physically make whole and half turns by standing up and turning their bodies. A compass arrow on a card or a turntable with a pointer shows the direction and amount of turn. They notice that a whole turn returns them to their starting direction and a half turn faces them the opposite way.",
        "resources": ["Space for physical turning", "Card arrows on a pivot", "Turntable with a pointer", "Directional compass mat"],
        "example_activity": "Face the door. Make a whole turn — you face the door again. Make a half turn — you face the opposite wall. Teacher calls 'Whole turn!' or 'Half turn!' and children turn accordingly.",
        "transition_cue": "Child makes accurate whole and half turns on command, consistently returning to their starting direction after a whole turn and facing the opposite direction after a half turn."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children draw arrows on paper showing quarter, half, three-quarter and whole turns. They mark the start and end directions on clock face diagrams, connecting clockwise turns to clock hand movement. Turn cards show the amount and direction of each turn.",
        "resources": ["Turn arrow drawing templates", "Clock face diagrams for showing turns", "Turn cards (quarter/half/three-quarter, clockwise/anticlockwise)"],
        "example_activity": "Draw an arrow pointing up (North). Draw a quarter turn clockwise — the arrow now points right (East). Draw another quarter turn — the arrow now points down (South). Two quarter turns make a half turn.",
        "transition_cue": "Child draws accurate turn diagrams showing the correct end direction for quarter, half and three-quarter turns in both clockwise and anticlockwise directions."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children describe turns precisely using spoken language: 'a quarter turn clockwise', 'a three-quarter turn anticlockwise'. They connect the fraction vocabulary to fractions (quarter, half, three-quarter) and explain that a quarter turn clockwise reaches the same position as a three-quarter turn anticlockwise.",
        "resources": [],
        "example_activity": "I face the window. I make a quarter turn clockwise. Which way do I face? 'The door.' What other turn ends in the same position? 'A three-quarter turn anticlockwise.'",
        "transition_cue": "Child describes any turn using precise fraction and direction language without physical movement, and explains equivalent turns (e.g. quarter clockwise = three-quarter anticlockwise) unprompted."
      }
    ]
  }
]