[
  {
    "concept_id": "MA-Y4-C001",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Using Dienes blocks (thousands cube, hundreds flat, tens rod, ones cube) on a four-column place value mat to build, partition and exchange four-digit numbers",
        "resources": ["Dienes blocks (thousands cubes)", "place value mat (Th, H, T, O)", "arrow cards (1000s, 100s, 10s, 1s)", "place value counters"],
        "example_activity": "Build 3,472 on the place value mat: 3 thousands cubes, 4 hundreds flats, 7 tens rods, 2 ones cubes. What is the 4 worth? 400. Now partition 3,472 differently: 2,000 + 1,472. Show both partitions with blocks. Use arrow cards: overlap 3000, 400, 70, 2 to make 3472.",
        "transition_cue": "Child identifies the value of each digit in any four-digit number and partitions flexibly without needing blocks or cards"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Drawing place value charts and using number lines to 10,000 to represent, compare and order four-digit numbers",
        "resources": ["place value chart (Th, H, T, O)", "number line (0-10,000)", "squared paper"],
        "example_activity": "Write 4,506 in a place value chart. What is the value of the 0? (0 tens = no tens). Mark 4,506 on a number line. Compare 4,506 and 4,560 using the chart: the tens digit differs. Order five four-digit numbers from smallest to largest.",
        "transition_cue": "Child reads, writes, compares and orders any four-digit number without a chart, explaining place value reasoning verbally"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Working with four-digit numbers mentally: identifying digit values, partitioning flexibly, comparing and ordering, and solving problems involving place value",
        "resources": [],
        "example_activity": "What is the value of the 7 in 7,203? Partition 5,814 into thousands and the rest. Which is bigger: 3,099 or 3,109? How do you know? A number has 4 thousands, 0 hundreds, 6 tens and 3 ones — what is the number?",
        "transition_cue": "Child answers any four-digit place value question within 3 seconds and uses place value reasoning to justify comparisons"
      }
    ]
  },
  {
    "concept_id": "MA-Y4-C002",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Using bead strings, Cuisenaire rods and hundred squares to count in multiples of 6, 7, 9, 25 and 1000, marking each multiple physically",
        "resources": ["100-bead string", "Cuisenaire rods", "hundred square", "number line (0-1000 for 25s; 0-10000 for 1000s)"],
        "example_activity": "Count in 6s on a hundred square: colour 6, 12, 18, 24... What pattern do you see? Count in 25s using Cuisenaire rods: each rod = 25. Stack 4 rods: 100. Stack 8: 200. Count in 1000s on a number line: 1000, 2000, 3000... 10000.",
        "transition_cue": "Child counts in all five multiples fluently from any starting point without highlighting or stacking"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Recording multiples as sequences on number lines, circling patterns on number grids, and connecting skip-counting patterns to multiplication tables",
        "resources": ["number line templates", "hundred square", "multiplication grid"],
        "example_activity": "Write the first 12 multiples of 7. Highlight them on a hundred square — describe the zigzag pattern. On a number line, mark multiples of 25 from 0 to 300. Connect: counting in 9s gives the 9 times table. What is the 8th multiple of 9?",
        "transition_cue": "Child generates any sequence of multiples from memory, identifies the nth multiple, and connects skip-counting directly to multiplication facts"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Counting in multiples mentally from any starting point in both directions, and using the sequences to derive multiplication and division facts",
        "resources": [],
        "example_activity": "Count in 7s from 28 to 84. Count back in 9s from 108. What is the 7th multiple of 6? Is 52 a multiple of 7? Start at 4,500 and count on in 1000s. What is 375 ÷ 25?",
        "transition_cue": "Child counts in all multiples fluently forwards and backwards from any starting point and connects sequences to times table facts instantly"
      }
    ]
  },
  {
    "concept_id": "MA-Y4-C003",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Using a vertical number line (thermometer model), a horizontal floor number line extending below zero, and temperature displays to count through zero and locate negative numbers",
        "resources": ["vertical number line (thermometer, -10 to 30)", "floor number line (-10 to 10)", "temperature cards", "integer counters (red for negative, blue for positive)"],
        "example_activity": "Read the thermometer: it shows -3°C. Walk along the floor number line from 2, counting back: 1, 0, -1, -2, -3. Which is colder: -3°C or -7°C? Stand at each position — -7 is further from zero (colder). Use temperature cards to order: -5, -2, 0, 3, 7.",
        "transition_cue": "Child counts through zero in both directions and compares negative numbers correctly, explaining that -7 is less than -3 because it is further below zero"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Drawing vertical and horizontal number lines that extend below zero, marking and comparing negative numbers, and calculating intervals across zero",
        "resources": ["number line template (-20 to 20)", "thermometer diagrams", "comparison recording frame"],
        "example_activity": "Draw a number line from -10 to 10. Mark -4 and 3. How many steps from -4 to 3? Count: -4 to 0 is 4, 0 to 3 is 3, total 7. The temperature drops from 5°C to -3°C. Draw this on a thermometer. How many degrees did it fall?",
        "transition_cue": "Child calculates intervals crossing zero on paper and compares negative numbers without needing to count on the number line"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Working with negative numbers mentally: comparing, ordering, and calculating temperature changes and intervals across zero",
        "resources": [],
        "example_activity": "Order: -8, 3, -1, 0, -5, 7 from smallest to largest. The temperature is -4°C and rises by 9 degrees. What is the new temperature? What is the difference between -6°C and 4°C?",
        "transition_cue": "Child compares and orders negative numbers instantly and calculates intervals across zero mentally without drawing a number line"
      }
    ]
  },
  {
    "concept_id": "MA-Y4-C004",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Using number lines marked in 10s, 100s and 1000s to physically locate numbers between two bounding multiples, determining which multiple is nearer",
        "resources": ["number line (marked in 10s to 100)", "number line (marked in 100s to 1000)", "number line (marked in 1000s to 10000)", "place value arrow cards"],
        "example_activity": "Place 347 on a number line between 340 and 350. Is it closer to 340 or 350? Closer to 350, so 347 rounds to 350. Now between 300 and 400: closer to 300. So 347 rounds to 300 (nearest 100). Between 0 and 1000: closer to 0, so rounds to 0.",
        "transition_cue": "Child identifies the two bounding multiples and chooses the nearer one without the number line, including the convention that 5 rounds up"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Drawing number lines to show the rounding process, marking the midpoint and the decision, and recording rounding in a structured format",
        "resources": ["number line template", "rounding recording frame", "squared paper"],
        "example_activity": "Draw a number line from 3,000 to 4,000 in steps of 100. Mark 3,472. The midpoint between 3,400 and 3,500 is 3,450. Since 3,472 > 3,450, round up to 3,500. Record: 3,472 ≈ 3,500 (nearest 100). Now round 3,472 to nearest 10 and nearest 1,000.",
        "transition_cue": "Child rounds any number to the nearest 10, 100 or 1000 by identifying the key digit, without needing to draw a number line"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Rounding any number to the nearest 10, 100 or 1000 using the digit-checking rule, and applying rounding to estimate calculations",
        "resources": [],
        "example_activity": "Round 6,849 to the nearest 10, 100 and 1000. Estimate 3,472 + 2,849 by rounding both to the nearest 1000. A school has 487 pupils. To the nearest hundred, how many pupils? Is the actual number more or less than the rounded number?",
        "transition_cue": "Child rounds any four-digit number to any degree of accuracy within 3 seconds and routinely uses rounding to check calculations"
      }
    ]
  },
  {
    "concept_id": "MA-Y4-C005",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Using Roman numeral cards, building numbers with individual letter tiles, and converting between Roman and Hindu-Arabic numerals using a reference chart and matching activities",
        "resources": ["Roman numeral letter tiles (I, V, X, L, C)", "Hindu-Arabic number cards (1-100)", "reference chart", "matching game cards"],
        "example_activity": "Build the number 47 in Roman numerals: XL (40) + VII (7) = XLVII. Match cards: pair XXIV with 24, LXIII with 63, XC with 90. Build the year 2024: MMXXIV. What is the difference between IV (4) and VI (6)?",
        "transition_cue": "Child builds and reads Roman numerals to 100, applying both additive and subtractive rules without the reference chart"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Writing Roman numeral conversion tables, drawing comparison charts showing the Roman system alongside our place value system, and recording conversions on paper",
        "resources": ["conversion table template", "comparison chart (Roman vs place value)", "squared paper"],
        "example_activity": "Complete a conversion table: write 1-10, 20, 30, 40, 50, 60, 70, 80, 90, 100 in Roman numerals. Draw a comparison chart: our system uses place value (position matters); Roman uses additive/subtractive (symbols combine). Convert: 78 = LXXVIII. Convert XCIV = 94.",
        "transition_cue": "Child converts any number 1-100 to and from Roman numerals on paper without a reference table"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Converting between Roman and Hindu-Arabic numerals mentally, explaining why the Roman system differs from our place value system, and reading Roman numerals in real-world contexts",
        "resources": [],
        "example_activity": "What is LXXXVII? What is 99 in Roman numerals? Why can't the Romans write zero? A building says MCMXLV — what year was it built? Explain why our system is more efficient for arithmetic.",
        "transition_cue": "Child converts any number to 100 (and common larger numbers) mentally and articulates the key difference: 'Our system uses position; Roman uses letter values'"
      }
    ]
  },
  {
    "concept_id": "MA-Y4-C006",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Using Dienes blocks on a four-column place value mat to model addition and subtraction of four-digit numbers, physically exchanging between columns",
        "resources": ["Dienes blocks (thousands, hundreds, tens, ones)", "place value mat (Th, H, T, O)", "place value counters"],
        "example_activity": "Add 2,547 + 1,386. Build both with Dienes blocks. Combine ones: 7+6=13, exchange 10 ones for 1 ten. Combine tens: 4+8+1=13 tens, exchange 10 tens for 1 hundred. Continue. For 3,204 − 1,567: exchange a hundred for 10 tens, then a ten for 10 ones to subtract.",
        "transition_cue": "Child explains each exchange verbally while performing columnar addition/subtraction on paper, no longer needing the blocks"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Recording columnar addition and subtraction using the expanded method alongside the compact method, drawing place value counters to show exchanges",
        "resources": ["squared paper", "place value counter diagrams", "column method template"],
        "example_activity": "Draw place value counters for 4,523 + 2,689. Circle groups of 10 to show each exchange. Write the compact column method alongside. For subtraction: draw counters for 5,002 − 2,347, showing the cascading exchange from 5,000 through each column.",
        "transition_cue": "Child sets up and completes four-digit columnar calculations independently on paper, handling cascading exchanges through zeros"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Performing four-digit columnar addition and subtraction fluently, checking with estimation and inverse operations",
        "resources": ["squared paper"],
        "example_activity": "Calculate 3,847 + 2,695. Estimate first: 3,800 + 2,700 ≈ 6,500. Calculate: 6,542. Check: 6,542 − 2,695 = 3,847 ✓. Now try 6,003 − 2,458 (cascading exchanges through zeros).",
        "transition_cue": "Child completes any four-digit addition or subtraction with all exchange types, routinely estimating before and checking after"
      }
    ]
  },
  {
    "concept_id": "MA-Y4-C007",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Using arrays built from counters, Cuisenaire rods for skip-counting, and multiplication grid cards to practise all times tables to 12 × 12 with physical manipulation",
        "resources": ["counters for arrays", "Cuisenaire rods", "multiplication grid (blank and partially completed)", "times table flash cards"],
        "example_activity": "Build a 7 × 8 array with counters: count all 56. Use Cuisenaire rods to skip-count in 9s: 9, 18, 27... 108. Complete the empty cells in a multiplication grid using counters to check. Use commutativity: 6 × 7 = 7 × 6, so you only need to learn one.",
        "transition_cue": "Child recalls all multiplication facts to 12 × 12 and corresponding division facts without building arrays or using the grid"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Completing multiplication grids on paper, drawing arrays to verify tricky facts, and using pattern-spotting (digit sums for 9s, patterns for 11s) to consolidate recall",
        "resources": ["multiplication grid (blank)", "squared paper for arrays", "pattern-spotting worksheets"],
        "example_activity": "Complete the 12 × 12 grid from memory. Check the hardest facts by drawing arrays on squared paper: 7 × 8 = 56, 6 × 9 = 54. Spot patterns: 9 times table digit sums always = 9 (e.g. 63: 6+3=9). 11 times table to 9: 11, 22, 33... Record the division fact for each.",
        "transition_cue": "Child completes the full 12 × 12 grid from memory within 5 minutes and states division facts without the grid"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Instant recall of all multiplication and division facts to 12 × 12, using known facts to derive related facts mentally",
        "resources": [],
        "example_activity": "Rapid-fire: 7 × 9? 84 ÷ 12? 11 × 6? 72 ÷ 8? If 12 × 7 = 84, what is 120 × 7? What is 8.4 ÷ 12? What are all the factor pairs of 72?",
        "transition_cue": "Child answers any times table fact within 2 seconds and derives related facts (×10, ×100, with decimals) without hesitation"
      }
    ]
  },
  {
    "concept_id": "MA-Y4-C008",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Using Dienes blocks to model multi-digit × single-digit multiplication, physically partitioning the multi-digit number and combining partial products with exchanges",
        "resources": ["Dienes blocks (hundreds, tens, ones)", "place value mat", "place value counters"],
        "example_activity": "Calculate 247 × 3. Build 247 three times: 3 groups of 2 hundreds, 4 tens, 7 ones. Combine ones: 21. Exchange 20 for 2 tens. Combine tens: 12 + 2 = 14. Exchange 10 tens for 1 hundred. Combine hundreds: 6 + 1 = 7. Total: 741.",
        "transition_cue": "Child explains the partition and exchange process verbally and begins recording the compact method on paper alongside the blocks"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Using the grid method to partition and multiply, showing partial products visually, then connecting to the compact short multiplication layout",
        "resources": ["grid method template", "squared paper", "column method template"],
        "example_activity": "Grid method for 247 × 3: split into 200, 40, 7. Calculate: 200×3=600, 40×3=120, 7×3=21. Total: 600+120+21=741. Now write the compact method: 7×3=21 (write 1, carry 2), 4×3=12+2=14 (write 4, carry 1), 2×3=6+1=7. Same answer: 741.",
        "transition_cue": "Child completes short multiplication using the compact method, explaining each carry, without needing the grid method alongside"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Performing short multiplication of 2- and 3-digit numbers by 1-digit numbers fluently using the compact method, with estimation to check",
        "resources": ["squared paper"],
        "example_activity": "Calculate 368 × 7. Estimate: 370 × 7 ≈ 2,590. Calculate: 2,576. Now try 509 × 6 (zero placeholder). Check: is the answer close to the estimate?",
        "transition_cue": "Child sets up and completes any short multiplication independently with correct carrying, estimating before calculating"
      }
    ]
  },
  {
    "concept_id": "MA-Y4-C009",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Finding factor pairs by building rectangular arrays from counters: for a given number of counters, how many different rectangles can you make?",
        "resources": ["counters", "squared paper for arrays", "factor pair recording cards"],
        "example_activity": "Take 24 counters. Arrange them in a rectangle: 1 × 24, 2 × 12, 3 × 8, 4 × 6. These are the factor pairs of 24. Rotate each array: 4 × 6 = 6 × 4 — that is commutativity. Now find all factor pairs of 36 using counters.",
        "transition_cue": "Child lists factor pairs systematically from 1 upward and explains that a × b = b × a means each pair gives two multiplication facts"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Recording factor pairs in systematic lists and factor trees, drawing arrays on squared paper to verify, and showing how reordering factors simplifies calculations",
        "resources": ["squared paper", "factor pair recording frame", "multiplication grid"],
        "example_activity": "List all factor pairs of 48: 1×48, 2×24, 3×16, 4×12, 6×8. Use the multiplication grid to check. Show how commutativity helps: 4 × 13 × 5 = (4 × 5) × 13 = 20 × 13 = 260. Draw the reordering as array diagrams.",
        "transition_cue": "Child finds all factor pairs of any number to 100 systematically and uses commutativity to simplify multi-factor calculations on paper"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Identifying factor pairs mentally, applying commutativity and associativity to simplify mental calculations, and explaining why these strategies work",
        "resources": [],
        "example_activity": "List all factor pairs of 60. Calculate 25 × 7 × 4 mentally (reorder to 25 × 4 × 7 = 100 × 7 = 700). Is 7 a factor of 56? How do you know? What are all the factors of 100?",
        "transition_cue": "Child identifies factor pairs mentally, spontaneously reorders calculations for efficiency, and explains the commutative and associative laws"
      }
    ]
  },
  {
    "concept_id": "MA-Y4-C010",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Using a 10×10 hundredths grid (each small square = 0.01), place value counters labelled 0.01 and 0.1, and money (1p = £0.01) to explore hundredths physically",
        "resources": ["10×10 hundredths grid", "place value counters (0.01, 0.1, 1)", "1p and 10p coins", "place value mat (O, tenths, hundredths)"],
        "example_activity": "Shade 47 squares on a hundredths grid: that is 47/100 = 0.47. How many tenths is that? 4 whole columns (4 tenths) + 7 extra squares (7 hundredths). Use coins: 47p = £0.47 = 4 tenths of a pound and 7 hundredths. Count in hundredths on the grid: 0.01, 0.02... 0.10 (1 tenth).",
        "transition_cue": "Child explains that 10 hundredths = 1 tenth and identifies the value of each digit in a two-decimal-place number without the grid"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Drawing hundredths grids, using place value charts with decimal columns, and placing decimals on number lines marked in hundredths",
        "resources": ["hundredths grid template", "place value chart (O, .t, .h)", "number line (0-1 in hundredths)", "squared paper"],
        "example_activity": "Write 0.63 in a place value chart: 0 ones, 6 tenths, 3 hundredths. Place 0.63 on a number line between 0.6 and 0.7. Shade a hundredths grid: which is more, 0.63 or 0.7? (0.7 = 70/100 > 63/100.) Connect: 1/100 = 0.01, 1/10 = 0.10 = 10/100.",
        "transition_cue": "Child reads and writes any two-decimal-place number, places it on a number line, and converts between fraction and decimal notation without the grid"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Working with hundredths mentally: counting in hundredths, identifying digit values, comparing decimals, and converting between fractions and decimals",
        "resources": [],
        "example_activity": "What is the value of the 8 in 3.85? Count in hundredths from 0.97 to 1.03. Which is greater: 0.7 or 0.65? Explain. Convert 34/100 to a decimal. What is 0.09 as a fraction?",
        "transition_cue": "Child works with hundredths fluently, never confusing 0.7 and 0.07, and converts between fraction and decimal forms instantly"
      }
    ]
  },
  {
    "concept_id": "MA-Y4-C011",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Using fraction walls, fraction strips and fraction circles to find equivalent fractions by overlaying and comparing, generating families of equivalent fractions physically",
        "resources": ["fraction wall", "fraction strips (halves through twelfths)", "fraction circles"],
        "example_activity": "Overlay fraction strips: place two 1/6 strips on one 1/3 strip — they match exactly. So 2/6 = 1/3. Find all fractions on the fraction wall equivalent to 1/2: 2/4, 3/6, 4/8, 5/10, 6/12. Use fraction circles to show 3/4 = 6/8: three quarter-pieces = six eighth-pieces.",
        "transition_cue": "Child generates equivalent fractions by multiplying numerator and denominator by the same number, verifying with strips only to confirm"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Drawing fraction bars to show equivalence, recording the multiplicative relationship in a table, and using equivalence to compare fractions with different denominators",
        "resources": ["fraction bar template", "equivalence table template", "squared paper"],
        "example_activity": "Draw a bar split into 3 with 2 shaded (2/3). Draw another split into 9 with 6 shaded (6/9). Are they equal? Yes: 2/3 = 6/9 (×3). Record families: 1/4, 2/8, 3/12, 4/16. Use equivalence to compare 2/3 and 3/4: convert both to twelfths (8/12 vs 9/12). Which is bigger?",
        "transition_cue": "Child generates equivalent fractions and uses them to compare fractions with different denominators, recording on paper without fraction strips"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Generating equivalent fractions mentally, simplifying fractions by dividing, and using equivalence to compare and order fractions",
        "resources": [],
        "example_activity": "Write three fractions equivalent to 3/5. Simplify 8/12 to its lowest terms. Which is greater: 5/6 or 7/9? (Convert to common denominator: 15/18 vs 14/18.) Order: 1/2, 2/3, 3/4 from smallest to largest.",
        "transition_cue": "Child generates, simplifies and uses equivalent fractions fluently to compare any two fractions, selecting the most efficient common denominator"
      }
    ]
  },
  {
    "concept_id": "MA-Y4-C012",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Using money (£1 = 100p) and hundredths grids to discover key fraction-decimal equivalences: half = 50p = 0.50, quarter = 25p = 0.25, three-quarters = 75p = 0.75",
        "resources": ["coins (1p, 10p, 50p, £1)", "hundredths grid", "fraction circles (halves, quarters)", "place value counters"],
        "example_activity": "Half of £1 = 50p = £0.50. Shade half the hundredths grid: 50 squares = 50/100 = 0.50. Quarter of £1 = 25p = £0.25. Shade 25 squares. Three-quarters: shade 75 squares = £0.75. Shade 10 squares: that is 1/10 = 0.10. Shade 1 square: 1/100 = 0.01.",
        "transition_cue": "Child states the decimal equivalents of 1/2, 1/4, 3/4, 1/10 and 1/100 from memory without money or grids"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Drawing hundredths grids and number lines to show fraction-decimal equivalences, recording conversions in a reference table",
        "resources": ["hundredths grid template", "number line (0-1 marked in tenths/hundredths)", "conversion table template"],
        "example_activity": "Draw a number line from 0 to 1. Mark 0.25 (= 1/4), 0.5 (= 1/2), 0.75 (= 3/4). Mark all tenths: 0.1 = 1/10, 0.2 = 2/10... Convert: what decimal is 7/10? (0.7.) What fraction is 0.25? (1/4 or 25/100.) Complete the table of all tenth-decimal equivalences.",
        "transition_cue": "Child converts between fraction and decimal notation for all tenths and the key quarter fractions without reference materials"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Converting instantly between common fractions and their decimal equivalents, and applying these in measurement and money contexts",
        "resources": [],
        "example_activity": "What is 3/4 as a decimal? What is 0.5 as a fraction? Convert 1/10 of a metre to cm and to a decimal of a metre. A piece of ribbon is 0.25 m long — what fraction of a metre is that? Which is more: 0.7 or 3/4?",
        "transition_cue": "Child converts between fractions and decimals instantly and applies equivalences in context without any visual aids"
      }
    ]
  },
  {
    "concept_id": "MA-Y4-C013",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Covering shapes with unit squares (1 cm² tiles), counting the squares to find area, and comparing by physically overlaying shapes on a grid",
        "resources": ["1 cm² square tiles", "squared paper (1 cm grid)", "rectilinear shape cutouts", "cm² unit labels"],
        "example_activity": "Cover a rectangle with 1 cm² tiles: a 5 cm × 3 cm rectangle needs 15 tiles, so its area is 15 cm². Cover an L-shape on squared paper: count all the squares inside the outline. Compare: which shape has more area? Does the shape with more area always have more perimeter?",
        "transition_cue": "Child counts squares reliably for any rectilinear shape and begins to see that a rectangle's area = rows × columns without counting every square"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Drawing shapes on squared paper and counting squares for area, introducing the formula for rectangles (length × width), and comparing area with perimeter on the same shapes",
        "resources": ["squared paper (1 cm grid)", "ruler", "area/perimeter comparison recording frame"],
        "example_activity": "Draw a 7 cm × 4 cm rectangle on squared paper. Count squares: 28 cm². Check: 7 × 4 = 28 ✓. Now draw an L-shape. Split it into two rectangles: 4×3=12 and 2×2=4. Total area: 16 cm². Calculate the perimeter of the same shape: are area and perimeter the same number?",
        "transition_cue": "Child uses the length × width formula for rectangles and decomposes L-shapes into rectangles for area, clearly distinguishing area from perimeter"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Calculating area of rectangles and compound rectilinear shapes from given dimensions without drawing, and reasoning about the relationship between area and perimeter",
        "resources": [],
        "example_activity": "A rectangle is 9 cm by 6 cm. What is its area? What is its perimeter? A room is 5 m by 4 m. What area of carpet is needed? An L-shape has dimensions 8×3 with a 2×2 cut-out. What is its area? Can two shapes have the same area but different perimeters?",
        "transition_cue": "Child calculates area and perimeter of any rectilinear shape from dimensions alone and explains why area and perimeter are independent measures"
      }
    ]
  },
  {
    "concept_id": "MA-Y4-C014",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Using real measuring equipment and conversion fact cards to physically convert between metric units: weighing objects in g then converting to kg, measuring lengths in cm then converting to m",
        "resources": ["kitchen scales (g/kg)", "rulers and metre sticks", "measuring jugs (ml/l)", "conversion fact cards (1 km=1000 m, 1 m=100 cm, 1 kg=1000 g, 1 l=1000 ml)"],
        "example_activity": "Weigh a bag of flour: 1,500 g. Convert: 1,500 g = 1 kg 500 g = 1.5 kg. Measure the classroom: 8 m 45 cm. Convert: 845 cm. Pour 2,300 ml of water. Convert: 2 l 300 ml = 2.3 l. Use the conversion cards to check each answer.",
        "transition_cue": "Child converts in both directions using the ×1000 or ×100 relationships without conversion cards, explaining: 'Kilo means 1000, so I multiply or divide by 1000'"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Drawing conversion number lines and tables, recording conversions on paper, and connecting decimals to metric measures",
        "resources": ["conversion number line templates", "conversion tables", "squared paper"],
        "example_activity": "Draw a number line from 0 m to 2 m, marked in tenths (0.1 m = 10 cm). Place 1.45 m: that is 145 cm. Complete a conversion table: 500 g = 0.5 kg, 250 ml = 0.25 l, 3.2 km = 3200 m. How many mm in 4.7 cm?",
        "transition_cue": "Child converts between metric units on paper, correctly using decimals, without measurement equipment or conversion aids"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Converting between metric units mentally, including decimal conversions, and solving problems involving mixed-unit calculations",
        "resources": [],
        "example_activity": "Convert 3.75 km to metres. Convert 4,280 g to kg. A recipe needs 1.2 l of milk but the jug measures in ml — how many ml? Add 2.4 km and 750 m, giving your answer in km.",
        "transition_cue": "Child converts between any metric units mentally, correctly handling decimal conversions, and applies this fluently in measurement problems"
      }
    ]
  },
  {
    "concept_id": "MA-Y4-C015",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Using large floor grids or pegboards to plot coordinates physically, placing objects at given positions and reading positions as (x, y) pairs",
        "resources": ["floor grid (1 m squares)", "pegboard with coordinate labels", "counters/figures to place", "coordinate cards"],
        "example_activity": "Stand on the floor grid at the origin (0, 0). Move 3 squares right and 5 squares up: you are at (3, 5). Place a counter at (2, 4). Read the coordinate of the red counter: along the corridor (x = 6) then up the stairs (y = 3), so (6, 3). Plot the corners of a square.",
        "transition_cue": "Child plots and reads coordinates on a floor grid or pegboard correctly, always giving x before y and starting from the origin"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Plotting coordinates on paper grids in the first quadrant, drawing shapes by connecting plotted points, and describing translations between coordinates",
        "resources": ["coordinate grid paper (first quadrant, 0-10)", "ruler", "shape coordinate cards"],
        "example_activity": "Plot these points: (1,1), (1,5), (4,5), (4,1). Join them in order. What shape have you drawn? (Rectangle.) Plot (2,3). Translate it 4 right and 2 up: new position (6,5). What changed in the coordinate?",
        "transition_cue": "Child plots coordinates precisely on paper, names the shapes formed, and describes how translations change the x and y values"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Working with coordinates mentally: predicting positions of translated points, identifying missing vertices of shapes, and reasoning about coordinate patterns",
        "resources": [],
        "example_activity": "Three corners of a rectangle are (1,2), (1,6), (5,2). What is the fourth corner? A point at (3,4) is translated 5 right and 3 down. Where does it land? What are the coordinates of a square with one corner at (2,1) and side length 4?",
        "transition_cue": "Child predicts translated coordinates and identifies missing vertices mentally without plotting on a grid"
      }
    ]
  },
  {
    "concept_id": "MA-Y4-C016",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Sorting physical shapes (card cut-outs, 3-D models) into groups using property criteria: measuring sides with rulers, testing angles with set-squares, checking for parallel sides",
        "resources": ["shape card cut-outs (triangles and quadrilaterals set)", "rulers", "set-squares", "sorting hoops", "property label cards"],
        "example_activity": "Sort triangles: measure all sides — are any equal? (Equilateral: all 3; isosceles: 2; scalene: 0.) Test angles: does it have a right angle? Sort quadrilaterals by properties: parallel sides (parallelogram, rectangle, square, rhombus, trapezium). Use Venn diagrams: 'has a right angle' AND 'has parallel sides'.",
        "transition_cue": "Child classifies any triangle or quadrilateral by measuring and testing, naming it correctly and stating the defining properties"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Drawing shape hierarchies and property tables, classifying shapes from diagrams by marking parallel sides and angle types, using Venn and Carroll diagrams",
        "resources": ["shape diagrams", "property table template", "Venn/Carroll diagram template", "ruler", "set-square"],
        "example_activity": "Complete a property table: shape name, number of sides, parallel side pairs, right angles, equal sides. Draw a Venn diagram: circle 1 = 'has at least one pair of parallel sides', circle 2 = 'has at least one right angle'. Place: square, trapezium, rectangle, rhombus, kite, parallelogram.",
        "transition_cue": "Child classifies shapes from diagrams using properties, correctly placing them in sorting diagrams without measuring"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Classifying shapes from descriptions alone, reasoning about hierarchical relationships (e.g. every square is a rectangle), and identifying shapes from minimal property clues",
        "resources": [],
        "example_activity": "I have 4 equal sides and 4 right angles. What am I? (Square.) Is a square also a rectangle? Why? Name a quadrilateral with exactly one pair of parallel sides. Can an isosceles triangle also be right-angled? Draw one to prove it.",
        "transition_cue": "Child identifies shapes from property descriptions, explains hierarchical relationships between shape classes, and reasons about possible/impossible property combinations"
      }
    ]
  },
  {
    "concept_id": "MA-Y4-C017",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Using mirrors (Mira mirrors) and folding paper shapes to find lines of symmetry, and completing symmetric figures by folding and tracing",
        "resources": ["Mira mirrors", "paper shapes for folding", "symmetry shape cards", "tracing paper"],
        "example_activity": "Fold a paper square: how many different ways can you fold it so both halves match exactly? (4 lines of symmetry.) Use a mirror on a half-butterfly picture: does the mirror show the complete butterfly? That mirror line is a line of symmetry. Fold a paper circle — does it always have symmetry?",
        "transition_cue": "Child identifies all lines of symmetry in regular shapes by folding and uses a mirror to verify, including non-vertical lines of symmetry"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Drawing lines of symmetry on shape diagrams, completing half-shapes on squared paper by reflecting across a given line, and counting lines of symmetry for different shapes",
        "resources": ["squared paper", "dotted paper", "shape diagrams", "mirror (for checking)"],
        "example_activity": "Draw all lines of symmetry on an equilateral triangle (3), a rectangle (2), a regular hexagon (6). On squared paper, a half-shape is drawn on the left of a vertical line. Complete the other half by reflecting each point. Try with a diagonal line of symmetry.",
        "transition_cue": "Child draws all lines of symmetry for any regular polygon and completes reflected shapes accurately on paper without a mirror"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Predicting the number of lines of symmetry from shape properties, completing symmetric figures mentally, and reasoning about symmetry in unfamiliar shapes",
        "resources": [],
        "example_activity": "How many lines of symmetry does a regular pentagon have? An isosceles triangle? A parallelogram (that is not a rectangle)? If a shape has exactly 2 lines of symmetry and 4 sides, what could it be? A point is at (2, 3). Where is its reflection in the line x = 5?",
        "transition_cue": "Child predicts symmetry properties from shape names and reasons about reflections without drawing"
      }
    ]
  },
  {
    "concept_id": "MA-Y4-C018",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Collecting real continuous data (e.g. temperature readings every hour using a thermometer) and plotting physical data points on a large wall chart, connecting them with string",
        "resources": ["thermometer", "large wall chart with axes", "sticky dots for data points", "string for connecting", "data recording sheet"],
        "example_activity": "Record the outdoor temperature every hour from 9 a.m. to 3 p.m. Stick a dot on the wall chart for each reading. Connect the dots with string. What happens to temperature during the day? Can you read the temperature at 10:30 a.m. (between two readings)?",
        "transition_cue": "Child plots data points, connects them to show a trend, and reads values between plotted points by interpolating"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Drawing time graphs on paper with correctly labelled axes, plotting data points and drawing a continuous line, and answering questions by reading the graph",
        "resources": ["graph paper", "ruler", "data tables", "graph template with axes"],
        "example_activity": "Plot the data: 9am=12°C, 10am=14°C, 11am=17°C, 12pm=19°C, 1pm=20°C, 2pm=18°C, 3pm=16°C. Join the points with a line. When was it warmest? What was the temperature at 11:30am? How much did the temperature rise between 9am and 1pm?",
        "transition_cue": "Child draws time graphs with correct scales and labels, reads values between plotted points, and describes trends (rising, falling, steady)"
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Interpreting time graphs from descriptions or partial information, predicting trends, and choosing between bar charts (discrete) and line graphs (continuous) for different data",
        "resources": [],
        "example_activity": "A graph shows temperature rising steadily from 10°C at 8am to 22°C at 2pm, then falling. Estimate the temperature at 11am. When might it reach 10°C again? Would you use a bar chart or line graph for: (a) favourite colours, (b) plant height each day, (c) rainfall each month?",
        "transition_cue": "Child interprets time graphs from verbal descriptions, predicts trends, and consistently selects the correct chart type for discrete vs continuous data"
      }
    ]
  }
]
