[
  {
    "concept_id": "MA-Y2-C001",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children make physical groups of 2, 3 and 5 objects to skip count. Groups of 3 are new in Year 2 and are practised using towers of 3 cubes, triangles of counters, or sets of 3 toys. Each group is added to the line and the running total announced aloud.",
        "resources": ["Interlocking cubes for towers of 3", "Counters for grouping", "5p and 2p coins for skip counting", "Dienes ten-sticks"],
        "example_activity": "Build towers of 3 cubes each. Place them in a line. Count as each is added: 3, 6, 9, 12, 15, 18, 21, 24, 27, 30. Practise forwards, then backwards removing one tower at a time: 30, 27, 24...",
        "transition_cue": "Child builds groups of 2, 3 or 5 and announces the running total correctly as each group is added or removed, including when the count crosses a decade boundary (e.g. 18 to 21 in 3s)."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children use hundred squares with multiples of 2, 3 or 5 shaded to reveal the pattern of each sequence. Counting sticks with colour-coded groups of 3 help children visualise the step size. Number lines with drawn jumps show the skip-counting pattern.",
        "resources": ["Hundred squares with multiples of 3 shaded", "Hundred squares with multiples of 2 and 5 shaded", "Counting sticks with colour-coded groups", "Number line jump diagrams"],
        "example_activity": "Shade every 3rd number on a hundred square starting from 3. Describe the pattern you see — it makes diagonal lines. Use the shaded squares to count forwards in 3s from 0 to 36, then backwards from 36 to 0.",
        "transition_cue": "Child uses a shaded hundred square to count in 2s, 3s and 5s in both directions without error, and describes the visual pattern each sequence makes on the grid."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children recite skip-counting sequences in 2s, 3s and 5s from 0 or any given multiple, forwards and backwards, without visual support. They connect the sequences to multiplication facts: counting in 3s from 0 generates the 3 times table.",
        "resources": [],
        "example_activity": "Teacher says: 'Count in 3s from 12.' Child responds: '12, 15, 18, 21, 24...' Teacher says: 'Stop. How many 3s from 0 to 21?' Child says: '7, because 7 times 3 is 21.'",
        "transition_cue": "Child counts fluently in 2s, 3s and 5s from any given multiple in either direction, and connects each count to the corresponding multiplication fact without prompting."
      }
    ]
  },
  {
    "concept_id": "MA-Y2-C002",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children build two-digit numbers using Dienes blocks (ten-sticks and unit cubes) on a place value mat divided into Tens and Ones columns. They physically exchange 10 unit cubes for 1 ten-stick to understand the grouping principle. Straws bundled in tens with loose straws provide an alternative tactile model.",
        "resources": ["Dienes blocks (ten-sticks and unit cubes)", "Place value mats (T | O columns)", "Straws and elastic bands for bundling", "Numicon ten-plates"],
        "example_activity": "Build 34 on the place value mat: 3 ten-sticks in the Tens column, 4 unit cubes in the Ones column. 'The 3 means 3 tens, which is 30. The 4 means 4 ones.' Now build 30 — what goes in the Ones column? '0 ones — nothing.'",
        "transition_cue": "Child builds any two-digit number on a place value mat using Dienes blocks, and states the value of each digit: 'The 5 in 52 means 5 tens, which is 50. The 2 means 2 ones.'"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children use arrow cards (place value cards that overlay: 30 + 7 = 37) and drawn place value charts. They draw Dienes-style pictures (sticks and dots) to represent numbers, and partition numbers in different ways using part-whole diagrams.",
        "resources": ["Arrow cards / place value cards", "Place value chart templates", "Part-whole model templates", "Dienes-style drawing sheets"],
        "example_activity": "Draw 47 using sticks (tens) and dots (ones): 4 sticks and 7 dots. Partition 47 in two different ways using part-whole diagrams: 47 = 40 + 7, and also 47 = 30 + 17. Explain why both are correct.",
        "transition_cue": "Child draws place value representations and completes part-whole diagrams for any two-digit number, including flexible partitioning (e.g. 56 = 50 + 6 and 56 = 40 + 16) without hesitation."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children partition any two-digit number into tens and ones fluently in standard and non-standard ways, and explain the value of each digit without visual support. They use zero as a placeholder confidently and apply partitioning to support mental calculation.",
        "resources": ["Place value notation reference"],
        "example_activity": "Partition 63 in three different ways: 63 = 60 + 3, 63 = 50 + 13, 63 = 40 + 23. Explain: 'In 60, the 6 means 6 tens and the 0 is a placeholder showing no ones.'",
        "transition_cue": "Child partitions any two-digit number in multiple ways from memory, explains the value of each digit including zero as a placeholder, and applies flexible partitioning to solve subtraction problems."
      }
    ]
  },
  {
    "concept_id": "MA-Y2-C003",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children compare two quantities using towers of cubes or Dienes blocks, placing them side by side. The taller tower / more blocks represents the greater number. They describe the comparison verbally using 'greater than' and 'less than' before any symbols are introduced.",
        "resources": ["Interlocking cubes", "Dienes blocks", "Comparison mats"],
        "example_activity": "Build 34 with Dienes blocks (3 tens, 4 ones) and 28 (2 tens, 8 ones). Place them side by side. 'Which has more tens? 34 has more tens, so 34 is greater than 28.' Connect: 'We compare tens first.'",
        "transition_cue": "Child compares any two-digit numbers using Dienes blocks and explains the comparison using place value: 'I compare the tens first. If the tens are the same, I compare the ones.'"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children use number lines and hundred squares to compare numbers by position. They practise writing the < and > symbols using pictorial memory aids (the open end faces the larger number, like a hungry crocodile eating the bigger number). They order sets of numbers on a number line.",
        "resources": ["Number lines (0-100)", "Hundred squares", "< and > symbol cards", "Number ordering worksheets"],
        "example_activity": "Place 34 and 28 on a number line. 34 is further right, so 34 is greater. Write: 34 > 28. The open end of > faces 34, the bigger number. Now order 45, 54, 31, 13 from smallest to largest on the number line.",
        "transition_cue": "Child writes < and > symbols correctly between pairs of numbers, always placing the open end towards the greater number, and orders sets of three or more numbers on a number line."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children use <, > and = symbols fluently to compare any numbers to 100 without visual support. They order sets of numbers from smallest to largest or largest to smallest, and chain comparisons using symbols.",
        "resources": ["<, > and = symbol reference"],
        "example_activity": "Write the correct symbol: 67 ? 76. Child writes: 67 < 76. Order and chain: 23 < 45 < 67 < 89. 'I know 67 < 76 because both have a 6 and a 7, but in 67 the 6 is in the tens and in 76 the 7 is in the tens.'",
        "transition_cue": "Child compares any two numbers to 100 using <, > or = symbols correctly and rapidly, explaining their reasoning using place value when the numbers are close together or have reversed digits."
      }
    ]
  },
  {
    "concept_id": "MA-Y2-C004",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children use ten frames with counters and Numicon plates to practise bonds to 10 and 20 until recall is automatic. Double ten frames make bonds to 20 visible. Cubes are grouped in tens to bridge from bonds to 10/20 to derived facts to 100.",
        "resources": ["Ten frames", "Double ten frames", "Two-colour counters", "Numicon plates", "Dienes ten-sticks for deriving facts to 100"],
        "example_activity": "Place 6 counters on a ten frame. How many to make 10? '4.' Now place 6 ten-sticks on a hundred grid. How many more ten-sticks to make 100? '4.' Connect: 6 + 4 = 10, so 60 + 40 = 100.",
        "transition_cue": "Child recalls all bonds to 10 instantly without the ten frame and begins to derive bonds to 100 using Dienes blocks, stating the connection: 'If 7 + 3 = 10, then 70 + 30 = 100.'"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children use part-whole models to record fact families within 20 and derived fact families to 100. They draw ten frame diagrams from memory and use number lines to show how known facts extend to larger numbers.",
        "resources": ["Part-whole model templates", "Fact family recording sheets", "Number line diagrams showing derived facts"],
        "example_activity": "Write the full fact family for 8 + 7 = 15: 8 + 7 = 15, 7 + 8 = 15, 15 - 8 = 7, 15 - 7 = 8. Now derive: 80 + 70 = 150, 150 - 80 = 70. Draw a number line showing the jump from 80 to 150.",
        "transition_cue": "Child writes complete fact families for any bond within 20 and draws diagrams showing the derived facts to 100 or beyond, explaining the place value connection."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children recall all addition and subtraction facts to 20 instantly and derive related facts to 100 fluently using place value reasoning. They check calculations by adding in a different order (commutativity) without any visual support.",
        "resources": [],
        "example_activity": "Rapid-fire: '8 + 9?' '17.' '17 - 9?' '8.' '80 + 90?' '170.' '56 + 4?' '60 — because 6 + 4 = 10.' Check: 'Is 37 + 25 = 62? Check: 25 + 37 = 25 + 30 + 7 = 55 + 7 = 62. Yes.'",
        "transition_cue": "Child recalls any fact within 20 in under 3 seconds and derives related facts to 100 instantly, explaining the place value reasoning: 'I know 6 + 4 = 10, so 60 + 40 = 100.'"
      }
    ]
  },
  {
    "concept_id": "MA-Y2-C005",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children use Dienes blocks on a place value mat to add and subtract two-digit numbers physically. For addition, they combine tens and ones, exchanging 10 ones for 1 ten when the ones total exceeds 9. For subtraction, they exchange 1 ten for 10 ones when they cannot subtract the ones directly.",
        "resources": ["Dienes blocks (ten-sticks and unit cubes)", "Place value mats", "Numicon plates"],
        "example_activity": "Add 47 + 26 using Dienes: combine 4 tens + 2 tens = 6 tens; combine 7 ones + 6 ones = 13 ones; exchange 10 ones for 1 ten, leaving 3 ones; total = 7 tens and 3 ones = 73. Physically exchange the cubes.",
        "transition_cue": "Child adds and subtracts two-digit numbers using Dienes blocks, correctly exchanging 10 ones for 1 ten (or vice versa) when needed, and states the result with place value explanation."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children use number lines with drawn jumps to add (jump forwards) and subtract (jump backwards), partitioning the second number into tens and ones for efficient jumping. They begin to record in columns, mirroring the Dienes work with drawn tens and ones.",
        "resources": ["Number lines (0-100)", "Column recording templates", "Part-whole model templates", "Bar model diagrams"],
        "example_activity": "Add 38 + 27 on a number line: start at 38, jump +20 to 58, jump +7 to 65. Record in a column: 38 + 27, ones: 8 + 7 = 15 (write 5, carry 1 ten), tens: 3 + 2 + 1 = 6. Answer: 65.",
        "transition_cue": "Child uses a number line or column recording to add and subtract two-digit numbers, correctly partitioning and carrying/exchanging, arriving at the right answer consistently."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children add and subtract two-digit numbers using efficient mental methods (partitioning, bridging through 10, using known facts) or recorded column methods. They select the best strategy for each calculation and solve word problems independently.",
        "resources": ["Column method notation reference"],
        "example_activity": "Solve: 'There are 45 red beads and 38 blue beads. How many altogether? How many more red than blue?' Child writes: 45 + 38 = 83 (using partitioning: 40 + 30 = 70, 5 + 8 = 13, 70 + 13 = 83). 45 - 38 = 7.",
        "transition_cue": "Child adds and subtracts two-digit numbers using mental or written methods without concrete support, choosing an efficient strategy and getting the correct answer including when crossing tens boundaries."
      }
    ]
  },
  {
    "concept_id": "MA-Y2-C006",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children demonstrate commutativity by combining two groups of objects in both orders and observing the total is the same. They push 3 red cubes and 5 blue cubes together, count the total, then push 5 blue cubes and 3 red cubes together and count again. For subtraction, they show that reversing the order gives a different result.",
        "resources": ["Interlocking cubes in two colours", "Counters", "Part-whole model trays"],
        "example_activity": "Combine 4 red + 7 blue = 11. Now combine 7 blue + 4 red = 11. Same total! Now try subtraction: take 4 from 7 = 3. Take 7 from 4 — you cannot do it the same way. Subtraction is not commutative.",
        "transition_cue": "Child demonstrates with objects that swapping the order of addition gives the same total, and explains why subtraction does not work the same way: 'You can't take 7 from 4 because there aren't enough.'"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children use bar models and number lines to show that addition in both orders arrives at the same total. They draw fact families and use the commutative property to check addition by reordering. They add three numbers and show that rearranging gives the same sum.",
        "resources": ["Bar model templates", "Number lines", "Fact family recording sheets"],
        "example_activity": "Draw a bar model for 8 + 14 = 22. Now draw one for 14 + 8 = 22. Both show the same whole. Check: add 6 + 5 + 4 in two different orders. Find 6 + 4 = 10 first, then 10 + 5 = 15. Or: 5 + 6 = 11, then 11 + 4 = 15. Same answer.",
        "transition_cue": "Child draws bar models or number line diagrams to verify commutativity, and reorders three addends to find number bonds to 10 before adding the third number."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children apply commutativity and associativity strategically: they choose the most efficient addition order (putting the largest number first, pairing numbers that make 10) and check calculations by adding in a different order. They state the rule as a mathematical principle.",
        "resources": [],
        "example_activity": "Work out 3 + 8 + 7. 'I add 3 + 7 = 10 first because they make a bond to 10. Then 10 + 8 = 18.' Check 38 + 45 = 83: '45 + 38 = 45 + 30 + 8 = 75 + 8 = 83. Correct!'",
        "transition_cue": "Child spontaneously reorders addends to find efficient pairs (bonds to 10) and checks calculations by adding in a different order, explaining: 'Addition can be done in any order but subtraction cannot.'"
      }
    ]
  },
  {
    "concept_id": "MA-Y2-C007",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children use bar models (part-whole models) with physical cubes to see that the same three numbers form both an addition and two subtractions. They place cubes in the 'whole' and 'parts' sections and physically move them to generate all four related facts.",
        "resources": ["Part-whole model trays", "Interlocking cubes", "Bar model frames"],
        "example_activity": "Place 12 cubes in the 'whole' section. Move 5 to one 'part' and 7 to the other. Write: 5 + 7 = 12, 7 + 5 = 12, 12 - 5 = 7, 12 - 7 = 5. 'Addition and subtraction undo each other — they are inverses.'",
        "transition_cue": "Child generates all four facts in a fact family from a bar model with cubes and explains: 'If I know the addition, I can work out the subtraction because they are inverse operations.'"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children use drawn bar models to check calculations by using the inverse: checking subtraction by adding, and checking addition by subtracting. They solve missing number problems by drawing bar models and reasoning backwards.",
        "resources": ["Bar model drawing templates", "Inverse checking worksheets", "Missing number problem cards"],
        "example_activity": "Check: is 43 - 17 = 26? Draw a bar model: whole = 43, parts = 17 and 26. Check: 17 + 26 = 43? 17 + 26 = 43. Yes, correct! Solve: ? - 8 = 13. Draw: whole = ?, parts = 8 and 13. So ? = 8 + 13 = 21.",
        "transition_cue": "Child draws bar models to check calculations using the inverse operation and solves missing number problems by identifying the unknown part or whole, explaining their reasoning."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children use the inverse relationship fluently without drawing: checking subtraction by adding, adding to check subtraction, and solving missing number problems by working backwards. They explain why the inverse method works as a mathematical principle.",
        "resources": [],
        "example_activity": "Solve: ? - 15 = 23. Child says: '23 + 15 = 38, so the missing number is 38.' Check 56 - 29 = 27: '27 + 29 = 56. Correct.' Explain: 'Subtraction undoes addition, so I can add the parts to find the whole.'",
        "transition_cue": "Child uses the inverse to check and solve calculations mentally, explaining: 'If I subtract and get the answer, I can add the answer back to check. Addition and subtraction are inverse operations.'"
      }
    ]
  },
  {
    "concept_id": "MA-Y2-C008",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children make groups of 2, 5 and 10 using cubes or counters and count the total using skip counting. They build arrays with physical objects, connecting each row/column to a times table fact. 2p, 5p and 10p coins provide real-world concrete resources for the corresponding tables.",
        "resources": ["Interlocking cubes for arrays", "Counters for grouping", "2p, 5p and 10p coins", "Array trays"],
        "example_activity": "Make a 4 × 5 array with cubes. Count in 5s along each row: 5, 10, 15, 20. Write: 4 × 5 = 20. Now divide: 20 cubes shared into 5 rows = 4 in each row, so 20 ÷ 5 = 4.",
        "transition_cue": "Child builds arrays and states the corresponding multiplication and division facts, connecting skip counting to the times table: '4 groups of 5 is 20, so 4 × 5 = 20 and 20 ÷ 5 = 4.'"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children use drawn arrays, number lines with equal jumps, and clock face diagrams (for the 5 times table) to practise and record times table facts. Fact family triangles show the multiplication and division relationship between three numbers.",
        "resources": ["Array drawing grids", "Number lines with equal jumps", "Clock face diagrams (5-minute intervals)", "Fact family triangle cards"],
        "example_activity": "Draw a number line. Make 7 equal jumps of 2 from 0. Land on 14. Write: 7 × 2 = 14. Now connect to the clock: the 5 times table matches the minute positions — the 3 on a clock is 15 minutes (3 × 5 = 15).",
        "transition_cue": "Child draws arrays and number line jumps to represent any fact in the 2, 5 and 10 times tables, and writes both the multiplication and the related division fact from the picture."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children recall all multiplication and division facts for the 2, 5 and 10 times tables instantly without any visual support. They apply these facts in word problems and explain connections between the tables (the 10 times table is double the 5 times table).",
        "resources": ["Flash cards for rapid recall"],
        "example_activity": "Rapid-fire: '8 × 5?' '40.' '40 ÷ 5?' '8.' 'Stickers cost 10p each. I buy 7. How much?' '70p.' 'If 6 × 5 = 30, what is 6 × 10?' '60, because 10 is double 5 so I double 30.'",
        "transition_cue": "Child recalls any multiplication or division fact from the 2, 5 and 10 tables within 3 seconds, and explains connections between tables: 'The 10 table is double the 5 table.'"
      }
    ]
  },
  {
    "concept_id": "MA-Y2-C009",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children write multiplication statements from concrete arrangements of equal groups. They lay out 3 plates with 5 cubes on each and write 3 × 5 = 15. They lay out arrays and write the corresponding statements for both orientations.",
        "resources": ["Plates and cubes for equal groups", "Array trays with counters", "× and ÷ symbol cards"],
        "example_activity": "Make 4 groups of 2 counters. Write: 4 × 2 = 8. Now share 8 counters equally between 4 groups. Write: 8 ÷ 4 = 2. Show that 4 × 2 and 2 × 4 give the same answer using the same counters rearranged.",
        "transition_cue": "Child writes a correct multiplication or division statement for any physical arrangement of equal groups, using ×, ÷ and = symbols in the right order."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children write multiplication and division statements from drawn arrays and equal-group pictures. They practise writing all four facts in a fact family from a single array diagram, and begin to interpret word problems as multiplication or division.",
        "resources": ["Array diagrams", "Equal-group picture cards", "Fact family recording sheets"],
        "example_activity": "Look at the array: 5 rows of 10 dots. Write all four facts: 5 × 10 = 50, 10 × 5 = 50, 50 ÷ 10 = 5, 50 ÷ 5 = 10. Now write a division for this picture: 15 sweets shared equally between 3 children = 15 ÷ 3 = 5.",
        "transition_cue": "Child writes complete fact families from drawn arrays and translates picture-based word problems into correct multiplication or division statements."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children write multiplication and division statements from word problems without pictures or objects, selecting the correct operation. They use × and ÷ symbols confidently and interpret statements in context.",
        "resources": ["× and ÷ symbol reference"],
        "example_activity": "'There are 30 children sitting at 5 tables with the same number at each table. How many at each table?' Write: 30 ÷ 5 = 6. 'I need 8 packs of 2 pencils. How many pencils altogether?' Write: 8 × 2 = 16.",
        "transition_cue": "Child reads a word problem and writes the correct multiplication or division statement without needing to draw it first, placing the numbers and symbols in the right order."
      }
    ]
  },
  {
    "concept_id": "MA-Y2-C010",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children make a rectangular array with counters (e.g. 3 rows × 4 columns = 12), then physically rotate the array 90 degrees to see 4 rows × 3 columns = 12. The same total without recounting demonstrates commutativity. For division, they show that sharing 12 between 3 and sharing 12 between 4 give different results.",
        "resources": ["Counters for arrays", "Array frames or trays", "Turntable for rotating arrays"],
        "example_activity": "Build a 3 × 5 array. Count: 15. Turn it sideways: now it is 5 × 3. Count: still 15! Multiplication is commutative. Now try: share 15 counters between 3 people (5 each) vs share 15 between 5 people (3 each). The results are different: division is not commutative.",
        "transition_cue": "Child rotates arrays to demonstrate commutativity of multiplication and explains: 'Turning the array does not change the total.' They show with objects that sharing changes when you swap the number of groups."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children draw arrays in both orientations and write both multiplication facts. They use these drawn arrays to choose the easier order for calculation. For division, they draw sharing diagrams to show that reversing gives a different answer.",
        "resources": ["Array drawing grids", "Sharing diagram templates"],
        "example_activity": "Draw a 2 × 9 array and a 9 × 2 array. Both have 18 dots. Write: 2 × 9 = 18 and 9 × 2 = 18. Which is easier to count? The 9 × 2 (count in 2s nine times). Draw: 12 ÷ 3 = 4 (sharing diagram). Draw: 3 ÷ 12 — can you share 3 among 12? Each person gets less than 1.",
        "transition_cue": "Child draws arrays in both orientations showing the same total, and explains why division diagrams give different answers when the numbers are swapped."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children apply commutativity to choose the more efficient multiplication order, and state as a rule that multiplication can be done in any order but division cannot. They use commutativity to halve the number of facts they need to memorise.",
        "resources": [],
        "example_activity": "'Which is easier: 2 × 8 or 8 × 2? Both are 16. Explain why 15 ÷ 3 = 5 but 3 ÷ 15 does not equal 5.' Child: 'You can swap the numbers in multiplication because it is just turning the array. But in division, sharing 15 among 3 and sharing 3 among 15 are completely different problems.'",
        "transition_cue": "Child states the commutativity rule for multiplication and non-commutativity of division in their own words, and uses commutativity to choose the easier calculation order without being told."
      }
    ]
  },
  {
    "concept_id": "MA-Y2-C011",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children try to share small numbers of cubes equally between 2 people. Even numbers share equally with none left over; odd numbers always leave one remaining. Pairing cubes physically demonstrates the concept: even numbers form complete pairs, odd numbers have one left over.",
        "resources": ["Interlocking cubes", "Plates for sharing between 2", "Pairing mats"],
        "example_activity": "Take 9 cubes. Try to make pairs. 4 pairs and 1 left over — 9 is odd. Take 12 cubes. Make pairs. 6 pairs and none left over — 12 is even. Record your findings in a table.",
        "transition_cue": "Child determines whether a number up to 20 is odd or even by pairing objects, stating the rule: 'Even numbers make complete pairs with none left over. Odd numbers always have 1 left over.'"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children shade the even numbers on a hundred square and observe the pattern (every other number). They use number lines with even numbers highlighted and identify the ones-digit rule by looking at which digits appear in the ones place of even numbers.",
        "resources": ["Hundred squares for shading", "Number lines with even numbers highlighted"],
        "example_activity": "Shade all even numbers on the hundred square. What pattern do you see? Alternate columns are shaded. Look at the ones digits of the shaded numbers: 0, 2, 4, 6, 8. The ones digit tells you if a number is even.",
        "transition_cue": "Child identifies whether any number up to 100 is odd or even by checking the ones digit against the rule (0, 2, 4, 6, 8 = even) without needing to pair objects."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children instantly identify any number up to 100 as odd or even, state the ones-digit rule, and explain the underlying concept (even numbers are multiples of 2, odd numbers are not). They connect odd/even to the 2 times table.",
        "resources": [],
        "example_activity": "Is 74 odd or even? 'Even, because it ends in 4.' Is 83 odd or even? 'Odd, because it ends in 3.' Explain: 'Even numbers are multiples of 2 — you say them when counting in 2s from 0. Odd numbers are the ones you skip.'",
        "transition_cue": "Child identifies any number as odd or even within 2 seconds using the ones-digit rule, and explains: 'Even means it is a multiple of 2. I can check: does the ones digit end in 0, 2, 4, 6 or 8?'"
      }
    ]
  },
  {
    "concept_id": "MA-Y2-C012",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children find fractions of quantities by sharing objects equally between the denominator number of plates or cups. For 1/3 of 12: share 12 counters between 3 plates (4 each). For 3/4 of 12: share 12 between 4 plates (3 each), then count 3 of the 4 plates (9).",
        "resources": ["Counters", "Plates or cups for sharing (2, 3 and 4)", "Fraction strips"],
        "example_activity": "Find 1/4 of 20: share 20 counters equally between 4 plates. Each plate gets 5. So 1/4 of 20 = 5. Now find 3/4 of 20: count the counters on 3 of the 4 plates. 5 + 5 + 5 = 15. So 3/4 of 20 = 15.",
        "transition_cue": "Child shares objects equally between the correct number of groups to find unit fractions (1/3, 1/4) and then counts the appropriate number of groups for non-unit fractions (2/4, 3/4)."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children use fraction strips, fraction walls and number lines to find fractions of quantities and lengths. They draw sharing diagrams for 1/3, 1/4, 2/4 and 3/4 of given quantities, and count in fractions on number lines (0, 1/4, 2/4, 3/4, 1, 1 1/4...).",
        "resources": ["Fraction strips", "Fraction walls", "Number lines marked in fractions", "Sharing diagram templates"],
        "example_activity": "On a fraction number line, count in quarters from 0 to 2: 0, 1/4, 2/4, 3/4, 1, 1 1/4, 1 2/4, 1 3/4, 2. Find 1/3 of 18 by drawing 18 circles in 3 equal groups: each group has 6, so 1/3 of 18 = 6.",
        "transition_cue": "Child uses fraction strips and drawn diagrams to find any of the required fractions (1/3, 1/4, 2/4, 3/4) of quantities up to 30, and counts in fractions along a number line beyond 1."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children find fractions of quantities mentally by dividing by the denominator and multiplying by the numerator. They write fraction notation correctly and count in fractions on a number line, understanding fractions as numbers that can exceed 1.",
        "resources": ["Fraction notation reference: numerator, denominator, vinculum"],
        "example_activity": "Find 3/4 of 24. '1/4 of 24 is 6, so 3/4 is 3 × 6 = 18.' Write: 3/4 of 24 = 18. Find 1/3 of 15. '15 ÷ 3 = 5.' Write: 1/3 of 15 = 5.",
        "transition_cue": "Child finds fractions of quantities mentally by dividing then multiplying, writes the fraction notation correctly (numerator above vinculum, denominator below), and explains the method in their own words."
      }
    ]
  },
  {
    "concept_id": "MA-Y2-C013",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children fold identical paper strips: one into 2 equal parts (halves), the other into 4 equal parts (quarters). They shade 1/2 of one strip and 2/4 of the other, then place them side by side to see the shaded regions are the same size. This physical comparison makes equivalence visible.",
        "resources": ["Paper strips for folding", "Crayons for shading", "Fraction tiles (halves and quarters)"],
        "example_activity": "Fold one strip in half and shade one part. Fold another strip in quarters and shade two parts. Lay them side by side. 'The shaded parts are the same size! 1/2 and 2/4 are the same amount — they are equivalent.'",
        "transition_cue": "Child folds and compares strips accurately, stating: '1/2 and 2/4 are the same because 2 out of 4 equal parts covers the same area as 1 out of 2 equal parts.'"
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children use fraction walls and number lines to verify that 1/2 and 2/4 occupy the same position. They shade diagrams to show the equivalence and count in fractions on number lines using both names for the same point (e.g. 1 2/4 = 1 1/2).",
        "resources": ["Fraction walls", "Number lines marked in halves and quarters", "Equivalence shading worksheets"],
        "example_activity": "On a fraction wall, point to where 1/2 is. Now point to 2/4. 'They are at the same place!' On a number line, count: 1/4, 2/4, 3/4, 1. Write '1/2' at the same point as 2/4. Counting: 1 1/4, 1 2/4 (= 1 1/2), 1 3/4, 2.",
        "transition_cue": "Child identifies 2/4 and 1/2 as the same point on a fraction wall and number line, and uses both names interchangeably when counting in fractions."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children explain why 2/4 = 1/2 as a mathematical equivalence: two of four equal parts is the same proportion as one of two equal parts. They recognise that equivalent fractions name the same value and apply this in context.",
        "resources": [],
        "example_activity": "Explain to a partner why 2/4 = 1/2. 'If you cut a pizza into 4 slices and take 2, you have exactly half the pizza. 2 out of 4 is the same as 1 out of 2.' Is 1/4 of 8 the same as 2/4 of 4? '1/4 of 8 = 2 and 2/4 of 4 = 2. Yes!'",
        "transition_cue": "Child explains the equivalence of 2/4 and 1/2 in their own words using the concept of equal parts, without needing to fold or draw, and applies the equivalence to solve problems."
      }
    ]
  },
  {
    "concept_id": "MA-Y2-C014",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children measure objects using real measuring instruments: rulers for length (starting from 0), balance scales with standard weights for mass, thermometers for temperature, and measuring jugs for capacity. They choose the correct instrument and unit for each measurement.",
        "resources": ["30 cm rulers", "Metre sticks", "Balance scales with g and kg weights", "Thermometers", "Measuring jugs (marked in ml and l)"],
        "example_activity": "Measure the length of your book with a ruler (starting from 0). Weigh your pencil case on a balance using 10g weights. Read the temperature on the classroom thermometer. Measure how much water a cup holds using a measuring jug.",
        "transition_cue": "Child selects the correct instrument for each measurement type, aligns the ruler from 0, reads scales by counting marked intervals, and records results with correct units."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children read scales on diagrams of rulers, weighing scales, thermometers and measuring jugs. They practise interpreting scales where not every mark is labelled, working out the value of each division. They record measurements using standard abbreviations in tables.",
        "resources": ["Scale-reading diagrams (rulers, scales, thermometers, jugs)", "Measurement recording tables", "Estimation worksheets"],
        "example_activity": "This weighing scale is labelled 0, 100g, 200g, 300g with 5 marks between each label. What does each small mark represent? (20g) The pointer is on the 3rd mark after 200g. What is the mass? (260g).",
        "transition_cue": "Child works out the value of each interval on a scale before reading, correctly reads unlabelled divisions, and records using m, cm, kg, g, °C, l, ml."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children estimate measurements before measuring, choose appropriate units (cm vs m, g vs kg, ml vs l), compare measurements using >, < and =, and solve problems involving multiples ('half as high', 'twice as wide').",
        "resources": ["Measurement abbreviation reference: m, cm, kg, g, °C, l, ml"],
        "example_activity": "Estimate: is the door closer to 1 m or 2 m tall? Measure: 2 m. Compare: the table is 120 cm long and the desk is 90 cm. 120 > 90, so the table is longer. How much longer? 120 - 90 = 30 cm.",
        "transition_cue": "Child estimates measurements to within a reasonable range, selects the appropriate unit, records with correct abbreviations, and compares measurements using subtraction and symbols."
      }
    ]
  },
  {
    "concept_id": "MA-Y2-C015",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children handle real or realistic plastic coins and notes, practising naming values and using the £ and p symbols. They sort coins by denomination and make given amounts by selecting coins from a collection. Shopkeeper role-play provides a meaningful context for combining and exchanging.",
        "resources": ["Real or plastic UK coins and notes", "Price tag cards", "Shop role-play resources", "Coin sorting trays"],
        "example_activity": "Set up a classroom shop with price tags. 'The rubber costs 35p. Find the coins to pay for it.' Child selects 20p + 10p + 5p = 35p. 'Write the price: 35p.' 'The book costs £2. Write: £2.'",
        "transition_cue": "Child selects coins to make amounts up to £1 and writes prices using £ or p symbols correctly (never mixing them: not £35p), and finds at least two different coin combinations for the same amount."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children draw coins to make given amounts, record different combinations in tables, and use bar models to solve money addition and subtraction problems. They practise counting up from a price to the amount paid to calculate change.",
        "resources": ["Coin drawing templates", "Combination recording tables", "Bar model templates for money problems"],
        "example_activity": "Draw two different ways to make 50p. Way 1: 20p + 20p + 10p. Way 2: 50p coin. Find the change from 50p when you buy something costing 35p: draw a bar model. Whole = 50p, parts = 35p and ?. Count up: 35, 40 (5p), 50 (10p). Change = 15p.",
        "transition_cue": "Child draws coin combinations and uses bar models to solve money problems including giving change, counting up from the price to the amount paid."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children solve money problems mentally using addition and subtraction skills, recording amounts with correct symbols. They calculate change by counting up or subtracting, and find different coin combinations systematically.",
        "resources": ["£ and p symbol reference"],
        "example_activity": "'A pencil costs 45p. You pay with a 50p coin. How much change?' '50p - 45p = 5p.' 'A toy costs 78p. You pay with £1. Change?' 'Count up from 78: 78 + 2 = 80, 80 + 20 = 100. Change is 22p.'",
        "transition_cue": "Child calculates prices, totals and change mentally using efficient strategies (counting up, using known bonds), recording amounts with correct £ and p symbols."
      }
    ]
  },
  {
    "concept_id": "MA-Y2-C016",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children use geared demonstration clocks and individual clock-face manipulatives to set and read times. The gearing shows how the minute hand movement drives the hour hand proportionally. They connect the 5 times table to the minute positions: the 1 on the clock means 5 minutes, the 2 means 10 minutes, the 3 means 15 minutes (quarter past).",
        "resources": ["Geared demonstration clock", "Individual clock-face manipulatives", "5 times table chart connected to clock positions"],
        "example_activity": "Set the clock to quarter past 3. 'The minute hand points to 3, which means 15 minutes past. The hour hand is just after 3.' Count in 5s around the clock face: 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60. Connect: 3 × 5 = 15, so the 3 means 15 minutes.",
        "transition_cue": "Child sets a clock manipulative to any five-minute time including quarter past, half past and quarter to, and reads times set by someone else, explaining the minute hand position using the 5 times table."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children read times from drawn clock faces and draw hands on blank clock faces to show given times. They practise both 'past' and 'to' times, connecting quarter past and quarter to to the fraction vocabulary from geometry (quarter turn).",
        "resources": ["Clock face worksheets", "Draw-the-hands templates", "Time recording sheets"],
        "example_activity": "Read this clock: minute hand at 9, hour hand between 3 and 4. 'Quarter to 4' (or '45 minutes past 3'). Draw the hands for '10 minutes to 6': minute hand at 10, hour hand just before 6.",
        "transition_cue": "Child reads any five-minute time from a drawn clock face including 'to' times, and draws both hands in the correct positions (hour hand between numbers for non-o'clock times)."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children tell the time to five minutes on analogue clocks without manipulatives, write times in standard notation (e.g. 3:25), and know that there are 60 minutes in an hour and 24 hours in a day.",
        "resources": ["Time notation reference"],
        "example_activity": "What time is it now? (Looks at classroom clock) 'Twenty past 10.' Write it: '10:20.' How many minutes until half past? 'Half past is 10:30. 30 - 20 = 10 minutes.' How many hours in a day? '24.'",
        "transition_cue": "Child reads any five-minute time from an analogue clock and writes it in standard notation, knows 60 minutes = 1 hour and 24 hours = 1 day, and calculates simple time intervals."
      }
    ]
  },
  {
    "concept_id": "MA-Y2-C017",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children handle 2-D shape tiles, tracing around each side with their finger to count sides and touching each corner to count vertices. They use geoboards with elastic bands to make shapes with specific numbers of sides. Mirrors placed along the edge of a shape check for line symmetry.",
        "resources": ["2-D shape tiles (wide variety including irregular shapes)", "Geoboards and elastic bands", "Small mirrors for symmetry checking", "Sorting hoops"],
        "example_activity": "Make a quadrilateral on the geoboard. Count: 4 sides, 4 corners. Make a different quadrilateral — a trapezium. Still 4 sides and 4 corners. Place a mirror along one edge: does it have a line of symmetry?",
        "transition_cue": "Child counts sides and vertices accurately for any 2-D shape by tracing, makes shapes on a geoboard to match given properties, and uses a mirror to check for vertical line symmetry."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children identify properties from drawn shapes, sort shapes using two-way tables (e.g. has symmetry / does not have symmetry × 3 sides / 4 sides / more than 4 sides), and draw lines of symmetry on shapes. They compare shapes by their properties in written descriptions.",
        "resources": ["Shape sorting tables", "Symmetry drawing worksheets", "Shape property comparison cards"],
        "example_activity": "Sort these drawn shapes into a table: 'Has vertical line symmetry' and 'Does not have vertical line symmetry'. Count sides and vertices for each. A regular pentagon: 5 sides, 5 vertices, multiple lines of symmetry.",
        "transition_cue": "Child sorts drawn shapes by properties (sides, vertices, symmetry) into two-way tables, draws vertical lines of symmetry on shapes that have them, and writes property descriptions."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children identify shapes from verbal descriptions of their properties and describe shapes using precise vocabulary (sides, vertices, line of symmetry, polygon, quadrilateral) without visual support.",
        "resources": [],
        "example_activity": "'I have 4 sides, 4 vertices, all sides the same length, and 4 lines of symmetry. What am I?' 'A square!' 'How is a square different from a rectangle?' 'A square has all sides equal. A rectangle can have 2 long and 2 short sides. But a square is a special rectangle.'",
        "transition_cue": "Child identifies shapes from property descriptions alone and describes shapes precisely using 'sides', 'vertices', 'line of symmetry', 'quadrilateral' and 'polygon' without needing to see or handle the shape."
      }
    ]
  },
  {
    "concept_id": "MA-Y2-C018",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children handle solid 3-D shapes, touching each face, tracing each edge with a finger, and touching each vertex. They count faces, edges and vertices systematically, marking each one with a sticker or dot to avoid counting twice. They use a recording table to organise their findings.",
        "resources": ["Solid 3-D shapes (cube, cuboid, pyramid, prism, cone, cylinder)", "Stickers for marking counted features", "Recording tables"],
        "example_activity": "Pick up the triangular prism. Touch and mark each face (5 faces). Trace each edge with your finger (9 edges). Touch each vertex (6 vertices). Record in the table. Repeat for the square-based pyramid: 5 faces, 8 edges, 5 vertices.",
        "transition_cue": "Child counts faces, edges and vertices of any common 3-D shape by systematic marking, recording correctly in a table without double-counting."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children identify faces, edges and vertices from 3-D shape diagrams and photographs. They compare 3-D shapes by their properties and sort them into groups using property-based criteria (e.g. 'shapes with all flat faces' vs 'shapes with curved surfaces').",
        "resources": ["3-D shape diagrams", "Property comparison tables", "Sorting criteria cards"],
        "example_activity": "Look at this diagram of a cuboid. How many faces? (6) How many edges? (12) How many vertices? (8) Sort: cube, cuboid, triangular prism, square-based pyramid. Which have all rectangular faces? (cube, cuboid). Which have triangular faces? (prism, pyramid).",
        "transition_cue": "Child identifies faces, edges and vertices from diagrams of 3-D shapes without handling them, and sorts shapes into groups by property-based criteria."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children describe and compare 3-D shapes using faces, edges and vertices without seeing the shape, and identify shapes from verbal property descriptions.",
        "resources": [],
        "example_activity": "'I have 5 faces, 9 edges and 6 vertices. Two of my faces are triangles and three are rectangles. What am I?' 'A triangular prism!' 'How is a cube different from a cuboid?' 'A cube has all square faces. A cuboid can have rectangular faces of different sizes.'",
        "transition_cue": "Child identifies any common 3-D shape from a description of its faces, edges and vertices, and compares shapes using precise property vocabulary."
      }
    ]
  },
  {
    "concept_id": "MA-Y2-C019",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children press each face of a 3-D shape onto paper and trace around it to discover the 2-D shapes that make up its surface. They sort the tracings by shape name and count how many of each type a 3-D shape has.",
        "resources": ["Solid 3-D shapes", "Paper and crayons for tracing", "Paint for face printing", "Sorting trays"],
        "example_activity": "Press each face of a square-based pyramid onto paper and trace. Sort the tracings: 'I got 1 square and 4 triangles. A square-based pyramid has 5 faces: 1 square base and 4 triangular sides.' Repeat with a cylinder: '2 circles and 1 curved surface.'",
        "transition_cue": "Child traces all faces of common 3-D shapes, names the 2-D shapes found, and counts how many of each type, stating the relationship clearly."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children identify the 2-D face shapes on drawn 3-D shapes without tracing. They label diagrams of 3-D shapes with the names of their faces and match 3-D shapes to their 2-D face components.",
        "resources": ["3-D shape diagrams for labelling", "2-D/3-D matching cards", "Face identification worksheets"],
        "example_activity": "Look at this drawing of a triangular prism. Label the faces: 'The two end faces are triangles. The three side faces are rectangles.' Match: which 3-D shape has only circular and rectangular faces? 'A cylinder — 2 circles and a rectangle that wraps around.'",
        "transition_cue": "Child identifies and names all 2-D face shapes on 3-D shape diagrams without physical tracing, and matches 3-D shapes to their component 2-D faces."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children identify the 2-D faces of 3-D shapes from verbal descriptions and explain how 2-D shapes combine to create 3-D shapes.",
        "resources": [],
        "example_activity": "'What 2-D shapes would you need to build a square-based pyramid?' 'One square and four triangles.' 'How are the 2-D shapes on a cube different from those on a cuboid?' 'A cube has only squares. A cuboid can have squares and rectangles of different sizes.'",
        "transition_cue": "Child lists the 2-D faces of any common 3-D shape without visual support and explains how they combine, using precise shape names."
      }
    ]
  },
  {
    "concept_id": "MA-Y2-C020",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children physically walk in straight lines and make turning movements, distinguishing between the two types of movement. They make quarter, half, three-quarter and whole turns, counting right angles as they turn. Programmable robots (Beebots or Scratch) require precise right-angle inputs.",
        "resources": ["Space for physical movement", "Right-angle measurers (card L-shapes)", "Programmable floor robots (Beebots)", "Direction mats"],
        "example_activity": "Walk 5 steps forwards (straight line). Stop. Make a quarter turn clockwise (1 right angle). Walk 3 steps forwards. Make a half turn (2 right angles). Walk back. 'How many right angles in a whole turn? 4.'",
        "transition_cue": "Child makes accurate turns of 1, 2, 3 and 4 right angles on command in either direction, and distinguishes clearly between walking (straight line) and turning (rotation on the spot)."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children draw routes on grid paper using straight lines and right-angle turns. They mark the number of right angles in each turn on diagrams and label turns as clockwise or anticlockwise. They program simple routes for screen-based robots using right-angle turn instructions.",
        "resources": ["Grid paper for route drawing", "Turn diagrams", "Right-angle labels", "Screen-based programming (Scratch)"],
        "example_activity": "Draw a route on grid paper: go forwards 4 squares, turn 1 right angle clockwise, go forwards 3 squares, turn 2 right angles (half turn), go forwards 3 squares. Label each turn with the number of right angles.",
        "transition_cue": "Child draws routes with straight lines and right-angle turns, labelling each turn correctly as 1, 2, 3 or 4 right angles, clockwise or anticlockwise."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children describe rotations using right angle terminology without physical movement. They know that a quarter turn = 1 right angle, a half turn = 2, a three-quarter turn = 3, and a full turn = 4, and apply this in problem-solving contexts.",
        "resources": [],
        "example_activity": "'I face North and make 3 right angles clockwise. Which direction do I face?' 'West.' 'What is 2 right angles as a fraction of a full turn?' 'A half turn, because 2 is half of 4.' 'How many right angles in a three-quarter turn anticlockwise?' '3.'",
        "transition_cue": "Child describes any rotation as a number of right angles in either direction, connects right angles to fraction-of-turn vocabulary, and solves direction problems without physical movement."
      }
    ]
  },
  {
    "concept_id": "MA-Y2-C021",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children create and extend repeating patterns using physical objects: shape tiles, coloured cubes, beads. They identify the repeating unit and predict what comes next by continuing the pattern. Patterns with two and then three changing attributes develop systematic thinking.",
        "resources": ["Shape tiles in different colours and sizes", "Coloured cubes", "Pattern beads and strings", "Attribute blocks"],
        "example_activity": "Continue this pattern with cubes: red-blue-blue-red-blue-blue-... What comes next? 'Red.' What is the repeating unit? 'Red-blue-blue.' Make your own pattern with 3 colours and show it to a partner. Can they identify the rule?",
        "transition_cue": "Child identifies the repeating unit in a pattern of objects, continues it correctly for at least 3 more repetitions, and creates their own pattern with a clearly identifiable rule."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children identify and continue patterns in drawn sequences of shapes, colours and numbers. They describe the rule in words and spot deliberate errors in given patterns. Number sequences (2, 4, 6, 8...) connect to skip counting.",
        "resources": ["Pattern worksheets with shape and number sequences", "Error-spotting pattern cards"],
        "example_activity": "Continue: 5, 10, 15, 20, ?, ?. Rule: 'Add 5 each time.' Answer: 25, 30. Error hunt: 3, 6, 9, 12, 14, 18. What is wrong? '14 should be 15, because the rule is add 3.'",
        "transition_cue": "Child states the rule of a number or shape pattern in words, continues it correctly, spots errors in given patterns, and creates their own patterns with a stated rule."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children describe pattern rules in words, create patterns from a given rule, find errors in patterns, and explain why a given term does or does not fit the pattern. They apply pattern thinking to number sequences from skip counting.",
        "resources": [],
        "example_activity": "'Create a pattern that follows the rule: start at 4, add 3 each time.' Child: '4, 7, 10, 13, 16, 19.' 'Does 25 fit this pattern?' Child checks: '22, 25 — yes, 25 is in the pattern because 22 + 3 = 25.'",
        "transition_cue": "Child generates sequences from stated rules, determines whether given numbers belong to a pattern by applying the rule, and explains their reasoning without needing to list every term."
      }
    ]
  },
  {
    "concept_id": "MA-Y2-C022",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children collect real data through class surveys (favourite colours, fruits, pets) and record it using physical tally sticks (bundles of lolly sticks) and sorting objects into labelled hoops. They create one-to-one pictograms by placing one physical picture card per data item.",
        "resources": ["Lolly sticks for tallying", "Sorting hoops with labels", "Picture cards for pictograms", "Large paper for display"],
        "example_activity": "Survey: 'What is your favourite fruit?' Use lolly sticks to tally each response (4 upright + 1 diagonal = 5). Arrange picture cards: one apple picture for each child who chose apple. Count pictures to read the results.",
        "transition_cue": "Child collects data by tallying in groups of 5, creates a one-to-one pictogram with physical picture cards, and reads the results correctly by counting."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children draw tally charts, pictograms (including many-to-one where one picture = 2, 5 or 10), block diagrams and simple tables from given data. They read values from all four representations, including interpreting the pictogram key.",
        "resources": ["Tally chart templates", "Pictogram drawing templates with keys", "Block diagram grids", "Table templates"],
        "example_activity": "Draw a pictogram for this data: Red 6, Blue 8, Green 4. Key: each star = 2 children. Red gets 3 stars, Blue gets 4 stars, Green gets 2 stars. Read back: 'How many chose Blue? 4 stars × 2 = 8 children.'",
        "transition_cue": "Child draws all four types of data representation from given data, uses the many-to-one key correctly in pictograms, and reads values accurately from each type."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children choose the most appropriate representation for given data, construct it independently, and answer descriptive, comparative and aggregating questions. They explain their choice of representation.",
        "resources": [],
        "example_activity": "Construct a block diagram from survey data and answer: 'How many children chose pizza? Which food was most popular? How many more chose pizza than sandwiches? How many children were surveyed altogether?'",
        "transition_cue": "Child constructs an appropriate data representation independently, answers all three types of question (counting, comparing, totalling) correctly, and explains why they chose that particular representation."
      }
    ]
  },
  {
    "concept_id": "MA-Y2-C023",
    "stages": [
      {
        "stage_number": 1,
        "stage": "concrete",
        "description": "Children answer simple 'how many' questions by counting objects sorted into physical groups or reading values from concrete pictograms. They point to the correct category and count the items.",
        "resources": ["Sorted objects in labelled groups", "Concrete pictograms (physical picture cards)"],
        "example_activity": "Look at the sorted objects: 5 red cubes, 8 blue cubes, 3 green cubes. 'How many blue cubes?' Point and count: '8.' 'Which colour has the most?' '8 is the most — blue.'",
        "transition_cue": "Child answers 'how many' and 'which has most/least' questions correctly by counting sorted objects or reading concrete pictograms."
      },
      {
        "stage_number": 2,
        "stage": "pictorial",
        "description": "Children answer the three types of statistical question from drawn charts and tables: counting (how many?), comparing (which has most/least?), and aggregating (how many altogether? how many more?). They practise with all four data representation types.",
        "resources": ["Pictograms, tally charts, block diagrams and tables with questions", "Bar model templates for comparison questions"],
        "example_activity": "From this block diagram: 'How many children chose swimming?' (Count the blocks.) 'Which sport was most popular?' (Find the tallest bar.) 'How many more chose football than tennis?' (Subtract: 12 - 5 = 7.) 'How many children were asked altogether?' (Add all bars.)",
        "transition_cue": "Child answers all three types of question from any drawn data representation, using counting, comparison and addition/subtraction correctly."
      },
      {
        "stage_number": 3,
        "stage": "abstract",
        "description": "Children generate their own questions about data sets, answer them correctly, and explain what the data shows. They think critically about data: 'What does this tell us?' and 'What questions can we NOT answer from this data?'",
        "resources": [],
        "example_activity": "Look at this table of class favourite colours. Write 3 questions: a 'how many' question, a 'which has most' question, and a 'how many more' question. Answer your own questions. Now: 'Can we tell from this data how many children are in the class?' (Yes — add all categories.)",
        "transition_cue": "Child writes sensible questions about data sets, answers them correctly using appropriate operations, and identifies what can and cannot be determined from the given data."
      }
    ]
  }
]