[
  {
    "suggestion_id": "TS-DT-KS4-001",
    "name": "NEA Context: Improving Everyday Life",
    "suggestion_type": "teacher_convention",
    "subject": "Design and Technology",
    "key_stage": "KS4",
    "curriculum_status": "exemplar",
    "curriculum_reference": [
      "use iterative design processes to identify user needs, develop and communicate design ideas, and create detailed design proposals",
      "apply human factors and ergonomics in design"
    ],
    "pedagogical_rationale": "The Non-Exam Assessment (NEA) forms 50% of the GCSE grade. A context of 'improving everyday life' gives pupils maximum creative freedom to identify a genuine user need through research (interviews, questionnaires, product analysis) and design iteratively towards a resolved outcome. This exemplar walks through the complete NEA process: investigate → design → make → evaluate, demonstrating how each section maps to the mark scheme.",
    "common_pitfalls": [
      "Choosing a product with no genuine user need -- the investigation must identify a real problem, not manufacture one",
      "Iterative design on paper only -- each design iteration must be tested (card models, 3D prints, prototypes)",
      "Photography missing from the making section -- document every stage; the moderator cannot visit your workshop"
    ],
    "definitions": [
      "NEA (non-exam assessment)",
      "design brief",
      "specification",
      "iterative design",
      "prototype",
      "ergonomics",
      "anthropometrics",
      "user feedback",
      "quality control",
      "final evaluation"
    ],
    "year_groups": [
      "Y10",
      "Y11"
    ],
    "duration_lessons": 40,
    "dt_strand": "nea_project",
    "design_brief": "AQA contextual challenge (changes annually): Identify a problem within the given context. Investigate the context thoroughly. Design, make and evaluate a product that addresses the identified need. The project must demonstrate iterative designing, skilled making, and rigorous evaluation against specification criteria.",
    "materials": [
      "dependent on chosen material focus area",
      "prototype materials (card, foam board, 3D print filament)",
      "final materials as appropriate to design"
    ],
    "tools": [
      "full workshop tools as appropriate",
      "CAD software",
      "3D printer and/or laser cutter",
      "camera for documentation"
    ],
    "techniques": [
      "user research methods (interviews, questionnaires, observation)",
      "specification writing",
      "iterative design development",
      "prototype testing",
      "quality control during making",
      "evaluation against specification"
    ],
    "safety_notes": "Full risk assessment required for each pupil's chosen making process. All standard workshop safety rules apply. Individual risk assessments must be completed before making begins and signed by the teacher. PPE requirements depend on the chosen material focus.",
    "evaluation_criteria": [
      "Does the investigation identify a genuine user need?",
      "Is the design process genuinely iterative (multiple cycles of test-evaluate-redesign)?",
      "Is the final product made to a high quality standard?",
      "Does the evaluation honestly assess the product against the original specification?"
    ],
    "delivers_via": [
      {
        "concept_id": "DT-KS4-C002",
        "primary": true
      },
      {
        "concept_id": "DT-KS4-C003",
        "primary": false
      },
      {
        "concept_id": "DT-KS4-C006",
        "primary": false
      },
      {
        "concept_id": "DT-KS4-C001",
        "primary": false
      }
    ],
    "uses_template": "VT-21",
    "domain_ids": [
      "DT-KS4-D002",
      "DT-KS4-D003",
      "DT-KS4-D004"
    ],
    "display_category": "Topic Suggestion",
    "display_color": "#059669",
    "display_icon": "construction",
    "cross_curricular_links": []
  },
  {
    "suggestion_id": "TS-DT-KS4-002",
    "name": "Core Technical Principles: Materials and Their Properties",
    "suggestion_type": "prescribed_topic",
    "subject": "Design and Technology",
    "key_stage": "KS4",
    "curriculum_status": "mandatory",
    "curriculum_reference": [
      "demonstrate knowledge and understanding of the properties and working characteristics of a range of material categories",
      "understand the properties and applications of modern and smart materials and emerging technologies"
    ],
    "pedagogical_rationale": "Understanding material properties is the foundation of all GCSE DT decisions. Pupils must know the physical (density, hardness), mechanical (tensile strength, toughness, elasticity), thermal and electrical properties of six material categories. Testing materials through practical investigation (tensile testing, hardness testing, thermal conductivity experiments) makes abstract properties concrete and memorable. Smart materials (thermochromic inks, shape-memory alloys, piezoelectric materials) connect to industry innovation.",
    "common_pitfalls": [
      "Memorising properties without understanding application -- always connect properties to 'why would a designer choose this material?'",
      "Confusing strength with hardness or toughness -- teach the precise engineering definitions through practical tests",
      "Neglecting modern and smart materials -- these appear frequently in exam questions"
    ],
    "definitions": [
      "tensile strength",
      "hardness",
      "toughness",
      "elasticity",
      "plasticity",
      "malleability",
      "ductility",
      "conductivity",
      "thermochromic",
      "shape-memory alloy",
      "piezoelectric",
      "composite"
    ],
    "year_groups": [
      "Y10"
    ],
    "duration_lessons": 12,
    "dt_strand": "core_technical_principles",
    "design_brief": "Investigate the properties of materials across all six categories (timber, metals and alloys, polymers, textiles, papers and boards, electronic/mechanical systems). Conduct practical tests to compare properties. Create a materials reference portfolio including modern and smart materials with application case studies.",
    "materials": [
      "material samples across all categories",
      "test specimens (standard sizes for fair testing)",
      "smart material samples (thermochromic sheet, nitinol wire)"
    ],
    "tools": [
      "tensile testing apparatus (if available) or spring balance test rig",
      "Mohs hardness test materials",
      "digital callipers",
      "thermometers",
      "multimeters"
    ],
    "techniques": [
      "tensile testing",
      "hardness comparison",
      "thermal conductivity testing",
      "material identification from properties",
      "research and documentation of smart materials"
    ],
    "safety_notes": "Material testing: safety glasses for tensile tests (samples may snap). Nitinol wire: use tongs when heating (shape recovery is triggered by heat). Thermochromic materials: heat source required -- use hot water, not direct flame. Standard PPE for any workshop activity.",
    "evaluation_criteria": [
      "Can you identify materials from their properties?",
      "Can you explain why specific materials are suited to specific applications?",
      "Is the materials portfolio comprehensive and accurate?",
      "Can you describe the properties and applications of at least three smart materials?"
    ],
    "delivers_via": [
      {
        "concept_id": "DT-KS4-C001",
        "primary": true
      },
      {
        "concept_id": "DT-KS4-C005",
        "primary": false
      }
    ],
    "uses_template": "VT-06",
    "domain_ids": [
      "DT-KS4-D001"
    ],
    "display_category": "Topic Suggestion",
    "display_color": "#059669",
    "display_icon": "construction",
    "cross_curricular_links": [
      {
        "target_id": "SE-KS3-005",
        "hook": "Particle model, material properties at atomic level, states of matter",
        "strength": "moderate"
      }
    ]
  },
  {
    "suggestion_id": "TS-DT-KS4-003",
    "name": "Human Factors and Inclusive Design",
    "suggestion_type": "prescribed_topic",
    "subject": "Design and Technology",
    "key_stage": "KS4",
    "curriculum_status": "mandatory",
    "curriculum_reference": [
      "apply human factors and ergonomics in design, considering the physical, cognitive and emotional needs of users"
    ],
    "pedagogical_rationale": "Human factors and ergonomics are exam topics that pupils find abstract until they measure real anthropometric data and design for actual users. Collecting hand-span measurements, seated reach distances, and grip strength data from the class provides a real dataset for designing products that accommodate the 5th to 95th percentile range. Inclusive design case studies (OXO Good Grips, Dyson, adjustable furniture) show that designing for accessibility improves products for everyone.",
    "common_pitfalls": [
      "Treating ergonomics as an add-on rather than a design driver -- it must inform decisions from the start",
      "Using only average measurements -- teach percentile ranges and the 'design for the extremes' principle",
      "Confusing ergonomics (physical fit) with aesthetics (visual appeal)"
    ],
    "definitions": [
      "ergonomics",
      "anthropometrics",
      "percentile",
      "inclusive design",
      "universal design",
      "user-centred design",
      "accessibility",
      "grip strength",
      "reach distance",
      "cognitive load"
    ],
    "year_groups": [
      "Y10"
    ],
    "duration_lessons": 6,
    "dt_strand": "human_factors",
    "design_brief": "Collect anthropometric data from your class. Analyse a poorly-designed everyday product (e.g. a tin opener, a bus seat, a school locker) and redesign it applying human factors principles. Present your redesign with annotated drawings showing how anthropometric data informed each decision.",
    "materials": [
      "existing product to analyse",
      "measuring equipment",
      "card for mock-ups"
    ],
    "tools": [
      "tape measures",
      "spring balance (for grip strength)",
      "rulers and callipers",
      "CAD software for redesign"
    ],
    "techniques": [
      "anthropometric data collection",
      "percentile range analysis",
      "product analysis against ergonomic criteria",
      "annotated design communication",
      "user testing with mock-ups"
    ],
    "safety_notes": "Grip strength testing: use calibrated equipment, not improvised tests. Anthropometric measurements: respect pupil privacy -- use anonymous data collection. Product disassembly: teacher-supervised if sharp tools needed.",
    "evaluation_criteria": [
      "Is the anthropometric data accurately collected and analysed?",
      "Does the redesign demonstrably improve the product's ergonomics?",
      "Are human factors principles clearly annotated in the design?",
      "Has the redesign been tested with users?"
    ],
    "delivers_via": [
      {
        "concept_id": "DT-KS4-C003",
        "primary": true
      },
      {
        "concept_id": "DT-KS4-C002",
        "primary": false
      }
    ],
    "uses_template": "VT-06",
    "domain_ids": [
      "DT-KS4-D002",
      "DT-KS4-D005"
    ],
    "display_category": "Topic Suggestion",
    "display_color": "#059669",
    "display_icon": "construction",
    "cross_curricular_links": []
  },
  {
    "suggestion_id": "TS-DT-KS4-004",
    "name": "CAD/CAM and Digital Manufacturing",
    "suggestion_type": "prescribed_topic",
    "subject": "Design and Technology",
    "key_stage": "KS4",
    "curriculum_status": "mandatory",
    "curriculum_reference": [
      "use a range of design strategies and communication methods including sketching, modelling, CAD and prototyping",
      "select and use appropriate tools, techniques and processes to make design outcomes to a good quality standard with precision and accuracy"
    ],
    "pedagogical_rationale": "GCSE DT requires pupils to use CAD/CAM as part of both designing and making. This unit develops competence with 2D and 3D CAD software, understanding of CNC manufacture (laser cutting, 3D printing, CNC routing), and the ability to select the most appropriate digital manufacturing process for a given design. Pupils compare digital and traditional manufacturing in terms of precision, repeatability, speed, cost and material waste.",
    "common_pitfalls": [
      "Using CAD/CAM as a shortcut rather than a design tool -- the design process must drive the choice of manufacture, not the other way around",
      "Designing in CAD without checking physical dimensions -- always verify with real measurements",
      "Not understanding manufacturing tolerances -- digital machines have limits; test cuts/prints are essential"
    ],
    "definitions": [
      "CAD",
      "CAM",
      "CNC",
      "laser cutting",
      "3D printing",
      "CNC routing",
      "tolerance",
      "parametric design",
      "vector",
      "raster",
      "G-code",
      "rapid prototyping"
    ],
    "year_groups": [
      "Y10",
      "Y11"
    ],
    "duration_lessons": 8,
    "dt_strand": "cad_cam",
    "design_brief": "Design a product that combines at least two different digital manufacturing processes (e.g. laser-cut frame + 3D-printed components, CNC-routed base + laser-engraved surface). Document your choice of manufacturing process for each component with technical justification.",
    "materials": [
      "appropriate materials for chosen processes",
      "PLA filament for 3D printing",
      "plywood or acrylic for laser cutting",
      "MDF or softwood for CNC routing"
    ],
    "tools": [
      "2D and 3D CAD software",
      "laser cutter (teacher operated)",
      "3D printer",
      "CNC router (teacher operated, if available)",
      "slicer software"
    ],
    "techniques": [
      "2D vector drawing for laser cutting",
      "3D solid modelling for 3D printing",
      "toolpath generation",
      "combining digital and traditional manufacture",
      "quality checking finished components"
    ],
    "safety_notes": "All CNC machines: teacher-operated only. Laser cutter: adequate extraction mandatory, never cut PVC. 3D printer: ensure ventilation, allow prints to cool. CNC router: hearing protection, dust extraction, no loose clothing. Always check material safety datasheets before digital manufacture.",
    "evaluation_criteria": [
      "Are at least two digital manufacturing processes used appropriately?",
      "Is the choice of process technically justified?",
      "Are the manufactured components precise and well-finished?",
      "Does the final product integrate digital and traditional processes effectively?"
    ],
    "delivers_via": [
      {
        "concept_id": "DT-KS4-C004",
        "primary": true
      },
      {
        "concept_id": "DT-KS4-C001",
        "primary": false
      }
    ],
    "uses_template": "VT-21",
    "domain_ids": [
      "DT-KS4-D003",
      "DT-KS4-D001"
    ],
    "display_category": "Topic Suggestion",
    "display_color": "#059669",
    "display_icon": "construction",
    "cross_curricular_links": []
  },
  {
    "suggestion_id": "TS-DT-KS4-005",
    "name": "Sustainability and Life Cycle Assessment",
    "suggestion_type": "prescribed_topic",
    "subject": "Design and Technology",
    "key_stage": "KS4",
    "curriculum_status": "mandatory",
    "curriculum_reference": [
      "understand the influence of environmental factors on design and technology",
      "understand the social, ethical and environmental impact of design decisions"
    ],
    "pedagogical_rationale": "Sustainability is a mandatory exam topic. Life Cycle Assessment (LCA) provides a systematic framework for evaluating environmental impact from raw material extraction through manufacture, use and disposal. Pupils conduct an LCA of a common product (a plastic water bottle, a cotton T-shirt, a smartphone), comparing it to a sustainable alternative. This develops analytical skills required for the exam and connects DT to geography, science and citizenship.",
    "common_pitfalls": [
      "LCA reduced to a simple 'good vs bad' judgement -- the analysis must be nuanced (trade-offs between environmental impacts)",
      "Ignoring the use phase -- for many products, the use phase (energy, water) has more impact than manufacture",
      "Not connecting to the 6Rs framework -- reduce, reuse, recycle, refuse, rethink, repair"
    ],
    "definitions": [
      "life cycle assessment",
      "carbon footprint",
      "embodied energy",
      "planned obsolescence",
      "circular economy",
      "cradle to cradle",
      "the 6Rs",
      "fair trade",
      "ethical sourcing",
      "environmental impact"
    ],
    "year_groups": [
      "Y10",
      "Y11"
    ],
    "duration_lessons": 6,
    "dt_strand": "sustainability",
    "design_brief": "Conduct a full Life Cycle Assessment of a common consumer product. Compare it to a more sustainable alternative. Present your findings as a visual report with data, diagrams, and recommendations for designers. Apply the 6Rs framework to propose improvements.",
    "materials": [
      "product samples for analysis",
      "LCA data resources",
      "presentation materials"
    ],
    "tools": [
      "research resources (LCA databases, manufacturer data)",
      "presentation software",
      "calculator for carbon footprint estimation"
    ],
    "techniques": [
      "life cycle assessment methodology",
      "carbon footprint calculation",
      "comparative analysis",
      "data presentation and visualisation",
      "design recommendations based on evidence"
    ],
    "safety_notes": "Product disassembly (if conducted): teacher-supervised. Do not disassemble products containing batteries, capacitors or pressurised components. Wear gloves when handling products with unknown chemical treatments.",
    "evaluation_criteria": [
      "Is the LCA thorough and evidence-based?",
      "Does the comparison identify genuine environmental trade-offs?",
      "Are the 6Rs applied meaningfully?",
      "Are the design recommendations specific and actionable?"
    ],
    "delivers_via": [
      {
        "concept_id": "DT-KS4-C005",
        "primary": true
      },
      {
        "concept_id": "DT-KS4-C007",
        "primary": false
      }
    ],
    "uses_template": "VT-06",
    "domain_ids": [
      "DT-KS4-D005",
      "DT-KS4-D004"
    ],
    "display_category": "Topic Suggestion",
    "display_color": "#059669",
    "display_icon": "construction",
    "cross_curricular_links": [
      {
        "target_id": "GS-GE-KS3-003",
        "hook": "Climate change, sustainability, environmental impact of production and consumption",
        "strength": "strong"
      }
    ]
  },
  {
    "suggestion_id": "TS-DT-KS4-006",
    "name": "Design in Context: Influential Designers and Movements",
    "suggestion_type": "prescribed_topic",
    "subject": "Design and Technology",
    "key_stage": "KS4",
    "curriculum_status": "mandatory",
    "curriculum_reference": [
      "understand the influence of historical, cultural, social and environmental factors on design",
      "analyse and evaluate the work of past and present professionals and companies in the design and technology field"
    ],
    "pedagogical_rationale": "Understanding the history of design is a mandatory exam topic. Studying influential designers (William Morris, Charles Rennie Mackintosh, Harry Beck, Philippe Starck, Dieter Rams, James Dyson) and movements (Arts and Crafts, Bauhaus, Art Deco, Memphis, Modernism) teaches that design does not exist in a cultural vacuum. Each designer's work reflects the social, technological and economic context of their era. Connecting historical analysis to contemporary design helps pupils develop an informed design identity.",
    "common_pitfalls": [
      "Treating design history as a list of names and dates -- connect each designer to their design philosophy and its influence",
      "Only covering Western designers -- include global design traditions and contemporary non-Western designers",
      "Not connecting to pupils' own designing -- ask 'how does this influence YOUR design decisions?'"
    ],
    "definitions": [
      "design movement",
      "Arts and Crafts",
      "Bauhaus",
      "Art Deco",
      "Modernism",
      "form follows function",
      "less is more",
      "planned obsolescence",
      "design philosophy",
      "design icon"
    ],
    "year_groups": [
      "Y10"
    ],
    "duration_lessons": 6,
    "dt_strand": "design_in_context",
    "design_brief": "Research two influential designers from different eras or movements. Analyse how their social, cultural and technological context shaped their design philosophy and products. Create a comparative presentation and design a product that shows the influence of one of these designers on your own work.",
    "materials": [
      "research resources",
      "presentation materials",
      "sketching materials for design response"
    ],
    "tools": [
      "research resources (books, online archives, museum websites)",
      "presentation software",
      "sketching and rendering materials"
    ],
    "techniques": [
      "design analysis (form, function, materials, manufacture, context)",
      "comparative analysis across eras",
      "design sketching in the style of an influential designer",
      "presentation and communication of design ideas"
    ],
    "safety_notes": "No specific workshop safety requirements for this research-based unit.",
    "evaluation_criteria": [
      "Is the analysis of each designer thorough and contextualised?",
      "Does the comparison identify meaningful similarities and differences?",
      "Does the design response show genuine influence from the studied designer?",
      "Is the presentation clear and well-evidenced?"
    ],
    "delivers_via": [
      {
        "concept_id": "DT-KS4-C002",
        "primary": false
      },
      {
        "concept_id": "DT-KS4-C005",
        "primary": false
      },
      {
        "concept_id": "DT-KS4-C006",
        "primary": true
      }
    ],
    "uses_template": "VT-14",
    "domain_ids": [
      "DT-KS4-D005"
    ],
    "display_category": "Topic Suggestion",
    "display_color": "#059669",
    "display_icon": "construction",
    "cross_curricular_links": [
      {
        "target_id": "HS-KS3-004",
        "hook": "Industrial Revolution: how industrialisation shaped manufacturing and design",
        "strength": "moderate"
      }
    ]
  },
  {
    "suggestion_id": "TS-DT-KS4-007",
    "name": "Electronic Systems: Programmable Product with Sensors",
    "suggestion_type": "teacher_convention",
    "subject": "Design and Technology",
    "key_stage": "KS4",
    "curriculum_status": "exemplar",
    "curriculum_reference": [
      "demonstrate knowledge and understanding of electronic and mechanical systems",
      "select and use appropriate tools, techniques and processes to make design outcomes"
    ],
    "pedagogical_rationale": "GCSE-level electronic systems require pupils to design circuits with multiple inputs and outputs controlled by a programmable microcontroller. A product that uses multiple sensors (temperature, light, motion, proximity) to respond intelligently to its environment demonstrates the embedded computing concepts in the specification. The project integrates electronics, programming, and product design into a single assessed outcome.",
    "common_pitfalls": [
      "Attempting too many features -- start with one sensor and one output, then add complexity incrementally",
      "Poor soldering causing intermittent faults -- teach soldering technique on practice boards before the real circuit",
      "Housing design as an afterthought -- design the housing and the circuit simultaneously; they must fit together"
    ],
    "definitions": [
      "microcontroller",
      "sensor",
      "actuator",
      "circuit board",
      "PCB (printed circuit board)",
      "soldering",
      "firmware",
      "serial communication",
      "analogue",
      "digital"
    ],
    "year_groups": [
      "Y10",
      "Y11"
    ],
    "duration_lessons": 12,
    "dt_strand": "electronic_systems",
    "design_brief": "Design and make a product that uses a microcontroller and at least two sensors to respond intelligently to its environment. Examples: a plant watering monitor (soil moisture + light), a room comfort monitor (temperature + humidity), a security device (motion + sound). The product must have a well-designed housing.",
    "materials": [
      "Arduino or micro:bit",
      "sensors (temperature, moisture, light, motion, ultrasonic)",
      "actuators (LEDs, buzzer, servo motor, relay)",
      "stripboard or PCB",
      "soldering materials",
      "housing materials (3D-printed, laser-cut, or fabricated)"
    ],
    "tools": [
      "soldering station",
      "wire strippers and cutters",
      "multimeter",
      "oscilloscope (if available)",
      "computer for programming",
      "workshop tools for housing"
    ],
    "techniques": [
      "circuit design and schematic drawing",
      "breadboard prototyping",
      "soldering to stripboard or PCB",
      "programming sensor input and actuator output",
      "housing design and assembly",
      "system testing and debugging"
    ],
    "safety_notes": "Soldering: well-ventilated area, safety glasses, soldering station with stand. Lead-free solder preferred. Never solder live circuits. Low voltage only (5V max). Wash hands after soldering. All circuits must be checked by the teacher before powering on. PAT testing any mains-powered equipment used.",
    "evaluation_criteria": [
      "Does the product respond correctly to both sensor inputs?",
      "Is the circuit well-constructed (neat soldering, no dry joints)?",
      "Is the code well-structured and commented?",
      "Does the housing integrate the electronics effectively?"
    ],
    "delivers_via": [
      {
        "concept_id": "DT-KS4-C004",
        "primary": false
      },
      {
        "concept_id": "DT-KS4-C001",
        "primary": false
      },
      {
        "concept_id": "DT-KS4-C002",
        "primary": true
      }
    ],
    "uses_template": "VT-21",
    "domain_ids": [
      "DT-KS4-D001",
      "DT-KS4-D003"
    ],
    "display_category": "Topic Suggestion",
    "display_color": "#059669",
    "display_icon": "construction",
    "cross_curricular_links": []
  },
  {
    "suggestion_id": "TS-DT-KS4-008",
    "name": "Exam Preparation: Analysing Past Paper Questions",
    "suggestion_type": "teacher_convention",
    "subject": "Design and Technology",
    "key_stage": "KS4",
    "curriculum_status": "exemplar",
    "curriculum_reference": [
      "demonstrate knowledge and understanding of the properties and working characteristics of a range of material categories",
      "understand the influence of environmental factors on design and technology"
    ],
    "pedagogical_rationale": "The written exam (50% of the GCSE) requires pupils to apply technical knowledge to unseen contexts. Structured practice with past paper questions -- identifying command words (describe, explain, evaluate, analyse), marking scheme expectations, and common examiner comments -- develops exam technique alongside subject knowledge. Working through questions collaboratively before attempting them independently scaffolds the transition from knowledge to application.",
    "common_pitfalls": [
      "Pupils describing when the question asks them to explain -- teach the hierarchy of command words explicitly",
      "Answers too short for the marks available -- teach the 'one developed point per mark' rule",
      "Rushing diagram questions -- annotated drawings with technical labels score highly if done carefully"
    ],
    "definitions": [
      "command word",
      "describe",
      "explain",
      "evaluate",
      "analyse",
      "compare",
      "justify",
      "mark scheme",
      "extended response",
      "annotated drawing"
    ],
    "year_groups": [
      "Y11"
    ],
    "duration_lessons": 8,
    "dt_strand": "exam_preparation",
    "design_brief": "Work through a bank of past paper questions organised by topic. For each topic: attempt under timed conditions, peer-mark using the mark scheme, identify gaps in knowledge, and revise targeted areas. Create a personal revision plan based on identified weaknesses.",
    "materials": [
      "past paper questions (AQA, Edexcel, or OCR as appropriate)",
      "mark schemes",
      "revision resources"
    ],
    "tools": [
      "exam papers",
      "mark schemes",
      "timer",
      "revision notes"
    ],
    "techniques": [
      "command word identification",
      "timed question practice",
      "peer marking against mark scheme",
      "gap analysis and revision planning",
      "extended response structuring"
    ],
    "safety_notes": "No specific safety requirements for this classroom-based unit.",
    "evaluation_criteria": [
      "Can you identify and respond to different command words correctly?",
      "Do your answers match the mark scheme requirements?",
      "Have you identified and addressed knowledge gaps?",
      "Can you write a structured extended response?"
    ],
    "delivers_via": [
      {
        "concept_id": "DT-KS4-C001",
        "primary": false
      },
      {
        "concept_id": "DT-KS4-C006",
        "primary": true
      }
    ],
    "uses_template": "VT-13",
    "domain_ids": [
      "DT-KS4-D001",
      "DT-KS4-D004",
      "DT-KS4-D005"
    ],
    "display_category": "Topic Suggestion",
    "display_color": "#059669",
    "display_icon": "construction",
    "cross_curricular_links": []
  }
]
