{
  "metadata": {
    "subject": "Art and Design",
    "key_stage": "KS2",
    "years_covered": [
      3,
      4,
      5,
      6
    ],
    "document_reference": "DFE-00170-2013",
    "extraction_date": "2026-02-17",
    "structure_rating": 6
  },
  "domains": [
    {
      "domain_id": "AD-KS2-D001",
      "domain_name": "Developing Techniques and Mastery",
      "description": "Developing greater control, skill and mastery across drawing, painting, sculpture and other art and design techniques using a range of materials.",
      "curriculum_context": "At KS2, pupils build upon the exploratory work of KS1 to develop greater technical mastery and intentional control of materials and processes. The curriculum specifies improvement in drawing, painting and sculpture across a range of materials including pencil, charcoal, paint and clay, with pupils expected to work with creativity, experimentation and an increasing awareness of different kinds of art, craft and design. This domain is central to the KS2 curriculum because it shifts pupils from exploration to craft, developing the understanding that mastery requires deliberate practice and critical self-evaluation. Pupils begin to make conscious choices about which techniques and materials serve their creative intentions, rather than simply trying things out.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "AD-KS2-D002",
      "domain_name": "Sketchbooks and Observational Practice",
      "description": "Using sketchbooks to record observations, develop ideas and review and revisit creative thinking over time.",
      "curriculum_context": "Sketchbooks are introduced at KS2 as a key tool for artistic development, mirroring the working practice of professional artists and designers. They provide a space for pupils to record observations of the world around them, experiment with techniques and materials, collect visual research and develop ideas before committing to a final outcome. The educational rationale is that sketchbooks make visible the iterative, exploratory nature of creativity and teach pupils that effective making involves planning, revision and reflection rather than a single attempt. Pupils learn to see their sketchbook as a resource to return to, building habits of visual curiosity and careful looking that serve them throughout their artistic education.",
      "is_cross_cutting": false,
      "structure_type": "process"
    },
    {
      "domain_id": "AD-KS2-D003",
      "domain_name": "Art History: Great Artists, Architects and Designers",
      "description": "Learning about the lives, work and significance of great artists, architects and designers throughout history.",
      "curriculum_context": "This domain extends pupils' cultural and historical knowledge of art and design by focusing on significant practitioners across history, with explicit inclusion of architects and designers as well as artists. Pupils learn that great works of art and design are located within historical periods and social contexts, and that practitioners have been influenced by the world around them and by each other's innovations. KS2 pupils are expected to make active connections between historical examples and their own creative work, using the work of great practitioners as inspiration, reference and a source of critical dialogue. This domain builds the disciplinary knowledge that enables pupils to engage meaningfully with art history and cultural heritage, and to situate their own creative work within a broader tradition.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    }
  ],
  "objectives": [
    {
      "objective_id": "AD-KS2-O001",
      "domain_id": "AD-KS2-D002",
      "objective_text": "to create sketch books to record their observations and use them to review and revisit ideas",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "AD-KS2-O002",
      "domain_id": "AD-KS2-D001",
      "objective_text": "to improve their mastery of art and design techniques, including drawing, painting and sculpture with a range of materials [for example, pencil, charcoal, paint, clay]",
      "non_statutory_guidance": null,
      "examples": "pencil, charcoal, paint, clay",
      "is_statutory": true
    },
    {
      "objective_id": "AD-KS2-O003",
      "domain_id": "AD-KS2-D003",
      "objective_text": "about great artists, architects and designers in history",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "AD-KS2-C001",
      "domain_id": "AD-KS2-D001",
      "concept_name": "Drawing Mastery",
      "description": "At KS2, drawing develops from exploratory mark-making to more controlled, purposeful and technically sophisticated work. Pupils learn to use a wider range of drawing tools and to vary line quality, tone and mark-making techniques to achieve different effects, including observational drawing and drawing from imagination. The concept of mastery implies deliberate practice, critical self-evaluation and progressive improvement over time.",
      "teaching_guidance": "Introduce pencil grading (H to B) and demonstrate how different pressures and angles create different marks. Teach shading techniques including hatching, cross-hatching and blending. Set regular observational drawing tasks from natural objects, still life and the environment. Use charcoal for tonal work and bold expressive drawing. Encourage pupils to compare drawings over time and identify areas of improvement. Connect drawing to sketchbook practice as a way of developing ideas.",
      "key_vocabulary": "tone, shade, gradient, hatching, cross-hatching, contour, proportion, perspective, observation, detail, composition, charcoal, graphite, tonal range",
      "common_misconceptions": "Pupils may equate drawing mastery with photographic accuracy rather than expressive control. Teaching that great artists develop personal styles reinforces that mastery is about intentional choices. Some pupils give up if their first attempt does not match expectation; scaffolding with structured practice builds resilience and the understanding that skill is developed over time.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "AD-KS2-C002",
      "domain_id": "AD-KS2-D001",
      "concept_name": "Painting Mastery",
      "description": "Building on KS1 colour exploration, KS2 pupils develop greater control in mixing, applying and layering paint to achieve specific expressive and representational effects. They learn about colour theory including complementary and harmonious colours, warm and cool palettes, and how artists use colour deliberately to create mood, depth and compositional focus.",
      "teaching_guidance": "Explore a wider range of paints including watercolour, acrylic and poster paint. Teach colour mixing in more depth, covering warm and cool colours, complementary pairs, and how to create neutrals and earthy tones. Study how artists such as Monet, Van Gogh or Klimt used colour expressively. Teach techniques such as wet-on-wet watercolour, impasto and glazing. Encourage pupils to plan colour choices in sketchbooks before committing to final paintings.",
      "key_vocabulary": "complementary, harmonious, warm, cool, tint, shade, hue, intensity, wet-on-wet, impasto, glaze, wash, palette, saturated, neutral",
      "common_misconceptions": "Pupils may believe colour mixing is unpredictable. Systematic colour mixing activities build understanding of predictable outcomes. Some pupils mix too many colours resulting in muddy browns; teaching about complementary pairs and limited palettes addresses this. Pupils may not connect colour choices to emotional or compositional intent.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "AD-KS2-C003",
      "domain_id": "AD-KS2-D001",
      "concept_name": "Sculpture Mastery",
      "description": "At KS2, pupils develop greater technical control and creative ambition in three-dimensional work. They learn to use materials such as clay, wire, card and found objects with increasing skill, understanding how structural decisions affect the stability, form and visual impact of a sculpture. Pupils also develop awareness of how sculptors work across a range of traditions and purposes.",
      "teaching_guidance": "Build on KS1 clay work with more complex techniques such as coil building, slab construction and surface decoration. Use wire armatures to support larger-scale figures or abstract forms. Explore mixed-media sculpture combining multiple materials. Study a range of sculptors from different cultures and periods. Encourage pupils to plan three-dimensional work through sketches and maquettes before making final pieces.",
      "key_vocabulary": "sculpture, three-dimensional, relief, armature, coil, slab, pinch, carve, assemble, texture, form, space, maquette, installation",
      "common_misconceptions": "Pupils may focus on surface decoration at the expense of structural integrity. Teaching basic structural principles prevents this. Some pupils may not see sculpture as a legitimate mode of artistic expression compared to drawing and painting; a rich diet of sculptural examples challenges this. Planning in 2D before working in 3D is a skill that requires explicit modelling.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "AD-KS2-C004",
      "domain_id": "AD-KS2-D002",
      "concept_name": "Sketchbook as Creative Tool",
      "description": "A sketchbook is a personal working document used by artists to record observations, collect ideas, experiment with techniques and develop thinking over time. At KS2, pupils learn to use sketchbooks as an integral part of their creative process, treating them as a living record of their developing ideas rather than a place for finished work. This concept models the iterative, exploratory nature of creative practice.",
      "teaching_guidance": "Give each pupil their own sketchbook and establish a culture where it is used regularly throughout the year. Encourage pupils to fill pages with quick sketches, notes, material samples and test marks as well as more developed studies. Set specific sketchbook tasks such as observational drawings, colour experiments and responses to works of art. Teach pupils to annotate their sketchbooks with reflections. Treat sketchbooks as evidence of creative thinking and reward exploration rather than only finished quality.",
      "key_vocabulary": "observation, record, annotate, develop, revisit, experiment, plan, research, collect, reflect, process, iteration, working drawing, visual diary",
      "common_misconceptions": "Pupils often treat sketchbooks as finished work books, producing neat drawings on blank pages. The idea that messy, exploratory work is valuable needs explicit modelling by teachers. Some pupils may not see the connection between sketchbook work and final outcomes; structured links between exploration and making phases are essential.",
      "concept_type": "process",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "AD-KS2-C005",
      "domain_id": "AD-KS2-D003",
      "concept_name": "Art History: Artists, Architects and Designers",
      "description": "Great artists, architects and designers throughout history have developed distinctive styles and approaches that reflect the social, cultural and historical contexts of their time. At KS2, pupils learn to place significant practitioners within historical periods and begin to understand how their work has shaped art history and influenced subsequent practitioners. The explicit inclusion of architects and designers broadens pupils' understanding beyond fine art.",
      "teaching_guidance": "Study a diverse selection of artists, architects and designers across different historical periods, cultures and disciplines. Include both canonical and less well-known examples, and deliberately include non-Western and contemporary practitioners. Use high-quality reproductions and, where possible, visits to galleries and museums. Set projects that use specific practitioners as starting points. Teach pupils to describe, interpret and evaluate works of art using appropriate language drawn from the formal elements.",
      "key_vocabulary": "Renaissance, Impressionism, Modernism, movement, period, style, influence, tradition, architect, designer, sculptor, painter, historical context, cultural context",
      "common_misconceptions": "Pupils may see art history as a list of names and dates. Connecting historical examples to pupils' own work and to contemporary practice makes history meaningful. Pupils may not appreciate non-Western art traditions; deliberately including diverse examples challenges Eurocentric assumptions. The division between fine art, craft and design can create a false hierarchy that needs to be questioned.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "AD-KS2-C006",
      "domain_id": "AD-KS2-D001",
      "concept_name": "Creativity and Experimentation",
      "description": "Creativity in art and design involves generating original ideas, making unexpected connections and being willing to experiment beyond familiar approaches. The KS2 curriculum explicitly requires pupils to approach their art making with creativity and experimentation, developing an increasing awareness of different kinds of art, craft and design. This concept involves taking creative risks, exploring different possibilities and developing a personal artistic voice.",
      "teaching_guidance": "Set open-ended creative briefs that allow diverse responses. Reward risk-taking and unusual approaches. Use warm-up activities that free pupils from concern about outcomes. Teach techniques for generating ideas such as mind-mapping, collage, random juxtapositions and working from imagination as well as observation. Discuss how famous artists experimented throughout their careers and how their work evolved.",
      "key_vocabulary": "experiment, explore, original, creative, invent, imagination, risk, develop, combine, transform, investigate, unconventional, personal style",
      "common_misconceptions": "Pupils may equate creativity with natural talent and believe it cannot be developed. Teaching that creativity involves learnable strategies and habits of mind addresses this. Some pupils may need explicit permission to make unusual choices or to depart from conventional approaches. Evaluation of creative risk-taking should reward the process of exploration, not only the quality of final outcomes.",
      "concept_type": "process",
      "complexity_level": 2,
      "is_cross_cutting": true
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "AD-KS1-C002",
      "dependent_concept": "AD-KS2-C001",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS2 drawing mastery directly builds on the foundational drawing skills and mark-making established at KS1."
    },
    {
      "prerequisite_concept": "AD-KS1-C003",
      "dependent_concept": "AD-KS2-C002",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS2 painting mastery extends the colour exploration and paint handling introduced at KS1."
    },
    {
      "prerequisite_concept": "AD-KS1-C004",
      "dependent_concept": "AD-KS2-C003",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS2 sculpture mastery builds on the three-dimensional making and material exploration begun at KS1."
    },
    {
      "prerequisite_concept": "AD-KS2-C001",
      "dependent_concept": "AD-KS2-C004",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.7,
      "rationale": "Drawing skills are the primary mode of recording and developing ideas in sketchbooks, making drawing ability a prerequisite for effective sketchbook use."
    },
    {
      "prerequisite_concept": "AD-KS1-C006",
      "dependent_concept": "AD-KS2-C005",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "KS1 knowledge of artists and their practices provides the foundation for the more historically situated and analytically rigorous study of art history at KS2."
    },
    {
      "prerequisite_concept": "AD-KS2-C004",
      "dependent_concept": "AD-KS2-C006",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.65,
      "rationale": "Sketchbook practice provides the iterative space and reflective habit of mind in which purposeful creative experimentation can develop."
    }
  ]
}
