{
  "metadata": {
    "subject": "Design and Technology",
    "key_stage": "KS2",
    "years_covered": [3, 4, 5, 6],
    "document_reference": "DFE-00172-2013",
    "extraction_date": "2026-02-17",
    "structure_rating": 8
  },
  "domains": [
    {
      "domain_id": "DT-KS2-D001",
      "domain_name": "Design",
      "description": "Using research and design criteria to generate and communicate ideas for innovative, functional and appealing products using advanced representations including annotated sketches, diagrams and computer-aided design.",
      "curriculum_context": "At KS2, the design domain requires pupils to conduct research to understand user needs and to use that research to inform the development of design criteria. Pupils move beyond simple drawing to use annotated sketches, cross-sectional and exploded diagrams, prototypes, pattern pieces and computer-aided design as communication tools. The progression from KS1 is marked by the introduction of research, the explicit consideration of specific target users or groups, and the use of more sophisticated visual communication methods. Pupils learn that effective design is evidence-based and user-centred, and that design ideas need to be communicated clearly enough to be made by others.",
      "is_cross_cutting": false,
      "structure_type": "process"
    },
    {
      "domain_id": "DT-KS2-D002",
      "domain_name": "Make",
      "description": "Selecting from and accurately using a wider range of tools, equipment and materials including those with specific functional properties and aesthetic qualities.",
      "curriculum_context": "The make domain at KS2 extends pupils' practical skills to include more complex tools, equipment and processes, and introduces the concept of accuracy as a design requirement. Pupils select from a wider range of materials considering both their functional properties (strength, flexibility, conductivity) and their aesthetic qualities (colour, texture, pattern), demonstrating more sophisticated material knowledge. The emphasis on accuracy reflects the increased complexity of KS2 products and the expectation that pupils can execute their designs with precision. Practical skills are developed in the context of purposeful making across different material areas.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "DT-KS2-D003",
      "domain_name": "Evaluate",
      "description": "Investigating and analysing existing products, evaluating their own work against design criteria, considering others' views, and understanding how key events and individuals have shaped design and technology.",
      "curriculum_context": "The evaluate domain at KS2 becomes more analytically rigorous, requiring pupils to investigate and analyse existing products in depth. Pupils evaluate their own work against design criteria and also consider the views of others, introducing the concept of user feedback as part of the design process. A distinctive addition at KS2 is the requirement to understand how key events and individuals in design and technology have helped shape the world, giving pupils historical and cultural perspective on the subject. This domain develops pupils' ability to think critically about products, processes and the broader impact of design and technology on society.",
      "is_cross_cutting": false,
      "structure_type": "process"
    },
    {
      "domain_id": "DT-KS2-D004",
      "domain_name": "Technical Knowledge",
      "description": "Understanding and applying principles of structural engineering, mechanical and electrical systems, and computing control in the design and making of complex products.",
      "curriculum_context": "Technical knowledge at KS2 becomes substantially more complex, building on KS1 structural and mechanical exploration to include electrical systems and computing control. Pupils apply understanding of how to strengthen, stiffen and reinforce complex structures, and learn to use mechanical systems including gears, pulleys, cams, levers and linkages. The introduction of electrical systems - series circuits incorporating switches, bulbs, buzzers and motors - enables pupils to create products with active components. The requirement to apply understanding of computing to program, monitor and control products connects design and technology to the computing curriculum and introduces pupils to the principle of embedded intelligence in designed objects.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "DT-KS2-D005",
      "domain_name": "Cooking and Nutrition",
      "description": "Understanding and applying the principles of a healthy and varied diet through cooking and learning about seasonality and ingredient sources.",
      "curriculum_context": "At KS2, the cooking and nutrition domain deepens pupils' knowledge of nutrition and their practical cooking skills. Pupils understand and apply the principles of a healthy and varied diet to make informed food choices, and they prepare and cook a variety of predominantly savoury dishes using a range of cooking techniques. Understanding seasonality is introduced, helping pupils to connect food production to environmental and agricultural cycles and to understand why certain foods are only available at certain times of year. Knowledge of where and how ingredients are grown, reared, caught and processed gives pupils a more complete picture of the food system from production to consumption.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    }
  ],
  "objectives": [
    {
      "objective_id": "DT-KS2-O001",
      "domain_id": "DT-KS2-D001",
      "objective_text": "use research and develop design criteria to inform the design of innovative, functional, appealing products that are fit for purpose, aimed at particular individuals or groups",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS2-O002",
      "domain_id": "DT-KS2-D001",
      "objective_text": "generate, develop, model and communicate their ideas through discussion, annotated sketches, cross-sectional and exploded diagrams, prototypes, pattern pieces and computer-aided design",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS2-O003",
      "domain_id": "DT-KS2-D002",
      "objective_text": "select from and use a wider range of tools and equipment to perform practical tasks [for example, cutting, shaping, joining and finishing], accurately",
      "non_statutory_guidance": null,
      "examples": "cutting, shaping, joining and finishing",
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS2-O004",
      "domain_id": "DT-KS2-D002",
      "objective_text": "select from and use a wider range of materials and components, including construction materials, textiles and ingredients, according to their functional properties and aesthetic qualities",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS2-O005",
      "domain_id": "DT-KS2-D003",
      "objective_text": "investigate and analyse a range of existing products",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS2-O006",
      "domain_id": "DT-KS2-D003",
      "objective_text": "evaluate their ideas and products against their own design criteria and consider the views of others to improve their work",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS2-O007",
      "domain_id": "DT-KS2-D003",
      "objective_text": "understand how key events and individuals in design and technology have helped shape the world",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS2-O008",
      "domain_id": "DT-KS2-D004",
      "objective_text": "apply their understanding of how to strengthen, stiffen and reinforce more complex structures",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS2-O009",
      "domain_id": "DT-KS2-D004",
      "objective_text": "understand and use mechanical systems in their products [for example, gears, pulleys, cams, levers and linkages]",
      "non_statutory_guidance": null,
      "examples": "gears, pulleys, cams, levers and linkages",
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS2-O010",
      "domain_id": "DT-KS2-D004",
      "objective_text": "understand and use electrical systems in their products [for example, series circuits incorporating switches, bulbs, buzzers and motors]",
      "non_statutory_guidance": null,
      "examples": "series circuits incorporating switches, bulbs, buzzers and motors",
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS2-O011",
      "domain_id": "DT-KS2-D004",
      "objective_text": "apply their understanding of computing to program, monitor and control their products",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS2-O012",
      "domain_id": "DT-KS2-D005",
      "objective_text": "understand and apply the principles of a healthy and varied diet",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS2-O013",
      "domain_id": "DT-KS2-D005",
      "objective_text": "prepare and cook a variety of predominantly savoury dishes using a range of cooking techniques",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "DT-KS2-O014",
      "domain_id": "DT-KS2-D005",
      "objective_text": "understand seasonality, and know where and how a variety of ingredients are grown, reared, caught and processed",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "DT-KS2-C001",
      "concept_name": "Research-Informed Design",
      "description": "At KS2, effective design is grounded in research that identifies the needs, preferences and constraints relevant to a product. Research may involve interviewing potential users, examining existing products, investigating materials, or exploring relevant contexts. The findings from research are used to develop design criteria that shape the design process and provide the basis for evaluation.",
      "teaching_guidance": "Teach pupils to conduct structured research before designing - this could include interviews with target users, surveys, product analysis or contextual investigation. Model how to translate research findings into design criteria. Show examples of real product development processes where research has informed design. Provide structured templates that connect research findings to design decisions. Discuss what makes a product 'fit for purpose' in terms of user needs.",
      "key_vocabulary": "research, user need, target user, design brief, design criteria, fit for purpose, context, investigate, analyse, inform",
      "common_misconceptions": "Pupils may begin designing before completing meaningful research. Establishing the design brief and research phase as required steps prevents this. Some pupils conflate research with simply looking at existing products without identifying specific needs or constraints.",
      "concept_type": "process",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "DT-KS2-C002",
      "concept_name": "Technical Drawing and Design Communication",
      "description": "Technical drawing involves representing design ideas using conventions that communicate information about how a product looks, how it is constructed and how its parts relate to each other. At KS2, pupils learn to use annotated sketches, cross-sectional diagrams, exploded diagrams, pattern pieces and computer-aided design to communicate their ideas clearly and accurately to others who will make or evaluate the product.",
      "teaching_guidance": "Teach specific drawing conventions including labelling, dimensioning and cross-sections. Practice exploded diagrams to show how components fit together. Introduce appropriate computer-aided design tools for generating and presenting design ideas. Discuss why designers need to communicate their ideas clearly to others, such as when a design is made by someone other than the designer. Compare technical drawings with artistic drawings to highlight different purposes.",
      "key_vocabulary": "annotated sketch, cross-section, exploded diagram, prototype, pattern piece, computer-aided design, dimension, label, scale, proportion",
      "common_misconceptions": "Pupils may treat all drawing in DT as artistic expression rather than technical communication. Establishing that technical drawing has specific conventions and purposes helps. Some pupils may find exploded and cross-sectional diagrams conceptually challenging; building up from physical disassembly of real objects helps develop the mental model.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "DT-KS2-C003",
      "concept_name": "Advanced Mechanical Systems",
      "description": "Mechanical systems use physical components to transmit, redirect or transform motion and force. At KS2, pupils extend their KS1 knowledge of levers, sliders and wheels to include gears, pulleys, cams and linkages, understanding how these more complex mechanisms change the speed, direction and type of movement in a product. Pupils apply this knowledge by incorporating appropriate mechanisms into their own designed products.",
      "teaching_guidance": "Use construction kits with gear systems to explore how gear ratios affect speed. Investigate pulley systems to explore how they multiply force. Examine cams of different shapes and how they produce different patterns of movement. Study real products that use these mechanisms - clocks, bicycles, engines. Challenge pupils to design products that require a specific type of movement and to select an appropriate mechanism to achieve it.",
      "key_vocabulary": "gear, pulley, cam, linkage, lever, rotation, linear motion, oscillation, gear ratio, input motion, output motion, crank, mechanism",
      "common_misconceptions": "Pupils may confuse gears of different sizes without understanding that larger gears rotate more slowly than smaller ones when meshed. Hands-on investigation with real gear systems is essential. Pupils may not understand that cams produce different patterns of movement depending on their shape - this requires practical investigation of various cam profiles.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "DT-KS2-C004",
      "concept_name": "Electrical Systems and Series Circuits",
      "description": "Electrical systems use the flow of electrical current through components to produce light, sound, heat or movement. At KS2, pupils learn to design and build series circuits incorporating switches, bulbs, buzzers and motors, understanding how these can be used to add active functionality to a designed product. This concept bridges design and technology with science, as understanding of circuits is developed in both subjects.",
      "teaching_guidance": "Connect to science circuits work by applying electrical knowledge in DT contexts. Build working series circuits as part of product designs - a lit-up toy, a burglar alarm, a motorised vehicle. Teach pupils to represent circuits using standard circuit symbols and to plan their circuits before building. Investigate the effect of adding more bulbs in series. Discuss how electrical components are incorporated in real products and what safety considerations apply.",
      "key_vocabulary": "circuit, series, component, switch, bulb, buzzer, motor, battery, current, conductor, insulator, symbol, diagram",
      "common_misconceptions": "Pupils may not understand that all components in a series circuit must be connected for current to flow, leading to confusion when a broken circuit does not work. Physical construction of circuits reinforces this concept better than diagrams alone. Pupils may confuse the functions of different output components (bulb gives light, buzzer gives sound, motor gives movement).",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": true
    },
    {
      "concept_id": "DT-KS2-C005",
      "concept_name": "Computing Control in Products",
      "description": "Computing can be applied to design and technology to create products that sense inputs, process information and control outputs. At KS2, pupils apply their understanding of programming to program, monitor and control their products, using components such as sensors, microcontrollers and actuators. This concept introduces the idea that modern products often contain embedded software that makes them intelligent and responsive.",
      "teaching_guidance": "Use programmable microcontrollers such as micro:bit, Arduino or similar platforms suited to primary pupils. Set projects where pupils program a device to respond to sensor input - lighting an LED when it gets dark, making a motor stop when a button is pressed. Connect programming tasks to the DT design process - pupils should design what their product will do, then program it to achieve that function. Evaluate how well the program meets the design criteria.",
      "key_vocabulary": "program, control, sensor, actuator, microcontroller, input, output, condition, sequence, monitor, automate, code",
      "common_misconceptions": "Pupils may see computing control as separate from DT rather than as an integrated part of product design. Framing programming tasks as part of the design-make-evaluate cycle maintains this connection. Some pupils may struggle with the abstraction of programming; physical computing with immediate, visible outputs (LEDs, motors) helps make the logic concrete.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": true
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "DT-KS1-C001",
      "dependent_concept": "DT-KS2-C001",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS2 research-informed design builds directly on the iterative design process introduced at KS1, extending it with the explicit research and user analysis phase."
    },
    {
      "prerequisite_concept": "DT-KS1-C005",
      "dependent_concept": "DT-KS2-C003",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS2 advanced mechanical systems directly extend the KS1 knowledge of levers, sliders, wheels and axles with more complex mechanisms such as gears, pulleys and cams."
    },
    {
      "prerequisite_concept": "DT-KS2-C003",
      "dependent_concept": "DT-KS2-C004",
      "confidence": "inferred",
      "relationship_type": "logical",
      "strength": 0.5,
      "rationale": "Both mechanical and electrical systems are used to add functionality to products; understanding mechanical systems provides a conceptual framework for understanding how other systems transform inputs to outputs."
    },
    {
      "prerequisite_concept": "DT-KS2-C004",
      "dependent_concept": "DT-KS2-C005",
      "confidence": "inferred",
      "relationship_type": "logical",
      "strength": 0.7,
      "rationale": "Computing control often operates by switching electrical components on and off; understanding how electrical circuits work provides the physical context for understanding what a program is controlling."
    }
  ]
}
