{
  "metadata": {
    "subject": "English",
    "key_stage": "KS2",
    "years_covered": [6],
    "document_reference": "DFE-00174-2013",
    "extraction_date": "2026-02-16",
    "structure_rating": 9,
    "notes": "Year 6 is the final year of Upper Key Stage 2 and the culmination of primary English. The programme of study is published as a combined Years 5 and 6 document. Content in this extraction represents the Year 6 lens, with grammar specifically identified in Appendix 2 as Year 6 statutory content building on Year 5 content. By end of Year 6, pupils' English must be sufficiently fluent and effortless to manage the general demands of secondary school across all subjects. Prerequisites reference Year 5 concepts (EN-Y5-C###). Source PDF: English_KS1-2_2014.pdf (September 2013 document)."
  },
  "domains": [
    {
      "domain_id": "EN-Y6-D001",
      "domain_name": "Spoken Language",
      "description": "Extending command of spoken language through public speaking, debate, performance and formal discussion (statutory for all years 1–6).",
      "curriculum_context": "By Year 6, the spoken language programme reaches its primary culmination: pupils are expected to demonstrate confident, assured command of language across the full range of contexts specified since Year 1, with a particular emphasis on public speaking, performance and debate that is named specifically for upper KS2. The curriculum states that pupils' confidence, enjoyment and mastery of language should be extended through these modes, signalling that Year 6 is a year for consolidation and showcasing, not merely incremental development. Pupils at this stage should be selecting and using appropriate registers with conscious control — a skill that directly mirrors the formal/informal distinction introduced in Year 6 grammar. The spoken language requirements cross-cut all subjects: pupils use spoken language to explore ideas, to evaluate, to report on learning and to persuade, providing the oral scaffolding for the complex written tasks of secondary school. Teachers should ensure that formal oracy opportunities are genuinely stretching, with pupils receiving explicit feedback on the quality and effectiveness of their communication, preparing them for the extended discussion, essay-based argument and examination oral components of secondary education.",
      "is_cross_cutting": true,
      "structure_type": "developmental"
    },
    {
      "domain_id": "EN-Y6-D002",
      "domain_name": "Reading - Word Reading",
      "description": "Applying morphological and etymological knowledge to read aloud fluently and to understand the meaning of unfamiliar words encountered across subjects.",
      "curriculum_context": "In Year 6, word reading as a distinct domain has effectively merged with vocabulary development: the curriculum assumes that for all but the very small number of pupils with decoding difficulties, there is no need for direct word reading instruction, and these pupils must follow the upper KS2 programme while receiving additional phonics support. The key Year 6 expectation is that pupils apply morphological and etymological knowledge automatically and flexibly across all subjects, not just in English lessons, enabling them to decode the specialist vocabulary of history, geography, science and mathematics without explicit teaching of every new word. The non-statutory guidance notes that vocabulary encountered across subjects should be treated as opportunity, not obstacle — teachers draw pupils' attention to new vocabulary, its pronunciation and its meaning. By Year 6, reading itself should be 'effortless' in terms of decoding, freeing cognitive resources entirely for comprehension and critical engagement, which is the core reading demand of secondary school. This domain also underpins the Year 6 grammar objective about formal vocabulary, since understanding morphology helps pupils recognise when a Latinate word is more formal than its Anglo-Saxon equivalent.",
      "is_cross_cutting": false,
      "structure_type": "sequential"
    },
    {
      "domain_id": "EN-Y6-D003",
      "domain_name": "Reading - Comprehension",
      "description": "Advanced comprehension including critical evaluation of authorial choices, analysis of formal and informal registers, formal presentations and debates, and preparation for secondary English demands.",
      "curriculum_context": "Year 6 reading comprehension represents the culmination of the primary programme and is explicitly designed to prepare pupils for secondary school. The curriculum states that by the end of Year 6, pupils' reading and writing should be 'sufficiently fluent and effortless for them to manage the general demands of the curriculum in Year 7, across all subjects'. All the comprehension skills developed from Year 1 onwards — inference, prediction, summarisation, retrieval, language analysis — are now applied to increasingly complex texts with high independence. The distinctively Year 6 dimension is the expectation of formal critical engagement: pupils evaluate authors' language choices (including figurative language), compare across texts, distinguish fact from opinion, present understanding through formal debate, and provide reasoned justifications for their views. The non-statutory guidance names specific technical terms pupils must know at this stage: metaphor, simile, analogy, imagery, style and effect — terms that are foundational for GCSE English Language and Literature. Teachers prepare pupils for secondary assessment by requiring the kind of sustained analytical response to text that will be assessed at GCSE, supporting pupils in making and defending interpretations with textual evidence.",
      "is_cross_cutting": false,
      "structure_type": "developmental"
    },
    {
      "domain_id": "EN-Y6-D004",
      "domain_name": "Writing - Transcription (Spelling)",
      "description": "Completing the primary spelling programme including the Years 5 and 6 statutory word list, complex suffix patterns, silent letters, homophones, and full integration of morphological and etymological spelling strategies.",
      "curriculum_context": "By Year 6, spelling instruction reaches its primary completion point: pupils are expected to have secured all the patterns and rules introduced across KS1 and KS2 and to spell the complete statutory word list for Years 5 and 6 accurately. The Year 6 emphasis is on consolidation, integration and automaticity — spelling should no longer consume conscious attention that should be free for composition. The curriculum is clear that knowledge of morphology and etymology is the primary spelling strategy at this level, supporting pupils in making principled decisions about unfamiliar words rather than relying purely on memory. Homophones and commonly confused words become increasingly subtle at Year 6 (device/devise; licence/license; prophecy/prophesy), reflecting the range of vocabulary pupils encounter across their reading. The non-statutory guidance notes that pupils should use dictionaries to check and confirm spellings and should use a thesaurus to develop vocabulary — with these reference tools becoming habitual instruments of self-correction and enrichment rather than emergency resources. Correct spelling is positioned as a dimension of meaning-making, not merely surface accuracy: misspelling homophones, for example, can change meaning entirely.",
      "is_cross_cutting": false,
      "structure_type": "sequential"
    },
    {
      "domain_id": "EN-Y6-D005",
      "domain_name": "Writing - Transcription (Handwriting and Presentation)",
      "description": "Fluent, legible, fast handwriting with confident personal style; appropriate choice of joined and unjoined styles for different tasks and purposes.",
      "curriculum_context": "By Year 6, the curriculum expects that handwriting is sufficiently fluent and fast that it no longer presents any barrier to composition. The Year 6 handwriting objectives are identical to Year 5's (this is a combined Years 5 and 6 programme), but the expectation of automaticity and personal style is higher. Pupils should be choosing letter shapes and joins with confident personal judgement — understanding that handwriting, like other aspects of writing, involves contextually appropriate choices. The curriculum explicitly teaches that unjoined styles are appropriate and professional in certain contexts (labelling, algebra, capital letters, email addresses), preventing the misunderstanding that joined cursive is always the 'correct' form. In Year 6, presentation extends to understanding what is appropriate for a high-stakes piece of writing (such as a final published version) versus a quick note or planning draft. This metacognitive awareness of presentation standards is directly transferable to secondary school where written examination answers, coursework and personal notes have different presentation requirements.",
      "is_cross_cutting": false,
      "structure_type": "developmental"
    },
    {
      "domain_id": "EN-Y6-D006",
      "domain_name": "Writing - Composition",
      "description": "Planning, drafting and producing polished narratives and non-fiction writing for clearly defined audiences and purposes, with sophisticated cohesion, precise vocabulary, and evidence of authorial control.",
      "curriculum_context": "Year 6 writing composition is where all threads of the primary programme converge: pupils should be composing with sufficient fluency and control that they can concentrate on making deliberate authorial choices rather than managing the mechanics of writing. The curriculum's aspiration for Year 6 is that pupils can 'consciously control sentence structure in their writing and understand why sentences are constructed as they are' — a metacognitive standard that requires not just doing but understanding. Pupils are expected to produce writing that reflects genuine awareness of audience and purpose: selecting vocabulary and grammar consciously for effect, using a wide range of cohesive devices including the sophisticated ones introduced in Year 6 grammar (ellipsis, grammatical connections, repetition for effect), and evaluating and editing their own work critically against the criteria of effectiveness for the intended reader. The composition programme also includes performing compositions — foregrounding the oral-written relationship — and the expectation of proof-reading that is thorough and systematic. The plan-draft-evaluate-edit cycle, which began in Year 1, reaches its most sophisticated form here, with pupils expected to move fluently between all stages and to understand each stage's purpose.",
      "is_cross_cutting": false,
      "structure_type": "developmental"
    },
    {
      "domain_id": "EN-Y6-D007",
      "domain_name": "Writing - Vocabulary, Grammar and Punctuation",
      "description": "Completing the primary grammar programme with Year 6-specific content: formal vocabulary and register, passive voice, synonyms and antonyms, advanced cohesive devices including ellipsis, layout devices, and the full range of advanced punctuation (semi-colons, colons, hyphens, bullet points).",
      "curriculum_context": "Year 6 grammar and punctuation teaching introduces the final cohort of statutory grammatical content before secondary school. The Year 6-specific Appendix 2 content covers: the difference between informal and formal vocabulary (finding/discovering, asking/requesting); synonyms and antonyms; the passive voice; formal versus informal structures including subjunctive forms (If I were, Were they to come); advanced cohesive devices across paragraphs (repetition, grammatical connections, ellipsis); and layout devices (headings, sub-headings, columns, bullets, tables). Year 6 punctuation content includes semi-colons, colons and dashes for clause boundaries, colons to introduce lists and semi-colons within lists, bullet point punctuation, and hyphens to avoid ambiguity — completing a repertoire that encompasses every major punctuation mark of written English. The Year 6 grammatical terminology set adds subject, object, active, passive, synonym, antonym, ellipsis, hyphen, colon, semi-colon and bullet points to all previously learnt terms. This comprehensive grammatical knowledge prepares pupils for GCSE assessments in both English Language (where understanding of grammar and punctuation choices is assessed) and English Literature (where understanding of authorial choices including syntax and punctuation is required).",
      "is_cross_cutting": false,
      "structure_type": "hierarchical"
    }
  ],
  "objectives": [
    {
      "objective_id": "EN-Y6-O001",
      "domain_id": "EN-Y6-D001",
      "objective_text": "listen and respond appropriately to adults and their peers",
      "non_statutory_guidance": "Pupils should be taught to develop their competence in spoken language and listening to enhance the effectiveness with which they are able to communicate across a range of contexts and to a range of audiences. They should therefore have opportunities to work in groups of different sizes – in pairs, small groups, large groups and as a whole class.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O002",
      "domain_id": "EN-Y6-D001",
      "objective_text": "ask relevant questions to extend their understanding and knowledge",
      "non_statutory_guidance": "Pupils should understand how to take turns and when and how to participate constructively in conversations and debates.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O003",
      "domain_id": "EN-Y6-D001",
      "objective_text": "use relevant strategies to build their vocabulary",
      "non_statutory_guidance": "Attention should also be paid to increasing pupils' vocabulary, ranging from describing their immediate world and feelings to developing a broader, deeper and richer vocabulary to discuss abstract concepts and a wider range of topics, and to enhancing their knowledge about language as a whole.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O004",
      "domain_id": "EN-Y6-D001",
      "objective_text": "articulate and justify answers, arguments and opinions",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O005",
      "domain_id": "EN-Y6-D001",
      "objective_text": "give well-structured descriptions, explanations and narratives for different purposes, including for expressing feelings",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O006",
      "domain_id": "EN-Y6-D001",
      "objective_text": "maintain attention and participate actively in collaborative conversations, staying on topic and initiating and responding to comments",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O007",
      "domain_id": "EN-Y6-D001",
      "objective_text": "use spoken language to develop understanding through speculating, hypothesising, imagining and exploring ideas",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O008",
      "domain_id": "EN-Y6-D001",
      "objective_text": "speak audibly and fluently with an increasing command of Standard English",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O009",
      "domain_id": "EN-Y6-D001",
      "objective_text": "participate in discussions, presentations, performances, role play, improvisations and debates",
      "non_statutory_guidance": "In years 5 and 6, pupils' confidence, enjoyment and mastery of language should be extended through public speaking, performance and debate.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O010",
      "domain_id": "EN-Y6-D001",
      "objective_text": "gain, maintain and monitor the interest of the listener(s)",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O011",
      "domain_id": "EN-Y6-D001",
      "objective_text": "consider and evaluate different viewpoints, attending to and building on the contributions of others",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O012",
      "domain_id": "EN-Y6-D001",
      "objective_text": "select and use appropriate registers for effective communication",
      "non_statutory_guidance": "These statements apply to all years. The content should be taught at a level appropriate to the age of the pupils. Pupils should build on the oral language skills that have been taught in preceding years. Pupils should receive constructive feedback on their spoken language and listening, not only to improve their knowledge and skills but also to establish secure foundations for effective spoken language in their studies at primary school, helping them to achieve in secondary education and beyond.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O013",
      "domain_id": "EN-Y6-D002",
      "objective_text": "apply their growing knowledge of root words, prefixes and suffixes (morphology and etymology), as listed in English Appendix 1, both to read aloud and to understand the meaning of new words that they meet",
      "non_statutory_guidance": "At this stage, there should be no need for further direct teaching of word reading skills for almost all pupils. If pupils are struggling or failing in this, the reasons for this should be investigated. It is imperative that pupils are taught to read during their last two years at primary school if they enter year 5 not being able to do so. Pupils should be encouraged to work out any unfamiliar word. They should focus on all the letters in a word so that they do not, for example, read 'invitation' for 'imitation' simply because they might be more familiar with the first word. Accurate reading of individual words, which might be key to the meaning of a sentence or paragraph, improves comprehension. When teachers are reading with or to pupils, attention should be paid to new vocabulary – both a word's meaning(s) and its correct pronunciation.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O014",
      "domain_id": "EN-Y6-D003",
      "objective_text": "maintain positive attitudes to reading and understanding of what they read by: continuing to read and discuss an increasingly wide range of fiction, poetry, plays, non-fiction and reference books or textbooks",
      "non_statutory_guidance": "Even though pupils can now read independently, reading aloud to them should include whole books so that they meet books and authors that they might not choose to read themselves.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O015",
      "domain_id": "EN-Y6-D003",
      "objective_text": "maintain positive attitudes to reading and understanding of what they read by: reading books that are structured in different ways and reading for a range of purposes",
      "non_statutory_guidance": "The knowledge and skills that pupils need in order to comprehend are very similar at different ages. Pupils should continue to apply what they have already learnt to more complex writing.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O016",
      "domain_id": "EN-Y6-D003",
      "objective_text": "maintain positive attitudes to reading and understanding of what they read by: increasing their familiarity with a wide range of books, including myths, legends and traditional stories, modern fiction, fiction from our literary heritage, and books from other cultures and traditions",
      "non_statutory_guidance": "Pupils should be taught to recognise themes in what they read, such as loss or heroism. They should have opportunities to compare characters, consider different accounts of the same event and discuss viewpoints (both of authors and of fictional characters), within a text and across more than one text. They should continue to learn the conventions of different types of writing, such as the use of the first person in writing diaries and autobiographies.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O017",
      "domain_id": "EN-Y6-D003",
      "objective_text": "maintain positive attitudes to reading and understanding of what they read by: recommending books that they have read to their peers, giving reasons for their choices",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O018",
      "domain_id": "EN-Y6-D003",
      "objective_text": "maintain positive attitudes to reading and understanding of what they read by: identifying and discussing themes and conventions in and across a wide range of writing",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O019",
      "domain_id": "EN-Y6-D003",
      "objective_text": "maintain positive attitudes to reading and understanding of what they read by: making comparisons within and across books",
      "non_statutory_guidance": "Pupils should be shown how to compare characters, settings, themes and other aspects of what they read.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O020",
      "domain_id": "EN-Y6-D003",
      "objective_text": "maintain positive attitudes to reading and understanding of what they read by: learning a wider range of poetry by heart",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O021",
      "domain_id": "EN-Y6-D003",
      "objective_text": "maintain positive attitudes to reading and understanding of what they read by: preparing poems and plays to read aloud and to perform, showing understanding through intonation, tone and volume so that the meaning is clear to an audience",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O022",
      "domain_id": "EN-Y6-D003",
      "objective_text": "understand what they read by: checking that the book makes sense to them, discussing their understanding and exploring the meaning of words in context",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O023",
      "domain_id": "EN-Y6-D003",
      "objective_text": "understand what they read by: asking questions to improve their understanding",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O024",
      "domain_id": "EN-Y6-D003",
      "objective_text": "understand what they read by: drawing inferences such as inferring characters' feelings, thoughts and motives from their actions, and justifying inferences with evidence",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O025",
      "domain_id": "EN-Y6-D003",
      "objective_text": "understand what they read by: predicting what might happen from details stated and implied",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O026",
      "domain_id": "EN-Y6-D003",
      "objective_text": "understand what they read by: summarising the main ideas drawn from more than one paragraph, identifying key details that support the main ideas",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O027",
      "domain_id": "EN-Y6-D003",
      "objective_text": "understand what they read by: identifying how language, structure and presentation contribute to meaning",
      "non_statutory_guidance": "Pupils should be taught the technical and other terms needed for discussing what they hear and read, such as metaphor, simile, analogy, imagery, style and effect.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O028",
      "domain_id": "EN-Y6-D003",
      "objective_text": "discuss and evaluate how authors use language, including figurative language, considering the impact on the reader",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O029",
      "domain_id": "EN-Y6-D003",
      "objective_text": "distinguish between statements of fact and opinion",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O030",
      "domain_id": "EN-Y6-D003",
      "objective_text": "retrieve, record and present information from non-fiction",
      "non_statutory_guidance": "In using reference books, pupils need to know what information they need to look for before they begin and need to understand the task. They should be shown how to use contents pages and indexes to locate information. The skills of information retrieval that are taught should be applied, for example, in reading history, geography and science textbooks, and in contexts where pupils are genuinely motivated to find out information, for example, reading information leaflets before a gallery or museum visit or reading a theatre programme or review. Teachers should consider making use of any library services and expertise to support this.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O031",
      "domain_id": "EN-Y6-D003",
      "objective_text": "participate in discussions about books that are read to them and those they can read for themselves, building on their own and others' ideas and challenging views courteously",
      "non_statutory_guidance": "Pupils should have guidance about and feedback on the quality of their explanations and contributions to discussions.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O032",
      "domain_id": "EN-Y6-D003",
      "objective_text": "explain and discuss their understanding of what they have read, including through formal presentations and debates, maintaining a focus on the topic and using notes where necessary",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O033",
      "domain_id": "EN-Y6-D003",
      "objective_text": "provide reasoned justifications for their views",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O034",
      "domain_id": "EN-Y6-D004",
      "objective_text": "use further prefixes and suffixes and understand the guidance for adding them",
      "non_statutory_guidance": "As in earlier years, pupils should continue to be taught to understand and apply the concepts of word structure so that they can draw on their knowledge of morphology and etymology to spell correctly.",
      "examples": "Converting nouns or adjectives into verbs using suffixes [for example, –ate; –ise; –ify]. Verb prefixes [for example, dis–, de–, mis–, over– and re–].",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O035",
      "domain_id": "EN-Y6-D004",
      "objective_text": "spell some words with 'silent' letters [for example, knight, psalm, solemn]",
      "non_statutory_guidance": "Some letters which are no longer sounded used to be sounded hundreds of years ago: e.g. in knight, there was a /k/ sound before the /n/, and the gh used to represent the sound that 'ch' now represents in the Scottish word loch.",
      "examples": "doubt, island, lamb, solemn, thistle, knight",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O036",
      "domain_id": "EN-Y6-D004",
      "objective_text": "continue to distinguish between homophones and other words which are often confused",
      "non_statutory_guidance": "In the pairs of words opposite, nouns end –ce and verbs end –se. Advice and advise provide a useful clue as the word advise (verb) is pronounced with a /z/ sound – which could not be spelt c.",
      "examples": "advice/advise, device/devise, licence/license, practice/practise, prophecy/prophesy; affect/effect; stationary/stationery; principal/principle; steal/steel; who's/whose; past/passed; precede/proceed",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O037",
      "domain_id": "EN-Y6-D004",
      "objective_text": "use knowledge of morphology and etymology in spelling and understand that the spelling of some words needs to be learnt specifically, as listed in English Appendix 1",
      "non_statutory_guidance": "bicycle is cycle (from the Greek for wheel) with bi– (meaning 'two') before it. medicine is related to medical so the /s/ sound is spelt as c. opposite is related to oppose, so the schwa sound in opposite is spelt as o.",
      "examples": "The statutory word list for Years 5 and 6 includes: accommodate, accompany, according, achieve, aggressive, amateur, ancient, apparent, appreciate, attached, available, average, awkward, bargain, bruise, category, cemetery, committee, communicate, community, competition, conscience, conscious, controversy, convenience, correspond, criticise, curiosity, definite, desperate, determined, develop, dictionary, disastrous, embarrass, environment, equip, especially, exaggerate, excellent, existence, explanation, familiar, foreign, forty, frequently, government, guarantee, harass, hindrance, identity, immediate, individual, interfere, interrupt, language, leisure, lightning, marvellous, mischievous, muscle, necessary, neighbour, nuisance, occupy, occur, phenomenon, prejudice, privilege, profession, programme, pronunciation, queue, recognise, recommend, relevant, restaurant, rhyme, rhythm, sacrifice, secretary, shoulder, signature, sincere(ly), soldier, stomach, sufficient, suggest, symbol, system, temperature, thorough, twelfth, variety, vegetable, vehicle, yacht",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O038",
      "domain_id": "EN-Y6-D004",
      "objective_text": "use dictionaries to check the spelling and meaning of words",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O039",
      "domain_id": "EN-Y6-D004",
      "objective_text": "use the first three or four letters of a word to check spelling, meaning or both of these in a dictionary",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O040",
      "domain_id": "EN-Y6-D004",
      "objective_text": "use a thesaurus",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O041",
      "domain_id": "EN-Y6-D005",
      "objective_text": "write legibly, fluently and with increasing speed by: choosing which shape of a letter to use when given choices and deciding whether or not to join specific letters",
      "non_statutory_guidance": "Pupils should continue to practise handwriting and be encouraged to increase the speed of it, so that problems with forming letters do not get in the way of their writing down what they want to say. They should be clear about what standard of handwriting is appropriate for a particular task, for example, quick notes or a final handwritten version. They should also be taught to use an unjoined style, for example, for labelling a diagram or data, writing an email address, or for algebra and capital letters, for example, for filling in a form.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O042",
      "domain_id": "EN-Y6-D005",
      "objective_text": "write legibly, fluently and with increasing speed by: choosing the writing implement that is best suited for a task",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O043",
      "domain_id": "EN-Y6-D006",
      "objective_text": "plan their writing by: identifying the audience for and purpose of the writing, selecting the appropriate form and using other similar writing as models for their own",
      "non_statutory_guidance": "Pupils should understand, through being shown, the skills and processes essential for writing: that is, thinking aloud to generate ideas, drafting, and re-reading to check that the meaning is clear.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O044",
      "domain_id": "EN-Y6-D006",
      "objective_text": "plan their writing by: noting and developing initial ideas, drawing on reading and research where necessary",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O045",
      "domain_id": "EN-Y6-D006",
      "objective_text": "plan their writing by: in writing narratives, considering how authors have developed characters and settings in what pupils have read, listened to or seen performed",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O046",
      "domain_id": "EN-Y6-D006",
      "objective_text": "draft and write by: selecting appropriate grammar and vocabulary, understanding how such choices can change and enhance meaning",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O047",
      "domain_id": "EN-Y6-D006",
      "objective_text": "draft and write by: in narratives, describing settings, characters and atmosphere and integrating dialogue to convey character and advance the action",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O048",
      "domain_id": "EN-Y6-D006",
      "objective_text": "draft and write by: précising longer passages",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O049",
      "domain_id": "EN-Y6-D006",
      "objective_text": "draft and write by: using a wide range of devices to build cohesion within and across paragraphs",
      "non_statutory_guidance": null,
      "examples": "Linking ideas across paragraphs using a wider range of cohesive devices: repetition of a word or phrase, grammatical connections [for example, the use of adverbials such as on the other hand, in contrast, or as a consequence], and ellipsis.",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O050",
      "domain_id": "EN-Y6-D006",
      "objective_text": "draft and write by: using further organisational and presentational devices to structure text and to guide the reader [for example, headings, bullet points, underlining]",
      "non_statutory_guidance": null,
      "examples": "Layout devices [for example, headings, sub-headings, columns, bullets, or tables, to structure text].",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O051",
      "domain_id": "EN-Y6-D006",
      "objective_text": "evaluate and edit by: assessing the effectiveness of their own and others' writing",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O052",
      "domain_id": "EN-Y6-D006",
      "objective_text": "evaluate and edit by: proposing changes to vocabulary, grammar and punctuation to enhance effects and clarify meaning",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O053",
      "domain_id": "EN-Y6-D006",
      "objective_text": "evaluate and edit by: ensuring the consistent and correct use of tense throughout a piece of writing",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O054",
      "domain_id": "EN-Y6-D006",
      "objective_text": "evaluate and edit by: ensuring correct subject and verb agreement when using singular and plural, distinguishing between the language of speech and writing and choosing the appropriate register",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O055",
      "domain_id": "EN-Y6-D006",
      "objective_text": "proof-read for spelling and punctuation errors",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O056",
      "domain_id": "EN-Y6-D006",
      "objective_text": "perform their own compositions, using appropriate intonation, volume, and movement so that meaning is clear",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O057",
      "domain_id": "EN-Y6-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by: recognising vocabulary and structures that are appropriate for formal speech and writing, including subjunctive forms",
      "non_statutory_guidance": "Pupils should continue to add to their knowledge of linguistic terms, including those to describe grammar, so that they can discuss their writing and reading.",
      "examples": "The difference between vocabulary typical of informal speech and vocabulary appropriate for formal speech and writing [for example, find out – discover; ask for – request; go in – enter]. The difference between structures typical of informal speech and structures appropriate for formal speech and writing [for example, the use of question tags: He's your friend, isn't he?, or the use of subjunctive forms such as If I were or Were they to come in some very formal writing and speech].",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O058",
      "domain_id": "EN-Y6-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by: using passive verbs to affect the presentation of information in a sentence",
      "non_statutory_guidance": null,
      "examples": "Use of the passive to affect the presentation of information in a sentence [for example, I broke the window in the greenhouse versus The window in the greenhouse was broken (by me)].",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O059",
      "domain_id": "EN-Y6-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by: using the perfect form of verbs to mark relationships of time and cause",
      "non_statutory_guidance": null,
      "examples": "he had seen her before [past perfect marking a completed action prior to another past action]",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O060",
      "domain_id": "EN-Y6-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by: using expanded noun phrases to convey complicated information concisely",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O061",
      "domain_id": "EN-Y6-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by: using modal verbs or adverbs to indicate degrees of possibility",
      "non_statutory_guidance": null,
      "examples": "Indicating degrees of possibility using adverbs [for example, perhaps, surely] or modal verbs [for example, might, should, will, must].",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O062",
      "domain_id": "EN-Y6-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by: using relative clauses beginning with who, which, where, when, whose, that or with an implied (i.e. omitted) relative pronoun",
      "non_statutory_guidance": null,
      "examples": "Relative clauses beginning with who, which, where, when, whose, that, or an omitted relative pronoun.",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O063",
      "domain_id": "EN-Y6-D007",
      "objective_text": "develop their understanding of the concepts set out in English Appendix 2 by: learning the grammar for years 5 and 6 in English Appendix 2",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O064",
      "domain_id": "EN-Y6-D007",
      "objective_text": "indicate grammatical and other features by: using commas to clarify meaning or avoid ambiguity in writing",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O065",
      "domain_id": "EN-Y6-D007",
      "objective_text": "indicate grammatical and other features by: using hyphens to avoid ambiguity",
      "non_statutory_guidance": null,
      "examples": "How hyphens can be used to avoid ambiguity [for example, man eating shark versus man-eating shark, or recover versus re-cover].",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O066",
      "domain_id": "EN-Y6-D007",
      "objective_text": "indicate grammatical and other features by: using brackets, dashes or commas to indicate parenthesis",
      "non_statutory_guidance": null,
      "examples": "Brackets, dashes or commas to indicate parenthesis.",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O067",
      "domain_id": "EN-Y6-D007",
      "objective_text": "indicate grammatical and other features by: using semi-colons, colons or dashes to mark boundaries between independent clauses",
      "non_statutory_guidance": null,
      "examples": "Use of the semi-colon, colon and dash to mark the boundary between independent clauses [for example, It's raining; I'm fed up].",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O068",
      "domain_id": "EN-Y6-D007",
      "objective_text": "indicate grammatical and other features by: using a colon to introduce a list",
      "non_statutory_guidance": null,
      "examples": "Use of the colon to introduce a list and use of semi-colons within lists.",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O069",
      "domain_id": "EN-Y6-D007",
      "objective_text": "indicate grammatical and other features by: punctuating bullet points consistently",
      "non_statutory_guidance": null,
      "examples": "Punctuation of bullet points to list information.",
      "is_statutory": true
    },
    {
      "objective_id": "EN-Y6-O070",
      "domain_id": "EN-Y6-D007",
      "objective_text": "use and understand the grammatical terminology in English Appendix 2 accurately and appropriately in discussing their writing and reading",
      "non_statutory_guidance": "Pupils should continue to add to their knowledge of linguistic terms, including those to describe grammar, so that they can discuss their writing and reading.",
      "examples": "Year 6 terminology: subject, object, active, passive, synonym, antonym, ellipsis, hyphen, colon, semi-colon, bullet points (in addition to all previously learnt terminology).",
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "EN-Y6-C001",
      "concept_name": "Formal versus informal vocabulary",
      "description": "Formal vocabulary is typically Latinate, precise and abstract (discover, request, enter), while informal vocabulary is often Anglo-Saxon, concrete and conversational (find out, ask for, go in). At upper KS2 mastery, pupils understand this distinction, can identify formal and informal vocabulary in texts they read, and make deliberate, controlled choices between formal and informal vocabulary in their own writing based on audience and purpose. This is Year 6-specific content in Appendix 2.",
      "teaching_guidance": "Teach the formal/informal distinction as a cline rather than a binary. Collect synonym pairs across the range (find out – discover – ascertain; use – employ – utilise). Connect to the Anglo-Saxon vs. Norman French history of English vocabulary. Practise rewriting informal text in formal register and vice versa, discussing the effect of the shift. Link explicitly to written contexts where formal vocabulary is expected: reports, letters of complaint, essays.",
      "key_vocabulary": "formal, informal, register, Latinate, Anglo-Saxon, synonym, vocabulary choice, Standard English",
      "common_misconceptions": "Pupils sometimes equate formal with 'correct' and informal with 'wrong', rather than understanding that both are appropriate in different contexts. They may over-formalise all writing once they learn Latinate vocabulary, losing appropriate informality in personal or creative writing.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y6-C002",
      "concept_name": "Synonyms and antonyms",
      "description": "Synonyms are words with similar meanings; antonyms are words with opposite meanings. At Year 6 mastery, pupils understand that synonyms are rarely exact equivalents — they differ in connotation, register and degree — and that selecting the most precise synonym is a key dimension of effective vocabulary choice in writing. Antonyms help pupils understand word meaning through contrast and are explicitly named as Year 6 grammatical terminology in Appendix 2.",
      "teaching_guidance": "Teach synonyms on a cline: warm, hot, boiling, scalding — each word occupies a different position on the scale of heat. Use a thesaurus to explore synonym groups and ask pupils to discuss the differences in connotation. Teach antonyms through word families (appear/disappear; possible/impossible) and through meaning contrast. Connect to formal/informal vocabulary work: synonyms often differ in register as well as meaning.",
      "key_vocabulary": "synonym, antonym, connotation, denotation, register, nuance, word choice, degree",
      "common_misconceptions": "Pupils may treat synonyms as interchangeable and use a thesaurus to 'upgrade' vocabulary without checking that the synonym fits the precise meaning. They may confuse antonyms formed by negation prefixes (unhappy, dislike) with antonyms that are entirely different words (hot/cold).",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y6-C003",
      "concept_name": "Formal and informal structures including subjunctive forms",
      "description": "Formal structures include those appropriate for academic writing and formal speech, such as the subjunctive mood (If I were, Were they to come, If that be the case) and the avoidance of question tags and contractions. The subjunctive is a verb form expressing hypothetical, wished-for or formally conditional situations, distinct from the indicative. At Year 6 mastery, pupils can identify formal structures in texts, recognise the subjunctive form, and use formal structures appropriately in their own writing when the register demands it. This is Year 6-specific content in Appendix 2.",
      "teaching_guidance": "Introduce subjunctive with high-frequency examples: 'If I were you' (not 'was'); 'Were she to attend' (not 'If she attended'); 'I suggest that he come' (not 'comes'). Explain that the subjunctive is used in formal written English and some spoken contexts. Contrast with informal equivalents using question tags (He's your friend, isn't he?). Provide texts — formal letters, reports, speeches — for pupils to identify formal structural features.",
      "key_vocabulary": "subjunctive, indicative, formal, informal, structure, question tag, hypothetical, conditional",
      "common_misconceptions": "Pupils often write 'If I was' instead of 'If I were' because the indicative form ('was') sounds more natural in speech. Some pupils avoid the subjunctive altogether by rephrasing to avoid the conditional structure. The subjunctive is often confused with the passive voice.",
      "concept_type": "knowledge",
      "complexity_level": 5,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y6-C004",
      "concept_name": "Advanced cohesive devices: repetition, grammatical connections and ellipsis",
      "description": "In Year 6, pupils extend their repertoire of cohesive devices to include: deliberate repetition of a key word or phrase for effect or emphasis; grammatical connections using adverbials such as 'on the other hand', 'in contrast', 'as a consequence'; and ellipsis (the deliberate omission of words that are understood from context). These are specifically identified as Year 6 text-level content in Appendix 2. At mastery, pupils deploy all three types purposefully to create well-structured, coherent texts that move beyond simple linking adverbials.",
      "teaching_guidance": "Teach each device with examples from published writing. For repetition: show how anaphora (starting successive sentences with the same phrase) creates rhythm and emphasis. For grammatical connections: teach the relationship each adverbial signals (contrast, cause, sequence, example). For ellipsis: show how it creates pace and avoids unnecessary repetition ('She ate breakfast. He did too [= ate breakfast too]'). Practise identifying all three in newspaper editorials, persuasive essays and literary prose.",
      "key_vocabulary": "cohesion, repetition, anaphora, grammatical connection, adverbial, ellipsis, omission, contrast, consequence",
      "common_misconceptions": "Pupils often confuse ellipsis (grammatical omission for cohesive effect) with simply leaving words out accidentally. They may use 'on the other hand' when they do not in fact intend contrast, applying cohesive adverbials mechanically rather than logically. Repetition for effect may be confused with inadvertent repetition as a writing weakness.",
      "concept_type": "skill",
      "complexity_level": 5,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y6-C005",
      "concept_name": "Layout devices for structuring text",
      "description": "Layout devices including headings, sub-headings, columns, bullets and tables are used to organise non-fiction text, guide the reader and signal the structure of information. At Year 6 mastery, pupils deploy layout devices purposefully and consistently, understanding that the choice of device should serve the text's purpose and audience. This is Year 6-specific text-level content in Appendix 2.",
      "teaching_guidance": "Provide a range of non-fiction texts showing different layout devices in use. Analyse why each device has been chosen (table for comparison; subheadings to signal topic shifts; bullet points for parallel items). When pupils plan non-fiction writing, require them to decide on layout as part of the planning process, justifying their choices. Discuss how digital and print contexts create different layout conventions.",
      "key_vocabulary": "heading, sub-heading, column, bullet point, table, layout, organise, signpost, non-fiction",
      "common_misconceptions": "Pupils sometimes use layout devices decoratively rather than functionally — adding subheadings that do not accurately signal what follows. They may use bullet points where a continuous prose argument would be more appropriate for the genre.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y6-C006",
      "concept_name": "Semi-colons, colons and dashes for independent clauses",
      "description": "Semi-colons, colons and dashes can all mark boundaries between independent clauses (clauses that could each stand as a sentence), signalling different relationships. A colon introduces, explains or elaborates; a semi-colon balances or parallels two closely related clauses; a dash creates a more dramatic or informal effect. At Year 6 mastery, pupils deploy all three correctly and with awareness of their different effects. This is Year 6-specific punctuation content in Appendix 2.",
      "teaching_guidance": "Contrast the three marks using examples: 'She was nervous: she had never performed before.' (colon — elaborates) 'She was nervous; her hands trembled.' (semi-colon — balances) 'She was nervous — terrified, in fact.' (dash — dramatic addition). Test whether each clause can stand alone. Practise converting full-stop sentences to use these marks and discussing the change in effect. Use published writing to collect examples.",
      "key_vocabulary": "semi-colon, colon, dash, independent clause, clause boundary, balance, elaborate, contrast",
      "common_misconceptions": "Pupils frequently use a colon when the second part is not an independent clause (e.g., 'I like: chocolate and cake'). They may use semi-colons randomly as a sophistication marker without checking that both parts are independent clauses. The dash is often used as a catch-all substitute for all other punctuation.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y6-C007",
      "concept_name": "Colons to introduce lists and semi-colons within lists",
      "description": "A colon can introduce a list that follows a complete clause. When items in a list are long or contain commas themselves, semi-colons are used to separate items instead of commas, preventing ambiguity. At Year 6 mastery, pupils use colons to introduce lists correctly and know when to deploy semi-colons within a list for clarity. This is Year 6-specific punctuation content in Appendix 2.",
      "teaching_guidance": "Teach the 'complete clause before the colon' rule. Show how semi-colons clarify a list where items contain internal commas: 'The expedition required: warm, waterproof boots; a sleeping bag; and emergency rations.' Contrast with a simpler list separated by ordinary commas. Practise identifying when a list requires semi-colons to prevent misreading.",
      "key_vocabulary": "colon, semi-colon, list, items, clause, clarify, ambiguity, punctuation",
      "common_misconceptions": "Pupils often place a colon after a verb or preposition, where the sentence is not yet a complete clause ('I need: a pen, a ruler...'). They may not recognise when semi-colons within a list are needed to prevent ambiguity versus when commas are sufficient.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y6-C008",
      "concept_name": "Hyphens to avoid ambiguity",
      "description": "Hyphens are used within compound modifiers and certain prefixed words to prevent misreading and avoid ambiguity (man-eating shark vs. man eating shark; re-cover vs. recover). At Year 6 mastery, pupils understand why hyphens are used in these contexts, can identify ambiguous compound modifiers, and use hyphens appropriately and consistently in their own writing. This is Year 6-specific punctuation content in Appendix 2.",
      "teaching_guidance": "Present deliberately ambiguous compound modifiers and ask pupils to disambiguate: 'a little used car' (a little-used car vs. a little used car). Show how prefixes before vowels or proper nouns often require hyphens (co-ordinate, anti-inflammatory, pre-Roman). Distinguish hyphens from dashes — hyphens join words or word parts; dashes separate clauses or indicate parenthesis.",
      "key_vocabulary": "hyphen, compound modifier, prefix, ambiguity, word join, dash, punctuation",
      "common_misconceptions": "Pupils often confuse hyphens with dashes, using one where the other is appropriate. They may not recognise which compound modifiers require a hyphen (pre-eminent) versus those that do not (highly skilled). Some pupils over-hyphenate, inserting hyphens between all compound nouns.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y6-C009",
      "concept_name": "Bullet point punctuation",
      "description": "Bullet points are a layout device for listing items in a consistent, easily readable format. Correct punctuation of bullet points depends on whether they complete a sentence begun in the introductory clause (in which case lower case and no end punctuation on individual bullets, with a full stop on the last) or whether each is a sentence in its own right (capital letter, full stop on each). At Year 6 mastery, pupils punctuate bullet points consistently within a given style. This is Year 6-specific content in Appendix 2.",
      "teaching_guidance": "Teach two styles: (1) bullets completing a lead-in sentence — lower case, no end punctuation mid-list, full stop or semi-colon at end; (2) standalone bullet sentences — capital letter and full stop on each. Emphasise consistency within a document. Show examples from published non-fiction, instruction manuals, business documents. Note that different style guides vary; the key is consistency.",
      "key_vocabulary": "bullet point, list, punctuation, consistency, capital letter, full stop, semi-colon, layout",
      "common_misconceptions": "Pupils often mix styles inconsistently within a single list. They may punctuate every bullet with a full stop regardless of whether it completes a sentence or is a fragment. Some pupils avoid bullet points entirely in favour of prose, not recognising when a list format is more effective.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y6-C010",
      "concept_name": "Active and passive voice (advanced application)",
      "description": "Year 6 extends Year 5's introduction of passive voice to full Appendix 2 terminology: subject, object, active voice, passive voice. At Year 6 mastery, pupils can identify the grammatical subject and object of both active and passive sentences, construct passives correctly across different tenses, analyse why an author has chosen passive voice, and deploy it purposefully in their own writing — particularly in formal and impersonal registers.",
      "teaching_guidance": "Teach subject and object as distinct grammatical roles first: in 'The dog bit the man', 'the dog' is subject, 'the man' is object. Show how passive reverses these roles: 'The man was bitten by the dog.' The 'by' phrase (agent) can be omitted to achieve impersonality: 'Mistakes were made.' Collect examples of deliberate passive from science reports, news articles and formal writing. Discuss the ideological effect of omitting the agent.",
      "key_vocabulary": "active voice, passive voice, subject, object, agent, by-phrase, impersonal, formal, passive construction",
      "common_misconceptions": "Pupils often confuse past tense with passive voice. They may struggle to form passive correctly in non-present tenses ('It will be decided' vs 'It would be decided'). Some pupils write passive in all formal writing without selecting it for specific effect.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y6-C011",
      "concept_name": "Year 6 grammatical terminology",
      "description": "Year 6 introduces the final set of grammatical terminology that pupils are expected to know by the end of primary education: subject, object, active, passive, synonym, antonym, ellipsis, hyphen, colon, semi-colon, bullet points — in addition to all previously learnt terms from Years 1–5. At mastery, pupils use all these terms accurately and appropriately in discussion of their reading and writing, showing that metalinguistic awareness is integrated into their English practice.",
      "teaching_guidance": "Do not introduce terminology as a separate vocabulary lesson divorced from use — teach each term in the context of reading and writing where the concept is deployed. Create classroom displays of grammatical terms with examples. Use the terms consistently in marking, modelling and discussion. Regular low-stakes quizzes on terminology keep the vocabulary active.",
      "key_vocabulary": "subject, object, active, passive, synonym, antonym, ellipsis, hyphen, colon, semi-colon, bullet point, metalanguage",
      "common_misconceptions": "Pupils may know the name of a term without being able to identify or use the concept. The difference between subject and topic is frequently confused. 'Object' in grammar is often confused with its everyday meaning.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y6-C012",
      "concept_name": "Critical evaluation of authorial language and structure",
      "description": "At Year 6, language analysis extends to evaluation: not just identifying what a writer does but critically evaluating whether it is effective, for whom and why. Pupils consider how language, structure and presentation contribute to meaning in texts of increasing complexity, applying technical vocabulary including metaphor, simile, analogy, imagery, style and effect. Mastery means pupils can construct a sustained analytical argument about a text's language and structure, supported by specific textual evidence.",
      "teaching_guidance": "Model the three-move analysis: identify (name the technique) → describe (explain what the writer does) → evaluate (assess the effect, for whom it works and why). Push pupils beyond 'this is effective' to 'this is effective because... and this creates... for the reader who...'. Use short, rich extracts for focused analysis. Build from oral whole-class discussion to written analytical paragraph using frames if needed, then reducing scaffolding.",
      "key_vocabulary": "analyse, evaluate, technique, effect, impact, language choice, structure, presentation, metaphor, simile, analogy, imagery",
      "common_misconceptions": "Pupils identify techniques without evaluating effect. They evaluate vaguely ('it's more interesting') without specific analysis of mechanism. Some pupils list techniques rather than building a coherent analytical argument. Others evaluate from their own response rather than considering the intended audience and purpose.",
      "concept_type": "skill",
      "complexity_level": 5,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y6-C013",
      "concept_name": "Writing with conscious grammatical control",
      "description": "The curriculum's overarching Year 6 writing aspiration is that pupils can 'consciously control sentence structure in their writing and understand why sentences are constructed as they are'. This metacognitive dimension — knowing not just how to write a sentence but why a particular construction achieves a particular effect — represents the highest expectation of the primary programme and directly prepares pupils for GCSE. Mastery means pupils can justify their grammatical choices in terms of effect, audience and purpose.",
      "teaching_guidance": "Build in regular 'writer talk' where pupils explain their grammatical choices: 'I used a short sentence here because...', 'I chose the passive because I wanted to...', 'I used a colon here to...'. Use shared writing as a forum for making these decisions explicit. Peer and self-editing sessions should involve discussing grammatical choices, not just identifying errors. Model the reflective process by thinking aloud while composing.",
      "key_vocabulary": "sentence structure, grammatical choice, effect, purpose, audience, conscious control, metalanguage, justify",
      "common_misconceptions": "Pupils may make effective grammatical choices instinctively (from their reading) but be unable to articulate why. Conversely, they may use complex structures incorrectly in an attempt to appear sophisticated. The conscious-control requirement distinguishes Year 6 from simply following grammatical rules.",
      "concept_type": "process",
      "complexity_level": 5,
      "is_cross_cutting": false
    },
    {
      "concept_id": "EN-Y6-C014",
      "concept_name": "Register control in reading and writing",
      "description": "Register is the variety of language appropriate to a particular social situation, purpose and relationship between writer and audience. At Year 6 mastery, pupils recognise register in texts they read (distinguishing formal from informal, written from spoken, academic from personal) and make deliberate register choices in their own writing. This includes understanding that different parts of the same text may use different registers for specific effects.",
      "teaching_guidance": "Analyse texts for register: what signals formality or informality? (vocabulary choice, sentence length, use of personal pronouns, degree of hedging, use of contractions). Practise writing the same content in two registers (a formal report and an informal blog post about the same event). Discuss how shifting register unexpectedly can be used for deliberate comic or critical effect.",
      "key_vocabulary": "register, formal, informal, academic, personal, spoken, written, audience, purpose, tone",
      "common_misconceptions": "Pupils often treat register as binary (formal/informal) rather than as a multidimensional continuum. They may confuse polite tone with formal register or aggressive tone with informal register. Register control requires ongoing reading of texts in different registers to develop intuitive sensitivity.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": true
    },
    {
      "concept_id": "EN-Y6-C015",
      "concept_name": "Secondary school readiness in English",
      "description": "By the end of Year 6, pupils' reading and writing should be sufficiently fluent and effortless for them to manage the general demands of the curriculum in Year 7 across all subjects, not just in English. This means pupils can read subject-specific texts independently and write in a range of forms without the scaffolding of primary school. Secondary readiness in English encompasses: automatic decoding, wide vocabulary, confident comprehension, fluent composition with grammatical control, and effective oracy. This is the explicit terminal aspiration of the primary English curriculum.",
      "teaching_guidance": "In Year 6, provide regular practice with the kinds of texts, tasks and assessment formats pupils will encounter at secondary: extended reading for meaning, formal written argument, note-making from exposition, timed writing. Reduce scaffolding progressively. Ensure pupils have encountered the full range of non-fiction text types in the secondary curriculum (textbook entries, explanatory essays, persuasive articles). Brief pupils explicitly on secondary school English expectations.",
      "key_vocabulary": "fluency, automaticity, independent, subject vocabulary, secondary school, cross-curricular, writing under pressure",
      "common_misconceptions": "Teachers and pupils sometimes conflate secondary readiness in English with performance in English alone, missing the cross-curricular dimension. Pupils may be fluent readers of fiction but not of non-fiction, which is disproportionately important in secondary school across subjects.",
      "concept_type": "attitude",
      "complexity_level": 5,
      "is_cross_cutting": true
    },
    {
      "concept_id": "EN-Y6-C016",
      "concept_name": "Nuanced vocabulary and academic language",
      "description": "The curriculum states that by Year 6 pupils should 'understand nuances in vocabulary choice and age-appropriate, academic vocabulary'. This involves understanding that words differ not just in denotation (basic meaning) but in connotation, degree, register and precision. At mastery, pupils select vocabulary consciously to achieve precise, nuanced meaning, deploying academic vocabulary (investigate, conclude, analyse, evaluate, interpret, contrast, justify) confidently across subjects.",
      "teaching_guidance": "Explicitly teach academic vocabulary across subjects, connecting English vocabulary work to the language of mathematics (calculate, estimate), science (observe, hypothesise, conclude) and humanities (evidence, source, interpret, period). Use vocabulary maps showing a word at the centre surrounded by its synonyms, connotations, antonyms and word family. Require pupils to use specific vocabulary in written and spoken justifications.",
      "key_vocabulary": "nuance, connotation, denotation, academic vocabulary, precision, register, word choice, vocabulary development",
      "common_misconceptions": "Pupils may use impressive-sounding words incorrectly, valuing rarity over precision. They may not recognise that academic vocabulary varies by subject — 'evaluate' in mathematics means something different from 'evaluate' in literary criticism.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": true
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "EN-Y5-C028",
      "dependent_concept": "EN-Y6-C001",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.75,
      "rationale": "Year 5 relative clauses, which include Latinate conjunctions, create familiarity with grammatical patterns associated with formal registers that Year 6 extends to explicit formal/informal vocabulary distinction."
    },
    {
      "prerequisite_concept": "EN-Y5-C013",
      "dependent_concept": "EN-Y6-C002",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 5's thesaurus skills involve working with synonyms; Year 6 formalises the concept of synonyms and antonyms as grammatical terminology and deepens understanding of connotation and nuance."
    },
    {
      "prerequisite_concept": "EN-Y5-C001",
      "dependent_concept": "EN-Y6-C002",
      "confidence": "inferred",
      "relationship_type": "cognitive",
      "strength": 0.8,
      "rationale": "Morphological knowledge supports understanding of synonyms — many synonym pairs (discover/find out) differ in morphological complexity, and understanding word structure illuminates why Latinate words feel more formal."
    },
    {
      "prerequisite_concept": "EN-Y6-C001",
      "dependent_concept": "EN-Y6-C003",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Understanding formal versus informal vocabulary is prerequisite for understanding formal versus informal grammatical structures, since both dimensions of formality need to be controlled simultaneously."
    },
    {
      "prerequisite_concept": "EN-Y5-C029",
      "dependent_concept": "EN-Y6-C003",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.7,
      "rationale": "Modal verbs express hypothetical and conditional meaning; subjunctive forms are another way of expressing hypothesis and conditionality in formal registers, representing a more formal grammatical equivalent."
    },
    {
      "prerequisite_concept": "EN-Y5-C025",
      "dependent_concept": "EN-Y6-C004",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "Year 5's cohesive devices (adverbials of time, place, number) are extended in Year 6 to include repetition, grammatical connections and ellipsis — the most sophisticated level of cohesion in the primary programme."
    },
    {
      "prerequisite_concept": "EN-Y5-C030",
      "dependent_concept": "EN-Y6-C010",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 1.0,
      "rationale": "Year 5 introduces passive voice as a concept; Year 6 extends to full formal treatment in Appendix 2, adding the terminology subject, object, active and passive, and deepening understanding of purpose and effect."
    },
    {
      "prerequisite_concept": "EN-Y5-C032",
      "dependent_concept": "EN-Y6-C006",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 5's parenthesis punctuation (brackets, dashes, commas) establishes understanding of these marks as clause-boundary signallers; Year 6 deepens understanding of colons and semi-colons for the same purpose, completing the punctuation repertoire."
    },
    {
      "prerequisite_concept": "EN-Y5-C033",
      "dependent_concept": "EN-Y6-C006",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 1.0,
      "rationale": "Year 5 introduces semi-colons, colons and dashes for independent clause boundaries; Year 6 formalises these as Appendix 2 terminology and requires pupils to understand the differences in effect between the three marks."
    },
    {
      "prerequisite_concept": "EN-Y6-C006",
      "dependent_concept": "EN-Y6-C007",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Understanding how colons introduce independent clause extensions is prerequisite for understanding how they introduce lists, since both applications share the same structural requirement of a complete clause before the colon."
    },
    {
      "prerequisite_concept": "EN-Y5-C021",
      "dependent_concept": "EN-Y6-C012",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "Year 5's authorial language analysis (identify, describe, evaluate figurative language) develops in Year 6 to sustained critical evaluation of authorial choices across language and structure, with higher expectations of analytical depth and independence."
    },
    {
      "prerequisite_concept": "EN-Y6-C001",
      "dependent_concept": "EN-Y6-C014",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Formal/informal vocabulary distinction is a key component of register control; understanding register requires this knowledge as a building block, extending it to grammar, sentence structure and discourse."
    },
    {
      "prerequisite_concept": "EN-Y6-C003",
      "dependent_concept": "EN-Y6-C014",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.85,
      "rationale": "Understanding formal versus informal grammatical structures (including subjunctive) is a necessary component of full register control, alongside vocabulary choice."
    },
    {
      "prerequisite_concept": "EN-Y5-C026",
      "dependent_concept": "EN-Y6-C013",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 5's audience and purpose planning is the foundation for Year 6's metacognitive, conscious grammatical control: knowing who you are writing for and what you are trying to achieve enables purposeful grammatical choices."
    },
    {
      "prerequisite_concept": "EN-Y6-C013",
      "dependent_concept": "EN-Y6-C015",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Secondary school readiness requires the metacognitive grammatical control that Year 6 develops — pupils must not only perform tasks competently but understand what they are doing and why."
    },
    {
      "prerequisite_concept": "EN-Y5-C022",
      "dependent_concept": "EN-Y6-C016",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Distinguishing fact from opinion requires understanding of connotation and how language choices can present opinion as fact; this critical awareness of word choice feeds directly into Year 6's focus on nuanced vocabulary."
    },
    {
      "prerequisite_concept": "EN-Y6-C002",
      "dependent_concept": "EN-Y6-C016",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Understanding synonyms and antonyms — particularly that synonyms differ in connotation and degree — is the conceptual basis for developing nuanced vocabulary understanding at Year 6."
    },
    {
      "prerequisite_concept": "EN-Y5-C035",
      "dependent_concept": "EN-Y6-C015",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.7,
      "rationale": "Year 5's public speaking and debate provide oral scaffolding for the sustained academic discourse expected of pupils entering secondary school, where extended discussion is assessed across all subjects."
    },
    {
      "prerequisite_concept": "EN-Y5-C031",
      "dependent_concept": "EN-Y6-C010",
      "confidence": "inferred",
      "relationship_type": "cognitive",
      "strength": 0.7,
      "rationale": "Perfect verb forms require understanding of tense and aspect, which supports the ability to form passive constructions correctly across different tenses — both require manipulation of auxiliary verbs and non-finite verb forms."
    },
    {
      "prerequisite_concept": "EN-Y6-C004",
      "dependent_concept": "EN-Y6-C013",
      "confidence": "inferred",
      "relationship_type": "cognitive",
      "strength": 0.75,
      "rationale": "Deploying advanced cohesive devices requires exactly the kind of conscious grammatical control that Year 6 targets — pupils must choose between devices based on the logical relationship they intend to signal."
    },
    {
      "prerequisite_concept": "EN-Y6-C010",
      "dependent_concept": "EN-Y6-C013",
      "confidence": "inferred",
      "relationship_type": "cognitive",
      "strength": 0.8,
      "rationale": "Conscious control of passive voice — understanding when and why to use it for presentational effect — is one of the clearest examples of the metacognitive grammatical awareness that Year 6 targets across all structures."
    }
  ]
}
