{
  "metadata": {
    "subject": "History",
    "key_stage": "KS1",
    "years_covered": [
      1,
      2
    ],
    "document_reference": "DFE-00173-2013",
    "extraction_date": "2026-02-17",
    "structure_rating": 7
  },
  "domains": [
    {
      "domain_id": "HI-KS1-D001",
      "domain_name": "Chronological Understanding",
      "description": "Developing awareness of the past and its relationship to the present, using common words and phrases relating to the passing of time, and placing events and artefacts in order.",
      "curriculum_context": "Chronological understanding is foundational to historical thinking: without a secure sense of how the past is ordered in time, pupils cannot make sense of historical change, continuity, cause or consequence. At KS1, pupils develop their temporal awareness through the vocabulary of time - words and phrases like old, new, before, after, long ago, recently - and through practical sequencing activities with artefacts, photographs and events. The curriculum requires pupils to work with their own personal histories and family experiences as well as broader national and world history, connecting the abstract concept of 'the past' to their own lived experience. Understanding that the past is different from the present, and that things change over time, is the core conceptual achievement of this domain at KS1.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "HI-KS1-D002",
      "domain_name": "Historical Content Knowledge",
      "description": "Learning about significant people, events and changes in the past, including changes within living memory, events beyond living memory, and the lives of significant individuals.",
      "curriculum_context": "At KS1, pupils encounter specific historical content organised into four categories: changes within living memory that reveal how life in Britain has changed; events beyond living memory that are significant nationally or globally; the lives of significant individuals who have contributed to national and international achievements; and significant historical events, people and places in the pupil's own locality. This range ensures that pupils begin to understand history at both the personal/local and the national/global scale. The specific examples provided in the curriculum - the Great Fire of London, figures such as Queen Victoria, Florence Nightingale and Rosa Parks - give teachers specific content to teach while the categories allow flexibility in choice. Connecting historical figures and events to their significance helps pupils understand why history is studied, rather than treating it as mere memorisation of facts.",
      "is_cross_cutting": false,
      "structure_type": "knowledge"
    },
    {
      "domain_id": "HI-KS1-D003",
      "domain_name": "Historical Enquiry Skills",
      "description": "Asking and answering historical questions using a range of sources including artefacts, photographs, accounts and visits, to find out about the past.",
      "curriculum_context": "Historical enquiry involves asking questions about the past and using evidence to construct answers. At KS1, pupils begin to work with a range of historical sources - artefacts, photographs, books, accounts - developing the ability to observe carefully, extract information and begin to understand that historical evidence is interpreted rather than simply read. This involves developing the pupil's capacity to ask historically valid questions: not just 'what happened?' but 'why did this happen?', 'how do we know?', 'what does this source tell us?'. Developing enquiry skills at KS1 establishes the habits of mind and methods of working that are essential to genuine historical thinking at later stages of education.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    }
  ],
  "objectives": [
    {
      "objective_id": "HI-KS1-O001",
      "domain_id": "HI-KS1-D001",
      "objective_text": "changes within living memory – where appropriate, these should be used to reveal aspects of change in national life",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS1-O002",
      "domain_id": "HI-KS1-D002",
      "objective_text": "events beyond living memory that are significant nationally or globally [for example, the Great Fire of London, the first aeroplane flight or events commemorated through festivals or anniversaries]",
      "non_statutory_guidance": null,
      "examples": "the Great Fire of London, the first aeroplane flight or events commemorated through festivals or anniversaries",
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS1-O003",
      "domain_id": "HI-KS1-D002",
      "objective_text": "the lives of significant individuals in the past who have contributed to national and international achievements, some should be used to compare aspects of life in different periods [for example, Elizabeth I and Queen Victoria, Christopher Columbus and Neil Armstrong, William Caxton and Tim Berners-Lee, Pieter Bruegel the Elder and LS Lowry, Rosa Parks and Emily Davison, Mary Seacole and/or Florence Nightingale and Edith Cavell]",
      "non_statutory_guidance": null,
      "examples": "Elizabeth I and Queen Victoria, Christopher Columbus and Neil Armstrong, William Caxton and Tim Berners-Lee, Pieter Bruegel the Elder and LS Lowry, Rosa Parks and Emily Davison, Mary Seacole and/or Florence Nightingale and Edith Cavell",
      "is_statutory": true
    },
    {
      "objective_id": "HI-KS1-O004",
      "domain_id": "HI-KS1-D002",
      "objective_text": "significant historical events, people and places in their own locality",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "HI-KS1-C001",
      "domain_id": "HI-KS1-D001",
      "concept_name": "Time and Chronology",
      "description": "Chronology is the ordering of events and periods in time. Understanding chronology requires both the vocabulary of time (before, after, then, now, long ago, recently, past, present) and the ability to place events and people in sequence relative to each other. At KS1, pupils develop chronological understanding beginning with their own life histories and moving outwards to family memories, local history and national events. Placing events on timelines, sequencing pictures and comparing 'old' and 'new' versions of familiar objects are key activities that develop chronological awareness.",
      "teaching_guidance": "Use personal timelines (birth to present) to establish the concept of time sequence. Extend to family timelines using photographs and oral histories. Compare old and new versions of familiar objects (telephones, transport, clothing) to develop understanding of change over time. Use simple timeline displays that show where KS1 history topics fit within a longer span of time. Teach and use time vocabulary consistently. Connect specific dates (Great Fire of London, 1666) to the timeline to develop a sense of historical scale.",
      "key_vocabulary": "past, present, future, before, after, old, new, ancient, modern, recent, long ago, century, decade, year, timeline, sequence, order, change, continuity",
      "common_misconceptions": "Young pupils often have a very compressed sense of historical time, placing all 'old' things at the same distance from the present. Using timelines with scale helps develop a more calibrated sense of historical depth. Pupils may conflate 'old' with 'worse' or 'primitive'; a balanced approach that acknowledges both the challenges of the past and its achievements is needed. The concept that events happen in a fixed sequence that cannot be changed is important; some pupils believe history could have been different.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false
    },
    {
      "concept_id": "HI-KS1-C002",
      "domain_id": "HI-KS1-D001",
      "concept_name": "Change and Continuity",
      "description": "Historical change refers to the ways in which people's lives, beliefs, institutions and the world around them have transformed over time. Continuity refers to aspects that remain the same over long periods despite other changes. Understanding change and continuity requires pupils to identify what has changed, what has stayed the same, and to consider why some things change while others persist. At KS1, pupils explore change through comparing everyday objects, homes, transport and daily life across different time periods within living memory and beyond.",
      "teaching_guidance": "Use paired comparison activities: show an old and a new version of the same type of object and ask pupils to identify what has changed and what is similar. Explore change in everyday life by comparing their grandparents' childhood with their own (food, transport, entertainment, school). Look at photographs of the local area from different time periods. Distinguish between fast change (a technology like mobile phones) and slow change (landscape, traditions). Avoid presenting change as simple improvement or progress; discuss what is lost as well as what is gained.",
      "key_vocabulary": "change, continuity, same, different, transform, develop, improve, tradition, modern, old, new, before, after, progress, development",
      "common_misconceptions": "Pupils may assume all change represents progress or improvement. Discussing examples where change has involved loss (community customs, local buildings) develops a more nuanced understanding. The concept of continuity can be harder for pupils to grasp than change; using familiar examples (stories, celebrations, family customs) that have remained constant across generations helps.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false
    },
    {
      "concept_id": "HI-KS1-C003",
      "domain_id": "HI-KS1-D002",
      "concept_name": "Significant Individuals and Their Impact",
      "description": "History includes the study of significant individuals whose actions, discoveries, decisions or achievements have had lasting consequences for other people and subsequent generations. Significance is determined by the scale and duration of impact, the extent to which an individual changed the course of events, and the degree to which they are remembered and commemorated. At KS1, pupils learn about significant individuals from different historical periods and contexts, comparing figures from different times to understand how contexts shape lives and possibilities.",
      "teaching_guidance": "Introduce significant individuals through stories, photographs, artefacts and primary sources. Help pupils understand why each individual is significant: what did they do, and what difference did it make? Use paired comparisons specified in the curriculum (e.g., Florence Nightingale and Mary Seacole) to develop understanding of how context shapes significance and recognition. Discuss why some historical figures are well-known while others have been overlooked, introducing the idea that history involves selection and interpretation. Include significant individuals from diverse backgrounds, genders and cultures.",
      "key_vocabulary": "significant, achievement, contribution, impact, legacy, commemorate, famous, discover, invent, lead, inspire, pioneer, historical figure, biography",
      "common_misconceptions": "Pupils may think significant individuals were born special rather than shaped by context and choices. Discussing the obstacles individuals faced develops understanding of the conditions that make significance possible. Pupils may not question why some historical figures are more prominent than others; discussing who decides which figures are remembered develops critical historical thinking. The distinction between fact (what we know happened) and opinion (how we judge its significance) is important to introduce early.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false
    },
    {
      "concept_id": "HI-KS1-C004",
      "domain_id": "HI-KS1-D003",
      "concept_name": "Historical Sources and Evidence",
      "description": "Historical sources are the materials from which historians reconstruct the past - artefacts, photographs, documents, buildings, oral testimonies and other traces that survive from earlier times. Historical evidence is information extracted from sources by asking questions about them. At KS1, pupils begin to work with a range of sources, developing the ability to observe carefully, ask questions, extract information and begin to understand that sources provide evidence rather than complete and unmediated truth. This introduces the idea that history is a process of interpretation as well as discovery.",
      "teaching_guidance": "Bring a range of historical sources into the classroom: artefacts (or replicas), old photographs, letters, maps and accounts. Teach pupils a simple enquiry process: observe, question, infer, connect. Ask pupils what a source tells us and what it does not tell us. Compare sources about the same event or person. Use visit resources: museums, historic sites, community collections. Develop vocabulary for discussing sources: what is it? Who made it? When? Why? What can we learn from it? Begin to distinguish between primary (from the time) and secondary (written about the time later) sources.",
      "key_vocabulary": "source, evidence, artefact, document, photograph, account, primary source, secondary source, observe, question, infer, reliable, bias, interpret, past",
      "common_misconceptions": "Pupils may treat all sources as equally reliable and complete. Introducing the idea that sources can be partial, biased or misleading even at KS1 develops critical thinking. Pupils may not understand that historians do not know everything about the past; emphasising what we do not know as well as what we do know models intellectual honesty. The concept of primary sources from 'the time' can be confusing; concrete examples help.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false
    },
    {
      "concept_id": "HI-KS1-C005",
      "domain_id": "HI-KS1-D002",
      "concept_name": "Local and National History",
      "description": "History operates at different scales: the history of one's own locality connects personal and community identity to the broader national story, while national history provides the shared context within which local history is understood. The curriculum requires both local and national history at KS1, recognising that pupils' sense of historical belonging is rooted in the local even as they need to understand broader national narratives. Local history also provides access to primary sources and physical traces of the past that national history cannot always offer.",
      "teaching_guidance": "Identify significant local historical events, people and places before beginning this study. Use local resources: the school building itself, local churches, markets, museums, community elders. Connect local history to national history: how did national events affect the local area? What local figures played a national role? Use photographs of the local area from different periods. Invite local historians or community members to talk to the class. Develop a sense of pride in and curiosity about the local environment.",
      "key_vocabulary": "local, national, community, heritage, identity, historical site, landmark, oral history, tradition, ancestors, settlement, record, archive, census",
      "common_misconceptions": "Pupils may think local history is less important than national history. Emphasising that every national story is made up of local stories challenges this hierarchy. Pupils may not know the history of the places they visit every day; structured observation and questioning activities reveal the historical layers of familiar environments. The concept of oral history (passed down through conversation rather than writing) may be unfamiliar but is often very accessible and personally relevant to pupils.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "HI-KS1-C001",
      "dependent_concept": "HI-KS1-C002",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.85,
      "rationale": "Understanding that events and periods occur in sequence (chronology) is prerequisite to understanding what has changed and what has remained the same between two points in time (change and continuity)."
    },
    {
      "prerequisite_concept": "HI-KS1-C001",
      "dependent_concept": "HI-KS1-C003",
      "confidence": "inferred",
      "relationship_type": "logical",
      "strength": 0.7,
      "rationale": "Locating significant individuals in time - understanding that they lived in a different period from the present - requires chronological understanding as its prerequisite."
    },
    {
      "prerequisite_concept": "HI-KS1-C004",
      "dependent_concept": "HI-KS1-C003",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.65,
      "rationale": "Learning about significant individuals requires the ability to use historical sources (photographs, accounts, artefacts) to find out about their lives, making source skills a prerequisite for content learning."
    }
  ]
}
