{
  "metadata": {
    "subject": "Mathematics",
    "key_stage": "KS1",
    "years_covered": [
      2
    ],
    "document_reference": "DFE-00180-2013",
    "extraction_date": "2026-02-17",
    "structure_rating": 9
  },
  "domains": [
    {
      "domain_id": "MA-Y2-D001",
      "domain_name": "Number and Place Value",
      "description": "Pupils develop secure understanding of place value in two-digit numbers, count in steps of 2, 3 and 5, compare and order numbers to 100 using symbols, and read and write numbers in numerals and words.",
      "curriculum_context": "By the end of year 2, pupils should know the number bonds to 20 and be precise in using and understanding place value, and an emphasis on practice at this early stage will aid fluency. In Year 2, the number and place value domain consolidates and extends work from Year 1, with pupils now working confidently with numbers up to 100 in a wide range of representations and contexts. Using materials and a range of representations, pupils practise counting, reading, writing and comparing numbers to at least 100 and solving a variety of related problems to develop fluency, also counting in multiples of three to support their later understanding of a third. As they become more confident with numbers up to 100, pupils are introduced to larger numbers to develop further their recognition of patterns within the number system and represent them in different ways, including spatial representations. Pupils should partition numbers in different ways — for example, 23 = 20 + 3 and 23 = 10 + 13 — to support subtraction, and begin to understand zero as a place holder. They become fluent in applying their knowledge of numbers to reason with, discuss and solve problems that emphasise the value of each digit in two-digit numbers.",
      "is_cross_cutting": false,
      "structure_type": "sequential"
    },
    {
      "domain_id": "MA-Y2-D002",
      "domain_name": "Addition and Subtraction",
      "description": "Pupils recall and use addition and subtraction facts to 20 fluently, derive related facts up to 100, add and subtract two-digit numbers using multiple methods, and understand commutativity and the inverse relationship.",
      "curriculum_context": "In Year 2, addition and subtraction develop substantially in scope and sophistication from Year 1. Pupils extend their understanding of the language of addition and subtraction to include sum and difference, and practise addition and subtraction to 20 to become increasingly fluent in deriving related facts — for example, using 3 + 7 = 10; 10 – 7 = 3 to calculate 30 + 70 = 100; 100 – 70 = 30. They check their calculations by adding to check subtraction and adding numbers in a different order to check addition (for example, 5 + 2 + 1 = 1 + 5 + 2 = 1 + 2 + 5), which establishes commutativity and associativity of addition. Recording addition and subtraction in columns supports place value and prepares pupils for formal written methods with larger numbers in Key Stage 2. The statutory requirements now demand that pupils work with a two-digit number and ones, a two-digit number and tens, two two-digit numbers, and adding three one-digit numbers — a substantial progression from the within-20 focus of Year 1.",
      "is_cross_cutting": false,
      "structure_type": "sequential"
    },
    {
      "domain_id": "MA-Y2-D003",
      "domain_name": "Multiplication and Division",
      "description": "Pupils recall and use multiplication and division facts for the 2, 5 and 10 times tables, write formal multiplication and division statements, and understand commutativity of multiplication.",
      "curriculum_context": "Year 2 marks the formal introduction of multiplication tables, with pupils required to recall and use facts for the 2, 5 and 10 multiplication tables. Pupils are introduced to the multiplication tables and practise to become fluent, connecting the 2, 5 and 10 tables to each other — particularly the 10 multiplication table to place value, and the 5 multiplication table to the divisions on the clock face. They begin to use other multiplication tables and recall multiplication facts, including using related division facts to perform written and mental calculations. Pupils work with a range of materials and contexts in which multiplication and division relate to grouping and sharing discrete and continuous quantities, to arrays and to repeated addition. They begin to relate these to fractions and measures (for example, 40 ÷ 2 = 20, 20 is a half of 40) and use commutativity and inverse relations to develop multiplicative reasoning (for example, 4 × 5 = 20 and 20 ÷ 5 = 4). A key conceptual development is that pupils show that multiplication of two numbers can be done in any order (commutative) and division of one number by another cannot.",
      "is_cross_cutting": false,
      "structure_type": "sequential"
    },
    {
      "domain_id": "MA-Y2-D004",
      "domain_name": "Fractions",
      "description": "Pupils recognise, find, name and write fractions 1/3, 1/4, 2/4 and 3/4 of lengths, shapes, sets and quantities, write simple fractions, and recognise the equivalence of 2/4 and 1/2.",
      "curriculum_context": "In Year 2, fractions extend beyond the halves and quarters of Year 1 to include thirds and three-quarters, and pupils begin to write fraction notation. Pupils use fractions as 'fractions of' discrete and continuous quantities by solving problems using shapes, objects and quantities, connecting unit fractions to equal sharing and grouping, to numbers when they can be calculated, and to measures, finding fractions of lengths, quantities, sets of objects or shapes. Pupils meet 3/4 as the first example of a non-unit fraction — a fraction where the numerator is greater than 1. A significant conceptual milestone is the recognition that 2/4 and 1/2 are equivalent — the same quantity expressed in two different ways — which establishes the fundamental idea of fraction equivalence that will be central to mathematics through Key Stage 2 and beyond. Pupils should count in fractions up to 10, starting from any number and using the 1/2 and 2/4 equivalence on the number line (for example, 1 1/4, 1 2/4 (or 1 1/2), 1 3/4, 2), reinforcing the concept of fractions as numbers that can add up to more than one.",
      "is_cross_cutting": false,
      "structure_type": "conceptual"
    },
    {
      "domain_id": "MA-Y2-D005",
      "domain_name": "Measurement",
      "description": "Pupils choose and use appropriate standard units to estimate and measure length, mass, temperature and capacity; use symbols for money; solve practical money problems; and tell the time to five minutes.",
      "curriculum_context": "Measurement in Year 2 moves decisively from informal and non-standard approaches to the accurate use of standard units. Pupils use standard units of measurement with increasing accuracy, using their knowledge of the number system, and use appropriate language, recording using standard abbreviations (m, cm, kg, g, °C, l, ml). Comparing measures includes simple multiples such as 'half as high' and 'twice as wide', connecting measurement to multiplicative reasoning and fractions. Pupils become fluent in telling the time on analogue clocks and recording it — progressing from the hour and half past of Year 1 to five-minute intervals and quarter-past/quarter-to. In money, pupils become fluent in counting and recognising coins, read and say amounts of money confidently, and use the symbols £ and p accurately, recording pounds and pence separately. They solve simple problems in practical contexts involving addition and subtraction of money of the same unit, including giving change. The domain connects strongly to number knowledge (number bonds, addition/subtraction) and develops the practical mathematical literacy pupils will use throughout their lives.",
      "is_cross_cutting": true,
      "structure_type": "applied"
    },
    {
      "domain_id": "MA-Y2-D006",
      "domain_name": "Geometry: Properties of Shapes",
      "description": "Pupils identify and describe properties of 2-D and 3-D shapes including sides, edges, vertices, faces and line symmetry, and compare and sort shapes and everyday objects.",
      "curriculum_context": "In Year 2, the study of shapes moves from recognition and naming (Year 1) to analysis of properties. Pupils handle and name a wide variety of common 2-D and 3-D shapes including quadrilaterals and polygons, and cuboids, prisms and cones, and identify the properties of each shape — for example, number of sides, number of faces. Pupils identify, compare and sort shapes on the basis of their properties and use vocabulary precisely, such as sides, edges, vertices and faces. A new concept in Year 2 is line symmetry: pupils identify line symmetry in 2-D shapes presented in a vertical line, connecting geometric symmetry to their experience of reflection and pattern. Pupils identify 2-D shapes on the surface of 3-D shapes — for example, a circle on a cylinder and a triangle on a pyramid — making explicit the connection between 2-D and 3-D geometry. Pupils read and write names for shapes appropriate to their word reading and spelling, and draw lines and shapes using a straight edge.",
      "is_cross_cutting": false,
      "structure_type": "analytical"
    },
    {
      "domain_id": "MA-Y2-D007",
      "domain_name": "Geometry: Position and Direction",
      "description": "Pupils order and arrange combinations of mathematical objects in patterns and sequences, and use mathematical vocabulary to describe position, direction and movement including rotation in terms of right angles.",
      "curriculum_context": "In Year 2, position and direction develops from the informal turning and positional language of Year 1 to a more precise mathematical vocabulary involving right angles. Pupils should work with patterns of shapes, including those in different orientations, and use the concept and language of angles to describe 'turn' by applying rotations in practical contexts — for example, pupils themselves moving in turns, giving instructions to other pupils to do so, and programming robots using instructions given in right angles. The key development is that pupils now describe quarter, half and three-quarter turns not just as fractions of a full turn but specifically in terms of right angles — a quarter turn is one right angle, a half turn is two right angles, and a three-quarter turn is three right angles. This connects the informal experience of turning from Year 1 to the formal geometric concept of angle that pupils will develop in Year 3 and beyond.",
      "is_cross_cutting": true,
      "structure_type": "conceptual"
    },
    {
      "domain_id": "MA-Y2-D008",
      "domain_name": "Statistics",
      "description": "Pupils interpret and construct simple pictograms, tally charts, block diagrams and tables, and ask and answer questions about categorical data.",
      "curriculum_context": "Statistics is introduced for the first time as a formal domain in Year 2, providing pupils with tools to collect, organise, represent and interpret data. Pupils record, interpret, collate, organise and compare information — for example, using many-to-one correspondence in pictograms with simple ratios 2, 5, 10 — developing both the practical skill of data handling and the analytical skill of interpreting what the data shows. The three types of question pupils practise — counting the number of objects in each category, sorting categories by quantity, and totalling and comparing categorical data — establish the fundamental purposes of statistical inquiry: description, comparison and summary. This domain connects strongly to pupils' number knowledge (counting, comparison, addition) and to their ability to communicate mathematics through graphical representation. The introduction of statistics in Year 2 prepares pupils for the increasingly sophisticated data handling that continues through all subsequent year groups.",
      "is_cross_cutting": true,
      "structure_type": "applied"
    }
  ],
  "objectives": [
    {
      "objective_id": "MA-Y2-O001",
      "domain_id": "MA-Y2-D001",
      "objective_text": "count in steps of 2, 3, and 5 from 0, and in tens from any number, forward and backward",
      "non_statutory_guidance": "Using materials and a range of representations, pupils practise counting, reading, writing and comparing numbers to at least 100 and solving a variety of related problems to develop fluency. They count in multiples of three to support their later understanding of a third.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O002",
      "domain_id": "MA-Y2-D001",
      "objective_text": "recognise the place value of each digit in a two-digit number (tens, ones)",
      "non_statutory_guidance": "Pupils should partition numbers in different ways (for example, 23 = 20 + 3 and 23 = 10 + 13) to support subtraction. They become fluent and apply their knowledge of numbers to reason with, discuss and solve problems that emphasise the value of each digit in two-digit numbers. They begin to understand zero as a place holder.",
      "examples": "23 = 20 + 3 and 23 = 10 + 13",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O003",
      "domain_id": "MA-Y2-D001",
      "objective_text": "identify, represent and estimate numbers using different representations, including the number line",
      "non_statutory_guidance": "As they become more confident with numbers up to 100, pupils are introduced to larger numbers to develop further their recognition of patterns within the number system and represent them in different ways, including spatial representations.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O004",
      "domain_id": "MA-Y2-D001",
      "objective_text": "compare and order numbers from 0 up to 100; use <, > and = signs",
      "non_statutory_guidance": "Pupils should partition numbers in different ways (for example, 23 = 20 + 3 and 23 = 10 + 13) to support subtraction. They become fluent and apply their knowledge of numbers to reason with, discuss and solve problems that emphasise the value of each digit in two-digit numbers.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O005",
      "domain_id": "MA-Y2-D001",
      "objective_text": "read and write numbers to at least 100 in numerals and in words",
      "non_statutory_guidance": "Using materials and a range of representations, pupils practise counting, reading, writing and comparing numbers to at least 100 and solving a variety of related problems to develop fluency.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O006",
      "domain_id": "MA-Y2-D001",
      "objective_text": "use place value and number facts to solve problems.",
      "non_statutory_guidance": "They become fluent and apply their knowledge of numbers to reason with, discuss and solve problems that emphasise the value of each digit in two-digit numbers. They begin to understand zero as a place holder.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O007",
      "domain_id": "MA-Y2-D002",
      "objective_text": "solve problems with addition and subtraction: using concrete objects and pictorial representations, including those involving numbers, quantities and measures; applying their increasing knowledge of mental and written methods",
      "non_statutory_guidance": "Pupils extend their understanding of the language of addition and subtraction to include sum and difference.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O008",
      "domain_id": "MA-Y2-D002",
      "objective_text": "recall and use addition and subtraction facts to 20 fluently, and derive and use related facts up to 100",
      "non_statutory_guidance": "Pupils practise addition and subtraction to 20 to become increasingly fluent in deriving facts such as using 3 + 7 = 10; 10 – 7 = 3 and 7 = 10 – 3 to calculate 30 + 70 = 100; 100 – 70 = 30 and 70 = 100 – 30. They check their calculations, including by adding to check subtraction and adding numbers in a different order to check addition (for example, 5 + 2 + 1 = 1 + 5 + 2 = 1 + 2 + 5). This establishes commutativity and associativity of addition.",
      "examples": "using 3 + 7 = 10; 10 – 7 = 3 and 7 = 10 – 3 to calculate 30 + 70 = 100; 100 – 70 = 30 and 70 = 100 – 30; 5 + 2 + 1 = 1 + 5 + 2 = 1 + 2 + 5",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O009",
      "domain_id": "MA-Y2-D002",
      "objective_text": "add and subtract numbers using concrete objects, pictorial representations, and mentally, including: a two-digit number and ones; a two-digit number and tens; two two-digit numbers; adding three one-digit numbers",
      "non_statutory_guidance": "Recording addition and subtraction in columns supports place value and prepares for formal written methods with larger numbers.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O010",
      "domain_id": "MA-Y2-D002",
      "objective_text": "show that addition of two numbers can be done in any order (commutative) and subtraction of one number from another cannot",
      "non_statutory_guidance": "They check their calculations, including by adding to check subtraction and adding numbers in a different order to check addition (for example, 5 + 2 + 1 = 1 + 5 + 2 = 1 + 2 + 5). This establishes commutativity and associativity of addition.",
      "examples": "5 + 2 + 1 = 1 + 5 + 2 = 1 + 2 + 5",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O011",
      "domain_id": "MA-Y2-D002",
      "objective_text": "recognise and use the inverse relationship between addition and subtraction and use this to check calculations and solve missing number problems.",
      "non_statutory_guidance": "Recording addition and subtraction in columns supports place value and prepares for formal written methods with larger numbers.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O012",
      "domain_id": "MA-Y2-D003",
      "objective_text": "recall and use multiplication and division facts for the 2, 5 and 10 multiplication tables, including recognising odd and even numbers",
      "non_statutory_guidance": "Pupils are introduced to the multiplication tables. They practise to become fluent in the 2, 5 and 10 multiplication tables and connect them to each other. They connect the 10 multiplication table to place value, and the 5 multiplication table to the divisions on the clock face. They begin to use other multiplication tables and recall multiplication facts, including using related division facts to perform written and mental calculations.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O013",
      "domain_id": "MA-Y2-D003",
      "objective_text": "calculate mathematical statements for multiplication and division within the multiplication tables and write them using the multiplication (×), division (÷) and equals (=) signs",
      "non_statutory_guidance": "Pupils use a variety of language to describe multiplication and division. Pupils work with a range of materials and contexts in which multiplication and division relate to grouping and sharing discrete and continuous quantities, to arrays and to repeated addition.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O014",
      "domain_id": "MA-Y2-D003",
      "objective_text": "show that multiplication of two numbers can be done in any order (commutative) and division of one number by another cannot",
      "non_statutory_guidance": "They use commutativity and inverse relations to develop multiplicative reasoning (for example, 4 × 5 = 20 and 20 ÷ 5 = 4).",
      "examples": "4 × 5 = 20 and 20 ÷ 5 = 4",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O015",
      "domain_id": "MA-Y2-D003",
      "objective_text": "solve problems involving multiplication and division, using materials, arrays, repeated addition, mental methods, and multiplication and division facts, including problems in contexts.",
      "non_statutory_guidance": "They begin to relate these to fractions and measures (for example, 40 ÷ 2 = 20, 20 is a half of 40). They use commutativity and inverse relations to develop multiplicative reasoning (for example, 4 × 5 = 20 and 20 ÷ 5 = 4).",
      "examples": "40 ÷ 2 = 20, 20 is a half of 40",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O016",
      "domain_id": "MA-Y2-D004",
      "objective_text": "recognise, find, name and write fractions 1/3, 1/4, 2/4 and 3/4 of a length, shape, set of objects or quantity",
      "non_statutory_guidance": "Pupils use fractions as 'fractions of' discrete and continuous quantities by solving problems using shapes, objects and quantities. They connect unit fractions to equal sharing and grouping, to numbers when they can be calculated, and to measures, finding fractions of lengths, quantities, sets of objects or shapes. They meet 3/4 as the first example of a non-unit fraction.",
      "examples": "finding fractions of lengths, quantities, sets of objects or shapes",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O017",
      "domain_id": "MA-Y2-D004",
      "objective_text": "write simple fractions for example, 1/2 of 6 = 3 and recognise the equivalence of 2/4 and 1/2.",
      "non_statutory_guidance": "Pupils should count in fractions up to 10, starting from any number and using the 1/2 and 2/4 equivalence on the number line (for example, 1 1/4, 1 2/4 (or 1 1/2), 1 3/4, 2). This reinforces the concept of fractions as numbers and that they can add up to more than one.",
      "examples": "1/2 of 6 = 3; counting: 1 1/4, 1 2/4 (or 1 1/2), 1 3/4, 2",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O018",
      "domain_id": "MA-Y2-D005",
      "objective_text": "choose and use appropriate standard units to estimate and measure length/height in any direction (m/cm); mass (kg/g); temperature (°C); capacity (litres/ml) to the nearest appropriate unit, using rulers, scales, thermometers and measuring vessels",
      "non_statutory_guidance": "Pupils use standard units of measurement with increasing accuracy, using their knowledge of the number system. They use the appropriate language and record using standard abbreviations. Comparing measures includes simple multiples such as 'half as high'; 'twice as wide'.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O019",
      "domain_id": "MA-Y2-D005",
      "objective_text": "compare and order lengths, mass, volume/capacity and record the results using >, < and =",
      "non_statutory_guidance": "Pupils use standard units of measurement with increasing accuracy, using their knowledge of the number system. They use the appropriate language and record using standard abbreviations.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O020",
      "domain_id": "MA-Y2-D005",
      "objective_text": "recognise and use symbols for pounds (£) and pence (p); combine amounts to make a particular value",
      "non_statutory_guidance": "Pupils become fluent in counting and recognising coins. They read and say amounts of money confidently and use the symbols £ and p accurately, recording pounds and pence separately.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O021",
      "domain_id": "MA-Y2-D005",
      "objective_text": "find different combinations of coins that equal the same amounts of money",
      "non_statutory_guidance": "Pupils become fluent in counting and recognising coins. They read and say amounts of money confidently and use the symbols £ and p accurately, recording pounds and pence separately.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O022",
      "domain_id": "MA-Y2-D005",
      "objective_text": "solve simple problems in a practical context involving addition and subtraction of money of the same unit, including giving change",
      "non_statutory_guidance": "Pupils become fluent in counting and recognising coins. They read and say amounts of money confidently and use the symbols £ and p accurately, recording pounds and pence separately.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O023",
      "domain_id": "MA-Y2-D005",
      "objective_text": "compare and sequence intervals of time",
      "non_statutory_guidance": "They become fluent in telling the time on analogue clocks and recording it.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O024",
      "domain_id": "MA-Y2-D005",
      "objective_text": "tell and write the time to five minutes, including quarter past/to the hour and draw the hands on a clock face to show these times",
      "non_statutory_guidance": "They become fluent in telling the time on analogue clocks and recording it.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O025",
      "domain_id": "MA-Y2-D005",
      "objective_text": "know the number of minutes in an hour and the number of hours in a day.",
      "non_statutory_guidance": "",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O026",
      "domain_id": "MA-Y2-D006",
      "objective_text": "identify and describe the properties of 2-D shapes, including the number of sides and line symmetry in a vertical line",
      "non_statutory_guidance": "Pupils handle and name a wide variety of common 2-D and 3-D shapes including: quadrilaterals and polygons, and cuboids, prisms and cones, and identify the properties of each shape (for example, number of sides, number of faces). Pupils identify, compare and sort shapes on the basis of their properties and use vocabulary precisely, such as sides, edges, vertices and faces. Pupils read and write names for shapes that are appropriate for their word reading and spelling. Pupils draw lines and shapes using a straight edge.",
      "examples": "number of sides, number of faces",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O027",
      "domain_id": "MA-Y2-D006",
      "objective_text": "identify and describe the properties of 3-D shapes, including the number of edges, vertices and faces",
      "non_statutory_guidance": "Pupils handle and name a wide variety of common 2-D and 3-D shapes including: quadrilaterals and polygons, and cuboids, prisms and cones, and identify the properties of each shape (for example, number of sides, number of faces). Pupils identify, compare and sort shapes on the basis of their properties and use vocabulary precisely, such as sides, edges, vertices and faces.",
      "examples": "number of edges, vertices and faces",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O028",
      "domain_id": "MA-Y2-D006",
      "objective_text": "identify 2-D shapes on the surface of 3-D shapes, [for example, a circle on a cylinder and a triangle on a pyramid]",
      "non_statutory_guidance": "Pupils handle and name a wide variety of common 2-D and 3-D shapes including: quadrilaterals and polygons, and cuboids, prisms and cones, and identify the properties of each shape.",
      "examples": "a circle on a cylinder and a triangle on a pyramid",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O029",
      "domain_id": "MA-Y2-D006",
      "objective_text": "compare and sort common 2-D and 3-D shapes and everyday objects.",
      "non_statutory_guidance": "Pupils identify, compare and sort shapes on the basis of their properties and use vocabulary precisely, such as sides, edges, vertices and faces.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O030",
      "domain_id": "MA-Y2-D007",
      "objective_text": "order and arrange combinations of mathematical objects in patterns and sequences",
      "non_statutory_guidance": "Pupils should work with patterns of shapes, including those in different orientations.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O031",
      "domain_id": "MA-Y2-D007",
      "objective_text": "use mathematical vocabulary to describe position, direction and movement, including movement in a straight line and distinguishing between rotation as a turn and in terms of right angles for quarter, half and three-quarter turns (clockwise and anti-clockwise).",
      "non_statutory_guidance": "Pupils use the concept and language of angles to describe 'turn' by applying rotations, including in practical contexts (for example, pupils themselves moving in turns, giving instructions to other pupils to do so, and programming robots using instructions given in right angles).",
      "examples": "pupils themselves moving in turns, giving instructions to other pupils to do so, and programming robots using instructions given in right angles",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O032",
      "domain_id": "MA-Y2-D008",
      "objective_text": "interpret and construct simple pictograms, tally charts, block diagrams and simple tables",
      "non_statutory_guidance": "Pupils record, interpret, collate, organise and compare information (for example, using many-to-one correspondence in pictograms with simple ratios 2, 5, 10).",
      "examples": "many-to-one correspondence in pictograms with simple ratios 2, 5, 10",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O033",
      "domain_id": "MA-Y2-D008",
      "objective_text": "ask and answer simple questions by counting the number of objects in each category and sorting the categories by quantity",
      "non_statutory_guidance": "Pupils record, interpret, collate, organise and compare information (for example, using many-to-one correspondence in pictograms with simple ratios 2, 5, 10).",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y2-O034",
      "domain_id": "MA-Y2-D008",
      "objective_text": "ask and answer questions about totalling and comparing categorical data.",
      "non_statutory_guidance": "Pupils record, interpret, collate, organise and compare information (for example, using many-to-one correspondence in pictograms with simple ratios 2, 5, 10).",
      "examples": "",
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "MA-Y2-C001",
      "domain_id": "MA-Y2-D001",
      "concept_name": "Counting in steps of 2, 3 and 5 from 0",
      "description": "In Year 2, counting in steps is extended to include steps of 3 (new from Year 1) as well as 2 and 5. Counting in threes is introduced specifically to support pupils' later understanding of a third as a fraction. Mastery means pupils can count forward and backward in each of these step sizes starting from 0 or any multiple, recognise the patterns in the resulting sequences, and connect these counting sequences to multiplication facts.",
      "teaching_guidance": "Counting in steps of 3 is new and should be introduced concretely: use groups of 3 objects, three-peg number lines, or hundred squares with every third square shaded. Connect counting in threes to the concept of one third — if you count in threes from 0 to 12, you have 4 groups of three, so one third of 12 is 4. Reinforce counting in 2s and 5s from Year 1, now starting from non-zero multiples. Connect to multiplication tables: counting in 5s from 0 generates the 5 times table. Counting sticks with groups colour-coded are effective. Ensure backward counting is practised alongside forward, as backward is significantly harder.",
      "key_vocabulary": "count in twos, count in threes, count in fives, count in tens, multiple, step, sequence, pattern, forward, backward",
      "common_misconceptions": "Counting in threes is harder than twos and fives for most pupils because the pattern of digits is less obvious. Pupils frequently make errors when the sequence crosses a decade boundary: ...18, 21 is correct, but pupils often say 20 or 19. Counting backwards in steps of 3 is substantially harder than forwards and requires targeted practice. Some pupils count in threes starting at 3 rather than 0, producing the correct sequence but starting at the wrong place.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true
    },
    {
      "concept_id": "MA-Y2-C002",
      "domain_id": "MA-Y2-D001",
      "concept_name": "Place value of two-digit numbers (tens and ones)",
      "description": "Understanding that every two-digit number is composed of a number of tens and a number of ones is the foundational place value concept of KS1. A number like 37 has 3 tens (30) and 7 ones, and this structure governs both its position in the number system and the way calculations with it work. Mastery means pupils can partition any two-digit number into tens and ones fluently, represent the number in multiple ways, and explain the value of each digit — knowing, for example, that in 37 the digit 3 represents 30, not 3.",
      "teaching_guidance": "Use base-ten materials (Dienes blocks: ten-sticks and unit cubes) as the primary concrete resource — pupils should build numbers from physical tens and ones before working pictorially. Straws bundled into tens are also effective. Progress to place value charts (T | O columns), then to numeral cards that can be overlaid (30 over 7 to make 37, showing the tens digit as 30). The curriculum specifies that pupils should partition numbers in different ways: 23 = 20 + 3 and also 23 = 10 + 13 — this flexible partitioning is critical for subtraction strategies. Address zero as a place holder: 30 has 3 tens and 0 ones.",
      "key_vocabulary": "tens, ones, units, digit, value, place value, partition, exchange, two-digit number, tens column, ones column",
      "common_misconceptions": "The most persistent misconception is that the digits represent their face value regardless of position — pupils think the 3 in 37 means 3, not 30. When partitioning, pupils often write 37 = 3 + 7 (face values) rather than 37 = 30 + 7. Flexible partitioning (23 = 10 + 13) is hard because pupils have a single mental model of partitioning into standard tens and ones. Zero as a place holder in numbers like 20, 30, 50 causes problems: some pupils read 20 as 'two' or think the zero has no effect.",
      "concept_type": "concept",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y2-C003",
      "domain_id": "MA-Y2-D001",
      "concept_name": "Comparing and ordering numbers to 100 using <, > and = symbols",
      "description": "Pupils compare numbers up to 100 using the formal mathematical symbols for less than (<), greater than (>) and equal to (=). This formalises the comparative language introduced in Year 1 into precise mathematical notation. Mastery means pupils use these symbols correctly and fluently, can order a set of numbers from smallest to largest or largest to smallest, and understand the symbols as expressing a relationship between two quantities (not just 'the answer goes here').",
      "teaching_guidance": "Introduce < and > through the concrete comparison of quantities first — two towers of cubes of different heights — before attaching symbols. The 'hungry crocodile' or 'arrow pointing to the smaller number' mnemonics are useful memory aids, though pupils must also develop genuine understanding of what the symbols mean. Connect to place value: when comparing two-digit numbers, compare tens digits first; if tens are equal, compare ones. Use a number line to show why, for example, 47 > 39 (47 is further right on the number line). Practise ordering sets of three or more numbers, not just pairs.",
      "key_vocabulary": "greater than, less than, equal to, compare, order, smallest, largest, ascending, descending, symbol, <, >, =",
      "common_misconceptions": "Pupils frequently reverse the < and > symbols, writing 47 < 39 when they mean 47 > 39. The symbols are direction-sensitive and some pupils treat them as interchangeable. Some pupils compare only the first digit of each number regardless of place value, leading to errors such as 19 > 21 (because 1 and 9 > 2 and 1 when read left-to-right as individual digits). The equals sign continues to be misunderstood as 'makes' rather than as expressing equivalence.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true
    },
    {
      "concept_id": "MA-Y2-C004",
      "domain_id": "MA-Y2-D002",
      "concept_name": "Recall of addition and subtraction facts to 20 and derived facts to 100",
      "description": "By Year 2, pupils should know number bonds to 20 and be able to use them to derive related facts to 100 — for example, knowing 3 + 7 = 10 leads directly to 30 + 70 = 100; 300 + 700 = 1000. This bridging from known facts to derived facts is a critical mental arithmetic skill. Mastery means pupils recall facts to 20 instantly without counting, and fluently apply place value reasoning to extend them to larger numbers.",
      "teaching_guidance": "Ensure bonds to 10 and 20 are fully automatic through regular rapid-fire oral and written practice before working on derived facts. When pupils know 6 + 4 = 10, show them explicitly how this gives 60 + 40 = 100 — use base-ten materials to make the structural connection visible. The curriculum specifies checking by adding numbers in different orders (5 + 2 + 1 = 1 + 5 + 2 = 1 + 2 + 5), establishing commutativity and associativity. Practise all three forms of each bond (a + b = c, c – b = a, b = c – a) so that derived subtraction facts are as automatic as addition facts.",
      "key_vocabulary": "number bond, recall, fluent, fact, derive, related fact, addition, subtraction, sum, difference, check",
      "common_misconceptions": "Many pupils know addition bonds but fail to derive the related subtraction facts automatically. They may know 6 + 14 = 20 but not immediately know 20 – 14 = 6. The extension from bonds to 10/20 to derived facts to 100 requires explicit teaching; pupils often do not make this connection spontaneously. When checking calculations by reordering numbers, pupils sometimes change the calculation itself rather than just verifying.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y2-C005",
      "domain_id": "MA-Y2-D002",
      "concept_name": "Adding and subtracting two-digit numbers",
      "description": "Pupils in Year 2 add and subtract with two-digit numbers using concrete objects, pictorial representations and mental methods — working with a two-digit number and ones, a two-digit number and tens, and two two-digit numbers. They also add three one-digit numbers. Mastery means pupils can perform these calculations accurately and efficiently using appropriate strategies, selecting between mental methods (using known facts and partitioning) and recording in columns as preparation for formal written methods.",
      "teaching_guidance": "Use base-ten materials (Dienes) to model calculations concretely before using pictorial representations (drawn tens and ones, number lines, bar models). Teach multiple strategies: counting on from the larger number for small additions, partitioning for larger additions (43 + 25 = 40 + 20 + 3 + 5 = 65), and using number bonds. The curriculum specifies recording in columns to support place value and prepare for formal methods — introduce column recording as a pictorial/abstract stage that mirrors the concrete Dienes work. Adding three one-digit numbers is best approached by first finding a pair that makes 10 (e.g. for 4 + 7 + 6, notice 4 + 6 = 10, so the answer is 10 + 7 = 17).",
      "key_vocabulary": "add, subtract, two-digit, ones, tens, total, sum, difference, partition, column, mental method, carry, exchange, count on, count back",
      "common_misconceptions": "When adding two two-digit numbers, pupils often add all four digits without regard to place value (e.g. 34 + 25 = 50 + 9 instead of 50 + 9 correctly — but sometimes written as 50 + 59 by combining wrongly). When crossing ten boundaries (e.g. 37 + 6 = 43), pupils often give 33 or 43 depending on whether they count on correctly. Subtracting a two-digit number from a two-digit number causes confusion when the ones digit of the first number is smaller than the ones digit being subtracted (e.g. 32 – 7); pupils may subtract in the wrong direction (7 – 2 = 5) giving 35 instead of 25.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y2-C006",
      "domain_id": "MA-Y2-D002",
      "concept_name": "Commutativity and associativity of addition; non-commutativity of subtraction",
      "description": "Commutativity means that the order of addends does not affect the sum (3 + 7 = 7 + 3). Associativity means that when adding three or more numbers, the grouping does not affect the result ((2 + 3) + 4 = 2 + (3 + 4)). Subtraction is not commutative (7 – 3 is not equal to 3 – 7). These properties are stated explicitly in the Year 2 curriculum and are essential for developing efficient calculation strategies. Mastery means pupils can apply these properties fluently to choose efficient calculation orders and justify their choices.",
      "teaching_guidance": "Demonstrate commutativity concretely by showing that two groups of objects combined give the same total regardless of order. Use arrays: a 3 × 4 array can be read as 3 rows of 4 or 4 rows of 3 — both give 12. For addition checking, require pupils to add numbers in a different order to verify (curriculum example: 5 + 2 + 1 = 1 + 5 + 2). Show that this works for addition but not subtraction: 7 – 3 = 4 but 3 – 7 cannot be 4. Connect to the number line: counting on 7 then 3 lands at the same place as counting on 3 then 7. Establish these as mathematical rules, not just tricks.",
      "key_vocabulary": "commutative, order, rearrange, addition, subtraction, check, same total, different order, associative, grouping",
      "common_misconceptions": "Pupils frequently try to apply commutativity to subtraction, writing 3 – 7 = 7 – 3 = 4, or stating that subtraction 'doesn't matter which way round'. They may apply the principle correctly in addition but have no understanding of why it works. Some pupils understand that 3 + 7 = 7 + 3 but do not use this knowledge to choose the more efficient calculation order.",
      "concept_type": "concept",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y2-C007",
      "domain_id": "MA-Y2-D002",
      "concept_name": "Inverse relationship between addition and subtraction",
      "description": "Addition and subtraction are inverse operations — each undoes the other. If 7 + 5 = 12, then 12 – 5 = 7 and 12 – 7 = 5. This relationship allows pupils to check calculations (add to check subtraction, subtract to check addition) and to solve missing number problems by working backwards. Mastery means pupils fluently move between addition and subtraction facts, use the inverse relationship to check their work, and understand why these operations are linked.",
      "teaching_guidance": "Use the bar model (part-whole model) as the primary representation — it makes the part-part-whole structure visible and shows how the same three numbers give both an addition and two subtractions. The curriculum specifically states pupils should use the inverse to check calculations and solve missing number problems: if ? – 9 = 7, pupils add 7 + 9 = 16 to find the missing number. Practise presenting fact families: 7 + 5 = 12, 5 + 7 = 12, 12 – 5 = 7, 12 – 7 = 5. Require pupils to write the full fact family when given one fact.",
      "key_vocabulary": "inverse, opposite, check, undo, addition, subtraction, fact family, part, whole, missing number",
      "common_misconceptions": "Pupils often know the inverse relationship in principle but fail to apply it spontaneously to check calculations. They may write 12 – 5 = 7 and then check it by repeating 12 – 5 rather than using 7 + 5. Missing number problems that require using the inverse — such as ? – 5 = 7 — are consistently harder than problems where the unknown is at the end of the equation.",
      "concept_type": "concept",
      "complexity_level": 3,
      "is_cross_cutting": true
    },
    {
      "concept_id": "MA-Y2-C008",
      "domain_id": "MA-Y2-D003",
      "concept_name": "2, 5 and 10 times tables (recall and use)",
      "description": "The 2, 5 and 10 multiplication tables are the first formal multiplication tables introduced in the national curriculum. Pupils must recall multiplication facts (e.g. 5 × 4 = 20) and related division facts (e.g. 20 ÷ 5 = 4) fluently, connect the tables to each other and to place value, and apply them in calculation contexts. Mastery means instant recall of all facts in the 2, 5 and 10 times tables, both in multiplication and division form.",
      "teaching_guidance": "Introduce each table through skip counting (which pupils already practise), then build to recall of individual facts. Connect tables to each other: 10 × table is double the 5 × table, so if 3 × 5 = 15, then 3 × 10 = 30. Connect the 5 × table to the clock face (5-minute intervals) — this is explicitly mentioned in the non-statutory guidance. Connect the 10 × table to place value (multiplying by 10 shifts all digits one place to the left). Use arrays, number lines with jumps, and real-world contexts (2p coins, 5p coins, counting in 10s). Flash cards and games for rapid recall practice are essential. Ensure division facts are taught alongside: 20 ÷ 5 = 4 is part of the same fact family as 4 × 5 = 20.",
      "key_vocabulary": "multiply, times, product, multiplication table, times table, factor, divide, division, quotient, even, odd, multiples of 2, multiples of 5, multiples of 10",
      "common_misconceptions": "Pupils often confuse multiplication and addition in early table work (e.g. 3 × 5 = 8 instead of 15, as if computing 3 + 5). They may know facts forward but not backward: knowing 5 × 4 = 20 but not 4 × 5 = 20. The connection between multiplication and division facts is not automatic: pupils may recall 5 × 4 = 20 but not know 20 ÷ 5 = 4. Recognising odd and even numbers from the 2 times table — even numbers are multiples of 2, odd numbers are not — is a conceptual milestone that some pupils learn procedurally (ends in 0, 2, 4, 6, 8) without understanding.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y2-C009",
      "domain_id": "MA-Y2-D003",
      "concept_name": "Writing multiplication and division statements using × and ÷ symbols",
      "description": "In Year 2, pupils begin to write formal multiplication and division statements using the symbols × and ÷, alongside = signs. This formalises the informal grouping and sharing of Year 1 into mathematical notation. Mastery means pupils can write a complete mathematical statement from a context (e.g. 3 groups of 5 is 15, written as 3 × 5 = 15) and interpret a written statement in a real-world context.",
      "teaching_guidance": "Begin with concrete contexts — 3 groups of 5 objects — and model writing the multiplication statement alongside the physical action. Connect multiplication notation to repeated addition: 3 × 5 = 5 + 5 + 5. Connect arrays to both multiplication and division: a 3-row, 5-column array shows both 3 × 5 = 15 and 5 × 3 = 15 (commutativity). Show division as both sharing (15 ÷ 3 = 5, sharing 15 among 3) and grouping (15 ÷ 5 = 3, how many groups of 5 in 15). The curriculum requires pupils to use all three symbols (×, ÷, =) correctly in formal statements.",
      "key_vocabulary": "multiply, times, multiplied by, ×, divide, divided by, ÷, equals, =, product, quotient, statement, equation",
      "common_misconceptions": "Pupils often write multiplication statements in the wrong order, confusing the multiplicand and multiplier (writing 5 × 3 when meaning '3 groups of 5'). Division notation is harder: pupils may write 3 ÷ 15 instead of 15 ÷ 3. The ÷ symbol itself may be confused with + or – at first. Pupils sometimes omit the = sign or place it incorrectly.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y2-C010",
      "domain_id": "MA-Y2-D003",
      "concept_name": "Commutativity of multiplication and non-commutativity of division",
      "description": "Multiplication is commutative: 4 × 5 = 5 × 4. This mirrors the commutativity of addition and can be shown using arrays (a 4-row, 5-column array is the same total as a 5-row, 4-column array). Division is not commutative: 20 ÷ 5 = 4 but 5 ÷ 20 does not equal 4. This parallel between the commutativity structures of addition/multiplication and the non-commutativity of subtraction/division is an important algebraic insight. Mastery means pupils can demonstrate commutativity with arrays, explain why it works, and correctly state that division cannot be reordered.",
      "teaching_guidance": "Use arrays as the primary concrete/pictorial demonstration: physically turn a 4 × 5 array and show it becomes a 5 × 4 array without changing the number of objects. Contrast with division using sharing contexts: you can share 20 between 5 (getting 4 each) but cannot 'share' 5 between 20 in the same way. The curriculum specifies that pupils should show commutativity — not just be told — so require them to construct and rotate their own arrays. Connect to the 'fact family' concept: 4 × 5 = 20 and 5 × 4 = 20 are both valid; 20 ÷ 5 = 4 and 20 ÷ 4 = 5 are also both valid, but these are different divisions from different factorings.",
      "key_vocabulary": "commutative, order, array, turn, rotate, multiplication, division, rearrange, same product",
      "common_misconceptions": "Pupils apply commutativity to division as they do to multiplication, stating that 20 ÷ 5 = 5 ÷ 20. Some pupils understand that × is commutative but confuse this with thinking all operations are commutative. When using arrays to demonstrate commutativity, pupils sometimes recount the array rather than reasoning about its rotational symmetry.",
      "concept_type": "concept",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y2-C011",
      "domain_id": "MA-Y2-D001",
      "concept_name": "Recognising odd and even numbers",
      "description": "Even numbers are multiples of 2; odd numbers are not. In the context of the Year 2 curriculum, recognising odd and even numbers arises from the 2 times table and from counting in twos. Mastery means pupils can identify whether any number is odd or even, know the rule (even numbers end in 0, 2, 4, 6 or 8; odd numbers end in 1, 3, 5, 7 or 9), and understand the underlying concept that even numbers can be divided into two equal groups but odd numbers cannot.",
      "teaching_guidance": "Begin concretely: can you share this number of objects equally between two people? If yes, the number is even; if one object is left over, the number is odd. Connect this to the 2 times table: even numbers appear in the 2 times table. Establish the digit rule as a pattern observation after exploring enough examples. Use the hundred square with even numbers highlighted to see the pattern. Note that 'even' and 'odd' are properties of integers, not of digits — 24 is even because 24 objects can be shared equally between 2, not just because it ends in 4.",
      "key_vocabulary": "even, odd, multiple of two, divisible by two, remainder, share equally, pairs",
      "common_misconceptions": "Pupils sometimes classify a number as even because it 'sounds even' or because they have memorised a list (2, 4, 6, 8, 10) without understanding the rule. They may not know whether larger numbers (e.g. 76, 83) are odd or even because they are beyond their memorised list — teaching the units-digit rule addresses this. Some pupils classify 0 incorrectly (0 is even) or are uncertain about it.",
      "concept_type": "concept",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y2-C012",
      "domain_id": "MA-Y2-D004",
      "concept_name": "Fractions as 'fractions of': 1/3, 1/4, 2/4, 3/4",
      "description": "Year 2 extends the set of fractions pupils can find and name from halves and quarters (Year 1) to include thirds and three-quarters. Pupils use fractions to describe a part of a discrete quantity (e.g. 1/3 of 12 = 4) or a continuous quantity (e.g. 1/3 of a length). A quarter of a quantity is one of four equal parts; two quarters (2/4) is two of those four equal parts; three quarters (3/4) is three of those four equal parts. Three-quarters is explicitly the first non-unit fraction pupils encounter. Mastery means pupils can find any of these fractions of given quantities and lengths, and write the fraction notation correctly.",
      "teaching_guidance": "Use sharing as the primary concrete approach: to find 1/3 of 12, share 12 equally among 3 (each person gets 4). To find 3/4 of 12, first find 1/4 (share among 4 = 3), then multiply by 3 (three-quarters = 3 groups of the unit fraction = 9). Use fraction strips and number lines to show fractions of continuous quantities. The curriculum specifies that pupils should count in fractions up to 10 on the number line (1 1/4, 1 2/4, 1 3/4, 2...) to understand fractions as numbers in their own right. Write fraction notation clearly: the vinculum (fraction bar) separates numerator and denominator.",
      "key_vocabulary": "fraction, third, quarter, three-quarters, numerator, denominator, unit fraction, non-unit fraction, equal parts, whole",
      "common_misconceptions": "Pupils frequently confuse the denominator with the number of shaded parts, rather than the total number of equal parts. When finding fractions of quantities by sharing, pupils may share unequally and not recognise the error. For three-quarters, pupils often do not connect this to 3 × (1/4) — they see it as a new fraction to memorise rather than as three unit fractions combined. Writing fraction notation is confused: some pupils write the numerator below the line.",
      "concept_type": "concept",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y2-C013",
      "domain_id": "MA-Y2-D004",
      "concept_name": "Fraction equivalence: 2/4 = 1/2",
      "description": "The recognition that 2/4 and 1/2 name the same quantity — the same point on the number line, the same part of a whole — is the first exposure to fraction equivalence in the national curriculum. This is conceptually significant: two fractions with different numerators and denominators can have the same value. Mastery means pupils understand why 2/4 = 1/2 (because two of four equal parts is the same as one of two equal parts), and can identify this equivalence in different contexts.",
      "teaching_guidance": "Demonstrate equivalence concretely by folding: fold a strip of paper into halves, shade one half; fold a congruent strip into quarters, shade two quarters — the shaded regions are the same size. Use fraction walls and number lines where both 1/2 and 2/4 appear at the same point. The non-statutory guidance specifies counting in fractions on the number line using both 1 2/4 and 1 1/2 as equivalent names for the same point. Avoid purely symbolic demonstration at this stage; always ground equivalence in a visual or concrete model that shows the equality of the quantities.",
      "key_vocabulary": "equivalent, equal, same, fraction, 1/2, 2/4, different names, fraction wall, number line",
      "common_misconceptions": "Pupils initially resist the idea that fractions with different numerators and denominators can be equal — they interpret 2/4 and 1/2 as different fractions because 2 is not the same as 1 and 4 is not the same as 2. They may know that 2/4 = 1/2 as a rote fact without understanding why. Some pupils think larger denominators always mean larger fractions.",
      "concept_type": "concept",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y2-C014",
      "domain_id": "MA-Y2-D005",
      "concept_name": "Measuring with standard units: length, mass, temperature and capacity",
      "description": "Year 2 requires pupils to choose and use appropriate standard units to measure with increasing accuracy, using rulers (m/cm), weighing scales (kg/g), thermometers (°C), and measuring vessels (litres/ml). This represents a significant step from the introduction of measuring tools in Year 1 to accurate, independent measurement with standard notation. Mastery means pupils can select the appropriate unit and tool for a given measurement, measure to the nearest appropriate unit, read scales accurately, and record using standard abbreviations.",
      "teaching_guidance": "Provide ample practical measurement experience with real objects and instruments. Teach reading scales explicitly — scales with different intervals require careful counting. Estimate before measuring to develop number sense about quantities. Discuss appropriate choice of unit: centimetres for a pencil, metres for a classroom; grams for a biscuit, kilograms for a child. Record using standard abbreviations from the start (m, cm, kg, g, °C, l, ml). The non-statutory guidance specifies that comparing measures includes simple multiples such as 'half as high' and 'twice as wide', connecting measurement to multiplication and fractions.",
      "key_vocabulary": "metre, centimetre, kilogram, gram, litre, millilitre, degree Celsius, ruler, scales, thermometer, measuring vessel, estimate, measure, nearest, unit, abbreviation",
      "common_misconceptions": "Reading scales that do not label every division causes errors — pupils count individual marks rather than working out the interval between labelled marks. When measuring length, pupils misalign the start of the ruler with the start of the object. Confusing kg with g and l with ml leads to errors of a factor of 1000. Pupils may not read a thermometer correctly because temperature scales include negative numbers below zero.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y2-C015",
      "domain_id": "MA-Y2-D005",
      "concept_name": "Money: using £ and p symbols, making amounts, giving change",
      "description": "In Year 2, pupils move beyond recognising coins (Year 1) to using the £ and p symbols accurately, combining coins to make specified amounts, finding different coin combinations for the same total, and solving simple addition and subtraction problems involving money including giving change. Mastery means pupils can work confidently with money in practical contexts, record amounts accurately using £ and p notation (recorded separately, e.g. £1 and 35p, not £1.35 which uses decimal notation introduced later), and calculate change mentally.",
      "teaching_guidance": "Use real or realistic plastic coins and notes. Practise 'making amounts' by selecting coins to reach a target total. Explore how many different combinations of coins can make, say, 20p (reinforcing understanding that value matters, not the number of coins). For change, use the 'shopkeeper's method' of counting up from the cost to the amount paid: if something costs 37p and you pay 50p, count up 37 → 40 (3p) → 50 (10p), so change is 13p. The curriculum specifies recording pounds and pence separately at this stage; do not introduce decimal £ notation (£1.35) as this comes later.",
      "key_vocabulary": "pounds, pence, £, p, coin, note, total, amount, change, pay, cost, worth, combination, different ways",
      "common_misconceptions": "Pupils mix up £ and p symbols and may write amounts like £37p or confuse 37p with £37. When counting coins to make an amount, pupils sometimes count the number of coins rather than their values. Calculating change by subtraction is much harder than counting up, so most pupils benefit from the counting-up strategy initially. Finding all possible coin combinations requires systematic thinking that many pupils do not apply spontaneously.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y2-C016",
      "domain_id": "MA-Y2-D005",
      "concept_name": "Telling the time to five minutes and quarter past/to",
      "description": "Year 2 extends clock reading from the hour and half past (Year 1) to five-minute intervals, including quarter past and quarter to the hour. Pupils read and write the time and draw clock hands to show given times. Mastery means pupils can read any time that is a multiple of five minutes on an analogue clock, distinguish between quarter past and quarter to, and know the number of minutes in an hour (60) and the number of hours in a day (24).",
      "teaching_guidance": "Connect the five-minute intervals to counting in fives (curriculum connections): the 12 positions of the minute hand on a clock are each 5 minutes apart, and counting in fives from 0 (at 12) gives the minute values (5 at the 1, 10 at the 2... 30 at the 6, etc.). The non-statutory guidance explicitly connects the 5 times table to the divisions on the clock face. Use geared demonstration clocks so movements of the minute hand are shown to move the hour hand proportionally. Quarter past connects to the quarter turn concept from Year 1 geometry; quarter to connects to three-quarter turn. Introduce written time recording (e.g. '3:25' alongside 'twenty-five past three').",
      "key_vocabulary": "quarter past, quarter to, five minutes, o'clock, half past, clock, analogue, hour hand, minute hand, minutes in an hour, hours in a day, 60 minutes, 24 hours",
      "common_misconceptions": "Pupils confuse quarter past and quarter to — 'quarter to 4' means the minute hand is at 9 (showing 45 minutes past, or 15 minutes to 4) but pupils may read the 9 as referring to the hour and say 9 o'clock. Reading times between the hour and half past (e.g. 20 past 3) is generally easier than times between half past and the next hour (e.g. 20 to 4) because 'to' requires pupils to count backwards from the hour. The hour hand position between two numbers is consistently a source of error.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y2-C017",
      "domain_id": "MA-Y2-D006",
      "concept_name": "Properties of 2-D shapes: sides, symmetry",
      "description": "Year 2 pupils move from recognising 2-D shapes by name (Year 1) to analysing their properties: the number of sides, the number of vertices (corners), and the presence of line symmetry in a vertical line. Pupils handle and name a wider range of 2-D shapes including quadrilaterals and polygons, and identify and compare shapes on the basis of their properties. Mastery means pupils can precisely count and describe sides and vertices, identify whether a shape has vertical line symmetry, and sort shapes by their properties using precise vocabulary.",
      "teaching_guidance": "Use physical shape tiles and geoboards so pupils can feel and count sides. Introduce the full range of quadrilaterals: square, rectangle, rhombus, parallelogram, trapezium — pupils should be challenged by these rather than only seeing squares and rectangles. For line symmetry, use mirrors and paper folding: a shape has vertical line symmetry if a vertical fold creates two identical halves. Sort shapes using a two-way table (e.g. has symmetry/does not have symmetry; 4 sides/not 4 sides). Introduce the terms polygon (closed straight-sided shape) and quadrilateral (four-sided polygon).",
      "key_vocabulary": "side, vertex, vertices, corner, polygon, quadrilateral, triangle, rectangle, square, circle, symmetry, line of symmetry, vertical, mirror line",
      "common_misconceptions": "Pupils often confuse vertices and sides, counting vertices as sides or missing corners when counting sides of irregular polygons. Line symmetry in non-vertical lines confuses pupils who have only experienced vertical symmetry; they may claim a shape has no symmetry when it has a diagonal or horizontal line of symmetry (though only vertical symmetry is required at Year 2). Pupils may think regular shapes (equilateral triangles, squares) are the only shapes with symmetry.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y2-C018",
      "domain_id": "MA-Y2-D006",
      "concept_name": "Properties of 3-D shapes: faces, edges and vertices",
      "description": "Year 2 pupils extend their knowledge of 3-D shapes from recognising and naming (Year 1) to identifying and counting their faces, edges and vertices. They work with a wider range of 3-D shapes including cuboids, prisms and cones. Mastery means pupils can accurately count and name the faces, edges and vertices of common 3-D shapes, use this vocabulary precisely, and sort 3-D shapes by their properties.",
      "teaching_guidance": "Handle solid 3-D shapes — pupils must feel faces as flat surfaces, trace edges as meeting lines between faces, and identify vertices as sharp corners where edges meet. For a cube: 6 faces, 12 edges, 8 vertices. For a sphere: 0 faces, 0 edges, 0 vertices (or 1 curved surface, depending on how it is categorised — use language appropriate to Year 2). Introduce prisms: a prism has two identical parallel polygon faces (the bases) connected by rectangular lateral faces — a triangular prism has 5 faces, 9 edges, 6 vertices. Connect 2-D and 3-D: identify the 2-D shapes on the surfaces of 3-D shapes (squares on a cube; triangles on a pyramid; circles on a cylinder).",
      "key_vocabulary": "face, edge, vertex, vertices, 3-D, solid, cube, cuboid, prism, pyramid, sphere, cylinder, cone, surface, flat, curved",
      "common_misconceptions": "Pupils confuse faces and edges, using the terms interchangeably. They often miscount edges (the most numerous feature) of shapes like cubes or cuboids. Some pupils count the same edge or vertex twice. Curved surfaces on shapes like cylinders and spheres are tricky — pupils may not know whether to call the curved surface of a cylinder a 'face'. Pupils often confuse a prism and a pyramid because both come to at least one point.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y2-C019",
      "domain_id": "MA-Y2-D006",
      "concept_name": "2-D shapes on the surface of 3-D shapes",
      "description": "Identifying the 2-D shapes that form the faces of a 3-D shape (e.g. a circle on a cylinder, a triangle on a pyramid, a square on a cube) connects the two-dimensional and three-dimensional worlds of geometry. This concept also develops mathematical reasoning about how 3-D shapes are constructed from 2-D faces. Mastery means pupils can correctly identify all 2-D face shapes on common 3-D shapes and explain the relationship.",
      "teaching_guidance": "Use physical 3-D shapes and have pupils press each face onto paper to trace the 2-D face shape — this makes the connection concrete and memorable. Sorting activities: group 3-D shapes by which 2-D shapes appear on their faces. Connect to the earlier concept of 'nets' (though not formally required until Year 4): unfold a cardboard box to see the 2-D rectangle faces. The curriculum includes this objective with the example of 'a circle on a cylinder and a triangle on a pyramid', so ensure both examples are covered explicitly.",
      "key_vocabulary": "face, surface, 2-D, 3-D, circle, triangle, square, rectangle, cylinder, pyramid, cube, cuboid, prism",
      "common_misconceptions": "Pupils may not distinguish between the face of a 3-D shape and the whole shape itself. They may identify a square on the face of a cube but not recognise all six faces as squares. The curved surface of a cylinder is confusing: the circular faces at top and bottom are clearly circles, but the curved lateral surface does not map to a simple 2-D shape in the same way.",
      "concept_type": "concept",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y2-C020",
      "domain_id": "MA-Y2-D007",
      "concept_name": "Movement in a straight line and rotation as right angles",
      "description": "Year 2 extends the informal turning language of Year 1 to introduce the right angle as the standard unit of quarter turns. Pupils distinguish between movement in a straight line and movement as rotation (turning), and describe rotations specifically in terms of right angles — a quarter turn is one right angle, a half turn is two right angles, a three-quarter turn is three right angles, and a whole turn is four right angles. Mastery means pupils can make, describe and record rotations in right angle terms, and use this language to program routes and describe direction changes.",
      "teaching_guidance": "Physical movement is essential: pupils should walk in straight lines and make turning movements, describing their actions using right angle language. Programmable robots (Beebots, Scratch) provide an excellent context where right angle turns must be specified precisely as quarter turns (or 90°, though degrees are not formal until Year 5). The non-statutory guidance specifies that pupils use the concept and language of angles to describe 'turn', including in practical contexts such as giving instructions to other pupils and programming robots. Connect to the right angle as the corner of a square, and to the shape properties domain where right angles appear as shape properties.",
      "key_vocabulary": "right angle, quarter turn, half turn, three-quarter turn, whole turn, clockwise, anticlockwise, rotation, straight line, direction, movement",
      "common_misconceptions": "Pupils confuse the right angle (the angle itself — a measure of turn) with 'turning right'. Right turns and left turns are different from clockwise and anticlockwise; these pairs of terms are not synonymous. Pupils may not distinguish between translation (moving in a straight line) and rotation (turning on the spot), describing all movements as 'going'.",
      "concept_type": "concept",
      "complexity_level": 3,
      "is_cross_cutting": true
    },
    {
      "concept_id": "MA-Y2-C021",
      "domain_id": "MA-Y2-D001",
      "concept_name": "Patterns and sequences with mathematical objects",
      "description": "Pupils order and arrange combinations of mathematical objects in patterns and sequences. This includes continuing, describing and creating repeating patterns (with shapes, colours, numbers or other attributes) and understanding the rule that generates a sequence. Mastery means pupils can identify the rule of a pattern or sequence, continue it correctly, and create their own patterns using given criteria.",
      "teaching_guidance": "Work with patterns of shapes in different orientations — the non-statutory guidance specifies this. Use patterns that change in multiple attributes simultaneously (e.g. shape AND colour AND size) to develop systematic thinking. Connect to the number sequences from the number domain: counting in 2s, 3s, 5s, 10s as numerical sequences with a rule. Pattern and sequence work develops early algebraic thinking — the 'term-to-term rule' is introduced here informally. Extend to more complex repeating units (ABB, ABBC) and growing patterns.",
      "key_vocabulary": "pattern, sequence, repeat, rule, next, continue, predict, term, arrangement, order",
      "common_misconceptions": "Pupils often copy a pattern rather than identifying and applying the rule; they cannot continue a pattern shown from the middle. They may identify the wrong unit of repeat (e.g. in ABCABCABC, identifying AB as the repeat rather than ABC). Growing patterns (where the unit changes in a systematic way) are harder than repeating patterns and require more scaffolding.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true
    },
    {
      "concept_id": "MA-Y2-C022",
      "domain_id": "MA-Y2-D008",
      "concept_name": "Interpreting and constructing pictograms, tally charts, block diagrams and tables",
      "description": "Year 2 introduces statistics through four data representation formats: pictograms, tally charts, block diagrams and simple tables. Pupils both interpret existing representations (answering questions from given charts) and construct their own (gathering data and representing it). A key concept is many-to-one correspondence in pictograms, where one symbol represents more than one data unit (e.g. one picture = 2 items). Mastery means pupils can read values accurately from all four formats, construct representations from raw data, and answer questions about totals and comparisons.",
      "teaching_guidance": "Begin with one-to-one pictograms (one picture = one item) before introducing many-to-one. Tally charts are introduced as a data collection tool — teach the 'gate' system (four vertical lines then a diagonal cross for five). Block diagrams (bar graphs with blocks) should start with each block representing one unit, then one block representing 2 or 5 or 10. The curriculum specifies that pupils should ask and answer three types of question: counting objects in each category, sorting by quantity, and totalling and comparing. Start with data from real class surveys to maintain motivation and context.",
      "key_vocabulary": "data, tally, tally chart, pictogram, block diagram, table, key, many-to-one, category, total, compare, most, least, frequency, represent",
      "common_misconceptions": "Many-to-one correspondence in pictograms is the biggest source of error: pupils read each symbol as representing one unit even when the key says otherwise. When constructing block diagrams, pupils do not space blocks evenly or align them with the scale. Reading tally charts, pupils often miscount the five-gate unit. When answering 'how many more' questions, pupils subtract incorrectly or use addition instead of subtraction.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true
    },
    {
      "concept_id": "MA-Y2-C023",
      "domain_id": "MA-Y2-D008",
      "concept_name": "Asking and answering questions about data",
      "description": "Beyond constructing and reading representations, Year 2 pupils ask and answer questions about their data: how many objects are in each category, which category has most or least, and questions about totals and differences between categories. These three types of statistical question — descriptive, comparative and aggregating — establish the fundamental purposes of data analysis. Mastery means pupils can formulate appropriate questions about a data set and answer them correctly from visual representations.",
      "teaching_guidance": "Model the three types of question explicitly as a framework: 'How many?' (descriptive), 'Which has the most/least?' (comparative), and 'How many altogether?' or 'How many more?' (aggregating). Encourage pupils to generate their own questions from data they have collected rather than only answering teacher-generated questions. This develops statistical thinking and sense-making. Connect the numerical operations needed to answer questions (addition for totalling, subtraction for differences) to the number domain.",
      "key_vocabulary": "question, answer, data, category, total, most, least, more than, fewer than, how many, altogether, compare, difference",
      "common_misconceptions": "Pupils often answer 'which has most?' questions correctly but struggle with 'how many more?' questions, which require subtraction. They may confuse 'how many in this category' with 'how many altogether in all categories'. Forming questions about data (as opposed to answering given questions) is cognitively demanding and requires explicit modelling.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "MA-Y1-C002",
      "dependent_concept": "MA-Y2-C001",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Counting in multiples of 2, 5 and 10 from Year 1 is the direct prerequisite for counting in steps of 2, 3 and 5 in Year 2 — the Year 2 curriculum extends and formalises the Year 1 skip counting into the multiplication table context"
    },
    {
      "prerequisite_concept": "MA-Y1-C003",
      "dependent_concept": "MA-Y2-C002",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Reading and writing numerals to 100 is prerequisite to understanding the place value structure of those same numbers — pupils must be able to identify and represent the numbers before analysing the value of each digit"
    },
    {
      "prerequisite_concept": "MA-Y1-C007",
      "dependent_concept": "MA-Y2-C003",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "The comparative language of 'more than' and 'less than' from Year 1 is formalised in Year 2 into the < and > symbols — pupils must understand the concepts before learning the notation"
    },
    {
      "prerequisite_concept": "MA-Y1-C008",
      "dependent_concept": "MA-Y2-C004",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "Number bonds within 20 from Year 1 are the direct prerequisite for the Year 2 requirement to recall and use addition and subtraction facts to 20 fluently and derive related facts to 100"
    },
    {
      "prerequisite_concept": "MA-Y2-C004",
      "dependent_concept": "MA-Y2-C005",
      "confidence": "explicit",
      "relationship_type": "enabling",
      "strength": 0.9,
      "rationale": "Fluent recall of addition and subtraction facts to 20 enables efficient calculation with two-digit numbers, as many two-digit calculations reduce to combinations of number bonds"
    },
    {
      "prerequisite_concept": "MA-Y2-C002",
      "dependent_concept": "MA-Y2-C005",
      "confidence": "explicit",
      "relationship_type": "enabling",
      "strength": 0.85,
      "rationale": "Understanding place value in two-digit numbers is prerequisite to adding and subtracting them correctly, as calculations must respect the tens and ones structure of the numbers"
    },
    {
      "prerequisite_concept": "MA-Y2-C005",
      "dependent_concept": "MA-Y2-C006",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.75,
      "rationale": "Experience with adding and subtracting numbers enables pupils to discover and verify the commutative property of addition through practical examples"
    },
    {
      "prerequisite_concept": "MA-Y1-C011",
      "dependent_concept": "MA-Y2-C007",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Missing number problems from Year 1 introduce the inverse relationship between addition and subtraction — Year 2 formalises this as a general principle that pupils can apply to check calculations"
    },
    {
      "prerequisite_concept": "MA-Y1-C002",
      "dependent_concept": "MA-Y2-C008",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Counting in twos, fives and tens from Year 1 directly generates the 2, 5 and 10 multiplication tables; the curriculum explicitly connects skip counting to multiplication table recall"
    },
    {
      "prerequisite_concept": "MA-Y1-C012",
      "dependent_concept": "MA-Y2-C009",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "The informal grouping and sharing of Year 1 is the conceptual foundation for the formal multiplication and division notation introduced in Year 2"
    },
    {
      "prerequisite_concept": "MA-Y2-C008",
      "dependent_concept": "MA-Y2-C009",
      "confidence": "explicit",
      "relationship_type": "enabling",
      "strength": 0.9,
      "rationale": "Knowledge of multiplication and division facts is needed before pupils can write formal mathematical statements using × and ÷ symbols, as they need the facts to generate correct statements"
    },
    {
      "prerequisite_concept": "MA-Y2-C008",
      "dependent_concept": "MA-Y2-C010",
      "confidence": "explicit",
      "relationship_type": "enabling",
      "strength": 0.8,
      "rationale": "Understanding multiplication facts is prerequisite to demonstrating commutativity with arrays, as pupils need to know the facts to show that 4 × 5 and 5 × 4 give the same result"
    },
    {
      "prerequisite_concept": "MA-Y2-C001",
      "dependent_concept": "MA-Y2-C011",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Counting in steps of 2 (the 2 times table) directly generates the even numbers; odd numbers are defined as not multiples of 2, so skip counting is the foundation for identifying odd and even"
    },
    {
      "prerequisite_concept": "MA-Y1-C014",
      "dependent_concept": "MA-Y2-C012",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Understanding one half from Year 1 is prerequisite to the extended fractions of Year 2 — 1/4, 2/4 and 3/4 are extensions of the halving concept, and 1/3 parallels the structure of 1/2"
    },
    {
      "prerequisite_concept": "MA-Y1-C015",
      "dependent_concept": "MA-Y2-C012",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Understanding one quarter from Year 1 is the direct prerequisite for two quarters and three quarters in Year 2, as 2/4 and 3/4 are multiples of the unit fraction 1/4"
    },
    {
      "prerequisite_concept": "MA-Y2-C012",
      "dependent_concept": "MA-Y2-C013",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Understanding both 1/2 and 2/4 as fractions is prerequisite to recognising their equivalence — pupils must understand both fractions as quantities before they can compare them and discover they are equal"
    },
    {
      "prerequisite_concept": "MA-Y1-C016",
      "dependent_concept": "MA-Y2-C014",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "The introduction to measuring length with non-standard and standard units in Year 1 prepares pupils for the accurate use of multiple standard units (m, cm, kg, g, °C, l, ml) required in Year 2"
    },
    {
      "prerequisite_concept": "MA-Y1-C020",
      "dependent_concept": "MA-Y2-C015",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Recognising coins and notes from Year 1 is the prerequisite for the Year 2 money work of combining coins, finding different combinations, using £ and p notation, and giving change"
    },
    {
      "prerequisite_concept": "MA-Y1-C019",
      "dependent_concept": "MA-Y2-C016",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "Reading the clock to the hour and half past from Year 1 is the direct prerequisite for extending to five-minute intervals and quarter-past/quarter-to in Year 2"
    },
    {
      "prerequisite_concept": "MA-Y2-C008",
      "dependent_concept": "MA-Y2-C016",
      "confidence": "explicit",
      "relationship_type": "enabling",
      "strength": 0.75,
      "rationale": "The non-statutory guidance explicitly connects the 5 multiplication table to the divisions on the clock face — knowing 5-minute multiples from the 5 times table enables reading five-minute intervals on the clock"
    },
    {
      "prerequisite_concept": "MA-Y1-C021",
      "dependent_concept": "MA-Y2-C017",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Recognising and naming 2-D shapes in Year 1 is the prerequisite for identifying and describing their properties (sides, vertices, symmetry) in Year 2"
    },
    {
      "prerequisite_concept": "MA-Y1-C022",
      "dependent_concept": "MA-Y2-C018",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Recognising and naming 3-D shapes in Year 1 is the prerequisite for identifying and describing their properties (faces, edges, vertices) in Year 2"
    },
    {
      "prerequisite_concept": "MA-Y1-C024",
      "dependent_concept": "MA-Y2-C020",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "The whole, half, quarter and three-quarter turns introduced in Year 1 are the prerequisite for the Year 2 formalisation of these turns as right angles — Year 2 gives a precise geometric name to what was informally explored in Year 1"
    },
    {
      "prerequisite_concept": "MA-Y1-C001",
      "dependent_concept": "MA-Y2-C022",
      "confidence": "inferred",
      "relationship_type": "enabling",
      "strength": 0.7,
      "rationale": "Counting fluency is required to read and construct statistical representations, as interpreting a tally chart or pictogram requires counting tallies and understanding that numbers represent frequencies"
    },
    {
      "prerequisite_concept": "MA-Y2-C022",
      "dependent_concept": "MA-Y2-C023",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Interpreting data representations is a prerequisite for asking and answering questions about them — pupils must be able to read values from charts before they can calculate totals and differences"
    },
    {
      "prerequisite_concept": "MA-Y2-C005",
      "dependent_concept": "MA-Y2-C023",
      "confidence": "inferred",
      "relationship_type": "enabling",
      "strength": 0.7,
      "rationale": "Addition and subtraction skills are required to answer statistical questions about totalling and comparing data — 'how many more?' requires subtraction, 'how many altogether?' requires addition"
    }
  ]
}