{
  "metadata": {
    "subject": "Mathematics",
    "key_stage": "KS2",
    "years_covered": [6],
    "document_reference": "DFE-00180-2013",
    "extraction_date": "2026-02-17",
    "source_pages": "39-45",
    "structure_rating": 9,
    "notes": "Year 6 Mathematics curriculum for ages 10-11. Final year of Upper Key Stage 2. Comprehensive curriculum bridging to KS3. Focus on mastery of the number system to 10 million, advanced fractions/decimals/percentages, introduction to algebra, ratio and proportion, formal written methods for all four operations, and thorough preparation for secondary mathematics."
  },
  "domains": [
    {
      "domain_id": "MA-Y6-D001",
      "domain_name": "Number - Number and Place Value",
      "description": "Reading, writing, ordering and comparing numbers to 10,000,000; understanding place value; negative numbers and intervals across zero; rounding to any degree of accuracy.",
      "curriculum_context": "Year 6 number and place value work consolidates and extends the progression from thousands (Year 4) through 1,000,000 (Year 5) to 10,000,000, ensuring pupils have a secure understanding of our base-10 number system at its upper primary limit. Mastery of place value to 10 million is foundational for the formal written methods, mental calculations, and estimation skills that pervade all other Year 6 domains. Work on negative numbers extends from the introductory contexts of temperature and debt encountered in Year 5 to more formal number-line reasoning and calculation across zero, which underpins algebraic thinking and prepares pupils for the directed number work of KS3. Rounding to any degree of accuracy is a transferable skill that pupils apply throughout measurement, statistics, and problem-solving contexts in Year 6 and beyond. This domain also develops the language and symbolic representation of very large numbers, an important outcome for numeracy in everyday life.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical"
    },
    {
      "domain_id": "MA-Y6-D002",
      "domain_name": "Number - Addition, Subtraction, Multiplication and Division",
      "description": "Performing mental calculations with large numbers and mixed operations; using formal written methods for long multiplication and long division; identifying common factors, common multiples and prime numbers; understanding and applying the order of operations; solving multi-step problems involving all four operations.",
      "curriculum_context": "Year 6 completes the primary programme for written and mental calculation by introducing long division as the final formal written method and by embedding the order of operations (BODMAS/BIDMAS) so that pupils can work reliably with expressions involving brackets and multiple operations. Building on the short multiplication and division of Year 5 and the secure times-table knowledge established by Year 4, pupils now extend written methods to 4-digit dividends divided by 2-digit divisors, a significant cognitive step requiring strong place value understanding. The explicit teaching of common factors, common multiples, and the distinction between prime and composite numbers deepens pupils' number-theoretic understanding and supports later work in algebra and ratio. Multi-step problem-solving receives sustained emphasis in Year 6, reflecting the fact that national assessments require pupils to select and combine appropriate operations across increasingly complex contexts. Mental calculation strategies are refined and extended so that pupils can perform efficient approximate and exact calculations without reliance on written methods for straightforward cases.",
      "is_cross_cutting": false,
      "structure_type": "sequential"
    },
    {
      "domain_id": "MA-Y6-D003",
      "domain_name": "Number - Fractions (including decimals and percentages)",
      "description": "Simplifying fractions using common factors; comparing and ordering fractions greater than one; adding and subtracting fractions with different denominators and mixed numbers; multiplying simple pairs of fractions; dividing fractions by whole numbers; computing decimal calculations to three decimal places; expressing fractions as decimals and percentages.",
      "curriculum_context": "Year 6 fractions work represents the culmination of the primary fraction strand, which began with equal sharing in EYFS and progressed through unit fractions, equivalent fractions, and operations with like denominators across KS1 and lower KS2. Pupils now encounter the full range of fraction arithmetic — adding and subtracting fractions with different denominators, multiplying fractions together, and dividing fractions by whole numbers — equipping them with the conceptual and procedural tools needed for the rational number work of KS3. The explicit link between fractions, decimals and percentages, developed progressively since Year 4, is consolidated here so that pupils can fluently move between representations according to context, an essential skill for proportion reasoning and data interpretation. Simplification of fractions using highest common factors connects fraction work to pupils' developing understanding of multiplicative structure and factors. This domain also addresses the important concept of fractions as operators (a fraction of a quantity) and as measures, helping pupils develop flexible thinking about fractions beyond the part-whole model.",
      "is_cross_cutting": false,
      "structure_type": "sequential"
    },
    {
      "domain_id": "MA-Y6-D004",
      "domain_name": "Ratio and Proportion",
      "description": "Solving problems involving the relative sizes of two quantities using ratio notation; solving problems involving similar shapes and scale factors; using percentages for comparison; solving problems involving unequal sharing and grouping.",
      "curriculum_context": "Ratio and proportion is introduced explicitly as a named domain for the first time in Year 6, although proportional reasoning has been developed informally throughout the curriculum in contexts such as scaling recipes, comparing measures, and working with fractions and percentages. The formal introduction of ratio notation (a:b) and the language of 'for every' relationships marks a significant conceptual development, bridging the additive thinking that dominates KS1 and lower KS2 towards the multiplicative thinking central to KS3 mathematics. Work on similar shapes and scale factors provides an important geometric application of ratio, connecting proportion to Year 6 geometry content. The study of percentage as a tool for comparison introduces pupils to the idea of a common scale for comparing different quantities, which is extensively used in statistics and financial mathematics. This domain is deliberately brief but conceptually rich, laying foundations for the linear functions, direct proportion, and algebraic ratio work that pupils will encounter in secondary school.",
      "is_cross_cutting": true,
      "structure_type": "thematic"
    },
    {
      "domain_id": "MA-Y6-D005",
      "domain_name": "Algebra",
      "description": "Using simple formulae expressed in words and symbols; generating and describing linear number sequences; expressing missing number problems algebraically; finding pairs of numbers that satisfy an equation with two unknowns; enumerating possibilities of combinations of two variables.",
      "curriculum_context": "Algebra is introduced explicitly in Year 6 as a named domain, representing the formal beginning of symbolic mathematical reasoning that pupils will develop extensively throughout KS3 and beyond. Prior to Year 6, algebraic thinking has been present implicitly — in missing number problems from Year 1 onwards, in generalising pattern rules, and in the use of formulae for area and perimeter — but Year 6 formalises this into symbolic notation using letters to represent unknown or variable quantities. The transition from arithmetic to algebraic thinking is one of the most significant cognitive steps in mathematics education, and the Year 6 programme provides a carefully managed entry point through familiar contexts such as simple formulae and linear sequences. Work on equations with two unknowns introduces systematic enumeration of solutions, developing logical reasoning and laying groundwork for simultaneous equations at KS3. Teachers should emphasise the continuity between familiar arithmetic operations and their algebraic generalisations, helping pupils see algebra as a powerful tool for expressing and solving problems rather than a mysterious new subject.",
      "is_cross_cutting": true,
      "structure_type": "thematic"
    },
    {
      "domain_id": "MA-Y6-D006",
      "domain_name": "Measurement",
      "description": "Solving problems involving the calculation and conversion of units of measure using decimal notation; using, reading and writing standard units; recognising imperial units and their metric equivalents; calculating the area of triangles and parallelograms; calculating, estimating and comparing the volume of cubes and cuboids.",
      "curriculum_context": "Year 6 measurement extends the area and perimeter work of Years 3-5 to include the areas of triangles and parallelograms, requiring pupils to apply their understanding of multiplication and fractions (halving) in geometric contexts. Volume of cubes and cuboids builds on the introduction to volume in Year 5 and connects to the formulae for length, area, and volume in a coherent progression. The conversion of units using decimal notation consolidates and extends the metric conversion skills developed from Year 4, while the recognition of common imperial units and their metric equivalents serves the important practical purpose of enabling pupils to read everyday measurements in contexts such as road signs, recipes, and body weight. Problem-solving with measurement in Year 6 typically involves multi-step reasoning and the selection of appropriate units and methods, reflecting the emphasis on reasoning and problem-solving that characterises the national assessments pupils will face. This domain reinforces the cross-curricular links between mathematics and science, geography and design technology that make measurement a particularly important area of applied numeracy.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical"
    },
    {
      "domain_id": "MA-Y6-D007",
      "domain_name": "Geometry - Properties of Shapes",
      "description": "Recognising, describing and building simple 3-D shapes including nets; comparing and classifying geometric shapes based on their properties; finding unknown angles in triangles, quadrilaterals and regular polygons; illustrating and naming parts of circles including radius, diameter and circumference; describing positions on the full coordinate grid.",
      "curriculum_context": "Year 6 geometry consolidates and extends the shape classification and angle work of Years 4 and 5, introducing two important new areas: the properties of circles and the calculation of unknown angles using known angle facts. The introduction of circles as a named geometric focus (radius, diameter, circumference) prepares pupils for the circumference and area calculations of KS3 and establishes important vocabulary. Angle calculation — finding missing angles in triangles, quadrilaterals, and regular polygons using the properties that angles in a triangle sum to 180° and on a straight line to 180° — develops deductive geometric reasoning that is central to the KS3 geometry curriculum. Drawing and recognising nets of 3-D shapes supports spatial reasoning and connects to the volume work in the Measurement domain. The statutory requirement to reason about properties rather than merely identify shapes by appearance distinguishes mastery-level performance and reflects the curriculum's emphasis on mathematical reasoning.",
      "is_cross_cutting": false,
      "structure_type": "thematic"
    },
    {
      "domain_id": "MA-Y6-D008",
      "domain_name": "Geometry - Position and Direction",
      "description": "Describing positions on the full coordinate grid including all four quadrants; drawing and translating simple shapes on the coordinate plane; reflecting shapes in the axes.",
      "curriculum_context": "Year 6 position and direction extends the first-quadrant coordinate work of Year 4 and the all-four-quadrant introduction of Year 5 to include translations and reflections of shapes on the full coordinate plane. Working with all four quadrants requires pupils to apply their understanding of negative numbers in a geometric context, making this an important domain for consolidating and applying negative number reasoning. Reflections in the axes involve pupils in identifying coordinate patterns and symmetry rules, developing their algebraic and geometric thinking simultaneously. Translation — describing and performing movement by a given vector — introduces a form of transformation that connects to later work on vectors in KS3 and beyond. The coordinate grid also serves as the context in which algebraic relationships and linear graphs will be explored at KS3, making Year 6 coordinate work a direct and important preparation for that transition.",
      "is_cross_cutting": false,
      "structure_type": "thematic"
    },
    {
      "domain_id": "MA-Y6-D009",
      "domain_name": "Statistics",
      "description": "Interpreting and constructing pie charts and line graphs; calculating and interpreting the mean as an average; using relevant questions to collect and present data.",
      "curriculum_context": "Year 6 statistics introduces pie charts as a new representation and the mean as a formal measure of average, significantly extending the statistical toolkit pupils have been building since Year 2. Pie charts require pupils to apply their understanding of fractions and percentages to represent and interpret data, connecting statistics directly to the fractions and ratio domains. The calculation of the mean as a formal average (rather than the informal 'typical value' sense) involves division and the concept of equal distribution, connecting to division and place value work. Line graphs, introduced in Year 5, are revisited and extended in Year 6, with pupils expected to read values between marked points and to use graphs to solve comparison problems. The emphasis in Year 6 statistics is on interpretation and critical reasoning — asking whether data is presented clearly, what conclusions can and cannot be drawn, and what questions remain unanswered — preparing pupils for the data-handling strand that runs through the entire KS3 mathematics curriculum.",
      "is_cross_cutting": false,
      "structure_type": "thematic"
    }
  ],
  "objectives": [
    {
      "objective_id": "MA-Y6-O001",
      "domain_id": "MA-Y6-D001",
      "text": "read, write, order and compare numbers up to 10,000,000 and determine the value of each digit",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should use their understanding of place value to read and write numbers up to 10 million and to determine the value of each digit.",
      "examples": "3,456,789 has 3 millions, 4 hundred thousands, 5 ten thousands, 6 thousands, 7 hundreds, 8 tens, 9 ones."
    },
    {
      "objective_id": "MA-Y6-O002",
      "domain_id": "MA-Y6-D001",
      "text": "round any whole number to a required degree of accuracy",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should round numbers to the nearest 10, 100, 1000, 10,000, 100,000 and 1,000,000.",
      "examples": "Round 3,456,789 to the nearest 1000: 3,457,000."
    },
    {
      "objective_id": "MA-Y6-O003",
      "domain_id": "MA-Y6-D001",
      "text": "use negative numbers in context, and calculate intervals across zero",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils use negative numbers in contexts such as temperature, money (debt) and coordinate grids.",
      "examples": "The temperature is -3°C. It rises by 8°C. What is the new temperature? The difference between -4 and 6 is 10."
    },
    {
      "objective_id": "MA-Y6-O004",
      "domain_id": "MA-Y6-D001",
      "text": "solve number and practical problems that involve all of the above",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should apply place value, rounding and negative number understanding to solve problems in varied contexts.",
      "examples": "A company made a profit of £2,340,000 in one year and a loss of £890,000 the next. What was the overall change?"
    },
    {
      "objective_id": "MA-Y6-O005",
      "domain_id": "MA-Y6-D002",
      "text": "multiply multi-digit numbers up to 4 digits by a two-digit whole number using the formal written method of long multiplication",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should practise and apply all written methods, including long multiplication for 4-digit by 2-digit calculations.",
      "examples": "2,456 × 34; 3,127 × 52."
    },
    {
      "objective_id": "MA-Y6-O006",
      "domain_id": "MA-Y6-D002",
      "text": "divide numbers up to 4 digits by a two-digit whole number using the formal written method of long division, and interpret remainders as whole number remainders, fractions, or by rounding, as appropriate for the context",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils develop efficient written methods for division. They should practise dividing numbers up to 4 digits by a 2-digit number using the formal written method.",
      "examples": "2,456 ÷ 23; 3,458 ÷ 17; interpreting the remainder as a fraction: 432 ÷ 15 = 28 r12 = 28 12/15 = 28 4/5."
    },
    {
      "objective_id": "MA-Y6-O007",
      "domain_id": "MA-Y6-D002",
      "text": "divide numbers up to 4 digits by a two-digit number using the formal written method of short division where appropriate, interpreting remainders according to the context",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils practise short division as an efficient method where the divisor is manageable.",
      "examples": "4,896 ÷ 16; 2,345 ÷ 12."
    },
    {
      "objective_id": "MA-Y6-O008",
      "domain_id": "MA-Y6-D002",
      "text": "perform mental calculations, including with mixed operations and large numbers",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should continue to practise mental calculation strategies with increasingly large numbers and a variety of operations.",
      "examples": "Calculate 4000 × 600; 3,000,000 ÷ 6000; 25 × 48 using doubling and halving."
    },
    {
      "objective_id": "MA-Y6-O009",
      "domain_id": "MA-Y6-D002",
      "text": "identify common factors, common multiples and prime numbers",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should identify factors and multiples and use knowledge of prime numbers. They should use prior knowledge of primes, squares and cubes to identify factors and multiples more efficiently.",
      "examples": "Common factors of 24 and 36: 1, 2, 3, 4, 6, 12. Common multiples of 4 and 6: 12, 24, 36... Prime numbers to 20: 2, 3, 5, 7, 11, 13, 17, 19."
    },
    {
      "objective_id": "MA-Y6-O010",
      "domain_id": "MA-Y6-D002",
      "text": "use their knowledge of the order of operations to carry out calculations involving the four operations",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should understand and apply the order of operations (brackets, then multiplication/division before addition/subtraction) to evaluate expressions.",
      "examples": "Calculate: (3 + 4) × 5; 3 + 4 × 5; 20 − 4 ÷ 2 + 3."
    },
    {
      "objective_id": "MA-Y6-O011",
      "domain_id": "MA-Y6-D002",
      "text": "solve addition and subtraction multi-step problems in contexts, deciding which operations and methods to use and why",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should solve problems with up to three steps, explaining their choice of method.",
      "examples": "A school raises £3,456 in the summer fair and spends £1,278 on equipment. They then receive a grant of £2,000. How much do they have in total?"
    },
    {
      "objective_id": "MA-Y6-O012",
      "domain_id": "MA-Y6-D002",
      "text": "solve problems involving addition, subtraction, multiplication and division",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should use estimation and inverse operations to check answers.",
      "examples": "A box holds 24 cans. How many boxes are needed for 576 cans? How many are left over?"
    },
    {
      "objective_id": "MA-Y6-O013",
      "domain_id": "MA-Y6-D002",
      "text": "use estimation to check answers to calculations and determine, in the context of a problem, an appropriate degree of accuracy",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should use approximation and rounding to check the reasonableness of answers.",
      "examples": "Estimate 5,978 × 32 by computing 6,000 × 30 = 180,000."
    },
    {
      "objective_id": "MA-Y6-O014",
      "domain_id": "MA-Y6-D003",
      "text": "use common factors to simplify fractions; use common multiples to express fractions in the same denomination",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should identify the highest common factor to simplify fractions and the lowest common multiple to find a common denominator.",
      "examples": "Simplify 12/18 = 2/3. Express 1/4 and 1/6 with a common denominator of 12: 3/12 and 2/12."
    },
    {
      "objective_id": "MA-Y6-O015",
      "domain_id": "MA-Y6-D003",
      "text": "compare and order fractions, including fractions > 1",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should use a range of strategies including converting to a common denominator and using known equivalences.",
      "examples": "Order 7/4, 5/3, 11/6. Convert to common denominator 12: 21/12, 20/12, 22/12. Order: 5/3, 7/4, 11/6."
    },
    {
      "objective_id": "MA-Y6-O016",
      "domain_id": "MA-Y6-D003",
      "text": "add and subtract fractions with different denominators and mixed numbers, using the concept of equivalent fractions",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should add and subtract fractions, including those greater than 1, by converting to equivalent fractions with the same denominator.",
      "examples": "1/3 + 1/4 = 4/12 + 3/12 = 7/12. 2 3/4 + 1 2/3 = 2 9/12 + 1 8/12 = 3 17/12 = 4 5/12."
    },
    {
      "objective_id": "MA-Y6-O017",
      "domain_id": "MA-Y6-D003",
      "text": "multiply simple pairs of proper fractions, writing the answer in its simplest form",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils multiply fractions by multiplying the numerators and the denominators, simplifying the result.",
      "examples": "1/4 × 2/3 = 2/12 = 1/6."
    },
    {
      "objective_id": "MA-Y6-O018",
      "domain_id": "MA-Y6-D003",
      "text": "divide proper fractions by whole numbers",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils divide a proper fraction by a whole number by multiplying the denominator by the whole number.",
      "examples": "1/3 ÷ 2 = 1/6. 3/4 ÷ 3 = 1/4."
    },
    {
      "objective_id": "MA-Y6-O019",
      "domain_id": "MA-Y6-D003",
      "text": "associate a fraction with division and calculate decimal fraction equivalents (for example, 0.375) for a simple fraction (for example, 3/8)",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should understand that a fraction can be calculated by dividing the numerator by the denominator.",
      "examples": "3/8 = 3 ÷ 8 = 0.375. 7/20 = 7 ÷ 20 = 0.35."
    },
    {
      "objective_id": "MA-Y6-O020",
      "domain_id": "MA-Y6-D003",
      "text": "identify the value of each digit in numbers given to three decimal places and multiply and divide numbers by 10, 100 and 1000 giving answers up to three decimal places",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should extend their understanding of place value to thousandths and use this to carry out calculations.",
      "examples": "4.362 × 10 = 43.62; 4.362 ÷ 100 = 0.04362."
    },
    {
      "objective_id": "MA-Y6-O021",
      "domain_id": "MA-Y6-D003",
      "text": "multiply one-digit numbers with up to two decimal places by whole numbers",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should use their knowledge of multiplication facts and place value to multiply decimals.",
      "examples": "0.6 × 7 = 4.2; 3.25 × 4 = 13.00."
    },
    {
      "objective_id": "MA-Y6-O022",
      "domain_id": "MA-Y6-D003",
      "text": "use written division methods in cases where the answer has up to two decimal places",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should extend written division to include decimal answers by continuing the division beyond the decimal point.",
      "examples": "75 ÷ 4 = 18.75; 21 ÷ 8 = 2.625 (to three decimal places)."
    },
    {
      "objective_id": "MA-Y6-O023",
      "domain_id": "MA-Y6-D003",
      "text": "solve problems which require answers to be rounded to specified degrees of accuracy",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should interpret context to determine appropriate rounding.",
      "examples": "A rope of 7 m is cut into pieces each 0.8 m long. How many complete pieces can be cut? (8 complete pieces, 0.6 m left over.)"
    },
    {
      "objective_id": "MA-Y6-O024",
      "domain_id": "MA-Y6-D003",
      "text": "recall and use equivalences between simple fractions, decimals and percentages, including in different contexts",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should extend their knowledge of fraction-decimal-percentage equivalences to include more complex examples.",
      "examples": "1/8 = 0.125 = 12.5%. 3/5 = 0.6 = 60%. Use these to compare values in context."
    },
    {
      "objective_id": "MA-Y6-O025",
      "domain_id": "MA-Y6-D004",
      "text": "solve problems involving the relative sizes of two quantities where missing values can be found by using integer multiplication and division facts",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should use knowledge of multiplication tables and equivalences to find missing values in ratio problems.",
      "examples": "A recipe for 6 people uses 300 g of flour. How much flour is needed for 9 people? (450 g.)"
    },
    {
      "objective_id": "MA-Y6-O026",
      "domain_id": "MA-Y6-D004",
      "text": "solve problems involving the calculation of percentages [for example, of measures and such as 15% of 360] and the use of percentages for comparison",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should calculate percentages of quantities and use percentages to compare values.",
      "examples": "15% of 360 = 54. In class A, 12 out of 30 pupils walk to school (40%). In class B, 9 out of 20 walk (45%). Which class has the higher proportion?"
    },
    {
      "objective_id": "MA-Y6-O027",
      "domain_id": "MA-Y6-D004",
      "text": "solve problems involving similar shapes where the scale factor is known or can be found",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should use the scale factor to find missing lengths in similar shapes.",
      "examples": "A triangle has sides 3 cm, 4 cm and 5 cm. A similar triangle has its shortest side of 6 cm. What are the other two sides?"
    },
    {
      "objective_id": "MA-Y6-O028",
      "domain_id": "MA-Y6-D004",
      "text": "solve problems involving unequal sharing and grouping using knowledge of fractions and multiples",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should share quantities in given ratios and find quantities when given the ratio and one part.",
      "examples": "Share £40 between two people in the ratio 3:5. (£15 and £25.) The ratio of boys to girls in a class is 2:3. There are 18 girls. How many boys?"
    },
    {
      "objective_id": "MA-Y6-O029",
      "domain_id": "MA-Y6-D005",
      "text": "use simple formulae",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should use and interpret formulae expressed in words or symbolic form.",
      "examples": "The perimeter of a rectangle: P = 2(l + w). The area of a rectangle: A = l × w. A formula given in words: cost = number of items × price."
    },
    {
      "objective_id": "MA-Y6-O030",
      "domain_id": "MA-Y6-D005",
      "text": "generate and describe linear number sequences",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should recognise and use the term 'linear sequence' and describe sequences using the common difference.",
      "examples": "3, 7, 11, 15, 19, ... (adding 4 each time); 100, 93, 86, 79, ... (subtracting 7 each time)."
    },
    {
      "objective_id": "MA-Y6-O031",
      "domain_id": "MA-Y6-D005",
      "text": "express missing number problems algebraically",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should represent unknown quantities using letters and write algebraic expressions and equations.",
      "examples": "n + 8 = 15; 3a = 18; 2b + 4 = 16."
    },
    {
      "objective_id": "MA-Y6-O032",
      "domain_id": "MA-Y6-D005",
      "text": "find pairs of numbers that satisfy an equation with two unknowns",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should enumerate systematically all solutions to a two-variable equation within a given range.",
      "examples": "Find all pairs of positive integers (a, b) such that a + b = 10. Find pairs (x, y) such that 2x + y = 12, where x and y are positive integers."
    },
    {
      "objective_id": "MA-Y6-O033",
      "domain_id": "MA-Y6-D005",
      "text": "enumerate possibilities of combinations of two variables",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should systematically list all possible combinations of two variables to find all solutions to a problem.",
      "examples": "A snack bar sells crisps for 30p and a banana for 20p. List all the different ways of spending exactly £1."
    },
    {
      "objective_id": "MA-Y6-O034",
      "domain_id": "MA-Y6-D006",
      "text": "solve problems involving the calculation and conversion of units of measure, using decimal notation up to three decimal places where appropriate",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should convert fluently between standard metric units and use decimal notation appropriately.",
      "examples": "Convert 3.45 km to metres: 3,450 m. Convert 2,350 ml to litres: 2.350 l."
    },
    {
      "objective_id": "MA-Y6-O035",
      "domain_id": "MA-Y6-D006",
      "text": "use, read and write standard units of measurement with decimal notation up to three decimal places (km, m, cm, mm; kg, g; l, ml)",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should be fluent with all metric units for length, mass and capacity, including the use of decimals.",
      "examples": "A plank of wood is 2.450 m long. A bottle holds 1.750 l of water."
    },
    {
      "objective_id": "MA-Y6-O036",
      "domain_id": "MA-Y6-D006",
      "text": "convert between miles and kilometres",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should know and use the approximate equivalence: 5 miles ≈ 8 kilometres.",
      "examples": "A journey is 40 miles. Approximately how many kilometres is this? (64 km.) Convert 24 km to miles. (15 miles.)"
    },
    {
      "objective_id": "MA-Y6-O037",
      "domain_id": "MA-Y6-D006",
      "text": "recognise that shapes with the same areas can have different perimeters and vice versa",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should investigate relationships between area and perimeter through practical and problem-solving activities.",
      "examples": "A 2 × 6 rectangle and a 3 × 4 rectangle both have area 12 cm² but perimeters of 16 cm and 14 cm respectively."
    },
    {
      "objective_id": "MA-Y6-O038",
      "domain_id": "MA-Y6-D006",
      "text": "recognise when it is possible to use formulae for area and volume of shapes",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should know and apply formulae for the area of rectangles, triangles, and parallelograms, and for the volume of cuboids.",
      "examples": "Area of triangle = ½ × base × height. Area of parallelogram = base × height. Volume of cuboid = length × width × height."
    },
    {
      "objective_id": "MA-Y6-O039",
      "domain_id": "MA-Y6-D006",
      "text": "calculate the area of parallelograms and triangles",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should develop and use the formulae for these areas, understanding why the formula works through practical demonstration.",
      "examples": "A triangle with base 8 cm and perpendicular height 5 cm has area ½ × 8 × 5 = 20 cm². A parallelogram with base 7 cm and height 4 cm has area 28 cm²."
    },
    {
      "objective_id": "MA-Y6-O040",
      "domain_id": "MA-Y6-D006",
      "text": "calculate, estimate and compare volume of cubes and cuboids using standard units, including cubic centimetres (cm³) and cubic metres (m³), and extending to other units (for example, mm³ and km³)",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should apply the formula V = l × w × h for cuboids and compare volumes of different shapes.",
      "examples": "A box is 5 cm × 3 cm × 4 cm. Volume = 60 cm³. How many 1 cm³ cubes fill the box?"
    },
    {
      "objective_id": "MA-Y6-O041",
      "domain_id": "MA-Y6-D007",
      "text": "draw 2-D shapes using given dimensions and angles",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should use a ruler and protractor to draw 2-D shapes accurately.",
      "examples": "Draw an isosceles triangle with a base of 6 cm and base angles of 70°. Draw a quadrilateral with angles 80°, 100°, 110°, 70°."
    },
    {
      "objective_id": "MA-Y6-O042",
      "domain_id": "MA-Y6-D007",
      "text": "recognise, describe and build simple 3-D shapes, including making nets",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should identify the properties of 3-D shapes (faces, edges, vertices) and draw or make nets for simple shapes.",
      "examples": "Identify and draw the net of a triangular prism. Which of these nets fold to make a cube?"
    },
    {
      "objective_id": "MA-Y6-O043",
      "domain_id": "MA-Y6-D007",
      "text": "compare and classify geometric shapes based on their properties and sizes and find unknown angles in any triangles, quadrilaterals, and regular polygons",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should use the fact that angles in a triangle sum to 180°, angles in a quadrilateral sum to 360°, and that all interior angles of a regular polygon are equal.",
      "examples": "Find the missing angle in a triangle with angles 47° and 82°. A regular hexagon: find each interior angle (60°). The angles in a quadrilateral are 90°, 115°, 80° and x. Find x."
    },
    {
      "objective_id": "MA-Y6-O044",
      "domain_id": "MA-Y6-D007",
      "text": "illustrate and name parts of circles, including radius, diameter and circumference and know that the diameter is twice the radius",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should draw and label circles and apply the relationship d = 2r.",
      "examples": "A circle has a radius of 4.5 cm. What is its diameter? Draw a circle with a diameter of 10 cm using a compass."
    },
    {
      "objective_id": "MA-Y6-O045",
      "domain_id": "MA-Y6-D007",
      "text": "recognise angles where they meet at a point, are on a straight line, or are vertically opposite, and find missing angles",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should use the properties: angles on a straight line sum to 180°; angles at a point sum to 360°; vertically opposite angles are equal.",
      "examples": "Two lines cross. One angle is 65°. Find the three other angles (115°, 65°, 115°). Find the missing angle when angles on a straight line are 40° and 85°."
    },
    {
      "objective_id": "MA-Y6-O046",
      "domain_id": "MA-Y6-D008",
      "text": "describe positions on the full coordinate grid (all four quadrants)",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should use coordinates in all four quadrants, including negative values on both axes.",
      "examples": "Plot and describe the coordinates (3, -2), (-4, 1), (-3, -5), (0, 4)."
    },
    {
      "objective_id": "MA-Y6-O047",
      "domain_id": "MA-Y6-D008",
      "text": "draw and translate simple shapes on the coordinate plane, and reflect them in the axes",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should translate shapes by a given vector and reflect shapes in the x-axis and y-axis, stating the new coordinates.",
      "examples": "Translate triangle A with vertices (1,2), (3,2), (2,4) by (+4, -3). Reflect triangle with vertices (1,1), (3,1), (2,3) in the y-axis."
    },
    {
      "objective_id": "MA-Y6-O048",
      "domain_id": "MA-Y6-D009",
      "text": "interpret and construct pie charts and line graphs and use these to solve problems",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should read and create pie charts, linking them to angle and fraction knowledge, and interpret line graphs in context.",
      "examples": "A pie chart shows how 120 pupils travel to school. The 'walk' sector is 90°. How many pupils walk? (30.) A line graph shows temperature over 12 hours."
    },
    {
      "objective_id": "MA-Y6-O049",
      "domain_id": "MA-Y6-D009",
      "text": "calculate and interpret the mean as an average",
      "is_statutory": true,
      "non_statutory_guidance": "Pupils should calculate the mean by adding all values and dividing by the number of values, and interpret the mean in context.",
      "examples": "Five test scores: 7, 9, 6, 10, 8. Mean = (7+9+6+10+8) ÷ 5 = 40 ÷ 5 = 8. The mean height of 4 pupils is 142 cm. Three pupils are 138 cm, 144 cm and 145 cm. How tall is the fourth?"
    }
  ],
  "concepts": [
    {
      "concept_id": "MA-Y6-C001",
      "domain_id": "MA-Y6-D001",
      "name": "Place Value to 10,000,000",
      "description": "A pupil who has mastered place value to 10,000,000 can confidently read and write any whole number in this range in digits and words, identify the value of any digit by its position, and use this understanding to order and compare numbers. Mastery is demonstrated when pupils can apply place value flexibly — for example, recognising that 4,000,000 is the same as 40 hundred-thousands — and when they can use this understanding to support estimation, mental calculation, and formal written methods without error.",
      "teaching_guidance": "Use extended place value charts showing columns from ones to millions, and ask pupils to represent numbers by placing digit cards. Physical representations such as large-format 'millions strips' help bridge understanding from 100,000. Emphasise the pattern of grouping in threes (ones, thousands, millions) which reflects the way large numbers are written with commas. Progress from reading and writing to ordering, using inequality symbols, and then to application in context. Calculator investigations exploring what happens to a digit when a number is multiplied by 10 repeatedly are very effective.",
      "key_vocabulary": "millions, ten millions, place value, digit, value of a digit, order, compare, greater than, less than, inequality",
      "common_misconceptions": "Pupils often misread multi-digit numbers, especially those with zeros as placeholders (e.g., reading 4,006,050 as 'four million sixty-five'). When writing numbers from words, pupils may omit placeholder zeros. Some pupils confuse the face value of a digit (e.g., 4) with its place value (e.g., 4,000,000). Reinforce the role of each zero as a place-holder with explicit examples.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y6-C002",
      "domain_id": "MA-Y6-D001",
      "name": "Rounding to Any Degree of Accuracy",
      "description": "Mastery of rounding means pupils can round any whole number or decimal to any specified degree of accuracy — including to the nearest 10, 100, 1,000, 10,000, 100,000, 1,000,000, or to any number of decimal places — and can select the appropriate degree of accuracy for a given context. A fully secure pupil understands rounding as a process of finding the nearest named value and applies the rounding rule (5 or more rounds up) consistently, including for numbers ending in exactly 5.",
      "teaching_guidance": "Use number lines to develop conceptual understanding before moving to procedural rules. Place the number on a number line between the two nearest multiples and identify which is closer. Gradually increase the scale of number lines from tens to thousands to millions. Connect rounding to real-world contexts: money (to the nearest pound), distance (to the nearest kilometre), and population (to the nearest thousand). Address boundary cases (e.g., 350 to the nearest hundred) explicitly. Later, connect to decimal rounding by extending the number line to tenths and hundredths.",
      "key_vocabulary": "round, nearest, degree of accuracy, multiple, estimate, approximate",
      "common_misconceptions": "When rounding to a large unit (e.g., nearest 100,000), pupils often round only the digit in the required column, ignoring whether subsequent digits cause the number to be closer to the upper or lower value. Pupils frequently round 'down' when they should round up at the 5-boundary. Some pupils truncate rather than round when working with large numbers. Explicit number-line work addresses all these errors.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true
    },
    {
      "concept_id": "MA-Y6-C003",
      "domain_id": "MA-Y6-D001",
      "name": "Negative Numbers and Calculating Intervals Across Zero",
      "description": "Mastery means pupils can use negative numbers fluently in context (temperature, bank balances, sea level, coordinates) and calculate the interval between a negative and a positive number by reasoning on a number line rather than by applying a rule. A fully secure pupil understands that subtracting a negative number increases the value and can calculate multi-step problems involving both negative and positive quantities, explaining their reasoning clearly.",
      "teaching_guidance": "Contexts should drive initial understanding: temperature is the most intuitive starting point, as pupils can visualise rising and falling. Use a vertical number line (like a thermometer) to make the direction of change concrete. Progress to horizontal number lines and then to abstract calculations. Explicitly connect negative numbers to the coordinate grid work pupils will meet in the geometry domains. The key calculation to practise is finding the difference between a negative and a positive number (e.g., the difference between -4 and +6 is 10), which pupils can model by counting steps on the number line.",
      "key_vocabulary": "negative number, positive number, zero, below zero, above zero, interval, difference, thermometer, number line",
      "common_misconceptions": "Pupils commonly think -8 is greater than -3 because 8 is greater than 3. When calculating the difference between -3 and +5, pupils often compute 5 - 3 = 2 rather than 5 - (-3) = 8. The number line is the essential tool for overcoming both misconceptions. Some pupils resist the idea that the result of subtracting a larger positive number from a smaller one can be negative, reflecting over-generalisation from whole number arithmetic.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": true
    },
    {
      "concept_id": "MA-Y6-C004",
      "domain_id": "MA-Y6-D002",
      "name": "Long Multiplication",
      "description": "Mastery of long multiplication means pupils can reliably multiply a 4-digit number by a 2-digit number using the formal long multiplication algorithm, understand why each partial product is placed in its correct column, and can check their answer using estimation. A fully secure pupil can also select appropriate methods — mental, informal, or formal — for different problems and can solve multi-step problems that require long multiplication as one step.",
      "teaching_guidance": "Ensure pupils have thoroughly understood short multiplication (Year 5) before introducing the two-row long multiplication format. Use place value understanding to explain why the second partial product row is shifted one place to the left (multiplying by tens). Grid multiplication provides an effective bridge between informal methods and the formal algorithm: show how the four cells of the grid correspond to the four partial products in long multiplication. Estimation should always precede formal calculation. Regular practice with varied digit configurations (including zeros within numbers) builds fluency.",
      "key_vocabulary": "long multiplication, partial product, algorithm, formal written method, estimate, digit, column",
      "common_misconceptions": "The most common error in long multiplication is forgetting to shift the second row of partial products one place to the left when multiplying by the tens digit. Pupils also make errors with carrying, particularly when sums exceed 10 in multiple columns simultaneously. Some pupils misalign digits in the answer, especially when the number contains zeros. Estimation before calculating helps pupils identify unreasonable answers.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y6-C005",
      "domain_id": "MA-Y6-D002",
      "name": "Long Division",
      "description": "Mastery of long division means pupils can divide a 4-digit number by a 2-digit divisor using the formal long division algorithm and can correctly interpret the remainder — expressing it as a whole number remainder, a fraction, or a decimal — according to the context of the problem. A fully secure pupil understands each step of the algorithm (estimate, multiply, subtract, bring down) and can perform the procedure reliably with numbers that require regrouping.",
      "teaching_guidance": "Long division is one of the most cognitively demanding written methods in the primary curriculum and should be introduced only after pupils are completely secure with short division. Begin with divisors from the times tables (e.g., 13, 15, 25) before progressing to less familiar divisors. The 'chunk' method (subtracting known multiples) can serve as a bridge to the formal algorithm for pupils who struggle. Explicitly teach the four-step cycle: estimate how many times the divisor goes into the partial dividend, write the quotient digit, multiply and write the product below, subtract. Practise identifying from the context whether to express the remainder as r___,  as a fraction, or as a decimal.",
      "key_vocabulary": "long division, divisor, dividend, quotient, remainder, partial dividend, estimate, formal written method, fraction remainder",
      "common_misconceptions": "Pupils frequently lose track of place value during long division, producing quotient digits in the wrong columns. A common error is not bringing down the next digit when the partial dividend is smaller than the divisor (the quotient digit at that step should be zero, which is often omitted). Pupils also confuse when to express the remainder as a fraction (½ of a pizza) versus rounding up (number of buses needed) — always connect to the problem context.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y6-C006",
      "domain_id": "MA-Y6-D002",
      "name": "Order of Operations",
      "description": "Mastery of the order of operations means pupils understand and can apply the rule that brackets are evaluated first, followed by multiplication and division (from left to right), then addition and subtraction (from left to right), and that this is a convention that makes mathematical expressions unambiguous. A fully secure pupil can evaluate multi-step expressions correctly, insert brackets to make expressions equal a given value, and explain why the convention is necessary.",
      "teaching_guidance": "Introduce through concrete examples that demonstrate the need for an agreed convention: show that 3 + 4 × 5 can be evaluated as either 35 or 23 without a rule, then establish that mathematicians have agreed on the order of operations to avoid ambiguity. Use the acronym BODMAS (Brackets, Other, Division, Multiplication, Addition, Subtraction) or BIDMAS as a memory aid but emphasise understanding over rote application. Provide exercises where pupils must insert brackets to produce a given answer (e.g., make 3 + 4 × 5 equal 35 by inserting brackets). Connect to calculator use: demonstrate that most calculators apply the order of operations automatically.",
      "key_vocabulary": "order of operations, brackets, BODMAS, BIDMAS, expression, evaluate, convention",
      "common_misconceptions": "The most prevalent misconception is evaluating left-to-right without applying the order of operations (treating all operations as having equal priority). Pupils also commonly neglect to evaluate the contents of brackets first when brackets are nested or when brackets appear later in the expression. Some pupils misremember BODMAS as meaning division always before multiplication, when in fact they have equal priority and should be evaluated left to right.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": true
    },
    {
      "concept_id": "MA-Y6-C007",
      "domain_id": "MA-Y6-D002",
      "name": "Common Factors, Common Multiples and Primes",
      "description": "Mastery means pupils can systematically identify all common factors of two numbers, list common multiples, identify the lowest common multiple and highest common factor, and use these skills to support fraction work (finding common denominators, simplifying fractions). A fully secure pupil knows that prime numbers have exactly two factors and can apply this understanding to determine whether any number up to 100 is prime, using divisibility rules as efficient tools.",
      "teaching_guidance": "Build on Year 5 work on factors, multiples and primes by introducing the terms 'common factor', 'common multiple', 'highest common factor' and 'lowest common multiple'. Use Venn diagrams to organise the factors or multiples of two numbers visually, identifying the overlapping region as the common factors/multiples. Connect explicitly to fraction simplification (divide numerator and denominator by their highest common factor) and finding common denominators (use the lowest common multiple of the two denominators). Divisibility rules (by 2, 3, 5, 7, 9, 10, 11) help pupils work efficiently without listing all factors.",
      "key_vocabulary": "factor, multiple, common factor, common multiple, highest common factor (HCF), lowest common multiple (LCM), prime number, composite number, divisibility rule",
      "common_misconceptions": "Pupils often confuse factors and multiples, and further confuse highest common factor (a factor, smaller than or equal to the number) with lowest common multiple (a multiple, larger than or equal to the number). Some pupils include 1 as a prime number (it is not, as it has only one factor). When finding common factors, pupils often stop at the first common factor they find rather than the highest. Systematic listing of all factors of both numbers into a Venn diagram prevents most of these errors.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": true
    },
    {
      "concept_id": "MA-Y6-C008",
      "domain_id": "MA-Y6-D003",
      "name": "Simplifying and Comparing Fractions",
      "description": "Mastery of simplifying fractions means pupils can divide the numerator and denominator of any fraction by their highest common factor to express it in its simplest form, and can compare and order fractions — including improper fractions and mixed numbers — by converting to a common denominator. A fully secure pupil understands that simplification does not change the value of the fraction, only its representation, and chooses to simplify at appropriate points in calculations rather than only at the end.",
      "teaching_guidance": "Develop simplification as a natural extension of equivalent fraction knowledge from Year 5: rather than multiplying up to find equivalents, pupils now divide down to find simpler equivalents. Explicitly connect to the HCF work in the calculation domain. Use fraction walls and number lines to verify that simplified fractions are equivalent to the original. For comparing fractions, progress from using benchmark fractions (less than ½, equal to ½, greater than ½) to converting to a common denominator. Include improper fractions and mixed numbers in comparison activities.",
      "key_vocabulary": "simplify, simplest form, lowest terms, common factor, equivalent fraction, common denominator, improper fraction, mixed number, compare, order",
      "common_misconceptions": "When simplifying, pupils often divide by 2 (or another common factor) rather than the highest common factor, leaving fractions in a partially simplified state (e.g., simplifying 12/18 to 6/9 rather than 2/3). Some pupils believe a fraction with a larger numerator and denominator is always greater than one with smaller numbers. When comparing fractions with different denominators, pupils sometimes compare numerators or denominators in isolation rather than converting to a common denominator.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y6-C009",
      "domain_id": "MA-Y6-D003",
      "name": "Addition and Subtraction of Fractions with Different Denominators",
      "description": "Mastery means pupils can add and subtract any pair of fractions — including those with different denominators and mixed numbers — by converting to equivalent fractions with a common denominator, and can simplify the result. A fully secure pupil applies this fluently in both calculation and problem-solving contexts, chooses the lowest common multiple of the denominators as the common denominator for efficiency, and manages the whole-number and fractional parts of mixed numbers correctly during subtraction.",
      "teaching_guidance": "Use fraction diagrams and number lines to demonstrate why fractions must have the same denominator before they can be added or subtracted. Progress carefully through three stages: same denominators (already secured), one denominator is a multiple of the other (simpler case), and denominators that share only the factor 1 (requiring multiplication of both). For mixed numbers, teach both the 'convert to improper fraction' method and the 'deal with whole and fractional parts separately' method, allowing pupils to choose. Subtraction of mixed numbers where regrouping is required (e.g., 3 1/4 - 1 3/4) needs careful attention.",
      "key_vocabulary": "common denominator, equivalent fraction, lowest common multiple, mixed number, improper fraction, simplify, denominator, numerator",
      "common_misconceptions": "The classic and persistent misconception is adding numerators and denominators separately (e.g., 1/3 + 1/4 = 2/7). Use diagrams extensively to show why this is incorrect. When subtracting mixed numbers, pupils often subtract the smaller fraction from the larger regardless of which is the subtrahend (e.g., computing 3 1/4 - 1 3/4 as 3 + (3/4 - 1/4) = 3 2/4). Failing to simplify the final answer is also common; build simplification into the routine.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y6-C010",
      "domain_id": "MA-Y6-D003",
      "name": "Multiplication and Division of Fractions",
      "description": "Mastery of fraction multiplication means pupils can multiply a pair of proper fractions by multiplying the numerators and the denominators, simplify the result, and understand the result is smaller than either factor (when both are proper fractions). For division of a fraction by a whole number, mastery means pupils understand that dividing a fraction by n is the same as multiplying by 1/n (or equivalently, multiplying the denominator by n) and can apply this in context.",
      "teaching_guidance": "For multiplication, begin with the concrete context of 'a fraction of a fraction' (e.g., ½ of ¾ of a pizza). Diagrams showing a rectangle divided first into quarters horizontally and then into halves vertically make the multiplication of fractions visually clear. Establish the rule (multiply numerators, multiply denominators) and connect it to the diagram. Cross-cancellation (simplifying diagonally before multiplying) can be introduced to keep numbers manageable. For division by a whole number, use sharing contexts: if ¾ of a bar of chocolate is shared equally between 3 people, each person gets ¼. Generalise to the rule of multiplying the denominator.",
      "key_vocabulary": "multiply fractions, divide fractions, product, proper fraction, simplify, cross-cancel, reciprocal",
      "common_misconceptions": "Pupils apply addition/subtraction strategies to multiplication (finding a common denominator before multiplying), which is unnecessary and leads to errors. When dividing a fraction by a whole number, pupils sometimes divide the numerator rather than multiply the denominator (e.g., computing 3/4 ÷ 3 as 1/4, which coincidentally gives the right answer, but using incorrect reasoning that fails for other examples like 3/4 ÷ 2). Build conceptual understanding alongside procedural competence.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y6-C011",
      "domain_id": "MA-Y6-D003",
      "name": "Fraction-Decimal-Percentage Equivalences",
      "description": "Mastery means pupils can fluently convert between fractions, decimals and percentages for a wide range of values, including less common equivalences such as 1/8 = 0.125 = 12.5%, and can select the most appropriate representation for a given context without prompting. A fully secure pupil understands that the three representations are different ways of expressing the same proportion and can use this understanding to compare quantities expressed in different forms and to solve proportion problems.",
      "teaching_guidance": "Build on the fraction-decimal-percentage equivalences established in Years 4 and 5 by extending to eighths, thirds and other fractions that produce recurring or multi-place decimals. Organised practice — completing equivalence tables, using sorting activities, and playing matching games — builds fluency. Percentage bar models support problem-solving: drawing a bar divided into 100 equal parts and shading the relevant percentage helps pupils visualise the relationship. Connect explicitly to the ratio domain by using percentages as a common scale for comparison.",
      "key_vocabulary": "fraction, decimal, percentage, equivalent, convert, proportion, per cent, decimal point, recurring decimal",
      "common_misconceptions": "Pupils sometimes treat fractions, decimals and percentages as unrelated rather than as equivalent representations, failing to convert between them when it would be helpful. Common specific errors: believing 25% = ¼ but not knowing that 75% = ¾; confusing 0.5% with 50%; writing 0.8 as 0.8% rather than 80%. Regular work with real-world contexts (sale discounts, test scores, nutritional information) builds meaningful understanding alongside the procedural fluency.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": true
    },
    {
      "concept_id": "MA-Y6-C012",
      "domain_id": "MA-Y6-D004",
      "name": "Ratio and Proportion",
      "description": "Mastery of ratio and proportion means pupils can express the relationship between two quantities using ratio notation (a:b), scale up and down using a multiplier, solve problems involving sharing in a given ratio, and use percentages and fractions as tools for expressing proportional relationships. A fully secure pupil understands the difference between additive comparison (A has 3 more than B) and multiplicative comparison (A has 3 times as many as B) and can identify which type of reasoning is required by a problem.",
      "teaching_guidance": "Begin with practical activities: making paint colours from different proportions of red and yellow, mixing squash with water, dividing a class into boys and girls in a given ratio. The 'unitary method' — finding the value of one part and scaling — should be taught alongside the 'scale factor' method. Bar models are particularly effective for ratio problems as they make the proportional structure visible. Connect to percentage increase and decrease as applications of proportion. Similar shapes provide a geometric context in which scale factors arise naturally.",
      "key_vocabulary": "ratio, proportion, scale factor, unitary method, parts, share, for every, in the ratio, percentage, similar",
      "common_misconceptions": "Pupils frequently apply additive rather than multiplicative reasoning in proportion problems (e.g., if a recipe for 4 serves uses 200 g flour and 150 g butter, pupils subtract to get 50 g 'difference' and add 50 g for each extra serving rather than using the ratio 4:3). In sharing problems, pupils sometimes give each person the stated number of parts rather than computing the value of each part. The bar model is the most effective tool for preventing both misconceptions.",
      "concept_type": "process",
      "complexity_level": 3,
      "is_cross_cutting": true
    },
    {
      "concept_id": "MA-Y6-C013",
      "domain_id": "MA-Y6-D005",
      "name": "Algebraic Notation and Formulae",
      "description": "Mastery of algebraic notation means pupils can write, interpret and use simple algebraic expressions and formulae in which letters represent unknown or variable quantities, substituting values to evaluate expressions and constructing expressions from word descriptions. A fully secure pupil understands that a letter represents a number (which may be unknown, or may vary), that 3n means '3 times n', and that an expression like 2l + 2w is a general formula applicable to any rectangle — not just a specific case.",
      "teaching_guidance": "Draw explicitly on prior work with missing number problems to establish continuity: the box in □ + 5 = 12 is the same idea as n in n + 5 = 12. Introduce letter notation as a more efficient and general representation than boxes. Practise writing expressions from descriptions ('5 more than n' → n + 5; 'three times m, subtract 4' → 3m - 4). Substitution exercises — evaluating an expression for given values — should precede formula derivation. Connect to known formulae (area of rectangle: A = lw; perimeter of rectangle: P = 2(l + w)) as familiar examples. Avoid ambiguity: be clear about the difference between an expression (3n + 2) and an equation (3n + 2 = 17).",
      "key_vocabulary": "algebra, expression, equation, formula, variable, unknown, substitute, evaluate, term, coefficient, letter symbol",
      "common_misconceptions": "Pupils often treat a letter in an expression as a label or abbreviation (e.g., a = apples) rather than as a number. Concatenation notation (3n meaning 3 × n) is unfamiliar and pupils may read it as 'thirty-n' or misinterpret it. Some pupils believe that different letters in an expression must represent different values (e.g., in a + b, a ≠ b). Pupils also confuse 'evaluate an expression' with 'solve an equation' — these are importantly different tasks.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": true
    },
    {
      "concept_id": "MA-Y6-C014",
      "domain_id": "MA-Y6-D005",
      "name": "Linear Sequences and Two-Variable Equations",
      "description": "Mastery means pupils can generate any term of a linear sequence given its first term and common difference, describe a sequence using the language of 'common difference' and 'term', and represent simple sequences and relationships using algebraic expressions. For two-variable equations, a fully secure pupil can enumerate all pairs of positive integers (or values within a given range) that satisfy an equation like a + b = 10 or 2x + y = 8 by working systematically.",
      "teaching_guidance": "Use real-world contexts for sequences: tile patterns, fence posts and panels, stair-step shapes. Ask pupils to describe the pattern in words before introducing algebraic notation. Progress from 'add n each time' descriptions to the nth term rule for linear sequences (though full nth term work is a KS3 objective). For two-variable equations, teach systematic enumeration: start with the smallest possible value for one variable, find the corresponding value for the other, and work through all possibilities in order, recording in a table. Connect to coordinate graph work by plotting solution pairs on a grid — visually, the solutions lie on a straight line.",
      "key_vocabulary": "sequence, term, common difference, linear sequence, rule, two unknowns, equation, enumerate, systematically, solution, coordinate",
      "common_misconceptions": "Pupils confuse the term-to-term rule (add 4 each time) with the position-to-term rule (nth term = 4n - 1). When enumerating solutions to two-variable equations, pupils work unsystematically and miss solutions or count duplicates. Some pupils do not consider that variables can take the value 0. Explicit use of tables and a systematic left-to-right approach prevents most enumeration errors.",
      "concept_type": "process",
      "complexity_level": 3,
      "is_cross_cutting": true
    },
    {
      "concept_id": "MA-Y6-C015",
      "domain_id": "MA-Y6-D006",
      "name": "Area of Triangles and Parallelograms",
      "description": "Mastery means pupils know and can apply the formulae for the area of a triangle (A = ½ × base × height) and parallelogram (A = base × height), understanding why these formulae work through the relationship between these shapes and rectangles. A fully secure pupil uses perpendicular height in the formula (not the slant side) and can identify the relevant base and height in non-standard orientations of the shapes.",
      "teaching_guidance": "Develop the formula for the area of a parallelogram by demonstrating that a parallelogram can be rearranged into a rectangle by cutting and moving a triangle. The triangle formula follows naturally: a triangle is half the area of the parallelogram formed by two copies of the triangle. Use geoboards and dotted paper to explore area by counting squares and then by applying the formula, allowing pupils to verify the formula through measurement. Always distinguish between height (perpendicular distance between parallel sides) and slant height. Include examples where the height is outside the shape (obtuse triangles) to deepen understanding.",
      "key_vocabulary": "area, triangle, parallelogram, perpendicular height, base, formula, square centimetres (cm²), square metres (m²)",
      "common_misconceptions": "The most significant and persistent misconception is using the slant height rather than the perpendicular height when calculating the area of a triangle or parallelogram. Pupils also sometimes use the wrong dimension as the base when the shape is in a non-standard orientation. Labelled diagrams should always identify the perpendicular height explicitly, and pupils should practise identifying perpendicular height in a variety of orientations.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y6-C016",
      "domain_id": "MA-Y6-D006",
      "name": "Volume of Cubes and Cuboids",
      "description": "Mastery means pupils can calculate the volume of a cube or cuboid by applying the formula V = l × w × h, explain why the formula works by reference to the layering of unit cubes, and can estimate and compare volumes of everyday objects in appropriate units. A fully secure pupil recognises that volume is measured in cubic units (cm³, m³) and can convert between different cubic units by reasoning multiplicatively from the relationship between the base units.",
      "teaching_guidance": "Begin with practical building: ask pupils to construct cuboids from centimetre cubes and count the total number of cubes, then compare this with l × w × h. Establish the conceptual model of volume as layers of area: the base layer has area l × w, and stacking h layers gives V = l × w × h. Progress to problems where not all three dimensions are given (find a missing dimension given volume and two sides). Connect to the Measurement domain by including unit conversion in volume calculations. Estimation activities using everyday objects (a cereal box, a room) develop proportional reasoning alongside the formula.",
      "key_vocabulary": "volume, cube, cuboid, cubic centimetres (cm³), cubic metres (m³), formula, capacity, dimension, layer, unit cube",
      "common_misconceptions": "Pupils frequently confuse area (2-D) with volume (3-D), using the formula for one when the other is required. Some pupils multiply only two dimensions (finding an area rather than a volume). When converting between cubic units, pupils often apply the linear conversion factor rather than its cube (e.g., thinking 1 m³ = 100 cm³ rather than 1,000,000 cm³). Consistent use of the correct units in all working helps reinforce the distinction.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y6-C017",
      "domain_id": "MA-Y6-D007",
      "name": "Angles in Polygons and Angle Facts",
      "description": "Mastery means pupils know and can apply the key angle facts — angles on a straight line sum to 180°, angles at a point sum to 360°, vertically opposite angles are equal, angles in a triangle sum to 180°, angles in a quadrilateral sum to 360° — and can use these facts in combination to find missing angles in multi-step problems. A fully secure pupil understands that these facts are derived from more fundamental principles (not just memorised rules) and can construct chains of geometric reasoning to justify their answers.",
      "teaching_guidance": "Develop each angle fact from direct measurement and logical reasoning rather than just stating it. For example, establish that angles on a straight line sum to 180° by measuring, then connect to the fact that a straight line represents a half-turn (180°). Demonstrate angles in a triangle using torn paper corners (the three corners of a triangle always form a straight line when placed together). For regular polygons, connect interior angle calculation to the total interior angle sum, which equals (n-2) × 180° (though this formula need not be formalised at Year 6). Multi-step problems that require applying two or more angle facts in sequence develop deductive reasoning.",
      "key_vocabulary": "angle, degrees, angles on a straight line, angles at a point, vertically opposite angles, interior angle, exterior angle, regular polygon, triangle, quadrilateral",
      "common_misconceptions": "Pupils often confuse the interior angle sum of a polygon with the measure of each interior angle, not dividing by the number of sides for regular polygons. A very common error is assuming all triangles have a right angle or that all quadrilaterals are rectangles, leading to incorrect angle calculations. Pupils sometimes subtract angles from 360° when they should subtract from 180° (or vice versa), confusing which angle fact applies. Labelling diagrams with known angle facts before attempting calculations prevents most of these errors.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y6-C018",
      "domain_id": "MA-Y6-D007",
      "name": "Circles: Radius, Diameter and Circumference",
      "description": "Mastery means pupils can accurately draw and label all parts of a circle (centre, radius, diameter, circumference, chord, arc) and apply the relationship d = 2r fluently. A fully secure pupil uses a compass accurately to draw circles of given radius, understands that the circumference is the perimeter of the circle, and can solve problems involving the relationship between radius and diameter without confusion.",
      "teaching_guidance": "Introduce circles through practical construction using compasses, developing manual skill alongside conceptual vocabulary. Ensure all parts are learned with clear definitions: radius (any line from centre to circumference), diameter (line through the centre from circumference to circumference), circumference (total perimeter). Draw and label many examples in different sizes. Challenge pupils to find the diameter from the radius and vice versa in various contexts. Note that while Year 6 does not require calculation of circumference using π, pupils benefit from measuring the circumference and diameter of circular objects and discovering the ratio is always approximately 3.14 (an excellent investigation).",
      "key_vocabulary": "circle, centre, radius, diameter, circumference, chord, arc, pi (π), compass",
      "common_misconceptions": "Pupils frequently confuse radius and diameter, especially when applying the formula d = 2r. Some pupils draw the radius to any point on the circle's interior rather than to the circumference, or place the compass point on the circumference rather than the centre. The term 'circumference' (the length of the perimeter) is often confused with 'circle' (the shape) or 'arc' (part of the circumference). Regular use of correct terminology in context, with labelled diagrams, establishes secure vocabulary.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y6-C019",
      "domain_id": "MA-Y6-D008",
      "name": "Coordinates in All Four Quadrants",
      "description": "Mastery means pupils can plot and read coordinates in all four quadrants of a Cartesian grid, including those with negative x and/or y values, and can describe translations and reflections of shapes using coordinate language. A fully secure pupil understands the structure of all four quadrants — including the signs of coordinates in each quadrant — and can use coordinates to describe geometric properties such as midpoints, perpendicular lines, and lines of symmetry.",
      "teaching_guidance": "Ensure pupils have a very secure understanding of first-quadrant coordinates before extending to all four quadrants. Use the coordinate grid as a concrete visual tool: clearly label the four quadrants (I, II, III, IV) and identify the sign pattern (quadrant I: +,+; II: -,+; III: -,-; IV: +,-). Connect negative coordinates to pupils' number-line work with negative numbers. Reflections in the axes involve changing the sign of one coordinate: reflection in the y-axis negates the x-coordinate; reflection in the x-axis negates the y-coordinate. Translations are described as (+a, +b) where a is horizontal displacement and b is vertical, with appropriate signs.",
      "key_vocabulary": "coordinates, quadrant, x-axis, y-axis, origin, ordered pair, negative coordinate, translation, reflection, transformation, vector",
      "common_misconceptions": "Pupils persistently reverse x and y coordinates when plotting (reading up first, then across) — emphasise 'along the corridor, then up the stairs'. In all-four-quadrant grids, pupils may ignore the sign of a coordinate when it is negative, plotting in the wrong quadrant. For reflections in the y-axis, pupils sometimes reflect correctly in terms of position but fail to update the sign of the x-coordinate in their answer. Making the sign pattern of each quadrant explicit and returning to it regularly prevents these errors.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": true
    },
    {
      "concept_id": "MA-Y6-C020",
      "domain_id": "MA-Y6-D009",
      "name": "Pie Charts",
      "description": "Mastery of pie charts means pupils can read values from a pie chart by using the proportion that each sector represents (expressed as a fraction, decimal, or percentage), construct pie charts by calculating the angle for each sector from data, and evaluate critically whether a pie chart is an appropriate representation for a given dataset. A fully secure pupil connects pie chart interpretation to their fraction, percentage and angle knowledge, recognising that the whole circle represents the total frequency.",
      "teaching_guidance": "Introduce pie charts using data sets where the total is 36 (so angles are multiples of 10°) or 100 (so percentages convert directly to angles using the conversion 1% = 3.6°). Before constructing, pupils must understand that the whole circle is 360° and that each sector's angle is calculated as (frequency ÷ total) × 360°. Reading pie charts requires the reverse: finding the frequency from the angle as (angle ÷ 360°) × total. Connect to angle measurement: pupils should measure and draw sectors using protractors. Discuss when pie charts are appropriate (comparing proportions of a whole) and when they are less appropriate (very many categories, or when exact values matter).",
      "key_vocabulary": "pie chart, sector, angle, proportion, frequency, total, percentage, fraction, circle graph, protractor",
      "common_misconceptions": "Pupils often read the sector angle as the data value, rather than using it to calculate the proportion. When constructing pie charts, pupils sometimes add frequencies directly rather than converting to angles first. Some pupils assume all sectors in a pie chart represent equal proportions unless clearly different sizes are visible, and fail to read angles carefully with a protractor. The key conceptual understanding to reinforce is that the whole circle = 360° = total frequency = 100%.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true
    },
    {
      "concept_id": "MA-Y6-C021",
      "domain_id": "MA-Y6-D009",
      "name": "The Mean as an Average",
      "description": "Mastery of the mean means pupils can calculate the mean of a data set (sum of values ÷ number of values), interpret it as the value each item would take if all items were equal (the 'fair share' or 'levelling' interpretation), and use the mean to compare two data sets. A fully secure pupil understands that the mean may not be a value that appears in the data set, can work backwards from the mean to find a missing value, and knows when the mean is and is not an appropriate measure of average.",
      "teaching_guidance": "Introduce the mean through the 'levelling' metaphor: if 5 pupils have different numbers of stickers, the mean is the number each would have if they redistributed stickers equally. Physical or pictorial representations (towers of cubes being levelled) make this concrete. Progress to the calculation procedure (add all values, divide by number of values) and connect this to the levelling process. Extend to finding a missing value given the mean and all other values — this involves working backwards (total = mean × n; missing value = total − sum of known values). Compare the mean with the median and mode briefly to establish that 'average' does not always mean 'the most common' or 'the middle value'.",
      "key_vocabulary": "mean, average, sum, total, data set, fair share, levelling, missing value, median, mode",
      "common_misconceptions": "Pupils commonly confuse mean with mode (most frequent) or median (middle value), particularly if they have encountered all three measures without clear differentiation. When finding the mean, pupils sometimes add correctly but then divide by a number other than the count of values (e.g., dividing by the range, or by the largest value). The reverse problem — finding a missing value given the mean — is often approached by guessing rather than by using the total. Explicit recording of the calculation as a sequence of steps prevents most procedural errors.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    }
  ],
  "prerequisite_relationships": [
    {
      "relationship_id": "MA-Y6-PR001",
      "source_concept_id": "MA-Y5-C001",
      "target_concept_id": "MA-Y6-C001",
      "relationship_type": "developmental",
      "confidence": "explicit",
      "justification": "Year 5 develops place value to 1,000,000. Year 6 extends this to 10,000,000, requiring the same conceptual framework."
    },
    {
      "relationship_id": "MA-Y6-PR002",
      "source_concept_id": "MA-Y5-C002",
      "target_concept_id": "MA-Y6-C002",
      "relationship_type": "developmental",
      "confidence": "explicit",
      "justification": "Year 5 introduces rounding to the nearest power of 10. Year 6 extends this to rounding to any required degree of accuracy including decimals."
    },
    {
      "relationship_id": "MA-Y6-PR003",
      "source_concept_id": "MA-Y5-C003",
      "target_concept_id": "MA-Y6-C003",
      "relationship_type": "developmental",
      "confidence": "explicit",
      "justification": "Year 5 introduces negative numbers in context. Year 6 extends this to calculating intervals across zero."
    },
    {
      "relationship_id": "MA-Y6-PR004",
      "source_concept_id": "MA-Y5-C006",
      "target_concept_id": "MA-Y6-C004",
      "relationship_type": "developmental",
      "confidence": "explicit",
      "justification": "Year 5 introduces long multiplication of 4-digit by 2-digit numbers. Year 6 consolidates and applies this in multi-step problems."
    },
    {
      "relationship_id": "MA-Y6-PR005",
      "source_concept_id": "MA-Y5-C007",
      "target_concept_id": "MA-Y6-C005",
      "relationship_type": "developmental",
      "confidence": "explicit",
      "justification": "Year 5 introduces short division with remainders. Year 6 extends this to the formal long division method with 2-digit divisors."
    },
    {
      "relationship_id": "MA-Y6-PR006",
      "source_concept_id": "MA-Y5-C004",
      "target_concept_id": "MA-Y6-C007",
      "relationship_type": "developmental",
      "confidence": "explicit",
      "justification": "Year 5 develops knowledge of prime numbers, factors, and multiples. Year 6 extends this to common factors, common multiples, HCF and LCM."
    },
    {
      "relationship_id": "MA-Y6-PR007",
      "source_concept_id": "MA-Y5-C009",
      "target_concept_id": "MA-Y6-C008",
      "relationship_type": "developmental",
      "confidence": "explicit",
      "justification": "Year 5 develops equivalent fractions and comparing/ordering. Year 6 extends this to simplifying using HCF and comparing improper fractions and mixed numbers."
    },
    {
      "relationship_id": "MA-Y6-PR008",
      "source_concept_id": "MA-Y5-C010",
      "target_concept_id": "MA-Y6-C009",
      "relationship_type": "developmental",
      "confidence": "explicit",
      "justification": "Year 5 introduces addition and subtraction of fractions with the same denominator and mixed numbers. Year 6 extends to different denominators requiring conversion."
    },
    {
      "relationship_id": "MA-Y6-PR009",
      "source_concept_id": "MA-Y5-C009",
      "target_concept_id": "MA-Y6-C010",
      "relationship_type": "logical",
      "confidence": "inferred",
      "justification": "Multiplication and division of fractions requires secure understanding of equivalent fractions and fraction notation established in Year 5."
    },
    {
      "relationship_id": "MA-Y6-PR010",
      "source_concept_id": "MA-Y5-C011",
      "target_concept_id": "MA-Y6-C011",
      "relationship_type": "developmental",
      "confidence": "explicit",
      "justification": "Year 5 introduces percentages and their equivalence to fractions and decimals. Year 6 extends this to a wider range of equivalences including eighths and thirds."
    },
    {
      "relationship_id": "MA-Y6-PR011",
      "source_concept_id": "MA-Y5-C011",
      "target_concept_id": "MA-Y6-C012",
      "relationship_type": "developmental",
      "confidence": "inferred",
      "justification": "Year 5 introduces percentage as per cent of a quantity. Year 6 extends this to ratio and proportion, with percentages as one tool for expressing proportional relationships."
    },
    {
      "relationship_id": "MA-Y6-PR012",
      "source_concept_id": "MA-Y5-C015",
      "target_concept_id": "MA-Y6-C015",
      "relationship_type": "developmental",
      "confidence": "explicit",
      "justification": "Year 5 introduces area of rectangles and irregular shapes. Year 6 extends to the area of triangles and parallelograms using derived formulae."
    },
    {
      "relationship_id": "MA-Y6-PR013",
      "source_concept_id": "MA-Y5-C015",
      "target_concept_id": "MA-Y6-C016",
      "relationship_type": "developmental",
      "confidence": "explicit",
      "justification": "Year 5 introduces volume of cuboids by counting unit cubes. Year 6 formalises this with the formula V = l × w × h and includes unit conversion."
    },
    {
      "relationship_id": "MA-Y6-PR014",
      "source_concept_id": "MA-Y5-C013",
      "target_concept_id": "MA-Y6-C017",
      "relationship_type": "developmental",
      "confidence": "explicit",
      "justification": "Year 5 establishes angles in a triangle sum to 180° and introduces angles on a straight line. Year 6 extends this to quadrilaterals and regular polygons and introduces vertically opposite angles."
    },
    {
      "relationship_id": "MA-Y6-PR015",
      "source_concept_id": "MA-Y5-C014",
      "target_concept_id": "MA-Y6-C019",
      "relationship_type": "developmental",
      "confidence": "explicit",
      "justification": "Year 5 extends coordinates into all four quadrants. Year 6 deepens this by including translations and reflections on the full coordinate grid."
    },
    {
      "relationship_id": "MA-Y6-PR016",
      "source_concept_id": "MA-Y5-C001",
      "target_concept_id": "MA-Y6-C006",
      "relationship_type": "logical",
      "confidence": "inferred",
      "justification": "The order of operations requires confident mental and written calculation skills developed progressively through Years 3-5."
    },
    {
      "relationship_id": "MA-Y6-PR017",
      "source_concept_id": "MA-Y6-C007",
      "target_concept_id": "MA-Y6-C008",
      "relationship_type": "logical",
      "confidence": "explicit",
      "justification": "Simplifying fractions using highest common factor requires the HCF skills taught in the common factors and multiples concept within the same year."
    },
    {
      "relationship_id": "MA-Y6-PR018",
      "source_concept_id": "MA-Y6-C007",
      "target_concept_id": "MA-Y6-C009",
      "relationship_type": "logical",
      "confidence": "explicit",
      "justification": "Finding a common denominator for adding and subtracting fractions with different denominators requires the LCM skills taught in the common factors and multiples concept."
    },
    {
      "relationship_id": "MA-Y6-PR019",
      "source_concept_id": "MA-Y6-C008",
      "target_concept_id": "MA-Y6-C010",
      "relationship_type": "logical",
      "confidence": "explicit",
      "justification": "Multiplying and dividing fractions requires the ability to simplify results, which depends on the simplification skills taught in concept C008."
    },
    {
      "relationship_id": "MA-Y6-PR020",
      "source_concept_id": "MA-Y6-C017",
      "target_concept_id": "MA-Y6-C020",
      "relationship_type": "logical",
      "confidence": "explicit",
      "justification": "Constructing pie charts requires calculating sector angles using proportion, which in turn requires secure understanding of angle measurement and the 360° total."
    }
  ]
}
