{
  "metadata": {
    "subject": "Mathematics",
    "key_stage": "KS2",
    "years_covered": [5],
    "document_reference": "DFE-00180-2013",
    "extraction_date": "2026-02-17",
    "structure_rating": 9
  },
  "domains": [
    {
      "domain_id": "MA-Y5-D001",
      "domain_name": "Number - Number and Place Value",
      "description": "Reading, writing, ordering and comparing numbers to at least 1,000,000; counting forwards and backwards in steps of powers of 10; negative numbers; rounding to any power of 10; Roman numerals to 1000.",
      "curriculum_context": "In upper key stage 2, the principal focus of mathematics teaching is to ensure that pupils extend their understanding of the number system and place value to include larger integers. In Year 5, pupils read, write, order and compare numbers to at least 1,000,000, developing their understanding that the place value system extends indefinitely — each column is ten times the value of the column to its right. The non-statutory guidance specifies that pupils should identify the value of each digit to three decimal places and practise with increasingly large numbers, reading scales and number lines with increasing accuracy. Roman numerals to 1000 (M) are introduced, including the year in Roman numerals. Rounding to any power of 10 — including to the nearest 10,000 and 100,000 — develops estimation skills needed across all upper KS2 domains. This domain underpins the long multiplication, formal division and fraction work that are central to Year 5.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical"
    },
    {
      "domain_id": "MA-Y5-D002",
      "domain_name": "Number - Addition and Subtraction",
      "description": "Adding and subtracting whole numbers with more than four digits using formal written methods; mental calculations with increasingly large numbers; rounding to check answers; multi-step problems.",
      "curriculum_context": "In Year 5, pupils use formal written methods to add and subtract whole numbers with more than four digits, building on the four-digit work of Year 4. The non-statutory guidance specifies that pupils should practise using formal written methods and should be able to add and subtract with confidence. Pupils continue to develop mental strategies alongside written methods, choosing appropriately and efficiently. Rounding is explicitly required as a checking strategy: estimate the answer by rounding, compute, then compare to the estimate. Multi-step problems require pupils to identify the operations needed and to present their working clearly. This domain supports the multi-step problem contexts across all other Year 5 domains, particularly measurement and fractions.",
      "is_cross_cutting": false,
      "structure_type": "sequential"
    },
    {
      "domain_id": "MA-Y5-D003",
      "domain_name": "Number - Multiplication and Division",
      "description": "Identifying multiples, factors, common factors, prime numbers, square numbers and cube numbers; long multiplication (4-digit × 2-digit); short and long division; problem solving with all four operations.",
      "curriculum_context": "Year 5 introduces the major formal written methods of long multiplication and long division, extending the short multiplication and division of Year 4. The non-statutory guidance specifies that pupils should practise long multiplication for up to a four-digit number multiplied by a two-digit number, and short and long division with remainders. Number theory is introduced formally: pupils learn to identify factors, common factors and highest common factor; multiples and lowest common multiple; prime numbers, prime factor decomposition (informally); and square and cube numbers. These number theory concepts underpin the fraction arithmetic of this year (finding common denominators uses LCM; simplifying fractions uses HCF) and the algebra and ratio of Year 6.",
      "is_cross_cutting": false,
      "structure_type": "sequential"
    },
    {
      "domain_id": "MA-Y5-D004",
      "domain_name": "Number - Fractions (including Decimals and Percentages)",
      "description": "Comparing and ordering fractions; adding and subtracting fractions with different denominators; multiplying proper fractions; mixed numbers and improper fractions; decimals to three places; percentages as fractions and decimals.",
      "curriculum_context": "In Year 5, fractions become significantly more complex: pupils add and subtract fractions with different denominators using equivalent fractions (requiring LCM knowledge), multiply proper fractions and mixed numbers by whole numbers, and convert between mixed numbers and improper fractions. The non-statutory guidance explains that pupils connect fractions to division (a/b = a ÷ b) and use this connection to find equivalences. Percentages are introduced as a special form of fraction (per hundred) with decimal and fraction equivalences. Decimal place value is extended to three decimal places (thousandths). This domain is one of the most demanding in Year 5 and requires confident fluency with all prerequisite fraction and multiplication knowledge from Years 3 and 4.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical"
    },
    {
      "domain_id": "MA-Y5-D005",
      "domain_name": "Measurement",
      "description": "Converting between metric and common imperial units; calculating perimeter and area of rectangles, triangles and parallelograms; volumes of cuboids; solving problems involving time and money.",
      "curriculum_context": "In Year 5, measurement extends to include some imperial units that remain in common use (miles, pounds, pints, gallons) and approximate metric equivalents. The non-statutory guidance specifies that pupils should use, read and write standard units — including decimal notation — and practise converting between units, developing fluency in using different measurement contexts. Area is extended beyond rectilinear shapes to triangles and parallelograms, connecting to multiplication and division. Volume of a cuboid (length × width × height, measured in cm³) is introduced, connecting three-dimensional thinking to arithmetic. These practical skills connect directly to the number work of the year and provide real-world contexts for decimals, fractions and large number calculations.",
      "is_cross_cutting": true,
      "structure_type": "mixed"
    },
    {
      "domain_id": "MA-Y5-D006",
      "domain_name": "Geometry - Properties of Shapes",
      "description": "Identifying 3-D shapes from 2-D representations; measuring angles in degrees using a protractor; drawing given angles; calculating unknown angles in triangles, quadrilaterals and around a point.",
      "curriculum_context": "In Year 5, geometry advances from the qualitative comparison of angles in Year 4 to their precise measurement and calculation in degrees. Pupils learn to use a protractor accurately to measure and draw angles, and to calculate angles using angle facts (angles in a triangle sum to 180°; angles on a straight line sum to 180°; angles around a point sum to 360°). The non-statutory guidance specifies that pupils know that angles are measured in degrees and use the protractor for measuring. Three-dimensional thinking is extended through recognising 3-D shapes from 2-D representations and sketches. This formal angle measurement provides the foundation for trigonometry and formal geometric proof in secondary school, and the angle sum facts are used for algebraic problem-solving in Year 6.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical"
    },
    {
      "domain_id": "MA-Y5-D007",
      "domain_name": "Geometry - Position and Direction",
      "description": "Identifying, describing and representing the position of a shape following reflection or translation using the appropriate language, and using coordinates in all four quadrants.",
      "curriculum_context": "In Year 5, coordinate geometry extends from the first quadrant (Year 4) to all four quadrants, introducing negative coordinate values. Pupils describe and represent reflections (in lines parallel to the axes) and translations using coordinates. The non-statutory guidance indicates that pupils should practise reflecting and translating shapes on coordinate grids and use coordinates to describe positions accurately in all four quadrants. Reflections in horizontal and vertical mirror lines require understanding that each point moves perpendicular to the line by the same distance it is from the line. This domain connects arithmetic (negative numbers), coordinate geometry and transformational geometry, developing the multi-domain thinking that characterises upper KS2 mathematics.",
      "is_cross_cutting": true,
      "structure_type": "hierarchical"
    },
    {
      "domain_id": "MA-Y5-D008",
      "domain_name": "Statistics",
      "description": "Solving comparison, sum and difference problems using information in line graphs; completing, reading and interpreting information in tables, including timetables.",
      "curriculum_context": "In Year 5, the statistics curriculum focuses on reading and interpreting line graphs accurately — including reading values between plotted points and using the graph to answer problems — and on complex tables including timetables. The non-statutory guidance specifies that pupils should connect their work on coordinates (all four quadrants) to graphs. Pupils practise completing tables from data and drawing line graphs. Reading timetables requires combining understanding of time (12- and 24-hour clocks) with table-reading skills. This consolidation of statistical skills prepares pupils for the pie charts and statistical measures (mean) of Year 6.",
      "is_cross_cutting": true,
      "structure_type": "sequential"
    }
  ],
  "objectives": [
    {
      "objective_id": "MA-Y5-O001",
      "domain_id": "MA-Y5-D001",
      "objective_text": "read, write, order and compare numbers to at least 1,000,000 and determine the value of each digit",
      "non_statutory_guidance": "Pupils identify the value of each digit to three decimal places and multiply and divide numbers by 10, 100 and 1,000 where the answers are up to three decimal places. Pupils use a variety of representations, including measures, to represent numbers of increasing size.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O002",
      "domain_id": "MA-Y5-D001",
      "objective_text": "count forwards or backwards in steps of powers of 10 for any given number up to 1,000,000",
      "non_statutory_guidance": "Pupils practise counting in steps of powers of 10 and become increasingly fluent in moving between representations of different large numbers.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O003",
      "domain_id": "MA-Y5-D001",
      "objective_text": "interpret negative numbers in context, count forwards and backwards with positive and negative whole numbers, including through zero",
      "non_statutory_guidance": "Pupils use the number line as a model for ordering of negative numbers and positive numbers. They understand that the number line extends in both directions below zero.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O004",
      "domain_id": "MA-Y5-D001",
      "objective_text": "round any number up to 1,000,000 to the nearest 10, 100, 1,000, 10,000 and 100,000",
      "non_statutory_guidance": "Pupils develop the skill of rounding to different degrees of accuracy. They use rounding to check the reasonableness of answers to calculations.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O005",
      "domain_id": "MA-Y5-D001",
      "objective_text": "solve number problems and practical problems that involve all of the above",
      "non_statutory_guidance": "Pupils use all the skills developed in this domain to solve problems in a range of contexts, applying their understanding of place value and number.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O006",
      "domain_id": "MA-Y5-D001",
      "objective_text": "read Roman numerals to 1,000 (M) and recognise years written in Roman numerals",
      "non_statutory_guidance": "Pupils practise reading Roman numerals to 1000 (M) and recognise years written in Roman numerals. They understand the historical context of the Roman numeral system.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O007",
      "domain_id": "MA-Y5-D002",
      "objective_text": "add and subtract whole numbers with more than 4 digits, including using formal written methods (columnar addition and subtraction)",
      "non_statutory_guidance": "Pupils practise using formal written methods of columnar addition and subtraction, including where numbers have different numbers of digits. They continue to use mental methods where appropriate.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O008",
      "domain_id": "MA-Y5-D002",
      "objective_text": "add and subtract numbers mentally with increasingly large numbers",
      "non_statutory_guidance": "Pupils practise adding and subtracting numbers mentally. They use strategies such as partitioning and compensation for larger numbers.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O009",
      "domain_id": "MA-Y5-D002",
      "objective_text": "use rounding to check answers to calculations and determine, in the context of a problem, levels of accuracy",
      "non_statutory_guidance": "Pupils develop the use of rounding to check the reasonableness of answers. They determine, in context, what level of accuracy is appropriate for an answer.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O010",
      "domain_id": "MA-Y5-D002",
      "objective_text": "solve addition and subtraction multi-step problems in contexts, deciding which operations and methods to use and why",
      "non_statutory_guidance": "Pupils solve a range of problems, applying their knowledge of addition and subtraction. They select appropriate methods and explain their reasoning.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O011",
      "domain_id": "MA-Y5-D003",
      "objective_text": "identify multiples and factors, including finding all factor pairs of a number, and common factors of two numbers",
      "non_statutory_guidance": "Pupils explore the properties of numbers systematically, including prime numbers, perfect squares and triangular numbers.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O012",
      "domain_id": "MA-Y5-D003",
      "objective_text": "know and use the vocabulary of prime numbers, prime factors and composite (non-prime) numbers",
      "non_statutory_guidance": "Pupils explore the properties of prime numbers. They understand that a prime number has exactly two factors: 1 and itself. They should know the prime numbers up to 19.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O013",
      "domain_id": "MA-Y5-D003",
      "objective_text": "establish whether a number up to 100 is prime and recall prime numbers up to 19",
      "non_statutory_guidance": "Pupils understand that 1 is not a prime number (as it has only one factor). They can identify whether a number up to 100 is prime by systematic checking.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O014",
      "domain_id": "MA-Y5-D003",
      "objective_text": "multiply numbers up to 4 digits by a one- or two-digit number using a formal written method, including long multiplication for two-digit numbers",
      "non_statutory_guidance": "Pupils practise and extend their use of the formal written methods of short multiplication and long multiplication. Long multiplication is used when the multiplier has two or more digits.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O015",
      "domain_id": "MA-Y5-D003",
      "objective_text": "divide numbers up to 4 digits by a one-digit number using the formal written method of short division and interpret remainders appropriately for the context",
      "non_statutory_guidance": "Pupils practise short division. They interpret remainders as whole number remainders, fractions, or by rounding, as appropriate for the context.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O016",
      "domain_id": "MA-Y5-D003",
      "objective_text": "multiply and divide numbers mentally drawing on known facts",
      "non_statutory_guidance": "Pupils continue to develop their mental calculation strategies, drawing on their knowledge of multiplication and division facts and place value.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O017",
      "domain_id": "MA-Y5-D003",
      "objective_text": "identify, name and write equivalent fractions of a given fraction, represented visually, including tenths and hundredths",
      "non_statutory_guidance": "Pupils should use the relationship between multiplication and division to find equivalent fractions. They extend their understanding of equivalent fractions using a visual approach.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O018",
      "domain_id": "MA-Y5-D003",
      "objective_text": "solve problems involving multiplication and division including using their knowledge of factors and multiples, squares and cubes",
      "non_statutory_guidance": "Pupils solve a range of multiplication and division problems, applying their knowledge of factors, multiples, prime numbers and square and cube numbers.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O019",
      "domain_id": "MA-Y5-D003",
      "objective_text": "solve problems involving addition, subtraction, multiplication and division and a combination of these, including understanding the meaning of the equals sign",
      "non_statutory_guidance": "Pupils solve multi-step problems involving all four operations. They begin to use brackets and understand the order of operations.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O020",
      "domain_id": "MA-Y5-D003",
      "objective_text": "recognise and use square numbers and cube numbers, and the notation for squared (²) and cubed (³)",
      "non_statutory_guidance": "Pupils understand that a square number is the result of multiplying a number by itself, and a cube number is the result of multiplying a number by itself three times. They use the notation n² and n³.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O021",
      "domain_id": "MA-Y5-D004",
      "objective_text": "compare and order fractions whose denominators are all multiples of the same number",
      "non_statutory_guidance": "Pupils should use fraction notation, including mixed numbers, and recognise that they are equal to a particular value. They practise converting between mixed numbers and improper fractions.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O022",
      "domain_id": "MA-Y5-D004",
      "objective_text": "identify, name and write equivalent fractions of a given fraction, represented visually, including tenths and hundredths",
      "non_statutory_guidance": "Pupils should connect multiplying and dividing by fractions to their knowledge of equivalent fractions. They extend their understanding of tenths and hundredths as equivalent fractions.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O023",
      "domain_id": "MA-Y5-D004",
      "objective_text": "recognise mixed numbers and improper fractions and convert from one form to the other and write mathematical statements > 1 as a mixed number [for example, 2/5 + 4/5 = 6/5 = 1 1/5]",
      "non_statutory_guidance": "Pupils should use the number line and fraction notation to understand the relationship between mixed numbers and improper fractions. They should be able to convert fluently between the two forms.",
      "examples": "2/5 + 4/5 = 6/5 = 1 1/5",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O024",
      "domain_id": "MA-Y5-D004",
      "objective_text": "add and subtract fractions with the same denominator and denominators that are multiples of the same number",
      "non_statutory_guidance": "Pupils should practise using equivalent fractions to add and subtract fractions with different denominators. They use the lowest common multiple to find a common denominator.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O025",
      "domain_id": "MA-Y5-D004",
      "objective_text": "multiply proper fractions and mixed numbers by whole numbers, supported by materials and diagrams",
      "non_statutory_guidance": "Pupils should multiply a proper fraction by a whole number, supported by concrete materials and diagrams. They should understand this as repeated addition of fractions.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O026",
      "domain_id": "MA-Y5-D004",
      "objective_text": "read and write decimal numbers as fractions [for example, 0.71 = 71/100]",
      "non_statutory_guidance": "Pupils should connect their knowledge of place value and fractions to understand the relationship between decimal notation and fraction notation.",
      "examples": "0.71 = 71/100",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O027",
      "domain_id": "MA-Y5-D004",
      "objective_text": "recognise and use thousandths and relate them to tenths, hundredths and decimal equivalents",
      "non_statutory_guidance": "Pupils should extend their knowledge of decimal place value to include thousandths (0.001). They connect thousandths to their knowledge of tenths and hundredths.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O028",
      "domain_id": "MA-Y5-D004",
      "objective_text": "round decimals with two decimal places to the nearest whole number and to one decimal place",
      "non_statutory_guidance": "Pupils should be able to round decimals with two decimal places to the nearest whole number and to one decimal place.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O029",
      "domain_id": "MA-Y5-D004",
      "objective_text": "read, write, order and compare numbers with up to three decimal places",
      "non_statutory_guidance": "Pupils should be able to read, write, order and compare numbers with up to three decimal places, applying their understanding of decimal place value.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O030",
      "domain_id": "MA-Y5-D004",
      "objective_text": "solve problems involving number up to three decimal places",
      "non_statutory_guidance": "Pupils should solve problems involving decimals to three places in a range of contexts, including measures and money.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O031",
      "domain_id": "MA-Y5-D004",
      "objective_text": "recognise the per cent symbol (%) and understand that per cent relates to 'number of parts per hundred', and write percentages as a fraction with denominator 100, and as a decimal",
      "non_statutory_guidance": "Pupils should connect percentages to their knowledge of fractions and decimals. They understand that 45% = 45/100 = 0.45.",
      "examples": "45% = 45/100 = 0.45",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O032",
      "domain_id": "MA-Y5-D004",
      "objective_text": "solve problems which require knowing percentage and decimal equivalents of 1/2, 1/4, 1/5, 2/5, 4/5 and those fractions with a denominator of a multiple of 10 or 25",
      "non_statutory_guidance": "Pupils should know and use the percentage and decimal equivalents of simple fractions. They should be able to find a percentage of an amount, for example finding 45% of a number by writing it as 45/100 × number.",
      "examples": "1/2, 1/4, 1/5, 2/5, 4/5",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O033",
      "domain_id": "MA-Y5-D005",
      "objective_text": "convert between different units of metric measure [for example, kilometre and metre; centimetre and metre; centimetre and millimetre; gram and kilogram; litre and millilitre]",
      "non_statutory_guidance": "Pupils should be able to convert between units of measure and use decimal notation up to three decimal places when recording measurements.",
      "examples": "kilometre and metre; centimetre and metre; centimetre and millimetre; gram and kilogram; litre and millilitre",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O034",
      "domain_id": "MA-Y5-D005",
      "objective_text": "understand and use approximate equivalences between metric units and common imperial units such as inches, pounds and pints",
      "non_statutory_guidance": "Pupils should know approximate imperial equivalents such as 5 miles ≈ 8 km, 1 kg ≈ 2.2 pounds, 1 litre ≈ 1.75 pints.",
      "examples": "inches, pounds and pints",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O035",
      "domain_id": "MA-Y5-D005",
      "objective_text": "measure and calculate the perimeter of composite rectilinear shapes in centimetres and metres",
      "non_statutory_guidance": "Pupils should extend their knowledge of perimeter to composite rectilinear shapes, identifying missing lengths where necessary.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O036",
      "domain_id": "MA-Y5-D005",
      "objective_text": "calculate and compare the area of rectangles (including squares), and including using standard units, square centimetres (cm²) and square metres (m²), and estimate the area of irregular shapes",
      "non_statutory_guidance": "Pupils should be able to calculate the area of rectangles and squares using the formula area = length × width. They should also be able to estimate the area of irregular shapes by counting squares.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O037",
      "domain_id": "MA-Y5-D005",
      "objective_text": "estimate volume [for example, using 1 cm³ blocks to build cuboids (including cubes)] and capacity [for example, using water]",
      "non_statutory_guidance": "Pupils should understand and use volume of a cuboid as length × width × height. They should use 1 cm³ blocks to build and measure the volume of cuboids.",
      "examples": "using 1 cm³ blocks to build cuboids (including cubes); using water",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O038",
      "domain_id": "MA-Y5-D005",
      "objective_text": "solve problems involving converting between units of time",
      "non_statutory_guidance": "Pupils should be able to convert between units of time. They should solve problems involving time in a range of contexts.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O039",
      "domain_id": "MA-Y5-D005",
      "objective_text": "use all four operations to solve problems involving measure [for example, length, mass, volume, money] using decimal notation, including scaling",
      "non_statutory_guidance": "Pupils should apply all four operations to measurement problems, using decimal notation. They should solve scaling problems involving measurement.",
      "examples": "length, mass, volume, money",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O040",
      "domain_id": "MA-Y5-D006",
      "objective_text": "identify 3-D shapes, including cubes and other cuboids, from 2-D representations",
      "non_statutory_guidance": "Pupils should be able to identify 3-D shapes from their 2-D representations, including nets and isometric drawings.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O041",
      "domain_id": "MA-Y5-D006",
      "objective_text": "know angles are measured in degrees: estimate and compare acute, obtuse and reflex angles",
      "non_statutory_guidance": "Pupils should know that angles are measured in degrees, that there are 360° in a full turn, and that they can estimate and compare angles.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O042",
      "domain_id": "MA-Y5-D006",
      "objective_text": "draw given angles, and measure them in degrees (°)",
      "non_statutory_guidance": "Pupils should be able to draw angles of a specified size using a protractor, and measure angles accurately to the nearest degree.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O043",
      "domain_id": "MA-Y5-D006",
      "objective_text": "identify: angles at a point and one whole turn (total 360°); angles at a point on a straight line and 1/2 a turn (total 180°); other multiples of 90°",
      "non_statutory_guidance": "Pupils should know that the sum of angles at a point is 360° and the sum of angles on a straight line is 180°. They should use these facts to calculate missing angles.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O044",
      "domain_id": "MA-Y5-D006",
      "objective_text": "use the properties of rectangles to deduce related facts and find missing lengths and angles",
      "non_statutory_guidance": "Pupils should use the properties of rectangles (all angles 90°, opposite sides equal) to find missing lengths and angles.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O045",
      "domain_id": "MA-Y5-D006",
      "objective_text": "distinguish between regular and irregular polygons based on reasoning about equal sides and angles",
      "non_statutory_guidance": "Pupils should be able to distinguish between regular polygons (all sides and angles equal) and irregular polygons, using the properties of the shapes.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O046",
      "domain_id": "MA-Y5-D007",
      "objective_text": "identify, describe and represent the position of a shape following a reflection or translation, using the appropriate language, and know that the shape has not changed",
      "non_statutory_guidance": "Pupils should be able to reflect and translate shapes on a coordinate grid. They should understand that the shape does not change size or shape under reflection or translation.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O047",
      "domain_id": "MA-Y5-D008",
      "objective_text": "solve comparison, sum and difference problems using information presented in a line graph",
      "non_statutory_guidance": "Pupils should be able to read and interpret line graphs, solving comparison, sum and difference problems. They should connect their coordinate work to graphing.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y5-O048",
      "domain_id": "MA-Y5-D008",
      "objective_text": "complete, read and interpret information in tables, including timetables",
      "non_statutory_guidance": "Pupils should be able to complete tables from given data and read and interpret information in tables, including timetables for buses and trains.",
      "examples": "",
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "MA-Y5-C001",
      "concept_name": "Numbers to 1,000,000 and their place value",
      "description": "Place value extends to six digits in Year 5, with columns for hundred-thousands, ten-thousands and thousands joining the familiar hundreds, tens and ones. Each column is ten times the value of the column to its right. Mastery means pupils can identify the value of any digit in a number up to 1,000,000, partition such numbers in multiple ways, compare and order them, and read and write them in numerals and words.",
      "teaching_guidance": "Extend place value charts to six columns. Use large number cards for the display board (100,000, 200,000... cards alongside the familiar 1,000, 2,000... cards). Connect to real-world contexts: populations of cities, distances in space, stadium capacities. Pupils who understand the repeating pattern (ones, tens, hundreds — then thousands ones, thousands tens, thousands hundreds — then millions...) see the structure clearly. Number lines from 0 to 1,000,000 help with ordering and estimation.",
      "key_vocabulary": "million, hundred thousand, ten thousand, thousand, place value, digit, partition, order, compare, numeral, words",
      "common_misconceptions": "Pupils sometimes omit commas in large numbers or place them incorrectly. Numbers with zeros in the middle (e.g. 304,056) cause placeholder confusion. Pupils may read 304,056 as 'three hundred and four thousand and fifty-six' omitting the hundreds of thousands value or collapsing place values.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y5-C002",
      "concept_name": "Rounding to any power of 10",
      "description": "Rounding in Year 5 extends to the nearest 10,000 and 100,000. The underlying rule is identical to Year 4 (look at the next column right: 5 or more rounds up, 4 or less rounds down), but the range of numbers and the columns involved are much larger. Mastery means pupils can round any number up to 1,000,000 to any specified degree of accuracy and explain why, connecting rounding to the position of the number on a number line.",
      "teaching_guidance": "Practise identifying the two bounding multiples of the target rounding unit first: to round 347,500 to the nearest 100,000, identify that it is between 300,000 and 400,000, then determine which it is closer to. Use a number line segment showing just the relevant range. Connect rounding to estimation: before multiplying 4,713 × 23, estimate as 5,000 × 20 = 100,000. Emphasise that rounding does not change the number — it approximates it.",
      "key_vocabulary": "round, nearest, ten thousand, hundred thousand, approximate, estimate, degree of accuracy, power of 10",
      "common_misconceptions": "When rounding to the nearest 10,000, pupils look at the ones or tens digit (the last digit) rather than the thousands digit. Cascading rounding — rounding 95,000 to the nearest 100,000 gives 100,000 — surprises pupils who may not expect rounding to increase the number of digits.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true
    },
    {
      "concept_id": "MA-Y5-C003",
      "concept_name": "Prime numbers and composite numbers",
      "description": "A prime number has exactly two distinct factors: 1 and itself (2, 3, 5, 7, 11, 13, 17, 19...). A composite number has more than two factors. The number 1 is neither prime nor composite. Mastery means pupils can identify whether any number up to 100 is prime, recall primes up to 19, and explain why 1 is excluded from the definition of prime.",
      "teaching_guidance": "Use the Sieve of Eratosthenes: start with numbers 2-100, cross out all multiples of 2 (not 2 itself), then all multiples of 3, 5, 7 — the remaining numbers are prime. This systematic approach builds conceptual understanding. Connect to factors: a prime number has only one factor pair (1 and itself). The fact that there are infinitely many primes can be discussed as a fascinating mathematical result. Practise rapid identification of primeness for numbers under 20.",
      "key_vocabulary": "prime number, composite number, factor, factor pair, divisible, Sieve of Eratosthenes, 1 is not prime",
      "common_misconceptions": "Pupils frequently include 1 as a prime number (it has only one factor, not two). They may think all odd numbers are prime (9 = 3 × 3 is odd but not prime). The number 2 is the only even prime, which surprises pupils who think 'all primes are odd'. Large-number primeness testing requires systematic factor checking.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y5-C004",
      "concept_name": "Square numbers and cube numbers",
      "description": "A square number is the product of an integer with itself: 1, 4, 9, 16, 25, 36, 49, 64, 81, 100... written as n². A cube number is the product of an integer with itself three times: 1, 8, 27, 64, 125... written as n³. Mastery means pupils can list all square numbers up to 144 (12²) and the first five cube numbers, use the notation n² and n³, and connect these to area and volume.",
      "teaching_guidance": "Use physical square arrays (a 5 × 5 grid of squares = 25 = 5²) and cubic structures (a 3 × 3 × 3 arrangement of cubes = 27 = 3³) to make the concepts concrete. Square numbers connect directly to area of squares (area of a 4 cm square = 4² = 16 cm²); cube numbers connect to volume of cubes (volume of a 3 cm cube = 3³ = 27 cm³). Display a reference chart of squares and cubes. Note that 1 and 64 are both square and cube numbers.",
      "key_vocabulary": "square number, cube number, squared, cubed, n², n³, power, notation, array",
      "common_misconceptions": "Pupils confuse squaring with multiplying by 2 (thinking 5² = 10 rather than 25). Similarly, they may think 5³ = 15 (multiplying by 3) rather than 125 (multiplying 5 × 5 × 5). The notation n² is sometimes read as 'n two' rather than 'n squared'. Pupils may not connect square numbers to physical square arrays.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y5-C005",
      "concept_name": "Factors, common factors and multiples",
      "description": "Factors of a number divide it exactly; multiples of a number are its products with positive integers. Common factors of two numbers are factors shared by both; the highest common factor (HCF) is the largest. Common multiples are multiples shared by two numbers; the lowest common multiple (LCM) is the smallest. Mastery means pupils can find all factor pairs of any number to 100, identify common factors and HCF of two numbers, identify the LCM of two single-digit numbers, and use these in simplifying fractions and finding common denominators.",
      "teaching_guidance": "Systematic factor pair listing: start from 1 × n and work upward until the factors meet in the middle (e.g. for 24: 1×24, 2×12, 3×8, 4×6 — stop at 4 because 5 does not divide 24 exactly and 5 × 5 = 25 > 24). Venn diagrams showing factors of two numbers overlap at their common factors. Connect directly to fractions: HCF is used to simplify (24/36: HCF is 12, so 24/36 = 2/3); LCM is used to find common denominators (adding 1/4 + 1/6: LCM of 4 and 6 is 12).",
      "key_vocabulary": "factor, multiple, factor pair, common factor, highest common factor, HCF, common multiple, lowest common multiple, LCM, divisible",
      "common_misconceptions": "Factors and multiples are persistently confused: factors divide a number (factors of 12 are 1, 2, 3, 4, 6, 12); multiples are the products of multiplying a number by positive integers (multiples of 12 are 12, 24, 36...). When finding common factors, pupils often stop after finding one rather than listing all. HCF is confused with product of factors.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y5-C006",
      "concept_name": "Long multiplication (4-digit × 2-digit)",
      "description": "Long multiplication extends short multiplication to a two-digit multiplier. The product is computed as the sum of two partial products: one where the multiplier is the ones digit (with the result placed on the first line) and one where the multiplier is the tens digit (with the result indented by one place, equivalent to multiplying by ten). Mastery means pupils can reliably compute any up-to four-digit number multiplied by any two-digit number using the formal long multiplication method.",
      "teaching_guidance": "Build from short multiplication. Show that 47 × 23 = 47 × 20 + 47 × 3 = 940 + 141 = 1081 using grid method first. Then show how this is compressed into the long multiplication layout: first row: 47 × 3 = 141; second row: 47 × 20 = 940 (written with 0 in the ones column as a placeholder, then multiplied by 2 for the tens); add the two rows: 141 + 940 = 1081. Estimation before multiplying: 47 × 23 ≈ 50 × 20 = 1000, so 1081 is plausible.",
      "key_vocabulary": "long multiplication, partial product, placeholder, indent, two-digit multiplier, ones, tens, formal method, carry",
      "common_misconceptions": "The most common error is forgetting to write the zero placeholder in the second row (so the tens product is not shifted left correctly). Pupils also forget to add carries from the first row before starting the second. Some pupils treat long multiplication as two separate short multiplications and forget to add the partial products at the end.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y5-C007",
      "concept_name": "Short division with remainders",
      "description": "Short division (the 'bus stop' method) divides a multi-digit number by a single-digit number, recording the working compactly above the number. In Year 5, this extends to four-digit dividends, and remainders must be interpreted appropriately — as a whole number remainder, as a fraction, or by rounding up or down depending on context. Mastery means pupils can accurately complete any four-digit ÷ one-digit calculation using short division and interpret the remainder correctly for the problem context.",
      "teaching_guidance": "Establish the procedure with two-digit ÷ one-digit first to consolidate the method. Extend to three then four digits. The critical skill is interpreting remainders: dividing 43 children into groups of 5: 43 ÷ 5 = 8 remainder 3 → 9 groups needed (round up for groups of people). Dividing £43 equally among 5 people: 43 ÷ 5 = £8.60 (express as a decimal). Share 43 biscuits equally among 5: 43 ÷ 5 = 8 with 3 left over (whole number remainder). Context determines the form of the answer.",
      "key_vocabulary": "short division, bus stop method, dividend, divisor, quotient, remainder, interpret, round up, round down, fraction, context",
      "common_misconceptions": "Pupils forget to bring down a digit when there is a remainder from one column to the next, particularly when a zero appears in the quotient (e.g. 3024 ÷ 4 = 756, where 0 ÷ 4 = 0 must still be written). Interpreting remainders contextually is frequently missed — pupils give a remainder answer when the context requires rounding.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y5-C008",
      "concept_name": "Adding and subtracting fractions with different denominators",
      "description": "To add or subtract fractions with different denominators, both fractions must be expressed with a common denominator using equivalent fractions. The lowest common multiple of the denominators gives the most efficient common denominator. For example, 1/3 + 1/4: LCM of 3 and 4 is 12; 1/3 = 4/12, 1/4 = 3/12; 4/12 + 3/12 = 7/12. Mastery means pupils can find a common denominator, convert both fractions, add or subtract, and simplify if possible.",
      "teaching_guidance": "Begin with denominators where one is a multiple of the other (1/4 + 1/8: 1/4 = 2/8, so 2/8 + 1/8 = 3/8 — only one fraction needs converting). Extend to cases requiring LCM (1/3 + 1/4 as above). Use fraction bars to show equivalence visually before computing abstractly. Connect to LCM knowledge from number theory. When results exceed 1 whole, convert to mixed number (7/5 = 1 2/5).",
      "key_vocabulary": "common denominator, equivalent fraction, lowest common multiple, LCM, numerator, denominator, add, subtract, simplify, mixed number",
      "common_misconceptions": "The classic error is adding numerators and denominators independently (1/3 + 1/4 = 2/7). Pupils who do not find a common denominator first will always make this error. When only one denominator needs converting, some pupils convert both unnecessarily and make errors. Forgetting to simplify the answer (leaving 6/9 instead of 2/3) is also common.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y5-C009",
      "concept_name": "Mixed numbers and improper fractions",
      "description": "An improper fraction has a numerator greater than or equal to its denominator (e.g. 7/4). A mixed number expresses the same value as a whole number and a proper fraction (e.g. 1 3/4). Converting between them: 7/4 = 4/4 + 3/4 = 1 + 3/4 = 1 3/4; and 2 3/5 = (2 × 5 + 3)/5 = 13/5. Mastery means pupils convert fluently in both directions, understand that the two forms represent identical values, and can position both on a number line.",
      "teaching_guidance": "Use a number line with fractions and whole numbers marked: 0, 1/4, 2/4 (=1/2), 3/4, 4/4 (=1), 5/4 (=1 1/4)... This makes the continuity of fractions beyond 1 visible. For converting improper to mixed: divide numerator by denominator (the quotient is the whole number; the remainder is the new numerator over the same denominator). For mixed to improper: multiply whole number by denominator and add numerator.",
      "key_vocabulary": "mixed number, improper fraction, convert, equivalent, numerator, denominator, whole number, number line, remainder",
      "common_misconceptions": "When converting mixed to improper, pupils forget to add the numerator after multiplying (computing 2 × 5 = 10 for 2 3/5 and writing 10/5 rather than 13/5). When converting improper to mixed, pupils who use the division method may not write the remainder as a fraction (writing quotient as the answer without a remainder fraction). They may also think improper fractions are 'wrong' rather than a valid form.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y5-C010",
      "concept_name": "Percentages as fractions and decimals",
      "description": "Percent means 'per hundred' (from Latin per centum). A percentage is therefore a fraction with denominator 100: 45% = 45/100 = 0.45. Common equivalences to know: 50% = 1/2 = 0.5; 25% = 1/4 = 0.25; 10% = 1/10 = 0.1; 1% = 1/100 = 0.01; 20% = 1/5 = 0.2. Mastery means pupils can convert between percentage, fraction and decimal forms for all common equivalences and for any percentage, and can find a percentage of a quantity.",
      "teaching_guidance": "Use a hundredths grid (100 squares representing 100%): shade 45 squares to show 45%. Money provides a natural percentage context: 50% of £80 = £40 (half). Teach the three forms side by side: fraction, decimal, percentage. Building up from known benchmarks: 50% is a half, 25% is a quarter, 10% is a tenth, then 5% = half of 10%, 20% = double 10% etc. Finding a percentage: multiply by the decimal equivalent (35% of 60 = 0.35 × 60 = 21).",
      "key_vocabulary": "percent, percentage, %, per hundred, fraction, decimal, equivalent, convert, find a percentage, of, hundredths",
      "common_misconceptions": "Pupils sometimes think 'per cent' and 'percentage points' are interchangeable in all contexts. They may write 5% as 0.5 (rather than 0.05) or as 5/10 (rather than 5/100). Converting 0.07 to a percentage: some pupils say 7% (correct) but others say 70% (multiplying by 10 rather than 100). The relationship between percentage and decimal requires multiplying or dividing by 100, not 10.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": true
    },
    {
      "concept_id": "MA-Y5-C011",
      "concept_name": "Measuring angles in degrees using a protractor",
      "description": "Angles are measured in degrees (°). A full turn is 360°; a right angle is 90°; a straight line is 180°. Pupils in Year 5 use a protractor to measure and draw angles to the nearest degree, and classify angles as acute (0°-90°), right (90°), obtuse (90°-180°), straight (180°) or reflex (180°-360°). Mastery means pupils can accurately measure any angle using a protractor, draw any given angle, and estimate angle size before measuring.",
      "teaching_guidance": "Teach protractor use step by step: (1) place the centre of the protractor on the vertex of the angle; (2) align the baseline with one arm of the angle; (3) read the scale from 0° on the baseline — use the correct scale (inner or outer) depending on the angle's orientation. Estimate first: 'It looks like about 60° — is it acute?' Check the reading is in the right range. Practise both measuring and drawing (place baseline, mark the required angle, draw the second arm). Identify the reflex angle as the one greater than 180°.",
      "key_vocabulary": "protractor, degrees, angle, vertex, arm, baseline, acute, obtuse, reflex, straight angle, right angle, measure, draw, estimate",
      "common_misconceptions": "The most common error is reading the wrong scale on the protractor (reading 120° when the angle is 60°, because protractors have two scales that count in opposite directions). Pupils may not place the centre of the protractor on the vertex, giving inaccurate readings. They may also not estimate before measuring, leading to unchecked errors.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y5-C012",
      "concept_name": "Angle facts (straight line, point, triangle)",
      "description": "Three fundamental angle facts enable calculation of unknown angles: (1) angles on a straight line sum to 180°; (2) angles at a point (around a full turn) sum to 360°; (3) angles in a triangle sum to 180°. Mastery means pupils can apply each fact to find a missing angle, state which fact they used, and combine facts in multi-step angle calculations.",
      "teaching_guidance": "Demonstrate each fact concretely: tear off the three corners of a paper triangle and arrange them to make a straight line — showing they sum to 180°. For angles at a point, physically measure several angles sharing a vertex and add them up. For straight line: 'two angles on a line are supplementary' — fold a straight strip to show the fold creates two angles totalling 180°. Then practise using the algebraic approach: if one angle is 65° and angles on a straight line sum to 180°, the missing angle is 180° – 65° = 115°.",
      "key_vocabulary": "angles on a straight line, angles at a point, angles in a triangle, degrees, sum, missing angle, supplementary, straight angle, protractor",
      "common_misconceptions": "Pupils sometimes use the wrong total (applying 360° instead of 180° for angles on a straight line). They may confuse 'at a point' (360°) with 'on a straight line' (180°). For triangles, pupils may not check that their three angles sum to 180° after calculating, missing arithmetic errors.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y5-C013",
      "concept_name": "Thousandths and decimal place value to 3 decimal places",
      "description": "A thousandth is 1/1000 = 0.001 — the third decimal place. Extending decimal place value to three places allows measurement to the nearest millimetre (1 mm = 0.001 m), weight to nearest gram (1 g = 0.001 kg), and volume to nearest millilitre. Mastery means pupils can read, write, order and compare numbers with up to three decimal places, identify the value of any digit, and connect decimal and fraction notation for thousandths.",
      "teaching_guidance": "Extend the place value chart to include tenths, hundredths and thousandths columns. Use a number line from 0 to 1 marked in 0.001 steps (or at key reference points) for ordering. Measurement contexts: a 5 km race recorded as 4.876 km = 4 km 876 m; a mass of 2.345 kg = 2 kg 345 g. Connect to division: 3 ÷ 1000 = 0.003 (three thousandths). Compare numbers with 3 decimal places column by column from left.",
      "key_vocabulary": "thousandth, 0.001, 1/1000, three decimal places, place value, tenths, hundredths, compare, order, decimal point",
      "common_misconceptions": "Pupils compare decimals with different numbers of decimal places incorrectly: thinking 0.4 > 0.35 might be true (correct) but thinking 0.035 > 0.4 because 35 > 4 (incorrect — confusing place values). The word 'thousandths' is confused with 'thousands', leading to errors when moving between large and small numbers. Writing 0.003 as 3/1000 is secure; writing 3/1000 as 0.003 is less so.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y5-C014",
      "concept_name": "Volume of cuboids",
      "description": "Volume is the amount of three-dimensional space a solid occupies, measured in cubic units (cm³, m³). The volume of a cuboid is calculated as length × width × height. In Year 5, pupils build cuboids from unit cubes, estimate volumes, and apply the formula. Mastery means pupils understand volume as a 3-D measurement distinct from area, can calculate the volume of a cuboid using the formula, and use appropriate cubic units.",
      "teaching_guidance": "Build cuboids from 1 cm³ cubes: a 3 × 4 × 2 cuboid contains 24 cubes = 24 cm³. Show that this can be seen as 3 layers of 4 × 2 = 8 cubes, or 4 rows of 3 × 2 = 6 cubes — connecting to the commutativity of multiplication. Connect area of the base (length × width) to volume: volume = base area × height. Introduce the unit cm³ (cubic centimetre) as the space a 1 cm × 1 cm × 1 cm cube occupies. Compare cm³ (volume) with cm² (area) to keep units clear.",
      "key_vocabulary": "volume, cuboid, cubic centimetre, cm³, length, width, height, formula, three-dimensional, space, unit cube",
      "common_misconceptions": "Pupils confuse volume (cm³, 3-D) with area (cm², 2-D). They may multiply only two dimensions rather than three. The formula V = l × w × h is sometimes misremembered as V = l + w + h (confusing with perimeter additions). Pupils may not understand that a flat shape has no volume, or that two shapes with the same surface area can have different volumes.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y5-C015",
      "concept_name": "Reflections and translations in all four quadrants",
      "description": "Reflection in a line maps each point to its mirror image equidistant from the line on the opposite side. Translation moves a shape a given number of units left/right and up/down without rotation or resizing. In Year 5, reflections use vertical or horizontal mirror lines; translations are described as vectors (3 right, 2 down). Mastery means pupils can reflect a shape in a given horizontal or vertical line on a coordinate grid, translate a shape given a description, and identify the coordinates of the transformed vertices.",
      "teaching_guidance": "For reflection: identify key vertices, count the perpendicular distance from each vertex to the mirror line, plot the image vertex the same distance on the other side. Use tracing paper to check. For translation: shift every vertex by the same amount in the same direction. Negative coordinates appear in Years 5 and beyond — reflections in the y-axis change the sign of the x-coordinate; reflections in the x-axis change the sign of the y-coordinate. Pupils should verify the shape is congruent to the original after any transformation.",
      "key_vocabulary": "reflection, mirror line, translation, transformation, coordinate, vertex, image, object, congruent, four quadrants, perpendicular distance",
      "common_misconceptions": "When reflecting in a non-axis line, pupils often count along the line rather than perpendicular to it. For reflection in the y-axis, pupils may change both coordinates rather than only the x-coordinate. Translations are confused with rotations. Pupils may change the size of the shape during transformation, not understanding that transformations preserve size and shape.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "MA-Y4-C001",
      "dependent_concept": "MA-Y5-C001",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "Year 4 place value in four-digit numbers is directly extended to six-digit numbers (up to 1,000,000) in Year 5 using the same columnar structure"
    },
    {
      "prerequisite_concept": "MA-Y4-C004",
      "dependent_concept": "MA-Y5-C002",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 4 rounding to the nearest 10, 100 and 1000 is extended to the nearest 10,000 and 100,000 in Year 5 using identical principles"
    },
    {
      "prerequisite_concept": "MA-Y4-C009",
      "dependent_concept": "MA-Y5-C003",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Year 4 factor pairs are the foundation for understanding prime numbers (those with only one factor pair: 1 and itself) in Year 5"
    },
    {
      "prerequisite_concept": "MA-Y4-C007",
      "dependent_concept": "MA-Y5-C004",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "All times tables to 12×12 (Year 4) provide the multiplication facts needed to recognise and generate square and cube numbers in Year 5"
    },
    {
      "prerequisite_concept": "MA-Y4-C009",
      "dependent_concept": "MA-Y5-C005",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Factor pairs (Year 4) are extended to common factors and HCF in Year 5; the systematic listing skills transfer directly"
    },
    {
      "prerequisite_concept": "MA-Y4-C008",
      "dependent_concept": "MA-Y5-C006",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "Short multiplication (2- and 3-digit × 1-digit, Year 4) is extended to long multiplication (up to 4-digit × 2-digit) in Year 5 by adding a second partial product"
    },
    {
      "prerequisite_concept": "MA-Y4-C007",
      "dependent_concept": "MA-Y5-C007",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Fluent recall of all multiplication/division facts to 12×12 is essential for efficient short division of four-digit numbers in Year 5"
    },
    {
      "prerequisite_concept": "MA-Y4-C011",
      "dependent_concept": "MA-Y5-C008",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Finding equivalent fractions (Year 4) is the core method for establishing a common denominator to add/subtract fractions with different denominators in Year 5"
    },
    {
      "prerequisite_concept": "MA-Y5-C005",
      "dependent_concept": "MA-Y5-C008",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.85,
      "rationale": "Finding the lowest common multiple of two denominators is the most efficient way to establish a common denominator for adding/subtracting fractions"
    },
    {
      "prerequisite_concept": "MA-Y4-C011",
      "dependent_concept": "MA-Y5-C009",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Equivalent fraction understanding from Year 4 is needed to convert between improper fractions and mixed numbers in Year 5"
    },
    {
      "prerequisite_concept": "MA-Y4-C010",
      "dependent_concept": "MA-Y5-C010",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Understanding hundredths (1/100 = 0.01) from Year 4 is the direct prerequisite for understanding percentages (per cent = per hundred) in Year 5"
    },
    {
      "prerequisite_concept": "MA-Y4-C016",
      "dependent_concept": "MA-Y5-C011",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 4 classification of angles as acute, right or obtuse prepares pupils for Year 5's formal measurement of all angles including reflex angles using a protractor"
    },
    {
      "prerequisite_concept": "MA-Y5-C011",
      "dependent_concept": "MA-Y5-C012",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.95,
      "rationale": "Measuring angles accurately with a protractor is prerequisite to applying angle facts to calculate unknown angles in geometric figures"
    },
    {
      "prerequisite_concept": "MA-Y4-C010",
      "dependent_concept": "MA-Y5-C013",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Understanding hundredths (two decimal places) from Year 4 is directly extended to thousandths (three decimal places) in Year 5"
    },
    {
      "prerequisite_concept": "MA-Y4-C013",
      "dependent_concept": "MA-Y5-C014",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Year 4 area of 2-D shapes (length × width) is extended to Year 5 volume of 3-D shapes (length × width × height) — both use the multiplication of dimensions"
    },
    {
      "prerequisite_concept": "MA-Y4-C015",
      "dependent_concept": "MA-Y5-C015",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 4 coordinates in the first quadrant and basic translations are extended in Year 5 to all four quadrants and to reflections in horizontal and vertical mirror lines"
    },
    {
      "prerequisite_concept": "MA-Y4-C003",
      "dependent_concept": "MA-Y5-C015",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.8,
      "rationale": "Negative numbers from Year 4 are needed for coordinates in the second, third and fourth quadrants used in reflections and translations in Year 5"
    }
  ]
}
