{
  "metadata": {
    "subject": "Mathematics",
    "key_stage": "KS2",
    "years_covered": [3],
    "document_reference": "DFE-00180-2013",
    "extraction_date": "2026-02-17",
    "structure_rating": 9
  },
  "domains": [
    {
      "domain_id": "MA-Y3-D001",
      "domain_name": "Number - Number and Place Value",
      "description": "Understanding place value in three-digit numbers (hundreds, tens, ones), counting in multiples of 4, 8, 50 and 100, comparing and ordering numbers to 1000, and reading/writing numbers in numerals and words.",
      "curriculum_context": "In lower key stage 2, the principal focus of mathematics teaching is to ensure that pupils become increasingly fluent with whole numbers and the four operations, including number facts and the concept of place value. In Year 3, pupils extend their understanding of the number system from two-digit numbers (explored in KS1) to three-digit numbers, developing secure knowledge of the hundreds, tens and ones structure. The non-statutory guidance emphasises that pupils should use a variety of representations including the number line to practise counting in fours, eights, fifties and hundreds, and should connect their new knowledge of the number system to measurement — for example, linking counting in 50s to amounts on a scale. Pupils who understand place value in three-digit numbers are equipped to undertake the mental and written arithmetic that is central to the rest of Year 3 mathematics, and this domain forms the essential prerequisite for the four-digit work of Year 4.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical"
    },
    {
      "domain_id": "MA-Y3-D002",
      "domain_name": "Number - Addition and Subtraction",
      "description": "Mental and written addition and subtraction with three-digit numbers, formal columnar methods, estimation, and using inverse operations to check answers.",
      "curriculum_context": "In Year 3, pupils are introduced to formal written methods of columnar addition and subtraction for the first time, building on the expanded methods practised in Year 2. The non-statutory guidance specifies that pupils practise solving varied addition and subtraction questions, and should be introduced to the formal written methods of columnar addition and subtraction — including where carrying (addition) and decomposition (subtraction) are required. Pupils continue to develop their mental arithmetic alongside written methods, ensuring they have the flexibility to choose the most efficient approach for a given calculation. Estimation before calculating and checking using the inverse operation are statutory requirements that build pupils' number sense and self-monitoring, preparing them for the multi-step problems and larger numbers encountered in Years 4 to 6.",
      "is_cross_cutting": false,
      "structure_type": "sequential"
    },
    {
      "domain_id": "MA-Y3-D003",
      "domain_name": "Number - Multiplication and Division",
      "description": "Multiplication and division facts for the 3, 4 and 8 times tables, written and mental methods including two-digit by one-digit, scaling and correspondence problems.",
      "curriculum_context": "In Year 3, pupils build on their knowledge of the 2, 5 and 10 times tables from KS1 to learn the 3, 4 and 8 multiplication tables. The non-statutory guidance highlights that pupils should practise mental methods and should begin progressing to formal written methods, understanding that multiplication is commutative but division is not. Pupils develop fluency in the 3, 4 and 8 tables and understand the connections between them — notably that 4 is the double of 2, and 8 is the double of 4 — which supports efficient recall. The introduction of two-digit by one-digit multiplication through both mental and early formal methods prepares pupils for the long and short multiplication of Year 4 and beyond, while scaling and correspondence problems develop proportional reasoning that is foundational for ratio and proportion in Year 6.",
      "is_cross_cutting": false,
      "structure_type": "sequential"
    },
    {
      "domain_id": "MA-Y3-D004",
      "domain_name": "Number - Fractions",
      "description": "Understanding tenths, unit and non-unit fractions with small denominators, equivalent fractions, adding and subtracting fractions with the same denominator, and comparing and ordering fractions.",
      "curriculum_context": "Year 3 is the point at which pupils extend their understanding of fractions significantly beyond the simple halves and quarters of KS1, encountering a wider range of unit and non-unit fractions and the fundamental concept of equivalent fractions. The non-statutory guidance explains that pupils should count up and down in tenths on a number line and connect tenths to place value — understanding that one-tenth is the same as dividing by 10 — which lays essential groundwork for decimal notation in Year 4. Pupils learn to add and subtract fractions with the same denominator and to compare and order fractions, developing the understanding that fractions are numbers that can be placed on a number line. This domain provides the conceptual foundations for the substantially more complex fraction and decimal work of Years 4, 5 and 6, and its careful development is essential for future algebraic and proportional reasoning.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical"
    },
    {
      "domain_id": "MA-Y3-D005",
      "domain_name": "Measurement",
      "description": "Measuring and comparing lengths, mass and volume/capacity using mixed units, measuring perimeter of 2-D shapes, money calculations, and telling time using Roman numerals, analogue clocks and 12/24-hour notation.",
      "curriculum_context": "In Year 3, the measurement domain significantly extends KS1 knowledge by introducing millimetres, mixed units (e.g. 1 m and 50 cm), simple metric equivalents, and calculating the perimeter of 2-D shapes for the first time. The non-statutory guidance indicates that pupils continue to measure using a range of instruments, read scales with increasing accuracy in a range of contexts, and that they should be able to carry out additions and subtractions with measurements in the same units. Money work progresses to include formal £ and p notation and giving change, while time is extended to Roman numerals on clock faces, 12- and 24-hour clocks, and reading the time to the nearest minute. These practical measurement skills reinforce pupils' number understanding in applied contexts and connect directly to the formal calculation methods being developed in the number domains.",
      "is_cross_cutting": true,
      "structure_type": "mixed"
    },
    {
      "domain_id": "MA-Y3-D006",
      "domain_name": "Geometry - Properties of Shapes",
      "description": "Drawing 2-D shapes and making 3-D shapes, recognising angles as properties of shapes and turns, identifying right angles, acute and obtuse angles, and horizontal, vertical, perpendicular and parallel lines.",
      "curriculum_context": "In Year 3, geometry moves beyond recognition of shapes to drawing, constructing and analysing them. Pupils learn to draw 2-D shapes with given dimensions and to make 3-D shapes using modelling materials, developing spatial reasoning and fine motor skills. A major new development is the formal introduction of angles: pupils learn that an angle is both a property of a shape (the corner of a rectangle is a right angle) and a description of a turn (a quarter turn makes a right angle). The statutory requirements that pupils identify whether angles are greater or less than a right angle (obtuse and acute) and recognise horizontal, vertical, perpendicular and parallel lines add important geometric vocabulary and conceptual understanding that supports area calculations in Year 4, angles in Year 5 and the complete analysis of shapes throughout upper KS2.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical"
    },
    {
      "domain_id": "MA-Y3-D007",
      "domain_name": "Statistics",
      "description": "Interpreting and presenting data using bar charts, pictograms and tables, and solving one-step and two-step questions from data including 'how many more?' and 'how many fewer?'.",
      "curriculum_context": "In Year 3, the statistics curriculum builds on the KS1 work of recording, interpreting and comparing simple data by requiring pupils to interpret and present data using scaled bar charts and pictograms, where each unit represents more than one item. The non-statutory guidance clarifies that pupils should ask and answer questions, including two-step questions, using information presented in bar charts, pictograms and tables. Solving questions such as 'How many more?' and 'How many fewer?' requires pupils to perform subtraction calculations on data values, connecting statistics directly to the calculation domains. This increasingly sophisticated engagement with data prepares pupils for the more complex graphical work with line graphs and pie charts encountered in Years 4 and 5.",
      "is_cross_cutting": true,
      "structure_type": "sequential"
    }
  ],
  "objectives": [
    {
      "objective_id": "MA-Y3-O001",
      "domain_id": "MA-Y3-D001",
      "objective_text": "count from 0 in multiples of 4, 8, 50 and 100; find 10 or 100 more or less than a given number",
      "non_statutory_guidance": "Pupils practise counting using multiples of different lengths. They practise mentally adding and subtracting multiples of 10 and 100. They use larger numbers to at least 1000, applying partitioning related to place value using varied and increasingly complex problems, building on work in year 2.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O002",
      "domain_id": "MA-Y3-D001",
      "objective_text": "recognise the place value of each digit in a three-digit number (hundreds, tens, ones)",
      "non_statutory_guidance": "Pupils practise counting using multiples of different lengths. They use larger numbers to at least 1000, applying partitioning related to place value using varied and increasingly complex problems, building on work in year 2.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O003",
      "domain_id": "MA-Y3-D001",
      "objective_text": "compare and order numbers up to 1000",
      "non_statutory_guidance": "Pupils practise counting using multiples of different lengths. They use larger numbers to at least 1000, applying partitioning related to place value using varied and increasingly complex problems, building on work in year 2.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O004",
      "domain_id": "MA-Y3-D001",
      "objective_text": "identify, represent and estimate numbers using different representations",
      "non_statutory_guidance": "Pupils use a variety of representations including the number line. They connect their new knowledge with the number system to counting in fours, eights, fifties and hundreds to amounts on a scale.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O005",
      "domain_id": "MA-Y3-D001",
      "objective_text": "read and write numbers up to 1000 in numerals and in words",
      "non_statutory_guidance": "Pupils practise counting using multiples of different lengths. They use larger numbers to at least 1000, applying partitioning related to place value.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O006",
      "domain_id": "MA-Y3-D001",
      "objective_text": "solve number problems and practical problems involving these ideas",
      "non_statutory_guidance": "Pupils use larger numbers to at least 1000, applying partitioning related to place value using varied and increasingly complex problems.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O007",
      "domain_id": "MA-Y3-D002",
      "objective_text": "add and subtract numbers mentally, including: a three-digit number and ones; a three-digit number and tens; a three-digit number and hundreds",
      "non_statutory_guidance": "Pupils practise solving varied addition and subtraction questions. For mental calculations with two-digit numbers, the answers could exceed 100. Pupils use and understand the language of measures.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O008",
      "domain_id": "MA-Y3-D002",
      "objective_text": "add and subtract numbers with up to three digits, using formal written methods of columnar addition and subtraction",
      "non_statutory_guidance": "Pupils are introduced to the formal written methods of columnar addition and subtraction. Pupils practise solving varied addition and subtraction questions. For mental calculations with two-digit numbers, the answers could exceed 100.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O009",
      "domain_id": "MA-Y3-D002",
      "objective_text": "estimate the answer to a calculation and use inverse operations to check answers",
      "non_statutory_guidance": "Pupils practise solving varied addition and subtraction questions. They use and understand the language of measures. Pupils use estimation to check their answers are of the correct magnitude.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O010",
      "domain_id": "MA-Y3-D002",
      "objective_text": "solve problems, including missing number problems, using number facts, place value, and more complex addition and subtraction",
      "non_statutory_guidance": "Pupils practise solving varied addition and subtraction questions including problems in context and missing number problems. They use and understand the language of measures.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O011",
      "domain_id": "MA-Y3-D003",
      "objective_text": "recall and use multiplication and division facts for the 3, 4 and 8 multiplication tables",
      "non_statutory_guidance": "Pupils continue to practise their mental recall of multiplication tables when they are calculating mathematical statements in order to improve fluency. Through doubling, they connect the 2, 4 and 8 multiplication tables.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O012",
      "domain_id": "MA-Y3-D003",
      "objective_text": "write and calculate mathematical statements for multiplication and division using the multiplication tables that they know, including for two-digit numbers times one-digit numbers, using mental and progressing to formal written methods",
      "non_statutory_guidance": "Pupils practise mental methods and extend this to three-digit numbers to derive facts, for example 200 × 3 = 600 into 600 ÷ 3 = 200, to manipulate large numbers for calculation. They also practise and extend their ability to write statements about the equality of expressions (for example, use the distributive law 39 × 7 = 30 × 7 + 9 × 7 and associative law (2 × 3) × 4 = 2 × (3 × 4)).",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O013",
      "domain_id": "MA-Y3-D003",
      "objective_text": "solve problems, including missing number problems, involving multiplication and division, including positive integer scaling problems and correspondence problems in which n objects are connected to m objects",
      "non_statutory_guidance": "Pupils develop efficient mental methods, for example, using commutativity and associativity (for example, 4 × 12 × 5 = 4 × 5 × 12 = 20 × 12 = 240) and multiplication and division facts (for example, using 3 × 2 = 6, 6 ÷ 3 = 2 and 2 = 6 ÷ 3) to derive related facts (for example, 30 × 2 = 60, 60 ÷ 3 = 20 and 20 = 60 ÷ 3).",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O014",
      "domain_id": "MA-Y3-D004",
      "objective_text": "count up and down in tenths; recognise that tenths arise from dividing an object into 10 equal parts and in dividing one-digit numbers or quantities by 10",
      "non_statutory_guidance": "Pupils connect tenths to place value, decimal measures and to division by 10. They connect unit and non-unit fractions to division. Pupils should be encouraged to understand and use unit fractions, non-unit fractions and fractions as a division.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O015",
      "domain_id": "MA-Y3-D004",
      "objective_text": "recognise, find and write fractions of a discrete set of objects: unit fractions and non-unit fractions with small denominators",
      "non_statutory_guidance": "Pupils connect unit and non-unit fractions to division. They should be encouraged to understand and use unit fractions, non-unit fractions and fractions as a division. Pupils should also be encouraged to use the fraction notation.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O016",
      "domain_id": "MA-Y3-D004",
      "objective_text": "recognise and use fractions as numbers: unit fractions and non-unit fractions with small denominators",
      "non_statutory_guidance": "Pupils connect unit and non-unit fractions to the number line. They should be encouraged to understand and use unit fractions, non-unit fractions and fractions as a division. Pupils should be encouraged to use the fraction notation.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O017",
      "domain_id": "MA-Y3-D004",
      "objective_text": "recognise and show, using diagrams, equivalent fractions with small denominators",
      "non_statutory_guidance": "Pupils connect unit and non-unit fractions to division. They should be encouraged to understand and use unit fractions, non-unit fractions and fractions as a division.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O018",
      "domain_id": "MA-Y3-D004",
      "objective_text": "add and subtract fractions with the same denominator within one whole [for example, 5/7 + 1/7 = 6/7]",
      "non_statutory_guidance": "Pupils connect unit and non-unit fractions to division. They should be encouraged to understand and use unit fractions, non-unit fractions and fractions as a division.",
      "examples": "5/7 + 1/7 = 6/7",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O019",
      "domain_id": "MA-Y3-D004",
      "objective_text": "compare and order unit fractions, and fractions with the same denominators",
      "non_statutory_guidance": "Pupils connect unit and non-unit fractions to division. They should be encouraged to understand and use unit fractions, non-unit fractions and fractions as a division.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O020",
      "domain_id": "MA-Y3-D004",
      "objective_text": "solve problems that involve all of the above",
      "non_statutory_guidance": "Pupils connect unit and non-unit fractions to division. They solve problems involving fractions in a range of contexts.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O021",
      "domain_id": "MA-Y3-D005",
      "objective_text": "measure, compare, add and subtract: lengths (m/cm/mm); mass (kg/g); volume/capacity (l/ml)",
      "non_statutory_guidance": "Pupils continue to measure using the appropriate tools and units, progressing to using a wider range of measures, including comparing and using mixed units and simple equivalents of mixed units. They continue to use and understand the language of measures.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O022",
      "domain_id": "MA-Y3-D005",
      "objective_text": "measure the perimeter of simple 2-D shapes",
      "non_statutory_guidance": "Pupils continue to measure using the appropriate tools and units. They should understand the difference between perimeter and area, measuring the perimeter of simple 2-D shapes.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O023",
      "domain_id": "MA-Y3-D005",
      "objective_text": "add and subtract amounts of money to give change, using both £ and p in practical contexts",
      "non_statutory_guidance": "Pupils continue to use and understand the language of money. They understand and use £ and p notation and solve practical problems involving the addition and subtraction of money.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O024",
      "domain_id": "MA-Y3-D005",
      "objective_text": "tell and write the time from an analogue clock, including using Roman numerals from I to XII, and 12-hour and 24-hour clocks",
      "non_statutory_guidance": "Pupils use both analogue and digital 12- and 24-hour clocks and record their times. In particular, they should use number lines and bar models to solve problems involving time.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O025",
      "domain_id": "MA-Y3-D005",
      "objective_text": "estimate and read time with increasing accuracy to the nearest minute; record and compare time in terms of seconds, minutes and hours; use vocabulary such as o'clock, a.m./p.m., morning, afternoon, noon and midnight",
      "non_statutory_guidance": "Pupils use both analogue and digital 12- and 24-hour clocks and record their times. In particular, they should use number lines and bar models to solve problems involving time. They compare intervals of time to calculate the time taken by particular events.",
      "examples": "o'clock, a.m./p.m., morning, afternoon, noon and midnight",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O026",
      "domain_id": "MA-Y3-D005",
      "objective_text": "know the number of seconds in a minute and the number of days in each month, year and leap year",
      "non_statutory_guidance": "Pupils use both analogue and digital 12- and 24-hour clocks and record their times. They know the number of seconds in a minute and the number of days in each month, year and leap year.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O027",
      "domain_id": "MA-Y3-D005",
      "objective_text": "compare durations of events [for example to calculate the time taken by particular events or tasks]",
      "non_statutory_guidance": "Pupils compare intervals of time, for example to calculate the time taken by particular events or tasks.",
      "examples": "to calculate the time taken by particular events or tasks",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O028",
      "domain_id": "MA-Y3-D006",
      "objective_text": "draw 2-D shapes and make 3-D shapes using modelling materials; recognise 3-D shapes in different orientations and describe them",
      "non_statutory_guidance": "Pupils' understanding of the properties of shapes is extended at this stage. Pupils extend and apply their understanding of symmetrical and non-symmetrical polygons and polyhedra. They draw and make shapes to fit specific criteria.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O029",
      "domain_id": "MA-Y3-D006",
      "objective_text": "recognise angles as a property of shape or a description of a turn",
      "non_statutory_guidance": "Pupils learn to use a set-square and ruler to draw shapes with right angles and to use a protractor (ruler) to measure and draw angles to the nearest degree. They connect angles as a turn to angles as a measure of the space between two lines.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O030",
      "domain_id": "MA-Y3-D006",
      "objective_text": "identify right angles, recognise that two right angles make a half-turn, three make three quarters of a turn and four a complete turn; identify whether angles are greater than or less than a right angle",
      "non_statutory_guidance": "Pupils learn that angles are measured in degrees: there are 360° in a full turn, 180° in a half turn and 90° in a quarter turn. Pupils connect angles as a turn to angles as a measure of the space between two lines.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O031",
      "domain_id": "MA-Y3-D006",
      "objective_text": "identify horizontal and vertical lines and pairs of perpendicular and parallel lines",
      "non_statutory_guidance": "Pupils use the correct terminology for horizontal and vertical lines and recognise perpendicular and parallel lines in the environment and in shapes. They use geometric properties of shapes.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O032",
      "domain_id": "MA-Y3-D007",
      "objective_text": "interpret and present data using bar charts, pictograms and tables",
      "non_statutory_guidance": "Pupils understand and use a greater range of scales in their representations. Pupils should be encouraged to use their knowledge of adding and subtracting fractions to interpret and construct simple line graphs and to use a wider range of graphs and charts.",
      "examples": "",
      "is_statutory": true
    },
    {
      "objective_id": "MA-Y3-O033",
      "domain_id": "MA-Y3-D007",
      "objective_text": "solve one-step and two-step questions [for example, 'How many more?' and 'How many fewer?'] using information presented in scaled bar charts and pictograms and tables",
      "non_statutory_guidance": "Pupils understand and use a greater range of scales in their representations. They understand that questions about data require them to use their calculation knowledge to extract information from representations.",
      "examples": "'How many more?' and 'How many fewer?'",
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "MA-Y3-C001",
      "concept_name": "Counting in multiples of 4",
      "description": "Counting in multiples of 4 (4, 8, 12, 16, 20...) builds on counting in twos from KS1 and prepares pupils for the 4 times table. Pupils must be able to count forwards and backwards in fours from any multiple of four, not just from zero. Mastery means a pupil can continue or start a count in fours from any given multiple without needing to recite the sequence from the beginning, and can connect counting in fours to the doubling relationship with twos.",
      "teaching_guidance": "Begin with concrete groups of 4 objects (four counting bears, four cubes) physically grouped and counted. Use a number line or hundred square with multiples of 4 highlighted to provide a pictorial representation. Connect explicitly to the 2 times table: 'double 2 is 4, so counting in fours is like counting in twos twice.' Practise from different starting points (not always from zero) and in both directions. Use chanting and rhythmic counting, but ensure pupils can also respond to 'what comes after 28?' without reciting from the start.",
      "key_vocabulary": "multiple, count in fours, four times table, skip count, sequence, pattern",
      "common_misconceptions": "Pupils often count in fours confidently starting from zero but stumble when asked to continue from a mid-sequence multiple (e.g. 'keep counting from 20'). Some pupils confuse multiples of 4 with multiples of 2 and say 2, 4, 6 when asked to count in fours. When counting backwards in fours, pupils frequently revert to counting back in ones.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C002",
      "concept_name": "Counting in multiples of 8",
      "description": "Counting in multiples of 8 (8, 16, 24, 32...) is the most challenging skip-counting sequence introduced in Year 3 and is directly connected to the 8 times table. Pupils must be able to count forwards and backwards in eights from any multiple. Mastery means a pupil can recite the sequence fluently, continue it from any starting multiple, and understand the doubling relationship linking the 4 and 8 times tables.",
      "teaching_guidance": "Use the doubling connection: first consolidate counting in fours, then demonstrate that each multiple of 8 is double the corresponding multiple of 4 (4 → 8, 8 → 16, 12 → 24). A number line showing multiples of 4 with the multiples of 8 highlighted makes this relationship visual. Repeated doubling (starting from 1: 1, 2, 4, 8, 16, 32, 64...) is a powerful pattern to explore. Use contexts where 8 is natural: spiders' legs, octopus arms, 8-shaped athletics tracks.",
      "key_vocabulary": "multiple, count in eights, eight times table, skip count, doubling, sequence",
      "common_misconceptions": "Counting in eights is hard because the multiples (8, 16, 24, 32, 40, 48, 56, 64, 72, 80...) do not have as obvious a visual pattern on a hundred square as multiples of 5 or 10. Pupils frequently lose their place in the sequence and resort to counting in ones. The transition from 32 to 40 and from 72 to 80 are particularly error-prone.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C003",
      "concept_name": "Counting in multiples of 50",
      "description": "Counting in multiples of 50 (50, 100, 150, 200...) connects to the 5 times table and understanding of amounts on scales and in money. Pupils must count forwards and backwards in 50s beyond 1000 if needed. Mastery means a pupil can count fluently in 50s from different starting points and connect this to reading scale marks on measurement instruments showing 50ml, 50g, 50cm etc.",
      "teaching_guidance": "Connect to the 5 times table: 5 × 10 = 50, so each multiple of 50 is a multiple of 5 scaled by 10. Use a number line marked in 50s. Connect to money (50p coins, £1 = two 50p coins) and measurement contexts (a weighing scale with 50g gradations). Show that counting in 50s is like counting in 5s but with an extra zero on the end of each number. Practise in both directions: 200, 150, 100, 50, 0.",
      "key_vocabulary": "fifty, multiple, count in fifties, sequence, scale",
      "common_misconceptions": "Pupils sometimes say 50, 100, 150, 200, 250, 310 (adding only 10 at some points). The transition across hundreds boundaries (e.g. 350, 400) occasionally causes pupils to add only 50 to the tens digit rather than to the whole number.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C004",
      "concept_name": "Counting in multiples of 100",
      "description": "Counting in multiples of 100 (100, 200, 300...) reinforces the structure of the number system and the hundreds place in place value. Pupils must count fluently forwards and backwards in hundreds up to at least 1000. Mastery means a pupil can count in hundreds without hesitation, identify any given multiple of 100 on a number line, and connect this to the hundreds digit in three-digit numbers.",
      "teaching_guidance": "Connect to the understanding of hundreds as a unit. Use a number line from 0 to 1000 marked in hundreds. Use Dienes/base-ten blocks: each flat (hundred block) represents one 100. Count the blocks as they are added or removed. Connect to knowledge of the 10 times table: 10 × 10 = 100, so multiples of 100 are multiples of the 10 times table scaled by 10.",
      "key_vocabulary": "hundred, multiple of 100, three-digit number, place value, number line",
      "common_misconceptions": "Most pupils count in hundreds easily from zero, but may struggle to count backward (1000, 900, 800...) particularly across the 0 boundary. Some pupils believe you cannot count below zero in hundreds, not knowing about negative numbers. When asked for 100 more than 950, some pupils say 1050 incorrectly (adding an extra zero) rather than 1050 correctly.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C005",
      "concept_name": "Finding 10 more and 10 less",
      "description": "Finding 10 more or 10 less than any given three-digit number requires understanding that only the tens digit changes (e.g. 246 + 10 = 256). This extends the KS1 skill of finding 10 more/less with two-digit numbers to the three-digit range. Mastery means a pupil can instantly identify 10 more/less than any three-digit number, including those where the tens digit reaches 0 or 9 (requiring the hundreds digit to change).",
      "teaching_guidance": "Use a 0-1000 number line with clear decade markings. Dienes blocks are powerful: adding a ten-stick shows the change physically. A hundred square extended to show three-digit numbers helps pupils see the pattern. Focus on the boundary cases: 10 more than 190 is 200 (the tens digit overflows into the hundreds); 10 less than 200 is 190 (borrowing from the hundreds). Practise with rapid-fire questions.",
      "key_vocabulary": "ten more, ten less, tens digit, hundreds digit, increase, decrease, partition",
      "common_misconceptions": "When the tens digit is 9, pupils often say 10 more than 196 is 1096 (adding a 1 in front) or 196 + 10 = 1,106. When the tens digit is 0, pupils may say 10 less than 300 is 390 rather than 290. These boundary errors reveal incomplete understanding of how carrying and borrowing work with hundreds.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C006",
      "concept_name": "Finding 100 more and 100 less",
      "description": "Finding 100 more or 100 less than any three-digit number requires understanding that only the hundreds digit changes (e.g. 346 + 100 = 446). This extends directly from finding 10 more/less by one column of place value. Mastery means a pupil can instantly identify 100 more or 100 less, including at boundaries such as 100 more than 900 = 1000.",
      "teaching_guidance": "Use Dienes blocks: adding a hundreds flat to a three-digit number shows the change physically. Connect to the hundred square pattern (one row down = 10 more; one full square = 100 more conceptually). Emphasise that the tens and ones digits do not change. Target the boundary: 100 more than 900 crosses into four digits (1000), which is an exciting moment to discuss. Practise in both directions.",
      "key_vocabulary": "hundred more, hundred less, hundreds digit, partition, place value, boundary",
      "common_misconceptions": "Pupils often change the wrong digit: for 100 more than 324, some say 424 (correct) but others say 334 (changed tens) or 325 (changed ones). The boundary case of 100 more than 900 = 1000 can confuse pupils who think four-digit numbers do not exist yet.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C007",
      "concept_name": "Place value in three-digit numbers",
      "description": "Understanding that each digit in a three-digit number has a specific value determined by its position — hundreds, tens or ones — is the core of place value for Year 3. For example, in 347, the 3 represents 300, the 4 represents 40 and the 7 represents 7. Mastery means pupils can identify the value of any digit in a three-digit number, partition the number in standard form (347 = 300 + 40 + 7), and use this understanding to support all calculation strategies.",
      "teaching_guidance": "Use base-ten (Dienes) blocks as the primary concrete resource: hundreds flats, tens sticks and ones cubes model each place value position physically. Place value mats with columns for H, T and O support structured partitioning. Arrow cards (separate cards for 300, 40, 7 that slot together to form 347) show how digits combine and separate. Progress to place value charts and then to abstract representation. Always connect to the spoken number name.",
      "key_vocabulary": "hundreds, tens, ones, units, place value, digit, three-digit number, partition, value, represent",
      "common_misconceptions": "Pupils frequently confuse the digit with its value — saying the digit 3 in 347 'is worth 3' rather than 300. Pupils with insecure understanding may add the digits (3 + 4 + 7 = 14) rather than partitioning them. Zero as a place holder causes particular difficulty: in 307, the zero means 'no tens', but pupils often omit it when writing the number or misread it as 37.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C008",
      "concept_name": "Partitioning three-digit numbers",
      "description": "Partitioning is the process of splitting a number into its component parts according to place value (e.g. 347 = 300 + 40 + 7). In Year 3, pupils extend this from two-digit to three-digit numbers and also practise flexible (non-standard) partitioning (e.g. 347 = 300 + 47 or 270 + 77). Mastery means pupils can partition any three-digit number in multiple ways and use partitioning as a mental calculation strategy.",
      "teaching_guidance": "Arrow cards and Dienes blocks remain the most powerful tools. After establishing standard partitioning, introduce flexible partitioning through practical problems: if I have 3 hundreds and 14 tens, what number is that? Discuss: 3 hundreds and 14 tens = 3 hundreds + 1 hundred + 4 tens = 4 hundreds + 4 tens = 440. Flexible partitioning is directly needed for mental addition and subtraction strategies, so teaching it in that context makes the purpose clear.",
      "key_vocabulary": "partition, split, hundreds, tens, ones, standard, flexible, parts, whole, compose, decompose",
      "common_misconceptions": "Pupils can usually do standard partitioning but struggle with flexible partitioning (e.g. they cannot see that 347 = 300 + 47 = 250 + 97). They may also partition in writing but not connect it to mental arithmetic strategies. Some pupils think each partition is a different number rather than different ways of expressing the same number.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C009",
      "concept_name": "Comparing and ordering numbers to 1000",
      "description": "Comparing numbers to 1000 involves using the language and symbols of inequality (greater than >, less than <, equal to =) to express the relationship between pairs of numbers. Ordering extends this to arranging multiple numbers in ascending or descending sequence. Mastery means pupils can compare any two three-digit numbers and explain their reasoning using place value, and can order sets of up to six numbers to 1000.",
      "teaching_guidance": "Use a number line from 0 to 1000 as the primary visual tool — the relative positions of numbers on the line make their order evident. Teach pupils to compare hundreds digits first, then tens, then ones — a systematic strategy. Use symbols > and < with the 'hungry crocodile always eats the bigger number' mnemonic if helpful, but ensure understanding precedes the symbol. Present numbers in random order and ask pupils to arrange them, explaining their reasoning aloud.",
      "key_vocabulary": "greater than, less than, equal to, compare, order, ascending, descending, sequence, symbol, >, <, =",
      "common_misconceptions": "Pupils sometimes compare by number of digits only (correctly seeing 999 > 100) but then fail when all numbers have the same number of digits (comparing 456 and 465). They may compare the first digits correctly then stop, not realising they need to move to the next column when the hundreds are equal. The symbols > and < are frequently confused with each other.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C010",
      "concept_name": "Estimating numbers to 1000",
      "description": "Estimation of numbers involves making a sensible approximation of a quantity or position based on available information, without precise counting. In Year 3, this includes estimating where a number appears on a partly-labelled number line and estimating quantities shown in images. Mastery means a pupil can give a reasonable estimate with appropriate reasoning (e.g. 'It's about halfway between 400 and 500, so I estimate 450') and understands that an estimate is not a guess.",
      "teaching_guidance": "Use partially labelled number lines (e.g. marked only at 0 and 1000, or at 0, 500 and 1000) and ask pupils to place numbers on them or identify values at marked positions. Compare estimation skills with measurement contexts — estimation is used before measuring to check for reasonableness. Discuss what makes a good estimate and how to improve the process (using benchmarks like halfway points). Connect to rounding in Year 4: estimation to the nearest 100 or 10 is the precursor.",
      "key_vocabulary": "estimate, approximately, about, roughly, nearly, reasonable, benchmark, halfway, number line",
      "common_misconceptions": "Pupils confuse estimation with guessing (no reasoning involved) or with an exact answer (too precise). They may estimate numbers on a 0-1000 number line without using known benchmarks (e.g. not using the midpoint 500 as an anchor). Some pupils are reluctant to estimate because they feel they might be wrong, not understanding that a reasonable estimate is always acceptable.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true
    },
    {
      "concept_id": "MA-Y3-C011",
      "concept_name": "Reading and writing numbers to 1000 in words",
      "description": "Pupils must be able to read and write in words any number up to 1000, including those with zero in a place value position (e.g. three hundred and seven, four hundred and fifty). Mastery means a pupil can convert fluently between numeral and word forms in both directions without errors, applying appropriate hyphenation and the word 'and' correctly.",
      "teaching_guidance": "Build systematically from hundreds: 'three hundred', then 'three hundred and forty', then 'three hundred and forty-seven'. Teach the rule that 'and' appears between hundreds and the rest (British English convention). Highlight hyphenation for compound tens (twenty-one, forty-seven). Special attention to 'eleven' through 'nineteen' as these are irregular. Post a reference chart of ones and teens words. Zero in the tens place requires 'and [ones]' (three hundred and seven, not three hundred and zero seven).",
      "key_vocabulary": "hundred, thousand, and, hyphen, numeral, word form, spell, write, read",
      "common_misconceptions": "Pupils frequently omit 'and' (writing 'three hundred forty-seven' rather than 'three hundred and forty-seven'). They may write the number of hundreds as a single digit prefix ('3 hundred forty-seven'). Numbers with zero in the tens column cause particular confusion: some write 'three hundred zero seven' or omit the zero entirely and write 'three hundred seven' which is ambiguous.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C012",
      "concept_name": "Mental addition with three-digit numbers",
      "description": "Mental addition in Year 3 includes adding a three-digit number and ones, a three-digit number and tens, or a three-digit number and hundreds, without using formal written methods. This extends the KS1 mental strategies to a larger range of numbers. Mastery means pupils can perform these mental calculations with confidence, choosing between partitioning, counting on, and known facts as the most efficient strategy for each problem.",
      "teaching_guidance": "Teach partitioning the smaller number: to add 247 + 30, think '247 + 30 = 247 + 30 = 277' (adding to the tens column only). Sequence instruction: ones first (no carrying difficulties), then tens (possible carrying into hundreds), then hundreds (the least complex as it affects only the hundreds digit). Number lines and hundred squares remain useful pictorial supports. Emphasise choosing the most efficient strategy: 356 + 400 is more efficient as adding hundreds mentally than using a written method.",
      "key_vocabulary": "add, mental arithmetic, strategy, partition, count on, ones, tens, hundreds, carrying, sum, total",
      "common_misconceptions": "When adding ones to a three-digit number, pupils sometimes forget to carry into the tens: 347 + 6 becomes 3413 (concatenating digits) rather than 353. When adding tens, some pupils also change the ones digit. The most common error is 'adding the wrong column': pupils add 30 to the hundreds digit rather than the tens.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C013",
      "concept_name": "Mental subtraction with three-digit numbers",
      "description": "Mental subtraction in Year 3 parallels the addition work, covering subtracting ones, tens or hundreds from a three-digit number. This includes bridging cases (e.g. 352 – 7 requires borrowing from the tens). Mastery means pupils can perform mental subtraction efficiently and choose appropriately between counting back, partitioning and complementary addition strategies.",
      "teaching_guidance": "Use number lines (counting back or counting up as complementary addition) as a concrete/pictorial bridge. Teach pupils to check whether subtraction crosses a tens or hundreds boundary and adjust strategy accordingly. Complementary addition ('counting on from the smaller to the larger') is particularly effective when the two numbers are close. Connect to inverse operations: use addition to check subtraction answers.",
      "key_vocabulary": "subtract, take away, difference, counting back, count on, bridge, borrow, exchange, ones, tens, hundreds",
      "common_misconceptions": "Pupils often subtract the smaller digit from the larger regardless of position — computing 352 – 7 as 355 (taking 5 from 7 gives 2, putting 2 in the ones place) which is incorrect. This 'smaller from larger' error also appears in written methods. Pupils may also forget that subtracting a ten from a number ending in zero requires borrowing (300 – 40 = 260, not 360).",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C014",
      "concept_name": "Formal columnar addition",
      "description": "Columnar addition is the formal written method for adding numbers of multiple digits, working right to left through the ones, tens and hundreds columns, carrying any value of 10 or more into the next column. In Year 3, this is introduced for numbers with up to three digits. Mastery means pupils can correctly set out a column addition, carry accurately between columns, and produce a correct answer for any three-digit addition.",
      "teaching_guidance": "Build from the expanded method (see Year 2) to the compact method. The CPA progression: first use Dienes blocks physically regrouping 10 ones into 1 ten and placing it in the tens column; then draw these exchanges pictorially; then record the compact method. Emphasise correct alignment — use squared paper or printed grids initially. Teach carrying explicitly: the small digit written above the next column represents the value carried. Model 'hundreds + hundreds, tens + tens, ones + ones, then deal with carries'.",
      "key_vocabulary": "column, addition, carry, exchange, regroup, hundreds, tens, ones, digit, align, place value",
      "common_misconceptions": "The most common error is forgetting to add the carried digit. Pupils also frequently misalign columns when numbers have different numbers of digits. Some pupils add all digits as if they had equal value (treating 247 + 135 as 2+1=3, 4+3=7, 7+5=12 giving 3712 rather than setting up columns properly). Zero as a placeholder causes alignment errors.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C015",
      "concept_name": "Formal columnar subtraction",
      "description": "Columnar subtraction is the formal written method for subtracting numbers, working right to left and exchanging (borrowing) from the next column when needed. In Year 3, this is introduced for three-digit subtraction. Mastery means pupils can correctly exchange between columns, complete any three-digit subtraction using the formal method, and check their answer using addition.",
      "teaching_guidance": "Begin with Dienes blocks: when there are not enough ones to subtract, exchange a tens rod for 10 ones cubes — physically model the exchange. Draw this pictorially. Then show how the exchange is recorded in the compact method (crossing out a digit and increasing the value in the ones column). Emphasise the systematic right-to-left approach. Practise 'zero as top digit' cases (300 – 47) which require multiple exchanges.",
      "key_vocabulary": "column, subtraction, exchange, borrow, regroup, hundreds, tens, ones, digit, align",
      "common_misconceptions": "Pupils frequently subtract the smaller digit from the larger regardless of its position (252 – 7: subtracting 2 from 7 gives 5, resulting in 255 instead of 245). They often forget to reduce the column they borrowed from by 1. Cases with zeros in the top number (300 – 47) are particularly challenging as they require cascading exchanges (300 = 29 tens and 10 ones = 2 hundreds, 9 tens, 10 ones).",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C016",
      "concept_name": "Estimation and inverse operations in calculation",
      "description": "Estimation before calculation gives a benchmark against which to check the answer (if 350 + 270 ≈ 600, an answer of 62 is clearly wrong). Using the inverse operation to check (doing the reverse calculation to verify) completes the checking cycle. Mastery means pupils routinely estimate before calculating and check using the inverse, and can identify when an answer is unreasonable.",
      "teaching_guidance": "Build estimation as a habit before every calculation: 'Round each number to the nearest hundred, add them, and write down your estimate.' After calculating, compare the exact answer to the estimate and judge reasonableness. For inverse checking: after computing 352 + 178 = 530, check by doing 530 – 178 = 352. Connect estimation to rounding, which is formalised in Year 4. Discuss why checking matters in real-world contexts (making change, measuring).",
      "key_vocabulary": "estimate, approximate, round, inverse, check, verify, reasonable, expect, predict, difference",
      "common_misconceptions": "Pupils often see estimation as a separate activity unconnected to the main calculation. They may estimate after calculating (when the estimate is biased by the answer they already have) rather than before. Some pupils do not understand that checking with the inverse should give back the original number — they just repeat the original calculation.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true
    },
    {
      "concept_id": "MA-Y3-C017",
      "concept_name": "3 times table and related division facts",
      "description": "The 3 times table (3, 6, 9, 12, 15, 18, 21, 24, 27, 30, 33, 36) and corresponding division facts (e.g. 24 ÷ 3 = 8) are statutory Year 3 knowledge. Pupils must know all multiplication and division facts for the 3 times table to automaticity. Mastery means pupils can instantly recall any 3× fact in multiplication or division form, and apply these facts to solve problems and to derive related facts (e.g. 30 × 3 = 90).",
      "teaching_guidance": "Connect to skip counting in threes, which was introduced in Year 2. Use concrete equal groups (3 groups of 4, 4 groups of 3) to show commutativity. Chanting, songs, and multiplication grids are standard practice tools, but instant recall is the goal — not just procedural recitation. The digit sum pattern for multiples of 3 (the sum of the digits is always a multiple of 3: 12 → 1+2=3, 18 → 1+8=9) is a powerful self-checking tool. Connect immediately to the corresponding division facts.",
      "key_vocabulary": "three times table, multiply, divide, multiplication fact, division fact, product, quotient, multiples of three, factor",
      "common_misconceptions": "Pupils may know multiplication facts but not the corresponding division facts, treating them as entirely separate items of knowledge. The commutativity of multiplication (3 × 8 = 8 × 3) is not always obvious to pupils, who may know 3 × 8 but not 8 × 3. Some pupils confuse 3 × 7 = 21 with 3 × 6 = 18 or 3 × 8 = 24, particularly in the middle of the table.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C018",
      "concept_name": "4 times table and related division facts",
      "description": "The 4 times table (4, 8, 12, 16, 20, 24, 28, 32, 36, 40, 44, 48) and corresponding division facts are statutory Year 3 knowledge. Pupils should recognise the connection to the 2 times table through doubling (4 = 2 × 2, so 4 × n = 2 × 2 × n = double the corresponding entry in the 2 times table). Mastery means instant recall of all multiplication and division facts and confident application in problem-solving.",
      "teaching_guidance": "Establish the doubling connection: write out the 2 times table and then double each answer to get the 4 times table. Use arrays (a 4 × 6 array can be seen as two 2 × 6 arrays) to make this visual. Practise with a mix of multiplication and division questions. Connect to the 8 times table (doubling again). The pattern that all multiples of 4 are even is worth noticing.",
      "key_vocabulary": "four times table, multiply, divide, double, product, quotient, factor, multiple, array, even number",
      "common_misconceptions": "Pupils who learn the 4 times table by rote without the doubling connection may have many isolated facts to memorise rather than seeing the structure. Common specific errors: 4 × 7 = 29 or 4 × 6 = 28 (off by one error). Pupils may not recognise that 32 ÷ 4 = 8 even when they know 4 × 8 = 32.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C019",
      "concept_name": "8 times table and related division facts",
      "description": "The 8 times table (8, 16, 24, 32, 40, 48, 56, 64, 72, 80, 88, 96) and corresponding division facts represent the most demanding multiplication table for Year 3. Pupils should understand the doubling connection from the 4 times table. Mastery means instant recall of all facts and confident application in calculation and problem-solving contexts.",
      "teaching_guidance": "Use the doubling chain: 2s → 4s → 8s. Each entry in the 8 times table is double the corresponding 4 times table entry (and four times the 2 times table entry). Use halving as the inverse strategy for division: 64 ÷ 8: halve 64 to get 32, halve again to get 16, halve again to get 8 — so 64 ÷ 8 = 8. Practise with a mix of multiplication and division. The pattern in the ones digits of multiples of 8 (8, 6, 4, 2, 0, 8, 6, 4, 2, 0...) can be a memory aid.",
      "key_vocabulary": "eight times table, multiply, divide, double, halve, product, quotient, factor, multiple",
      "common_misconceptions": "The 8 times table is the hardest in Year 3. Common errors: 8 × 7 = 54 or 56 (confusion with 7 × 8 = 56 vs 6 × 9 = 54), 8 × 6 = 48 (often confused with 8 × 7). Pupils may know 8 × n facts but not the related division facts. The doubling strategy takes practice to apply fluently.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C020",
      "concept_name": "Connection between 2, 4 and 8 times tables (doubling)",
      "description": "The 2, 4 and 8 times tables are connected by repeated doubling: 4 = 2 × 2, so 4 × n = 2 × (2 × n); 8 = 2 × 4, so 8 × n = 2 × (4 × n). Understanding this relationship enables pupils to derive unknown facts from known ones and to make sense of the tables rather than memorising isolated facts. Mastery means pupils can explain the connection, use doubling to derive any 4× or 8× fact from the 2× table, and apply this understanding to division by halving.",
      "teaching_guidance": "Write the three tables side by side and highlight the doubling relationship. Use the 'doubling machine': start with the 2 times table and pass it through a doubling machine to produce the 4 times table, and through another to get the 8 times table. Connect to knowledge that 4 and 8 are powers of 2. Use halving to divide by 4 (halve twice) or by 8 (halve three times). This structural knowledge supports mathematical reasoning beyond mere recall.",
      "key_vocabulary": "double, halve, twice, connection, relationship, times table, multiple, factor, pattern",
      "common_misconceptions": "Pupils who learn all three tables separately without the connection lose a powerful memory scaffold. Some pupils understand the doubling connection in multiplication but do not apply it in reverse for division (halving). The connection between 2s, 4s and 8s is not automatically generalised to other doubling relationships (e.g. 3s and 6s).",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C021",
      "concept_name": "Written multiplication methods (2-digit × 1-digit)",
      "description": "Multiplying a two-digit number by a one-digit number requires pupils to extend their times table knowledge and begin transitioning to formal written methods. This can be done using partitioning (24 × 3 = 20 × 3 + 4 × 3 = 60 + 12 = 72) or a grid method. Mastery means pupils can reliably compute any two-digit by one-digit multiplication using a written method and can explain why their method works using place value.",
      "teaching_guidance": "The grid method provides a powerful pictorial bridge: draw a rectangle labelled with the two-digit number along the top (split into tens and ones) and the one-digit number on the side; calculate the area of each part; add the partial products. This makes the distributive law visible. Progress from expanded methods to compact short multiplication as fluency develops. Always check with estimation: 24 × 3 ≈ 24 × 3 ≈ 20 × 3 = 60, so 72 is plausible.",
      "key_vocabulary": "multiply, partition, grid method, partial product, distributive law, two-digit, one-digit, written method, area model",
      "common_misconceptions": "Pupils who do not partition correctly forget to multiply the tens part (computing 24 × 3 as 4 × 3 = 12, giving 12 rather than 72). In the grid method, pupils sometimes forget to add the partial products. In compact methods, pupils may not carry correctly: 24 × 3 = 4 × 3 = 12 (write 2, carry 1), 2 × 3 = 6 + 1 = 7, giving 72 correctly — but the carry is often forgotten.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C022",
      "concept_name": "Scaling problems",
      "description": "Scaling problems involve comparing quantities as multiples of each other (e.g. 'Four times as many', 'Three times as tall'). They differ from repeated addition because they express a multiplicative relationship. Mastery means pupils can interpret scaling language, write the corresponding multiplication or division statement, and solve problems involving integer scaling in real and mathematical contexts.",
      "teaching_guidance": "Use visual bar models to show scaling: a bar representing one unit and another bar showing 4 units alongside makes 'four times as many' concrete. Use familiar contexts: if one jar holds 3 sweets, how many does a jar four times as big hold? Introduce both 'times as many' (multiplication) and 'times as many fewer' or 'what fraction of' (division) forms. Connect to the multiplicative comparison language that will be used in ratios in Year 6.",
      "key_vocabulary": "times as many, times as much, scaling, multiply, divide, times as tall, as long as, factor, multiple",
      "common_misconceptions": "Pupils often confuse additive and multiplicative comparison: 'four more' (additive: 7 and 3) versus 'four times as many' (multiplicative: 12 and 3). They may add 4 instead of multiplying by 4. The language 'three times shorter' is ambiguous and non-standard — pupils need to learn to interpret such phrasing critically.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C023",
      "concept_name": "Correspondence problems",
      "description": "Correspondence problems involve finding all possible combinations when n objects are connected to m objects (e.g. 3 hats and 4 coats: how many different outfits?). This introduces systematic enumeration and the idea that the number of combinations is the product of the number of options (3 × 4 = 12). Mastery means pupils can work systematically to find all combinations and connect this to multiplication.",
      "teaching_guidance": "Begin with small, concrete examples using physical objects: use real hats and coats, or drawings. Teach systematic listing: fix one hat and try it with each coat, then move to the next hat. Record results in a table. Introduce the multiplication as a shortcut: 'There are 3 × 4 = 12 combinations because for each of the 3 hats there are 4 coat choices.' Connect to the idea that this is a 3-by-4 array of possibilities.",
      "key_vocabulary": "combination, possibility, systematic, multiply, choose, connect, match, table, enumerate",
      "common_misconceptions": "Pupils often count combinations randomly and miss some or double-count others. They may not connect the systematic listing to multiplication and see the two as completely separate activities. When numbers get larger, non-systematic approaches quickly become unmanageable.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C024",
      "concept_name": "Tenths as fractions and in place value",
      "description": "A tenth arises when one whole is divided into 10 equal parts; each part is one tenth (1/10). This concept bridges fractions and decimals because one tenth (1/10) is the first decimal place (0.1). Counting in tenths connects to the number line and to measurement (e.g. 1/10 of a metre = 10 cm). Mastery means pupils understand tenths as both fractions and as parts of decimal numbers, can count in tenths on a number line, and recognise that dividing a one-digit number by 10 gives tenths.",
      "teaching_guidance": "Use a metre stick divided into 10 equal parts (each 10 cm = 1/10 of a metre) as a concrete tool. Fraction strips or circles divided into 10 equal sectors provide visual representations. Count in tenths on a number line from 0 to 2: 0/10, 1/10, 2/10... 10/10, 11/10... showing tenths beyond 1. Connect to division: 6 ÷ 10 = 6/10 (six tenths). Note that the formal decimal notation (0.1) is not introduced until Year 4, but the fractional concept (1/10) is established here.",
      "key_vocabulary": "tenth, one tenth, divide by ten, fraction, equal parts, number line, decimal, 1/10",
      "common_misconceptions": "Pupils may think 1/10 is a large fraction because 10 is a large number — not understanding that larger denominators mean smaller parts. They may count tenths as: one tenth, two tenths... ten tenths, eleven tenths instead of one whole and one tenth. The connection between 1/10 and 0.1 is not made until Year 4 so pupils at this stage work purely in fraction notation.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C025",
      "concept_name": "Unit fractions with small denominators",
      "description": "Unit fractions have a numerator of 1 (e.g. 1/2, 1/3, 1/4, 1/5, 1/6, 1/8, 1/10). In Year 3, pupils extend their KS1 understanding of 1/2 and 1/4 to a wider range of unit fractions. They find unit fractions of discrete sets of objects and numbers, and place unit fractions on a number line. Mastery means pupils understand that the denominator tells how many equal parts the whole is divided into, the numerator tells how many parts are being counted, and can compare unit fractions (understanding that 1/3 > 1/4 > 1/5 because larger denominators mean smaller parts).",
      "teaching_guidance": "Use fraction walls (visual representations showing fractions of a whole, with bars divided into halves, thirds, quarters, fifths etc.) as the primary pictorial tool. Fraction circles and folded paper provide concrete experience. Emphasise the equal-parts definition — 1/3 means one of THREE EQUAL PARTS, and all three parts must be the same size. Place unit fractions on a number line between 0 and 1. Compare: '1/4 < 1/3 because splitting into 4 parts makes each part smaller than splitting into 3 parts.'",
      "key_vocabulary": "unit fraction, numerator, denominator, equal parts, one third, one quarter, one fifth, one eighth, fraction wall, number line",
      "common_misconceptions": "Pupils commonly believe larger denominators mean larger fractions (thinking 1/8 > 1/3 because 8 > 3). They may also accept non-equal partitions as valid fractions. When finding 1/3 of 9 objects, pupils may distribute them one at a time without checking the equal-parts condition.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C026",
      "concept_name": "Non-unit fractions with small denominators",
      "description": "Non-unit fractions have a numerator greater than 1 (e.g. 2/3, 3/4, 5/8). They represent multiple parts of a whole divided equally. In Year 3, pupils learn to recognise, find and use non-unit fractions, building on their secure knowledge of unit fractions. Mastery means pupils can find a non-unit fraction of a set (e.g. 3/4 of 20 = 15) by first finding the unit fraction and multiplying, and can place non-unit fractions on a number line.",
      "teaching_guidance": "Build from unit fractions: 'We know 1/4 of 20 = 5, so 3/4 of 20 = 3 × 5 = 15.' Use fraction bars and circles to show multiple parts coloured. Place non-unit fractions on a number line — this shows that 3/4 is closer to 1 than to 0, and that fractions get larger as the numerator increases (when denominator is fixed). Connect to the concept that a non-unit fraction is several equal parts combined.",
      "key_vocabulary": "non-unit fraction, numerator, denominator, multiply, fraction of, parts, whole, number line",
      "common_misconceptions": "Pupils sometimes find the unit fraction correctly but forget to multiply by the numerator (finding 3/4 of 20 as just 5 rather than 15). Some pupils treat the numerator and denominator as independent whole numbers (saying 3/4 of 20 = 3 out of 4 of 20, then not knowing how to proceed). The connection between finding fractions of quantities and division is not always clear.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C027",
      "concept_name": "Equivalent fractions",
      "description": "Equivalent fractions are different fractions that represent the same value (e.g. 1/2 = 2/4 = 3/6 = 4/8). Pupils in Year 3 use diagrams and visual representations to recognise and show equivalent fractions with small denominators. Mastery means pupils can identify and generate equivalent fractions, understand that multiplying both the numerator and denominator by the same number produces an equivalent fraction, and use equivalence to compare and order fractions.",
      "teaching_guidance": "Fraction walls are the most powerful tool: line up bars showing halves, quarters and eighths to see that 1/2 = 2/4 = 4/8 visually. Fraction circles also demonstrate this well. Folding paper: fold a strip in half (showing 1/2), then fold again to show quarters (2/4), then again (4/8). Use diagrams to show the pattern: multiplying top and bottom by 2 doubles both. At Year 3, the formal rule (multiply by n/n) is introduced pictorially rather than algebraically.",
      "key_vocabulary": "equivalent, equal, same value, fraction wall, multiply, numerator, denominator, simplify",
      "common_misconceptions": "Pupils who have not developed the pictorial understanding may not believe that 1/2 = 2/4 because 'the numbers are different.' They may think that multiplying both numerator and denominator by the same number changes the value of the fraction. Some pupils confuse equivalent fractions (same value) with equal fractions (identical notation).",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C028",
      "concept_name": "Adding and subtracting fractions with the same denominator",
      "description": "When fractions have the same denominator, they can be added or subtracted by operating on the numerators only, keeping the denominator constant (e.g. 3/7 + 2/7 = 5/7; 5/8 – 2/8 = 3/8). The constraint 'within one whole' means results remain between 0 and 1. Mastery means pupils can reliably add and subtract same-denominator fractions, understand why only the numerators change, and connect this to counting in fractions on a number line.",
      "teaching_guidance": "Use a fraction number line to show addition as movement along the line: start at 3/7, move 2/7 further to reach 5/7. Fraction bars provide a concrete/pictorial approach: shade 3 parts of a 7-part bar, then shade 2 more — 5 parts shaded in total. Emphasise: 'The denominator tells us the size of each piece; the pieces don't change when we add, we just count more of them.' Connect to whole-number addition: 3 sevenths + 2 sevenths = 5 sevenths, just as 3 apples + 2 apples = 5 apples.",
      "key_vocabulary": "add fractions, subtract fractions, same denominator, numerator, denominator, total, difference, fraction bar, number line",
      "common_misconceptions": "The most common error is adding or subtracting both numerators and denominators: 3/7 + 2/7 = 5/14 (wrong). Pupils who make this error do not understand that the denominator represents the type of unit being counted, which does not change when you combine same-type units. Subtracting to get a zero numerator (3/5 – 3/5 = 0/5 = 0) also confuses some pupils.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C029",
      "concept_name": "Comparing and ordering fractions",
      "description": "In Year 3, pupils compare and order unit fractions (understanding that 1/2 > 1/3 > 1/4 > 1/5 because larger denominators make smaller parts) and compare fractions with the same denominator (where the larger numerator indicates the larger fraction, e.g. 5/8 > 3/8). Mastery means pupils can compare any two fractions encountered at this stage with justification, and order a set of unit fractions or same-denominator fractions correctly.",
      "teaching_guidance": "Use fraction walls to compare unit fractions visually — the bar divided into halves is longer per part than the bar divided into quarters. For same-denominator fractions, colour fraction bars and compare the shaded areas. Use a shared number line to place multiple fractions and compare their positions. Introduce the language 'greater than', 'less than' and 'equal to' explicitly in fraction contexts. Avoid the symbol approach until pupils have strong conceptual understanding.",
      "key_vocabulary": "compare, order, greater than, less than, unit fraction, same denominator, fraction wall, number line, ascending, descending",
      "common_misconceptions": "The most persistent misconception is 'larger denominator = larger fraction' for unit fractions (thinking 1/8 > 1/3). For same-denominator fractions, pupils may compare denominators rather than numerators. Some pupils are confused by equivalent fractions appearing at different positions in an ordered list.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C030",
      "concept_name": "Measuring in mixed units (length, mass, volume)",
      "description": "In Year 3, pupils work with measurements given in mixed units — for example, 1 m 45 cm, 2 kg 300 g, 1 l 250 ml — and perform calculations with such measurements. They also recognise simple equivalents (e.g. 1 km = 1000 m, 1 m = 100 cm, 1 m = 1000 mm, 1 kg = 1000 g, 1 l = 1000 ml). Mastery means pupils can read measuring instruments accurately, record measurements in appropriate units, and carry out addition and subtraction with measurements.",
      "teaching_guidance": "Use real measuring instruments: rulers in mm/cm/m, kitchen scales in g/kg, measuring jugs in ml/l. The curriculum specifies mm is introduced in Year 3, so ensure this unit is covered. Simple equivalents: use the pattern that kilo- means 1000, so 1 kilogram = 1000 grams, 1 kilometre = 1000 metres. Connect to place value: 1 m 45 cm = 145 cm (multiply metres by 100 and add centimetres). Practise reading scales with non-standard intervals.",
      "key_vocabulary": "millimetre, centimetre, metre, kilometre, gram, kilogram, millilitre, litre, equivalent, convert, mixed units, measure, scale",
      "common_misconceptions": "Pupils confuse mm and cm (writing 45 mm as 45 cm). They may add mixed units without converting (1 m 70 cm + 50 cm = 1 m 120 cm rather than 2 m 20 cm). Converting between units requires the multiplication/division knowledge from the number domain, and pupils often use the wrong conversion factor (multiplying by 10 rather than 100 for cm to mm).",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true
    },
    {
      "concept_id": "MA-Y3-C031",
      "concept_name": "Perimeter of simple 2-D shapes",
      "description": "Perimeter is the distance around the boundary of a flat (2-D) shape, found by adding the lengths of all its sides. In Year 3, pupils measure the perimeter of simple rectilinear shapes. Mastery means pupils understand perimeter as a length measurement (in mm, cm or m), can measure sides accurately and add them, and can distinguish perimeter from area.",
      "teaching_guidance": "Introduce perimeter physically: pupils walk the perimeter of the playground or run a finger around the edge of a shape. Measure sides using a ruler and record each length before adding. Simple rectilinear shapes (made from squares on squared paper) allow pupils to count squares along each side before measuring. Emphasise: perimeter is the total length around the outside, not the space inside (which is area). Use the formula for a rectangle (2 × length + 2 × width) informally at this stage.",
      "key_vocabulary": "perimeter, boundary, edge, distance, measure, length, add, total, centimetre, metre",
      "common_misconceptions": "Pupils frequently confuse perimeter (length around the outside) with area (space inside). They may count the squares of a shape (area) rather than measuring around its edge (perimeter). When measuring rectilinear shapes, pupils sometimes miss a side or count a vertex rather than a side. On shapes with equal opposite sides, pupils may only measure two sides and forget to double them.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C032",
      "concept_name": "Money calculations with £ and p",
      "description": "In Year 3, pupils add and subtract amounts of money expressed in both pounds and pence (e.g. £3.45 + £1.27 = £4.72) and calculate change. This requires understanding the notation £x.pp, relating pounds and pence to the decimal place value system. Mastery means pupils can fluently perform calculations in mixed £/p notation and give change by counting up from the purchase price to the amount tendered.",
      "teaching_guidance": "Connect to decimal notation: £1.45 means 1 pound and 45 pence, paralleling 1 whole and 45 hundredths. Use play money in practical shopkeeper role-plays as the primary concrete context. Teach giving change as 'counting up' (complementary addition): from £1.37 to £2.00, count up 3p to £1.40, then 60p to £2.00, giving change of 63p. This strategy is more intuitive than subtraction. Connect to columnar addition/subtraction for written calculations.",
      "key_vocabulary": "pounds, pence, £, p, change, total, cost, amount, decimal point, notation, add, subtract",
      "common_misconceptions": "Pupils confuse £ and p notation — writing £45 to mean 45 pence, or 45p to mean £4.50. They may add pounds and pence in separate columns without converting: £1.45 + 75p is handled as 1.45 + 0.75 = 2.20 by some but as 1.45 + 75 = 76.45 by others. The conversion between pence and pounds (÷ 100) is often unreliable.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true
    },
    {
      "concept_id": "MA-Y3-C033",
      "concept_name": "Time: Roman numerals I–XII and analogue clock",
      "description": "Roman numerals I through XII are used on traditional clock faces. Pupils must recognise these symbols and translate them to Hindu-Arabic numerals to read the time. The curriculum also requires pupils to tell and write the time from analogue clocks to the nearest minute. Mastery means pupils can read any time shown on a Roman numeral clock face and accurately report the time to the nearest minute in both words and 12-hour notation.",
      "teaching_guidance": "Display Roman numerals I–XII alongside their Hindu-Arabic equivalents. Focus on the additive (I, II, III, VI, VII, VIII, XI, XII) and subtractive (IV = 4, IX = 9) notations. Use real clocks with Roman numerals or large printed clock faces. Practise reading times to the nearest minute — the minute hand requires reading a scale of 60 (each minute mark is worth 1 minute), while the hour hand's position between two Roman numerals indicates the hour.",
      "key_vocabulary": "Roman numerals, I, II, III, IV, V, VI, VII, VIII, IX, X, XI, XII, analogue clock, minute hand, hour hand, nearest minute",
      "common_misconceptions": "Pupils sometimes read Roman numeral IV as 6 (confusing VI and IV). They may read the hour hand position when it is between two numbers by always rounding to the nearer number rather than the number it has passed. The minute hand scale (each interval of 5 minutes marked but individual minutes unmarked between) requires careful interpretation.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C034",
      "concept_name": "24-hour clock",
      "description": "The 24-hour clock system represents times from midnight (00:00) through midnight of the following day (23:59), avoiding the a.m./p.m. ambiguity of the 12-hour system. Afternoon hours are expressed as 13:00–23:59. Mastery means pupils can convert between 12-hour (with a.m./p.m.) and 24-hour notation and can read and write times in both systems correctly.",
      "teaching_guidance": "Establish: for a.m. times, the 24-hour time is the same as the 12-hour time but written with a leading zero (09:00). For p.m. times, add 12 to the 12-hour hour (3:00 p.m. = 15:00). Use a number line of 24 hours to show how p.m. continues the count past 12. Display a conversion table initially. Digital clocks showing 24-hour times provide a practical context. Connect to timetables (train, bus, television) which commonly use 24-hour notation.",
      "key_vocabulary": "24-hour clock, 12-hour clock, a.m., p.m., midnight, noon, digital, notation, convert",
      "common_misconceptions": "Pupils frequently forget to add 12 for p.m. times (recording 3 p.m. as 03:00 instead of 15:00). They may think 12:00 midnight is 00:00 correctly but treat 12:00 noon as 00:00 (confusing noon with midnight). The format 00:00 for midnight (rather than 24:00) can be counterintuitive.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C035",
      "concept_name": "Comparing durations of time",
      "description": "Comparing durations involves calculating how much time has passed between two events or which of two events took longer. This requires converting between seconds, minutes and hours as necessary. Mastery means pupils can calculate time durations using a number line or counting-on strategy, compare durations expressed in different units, and solve problems involving start and end times.",
      "teaching_guidance": "Use a number line timeline as the primary tool: mark the start time, mark the end time, and find the gap. For durations crossing the hour: e.g. from 2:45 to 3:20, count on 15 minutes to 3:00 then 20 more minutes = 35 minutes. Connect to subtraction in the time domain. Use real-life contexts: cooking times, journey times, the length of school lessons. The curriculum requires knowledge that there are 60 seconds in a minute, 60 minutes in an hour, 24 hours in a day — these conversion facts are essential for duration calculations.",
      "key_vocabulary": "duration, how long, time, seconds, minutes, hours, start, end, interval, calculate, number line, difference",
      "common_misconceptions": "Pupils often treat time as a base-10 system: subtracting 2:45 from 3:20 as 3.20 – 2.45 = 0.75, giving 75 minutes rather than 35 minutes. This is the single most common error in time calculations and arises from treating time notation as a decimal. Pupils also frequently confuse 1 hour 30 minutes with 1.3 hours or 130 minutes.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true
    },
    {
      "concept_id": "MA-Y3-C036",
      "concept_name": "Drawing 2-D shapes and making 3-D shapes",
      "description": "In Year 3, pupils move beyond recognising and naming shapes to constructing them. Drawing 2-D shapes from given specifications (e.g. draw a rectangle with sides 4 cm and 2 cm) develops precision and understanding of properties. Making 3-D shapes from modelling materials (straws and clay, commercial kits) builds understanding of the relationship between edges, faces and vertices. Mastery means pupils can accurately draw specified 2-D shapes and construct recognisable 3-D shapes from given criteria.",
      "teaching_guidance": "Provide rulers, set-squares and protractors for drawing. Start with shapes on squared/dotted paper for support before moving to plain paper. Teach measuring sides and marking angles before connecting them. For 3-D construction, use construction kits (e.g. Geomag, Polydron) that make edges and faces explicit. Ask pupils to count edges, faces and vertices as they build, connecting to properties. Connect to the properties explored in Years 1 and 2.",
      "key_vocabulary": "draw, construct, make, 2-D shape, 3-D shape, side, edge, face, vertex, vertices, corner, right angle, ruler, set-square, specification",
      "common_misconceptions": "When drawing rectangles, pupils often draw by eye rather than measuring carefully. They may draw right angles without using a set-square. In 3-D construction, pupils sometimes build structures that look right but do not have the correct number of faces/edges/vertices. They may confuse 2-D faces with 3-D solids (calling a face 'the shape' rather than 'the face of the shape').",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C037",
      "concept_name": "Angles as properties of shapes and as turns",
      "description": "An angle is the amount of turn between two lines that meet at a point, or equivalently the space between two lines meeting at a point (measured later in degrees). In Year 3, pupils understand angles both as properties of shapes (the corner of a square is a right angle) and as turns (rotating a quarter turn makes a right angle). Mastery means pupils can identify angles in shapes, recognise that an angle is a measure of turn, and connect the fraction of a turn to the angle size.",
      "teaching_guidance": "Use physical turning: pupils hold an arrow pointing forward and turn it by different amounts. Connect quarter turn = right angle, half turn = two right angles (a straight line), three-quarter turn = three right angles, full turn = four right angles. Use a set-square or corner of a piece of paper to test right angles in shapes and the environment. Identify right angles in the classroom (corners of tables, doors, windows). The word 'angle' comes from the Latin for 'corner' — use this etymology to make the concept memorable.",
      "key_vocabulary": "angle, turn, right angle, quarter turn, half turn, three-quarter turn, full turn, acute, obtuse, degrees (not yet formal), corner, set-square",
      "common_misconceptions": "Pupils may think that the size of an angle is determined by the length of its arms rather than by the amount of turn between them (so a large right angle with long arms appears bigger than a small right angle with short arms). They may think an angle must have one horizontal arm. Some pupils confuse right angle (90°) with straight angle (180°).",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C038",
      "concept_name": "Identifying right angles and comparing to other angles",
      "description": "A right angle is exactly one quarter of a full turn (later defined as 90°). Pupils must recognise right angles in shapes, as turns, and in the environment, and must compare other angles to right angles: acute angles are less than a right angle; obtuse angles are greater than a right angle (but less than a straight line). Mastery means pupils can identify right angles using a set-square, compare any angle to a right angle and classify it as right, acute or obtuse, and recognise that two right angles make a half-turn etc.",
      "teaching_guidance": "A folded piece of paper provides a ready-made right angle tester. Teach pupils to place it in corners of shapes and the environment to identify right angles. Then identify angles in shapes that are not right angles and classify them as 'bigger than a right angle' (obtuse) or 'smaller than a right angle' (acute). Use the memory aid: Acute = A cute small angle (both have an 'a'); Obtuse = an O-big angle. Count right angles in regular polygons: a square has 4, a rectangle has 4, a right-angled triangle has 1.",
      "key_vocabulary": "right angle, acute angle, obtuse angle, greater than, less than, set-square, corner, quarter turn, classify, compare",
      "common_misconceptions": "Pupils often think right angles must be 'corner shaped' with one horizontal and one vertical arm. They may not recognise a right angle tilted at 45° as still being a right angle. Pupils frequently confuse acute and obtuse, despite using mnemonics. They may also think that a straight angle (180°) is not an angle at all, since there is no visible 'corner'.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C039",
      "concept_name": "Horizontal, vertical, perpendicular and parallel lines",
      "description": "Horizontal lines are parallel to the horizon (flat). Vertical lines are perpendicular to the horizon (upright). Perpendicular lines meet at right angles. Parallel lines are always the same distance apart and never meet. These four concepts introduce precise geometric vocabulary for describing the orientation and relationship between lines. Mastery means pupils can identify and label examples of each type in shapes, diagrams and the environment.",
      "teaching_guidance": "Use the classroom environment to find examples: windowsills are horizontal, door frames are vertical, table legs are perpendicular to the floor, railway tracks are parallel. Use a set-square to verify perpendicularity (right angle between two lines). Parallel lines can be tested by measuring the distance between them at two points — if the same, they are parallel. Connect to shapes: a square has two pairs of parallel sides and four right angles (four pairs of perpendicular sides). Introduce correct notation: arrows on lines to show parallel; right angle squares to show perpendicular.",
      "key_vocabulary": "horizontal, vertical, perpendicular, parallel, right angle, pair, line, relationship, environment, notation",
      "common_misconceptions": "Pupils frequently confuse parallel and perpendicular. Some think parallel lines must be horizontal. Pupils may think that any two lines that do not cross in their visible length are parallel, not understanding that parallel lines must never cross even when extended. Vertical and horizontal are often confused when shapes are rotated.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C040",
      "concept_name": "Scaled bar charts and pictograms",
      "description": "In Year 3, bar charts and pictograms use scales where one bar unit or one symbol represents more than one item (e.g. each symbol = 5, each 1 cm on a bar chart = 10 children). Pupils must read the scale key, multiply appropriately to find values, and use these values to answer questions. Mastery means pupils can read scales on bar charts (including values between marked intervals) and pictograms (including half-symbols when one symbol represents 2 or more), and can present data in these formats.",
      "teaching_guidance": "Start with scales of 2 or 5 before moving to 10 or 100. For pictograms, use concrete half-symbols (a picture cut in half) before the abstract representation. Always read the key first. Practise reading values that fall between marked scale intervals. Creating their own bar charts and pictograms from given data is as important as reading them — the act of choosing a suitable scale builds understanding. Use real data from classroom surveys to make the work meaningful.",
      "key_vocabulary": "bar chart, pictogram, scale, key, frequency, interpret, present, data, axis, label, symbol, represents",
      "common_misconceptions": "Pupils read the numerical label on the scale as the value (reading 2 on a scale of 5 as '2 items' rather than '10 items'). Half-symbols in pictograms are often misread as zero rather than half the represented value. Pupils may not realise they need to consult the key before reading the chart, treating each bar unit as worth 1.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false
    },
    {
      "concept_id": "MA-Y3-C041",
      "concept_name": "Solving one-step and two-step questions from data",
      "description": "Data questions range from one-step (reading a single value directly from a chart) to two-step (reading values from a chart and then performing a calculation, e.g. finding how many more). In Year 3, pupils are explicitly required to solve two-step questions such as 'How many more children chose football than swimming?'. Mastery means pupils can identify which operation to use after reading the relevant values from a chart or table, and can answer both one-step and two-step questions accurately.",
      "teaching_guidance": "Teach pupils to first identify what they need to find, then identify which data values they need, then perform the calculation. Model think-alouds: 'I need to find how many more — that's a subtraction. I need to read the value for football (40) and the value for swimming (25). 40 – 25 = 15, so 15 more children chose football.' Use a range of question types: how many altogether (addition), how many more/fewer (subtraction), how many times as many (multiplication). Connect explicitly to the calculation domains.",
      "key_vocabulary": "data, bar chart, pictogram, table, one-step, two-step, more than, fewer than, altogether, total, difference, question, interpret",
      "common_misconceptions": "Pupils often read values correctly but then choose the wrong operation: for 'how many more', they may add rather than subtract. For two-step questions, pupils may answer only the first step and stop. When totalling all categories, pupils may read an axis value rather than add up all the bars.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "MA-Y2-C001",
      "dependent_concept": "MA-Y3-C001",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 2 counting in twos directly supports Year 3 counting in fours through the doubling relationship: 4 = 2 × 2, so counting in fours is like counting in twos twice"
    },
    {
      "prerequisite_concept": "MA-Y3-C001",
      "dependent_concept": "MA-Y3-C002",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Counting in fours is a prerequisite for counting in eights because 8 = 4 × 2, so the 8s sequence is the double of the 4s sequence"
    },
    {
      "prerequisite_concept": "MA-Y2-C003",
      "dependent_concept": "MA-Y3-C003",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Year 2 counting in fives supports Year 3 counting in fifties since multiples of 50 are multiples of 5 scaled by 10"
    },
    {
      "prerequisite_concept": "MA-Y2-C004",
      "dependent_concept": "MA-Y3-C004",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 2 counting in tens directly supports counting in hundreds (each multiple of 100 is a multiple of 10 scaled by 10)"
    },
    {
      "prerequisite_concept": "MA-Y2-C005",
      "dependent_concept": "MA-Y3-C005",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 2 finding 10 more/less with two-digit numbers extends directly to the same operation with three-digit numbers in Year 3"
    },
    {
      "prerequisite_concept": "MA-Y3-C004",
      "dependent_concept": "MA-Y3-C006",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Counting in hundreds prepares pupils to understand 100 more/less as a single step along the hundreds counting sequence"
    },
    {
      "prerequisite_concept": "MA-Y2-C007",
      "dependent_concept": "MA-Y3-C007",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "Year 2 place value understanding of tens and ones in two-digit numbers is directly extended to include hundreds in three-digit numbers"
    },
    {
      "prerequisite_concept": "MA-Y3-C007",
      "dependent_concept": "MA-Y3-C008",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 1.0,
      "rationale": "Understanding the value of each digit in a three-digit number is the prerequisite for partitioning that number into its component parts"
    },
    {
      "prerequisite_concept": "MA-Y3-C007",
      "dependent_concept": "MA-Y3-C009",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Place value understanding is essential for comparing three-digit numbers — pupils compare hundreds first, then tens, then ones"
    },
    {
      "prerequisite_concept": "MA-Y3-C009",
      "dependent_concept": "MA-Y3-C010",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Comparing and ordering numbers provides the conceptual basis for estimation, which requires judging the relative size of a quantity"
    },
    {
      "prerequisite_concept": "MA-Y2-C010",
      "dependent_concept": "MA-Y3-C011",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 2 reading and writing numbers to 100 in words is extended to numbers to 1000 in Year 3"
    },
    {
      "prerequisite_concept": "MA-Y3-C007",
      "dependent_concept": "MA-Y3-C012",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Place value understanding in three-digit numbers is essential for selecting the correct column to add to in mental addition strategies"
    },
    {
      "prerequisite_concept": "MA-Y3-C012",
      "dependent_concept": "MA-Y3-C013",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Mental addition strategies with three-digit numbers inform the parallel subtraction strategies, sharing the same place value understanding"
    },
    {
      "prerequisite_concept": "MA-Y2-C020",
      "dependent_concept": "MA-Y3-C014",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "Year 2 introduction to formal columnar addition (with two-digit numbers) is extended to three-digit numbers in Year 3"
    },
    {
      "prerequisite_concept": "MA-Y3-C007",
      "dependent_concept": "MA-Y3-C014",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Correct column alignment in addition depends on understanding that digits in the same column have the same place value"
    },
    {
      "prerequisite_concept": "MA-Y2-C021",
      "dependent_concept": "MA-Y3-C015",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "Year 2 introduction to formal columnar subtraction is extended to three-digit numbers with exchanges in Year 3"
    },
    {
      "prerequisite_concept": "MA-Y3-C010",
      "dependent_concept": "MA-Y3-C016",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.85,
      "rationale": "The ability to estimate numbers is the direct prerequisite for estimating calculation results before computing"
    },
    {
      "prerequisite_concept": "MA-Y2-C022",
      "dependent_concept": "MA-Y3-C017",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Year 2 counting in threes and recognising multiples of 3 is the foundation for learning the 3 times table in Year 3"
    },
    {
      "prerequisite_concept": "MA-Y2-C015",
      "dependent_concept": "MA-Y3-C018",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 2 knowledge of the 2 times table supports learning the 4 times table in Year 3 through the doubling relationship"
    },
    {
      "prerequisite_concept": "MA-Y3-C018",
      "dependent_concept": "MA-Y3-C019",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "The 4 times table is the direct prerequisite for the 8 times table through doubling"
    },
    {
      "prerequisite_concept": "MA-Y3-C017",
      "dependent_concept": "MA-Y3-C020",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "All three tables (2, 4, 8) must be known before their doubling connections can be fully understood"
    },
    {
      "prerequisite_concept": "MA-Y3-C018",
      "dependent_concept": "MA-Y3-C020",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Knowledge of the 4 times table is required to understand and apply the doubling connection to the 8 times table"
    },
    {
      "prerequisite_concept": "MA-Y3-C019",
      "dependent_concept": "MA-Y3-C020",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Knowledge of the 8 times table is required to verify the doubling connection with the 4 times table"
    },
    {
      "prerequisite_concept": "MA-Y3-C017",
      "dependent_concept": "MA-Y3-C021",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Times table knowledge is essential for computing the partial products in two-digit by one-digit multiplication"
    },
    {
      "prerequisite_concept": "MA-Y3-C008",
      "dependent_concept": "MA-Y3-C021",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Partitioning two-digit numbers into tens and ones is the core strategy for mental and written multiplication methods"
    },
    {
      "prerequisite_concept": "MA-Y3-C021",
      "dependent_concept": "MA-Y3-C022",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.85,
      "rationale": "Scaling problems require multiplication skills; knowing how to multiply a two-digit number by a one-digit number enables pupils to solve scaling problems"
    },
    {
      "prerequisite_concept": "MA-Y3-C021",
      "dependent_concept": "MA-Y3-C023",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.85,
      "rationale": "Correspondence problems are solved by multiplication, so multiplication skill is a prerequisite for the most efficient solution strategy"
    },
    {
      "prerequisite_concept": "MA-Y2-C030",
      "dependent_concept": "MA-Y3-C024",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Year 2 understanding of simple fractions (halves, quarters) provides the conceptual basis for extending to tenths"
    },
    {
      "prerequisite_concept": "MA-Y2-C031",
      "dependent_concept": "MA-Y3-C025",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 2 unit fractions (halves, thirds, quarters) are directly extended to a wider range of unit fractions in Year 3"
    },
    {
      "prerequisite_concept": "MA-Y3-C025",
      "dependent_concept": "MA-Y3-C026",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.95,
      "rationale": "Understanding unit fractions is essential before non-unit fractions, as non-unit fractions are multiples of the unit fraction with the same denominator"
    },
    {
      "prerequisite_concept": "MA-Y3-C026",
      "dependent_concept": "MA-Y3-C027",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Understanding non-unit fractions is needed to recognise that different non-unit fractions can represent the same value (equivalence)"
    },
    {
      "prerequisite_concept": "MA-Y3-C025",
      "dependent_concept": "MA-Y3-C028",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Understanding fractions as collections of equal parts is required before pupils can understand adding same-denominator fractions as combining those parts"
    },
    {
      "prerequisite_concept": "MA-Y3-C025",
      "dependent_concept": "MA-Y3-C029",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Comparing unit fractions requires understanding of unit fractions and the inverse relationship between denominator size and fraction size"
    },
    {
      "prerequisite_concept": "MA-Y2-C040",
      "dependent_concept": "MA-Y3-C030",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 2 measurement skills in standard units (cm, m, g, kg, ml, l) are extended in Year 3 to include mm and mixed units"
    },
    {
      "prerequisite_concept": "MA-Y3-C030",
      "dependent_concept": "MA-Y3-C031",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Accurate length measurement skills are a prerequisite for measuring the sides of shapes in order to calculate perimeter"
    },
    {
      "prerequisite_concept": "MA-Y3-C014",
      "dependent_concept": "MA-Y3-C031",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.85,
      "rationale": "Adding the side lengths to find perimeter requires the mental or written addition skills developed in the number domain"
    },
    {
      "prerequisite_concept": "MA-Y2-C041",
      "dependent_concept": "MA-Y3-C032",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 2 simple money calculations extend to mixed £ and p notation and giving change in Year 3"
    },
    {
      "prerequisite_concept": "MA-Y2-C042",
      "dependent_concept": "MA-Y3-C033",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 2 telling time to the nearest 5 minutes is extended to the nearest minute and to Roman numeral clocks in Year 3"
    },
    {
      "prerequisite_concept": "MA-Y3-C033",
      "dependent_concept": "MA-Y3-C034",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Fluent reading of 12-hour time is a prerequisite for converting to and from 24-hour notation"
    },
    {
      "prerequisite_concept": "MA-Y3-C033",
      "dependent_concept": "MA-Y3-C035",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Accurately reading start and end times is prerequisite for calculating the duration between them"
    },
    {
      "prerequisite_concept": "MA-Y2-C050",
      "dependent_concept": "MA-Y3-C036",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Year 2 recognition and description of 2-D and 3-D shapes provides the conceptual basis for drawing and constructing them accurately in Year 3"
    },
    {
      "prerequisite_concept": "MA-Y2-C051",
      "dependent_concept": "MA-Y3-C037",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Year 2 work on turns (quarter turn, half turn) provides the experiential basis for formally understanding angles as measures of turn in Year 3"
    },
    {
      "prerequisite_concept": "MA-Y3-C037",
      "dependent_concept": "MA-Y3-C038",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.95,
      "rationale": "Understanding angles as turns is prerequisite for identifying and comparing right angles, since a right angle is defined as a quarter turn"
    },
    {
      "prerequisite_concept": "MA-Y3-C038",
      "dependent_concept": "MA-Y3-C039",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Understanding right angles is essential for identifying perpendicular lines (which meet at right angles) and thus for distinguishing perpendicular from parallel"
    },
    {
      "prerequisite_concept": "MA-Y2-C043",
      "dependent_concept": "MA-Y3-C040",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Year 2 work with simple bar charts and pictograms (scale of 1) is extended to scaled charts in Year 3"
    },
    {
      "prerequisite_concept": "MA-Y3-C040",
      "dependent_concept": "MA-Y3-C041",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.95,
      "rationale": "Reading scaled charts accurately is prerequisite for extracting the data values needed to answer one-step and two-step questions"
    },
    {
      "prerequisite_concept": "MA-Y3-C014",
      "dependent_concept": "MA-Y3-C041",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.8,
      "rationale": "Two-step data questions require performing addition or subtraction on values read from charts, so calculation skill is a prerequisite"
    }
  ]
}
