{
  "metadata": {
    "subject": "Physical Education",
    "key_stage": "KS1",
    "years_covered": [1, 2],
    "document_reference": "DFE-00176-2013",
    "extraction_date": "2026-02-17",
    "structure_rating": 7
  },
  "domains": [
    {
      "domain_id": "PE-KS1-D001",
      "domain_name": "Physical Skills and Movement",
      "description": "Mastering basic movement skills including running, jumping, throwing and catching, and developing balance, agility and co-ordination across a range of activities.",
      "curriculum_context": "The foundation of KS1 physical education is the development of fundamental movement skills that underpin all subsequent physical activity. The curriculum specifies mastery of running, jumping, throwing and catching as core skills alongside balance, agility and co-ordination, which together form the physical literacy framework that enables pupils to participate confidently in a wide range of activities. The word 'master' is significant: it implies that pupils should develop genuine competence and fluency rather than merely being introduced to these skills. The application of basic skills across a range of activities ensures that learning transfers beyond single-sport contexts, building the physical confidence and versatility that supports lifelong physical activity.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "PE-KS1-D002",
      "domain_name": "Games and Team Activities",
      "description": "Participating in team games, developing simple tactics for attacking and defending.",
      "curriculum_context": "Team games introduce pupils to the social and strategic dimensions of physical activity at KS1. Pupils not only participate in games but are expected to develop simple tactics for attacking and defending, which requires them to think about the game strategically as well as execute physical skills. This domain develops communication, cooperation and decision-making within physical contexts, teaching pupils to work effectively with others towards shared goals. The introduction of attacking and defending as conceptual frameworks gives pupils a vocabulary for thinking about game strategy that will be extended and refined throughout their physical education.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "PE-KS1-D003",
      "domain_name": "Dance",
      "description": "Performing dances using simple movement patterns, developing expressive and rhythmic physical performance.",
      "curriculum_context": "Dance at KS1 introduces pupils to the expressive and aesthetic dimensions of physical education, connecting movement to music, rhythm and creative expression. Pupils perform dances using simple movement patterns, which develops their ability to reproduce sequences of movement from memory, to coordinate their body to musical rhythms, and to use their body as a means of creative and expressive communication. Dance develops spatial awareness, body coordination and musicality alongside physical fitness, and provides an important counterpoint to games and athletics in the physical education curriculum. The requirement to use simple movement patterns ensures that dance work is accessible and achievable at this stage while still developing genuine physical and expressive skill.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    },
    {
      "domain_id": "PE-KS1-D004",
      "domain_name": "Swimming and Water Safety",
      "description": "Swimming competently over a distance of at least 25 metres, using a range of strokes and performing safe self-rescue in different water-based situations.",
      "curriculum_context": "The National Curriculum requires that all pupils should be able to swim competently by the end of KS2, and schools may choose to teach swimming during KS1 to meet this requirement. The programme of study specifies three specific outcomes: swimming at least 25 metres using a range of strokes; using backstroke, breaststroke and front crawl; and performing safe self-rescue in different water-based situations. The inclusion of water safety as a distinct outcome, alongside swimming competence, reflects the life-critical nature of this skill: pupils are not merely developing a sport but acquiring an essential safety skill. Schools that cannot deliver swimming at KS1 must ensure it is delivered at KS2 so that the requirement is met before the end of primary education.",
      "is_cross_cutting": false,
      "structure_type": "skills"
    }
  ],
  "objectives": [
    {
      "objective_id": "PE-KS1-O001",
      "domain_id": "PE-KS1-D001",
      "objective_text": "master basic movements including running, jumping, throwing and catching, as well as developing balance, agility and co-ordination, and begin to apply these in a range of activities",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "PE-KS1-O002",
      "domain_id": "PE-KS1-D002",
      "objective_text": "participate in team games, developing simple tactics for attacking and defending",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "PE-KS1-O003",
      "domain_id": "PE-KS1-D003",
      "objective_text": "perform dances using simple movement patterns",
      "non_statutory_guidance": null,
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "PE-KS1-O004",
      "domain_id": "PE-KS1-D004",
      "objective_text": "swim competently, confidently and proficiently over a distance of at least 25 metres",
      "non_statutory_guidance": "This can be taught at KS1 or KS2, but must be met by the end of KS2.",
      "examples": null,
      "is_statutory": true
    },
    {
      "objective_id": "PE-KS1-O005",
      "domain_id": "PE-KS1-D004",
      "objective_text": "use a range of strokes effectively [for example, front crawl, backstroke and breaststroke]",
      "non_statutory_guidance": "This can be taught at KS1 or KS2, but must be met by the end of KS2.",
      "examples": "front crawl, backstroke and breaststroke",
      "is_statutory": true
    },
    {
      "objective_id": "PE-KS1-O006",
      "domain_id": "PE-KS1-D004",
      "objective_text": "perform safe self-rescue in different water-based situations",
      "non_statutory_guidance": "This can be taught at KS1 or KS2, but must be met by the end of KS2.",
      "examples": null,
      "is_statutory": true
    }
  ],
  "concepts": [
    {
      "concept_id": "PE-KS1-C001",
      "concept_name": "Fundamental Movement Skills",
      "description": "Fundamental movement skills are the foundational physical competencies that underpin participation in all sports and physical activities. Running, jumping, throwing and catching are the four primary fundamental movement skills specified at KS1; together with balance, agility and co-ordination, they constitute the physical literacy framework. Mastery of these skills in isolation and in combination is the prerequisite for confident, versatile physical participation across the full range of activities in the physical education curriculum.",
      "teaching_guidance": "Use a range of activities that require each fundamental skill in isolation before combining them. For running: vary pace, direction and pathways; use relay and chasing games. For jumping: explore different take-offs and landings; horizontal and vertical jumps. For throwing and catching: vary distances, sizes of object, and types of throw (underarm, overarm, roll). Develop balance through gymnastics balances and yoga-style holds. Build agility through obstacle courses, tag games and direction-change activities. Use rhythmic activities to develop coordination. Record and celebrate pupils' improving competence over time.",
      "key_vocabulary": "run, jump, throw, catch, balance, agility, co-ordination, hop, skip, leap, underarm, overarm, receive, travel, direction, pace",
      "common_misconceptions": "Pupils may believe that physical skill is innate rather than developed through practice. Consistent messaging that all skills can be improved with practice and effort develops a physical growth mindset. Some pupils may have significant developmental differences in motor skills; scaffolding and differentiated tasks ensure all pupils can access and progress. Teachers may focus on the most physically able pupils; deliberate attention to the full range of ability ensures inclusive progress.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false
    },
    {
      "concept_id": "PE-KS1-C002",
      "concept_name": "Game Tactics and Strategy",
      "description": "Tactics in games involve making decisions about what to do and when, in order to gain advantage over opponents or to create scoring opportunities. At KS1, pupils develop simple tactical understanding within small-sided games, learning the basic concepts of attacking (trying to score or gain advantage) and defending (trying to prevent the opposition from scoring). Tactical thinking requires pupils to read the game situation, make decisions quickly and adapt their movement accordingly.",
      "teaching_guidance": "Use small-sided games with simple rules so that tactical decisions are visible and manageable. Start with one-versus-one situations to make attacking and defending clear. Ask pupils questions during and after games: 'What did you do to get past your opponent?' 'Where was the best place to move to?' Use freeze-frame moments to discuss tactical options. Gradually increase the complexity of games as pupils develop tactical understanding. Connect tactical language to real decisions in game contexts rather than teaching it abstractly.",
      "key_vocabulary": "attack, defend, score, opponent, team, tactics, strategy, space, position, pass, intercept, guard, mark, goal, target",
      "common_misconceptions": "Young pupils often focus on the ball and chase it regardless of position, making games chaotic. Teaching about space - both finding and creating it - develops more sophisticated game play. Pupils may not understand the value of passing; small games where passing is rewarded help develop this understanding. Some pupils confuse individual skill with team success; cooperative games build understanding that effective teamwork can outperform individual talent.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false
    },
    {
      "concept_id": "PE-KS1-C003",
      "concept_name": "Expressive Movement and Dance",
      "description": "Dance in physical education develops pupils' ability to use their bodies expressively to communicate ideas, stories, moods and characters through movement. At KS1, pupils work with simple movement patterns, developing the ability to remember and reproduce sequences of movement, to coordinate their movement to music and rhythm, and to use their bodies with creative intention. Dance develops body awareness, spatial awareness, coordination and musicality alongside physical fitness.",
      "teaching_guidance": "Use a variety of stimuli for dance: music, stories, natural phenomena (weather, animals), themes and emotions. Teach specific movement vocabulary: stretching, curling, twisting, turning, travelling, jumping, stillness. Build simple sequences by combining a small number of actions. Use mirroring and copying activities to develop movement observation and reproduction. Encourage pupils to explore and choose their own movement responses within structured frameworks. Perform to each other to develop confidence and the experience of communicating through movement.",
      "key_vocabulary": "movement, pattern, sequence, expression, rhythm, travel, jump, turn, gesture, stillness, shape, level, direction, body part, tempo",
      "common_misconceptions": "Some pupils (particularly boys) may resist dance activities. Framing dance as physical skill development and using stimuli with broad appeal addresses this cultural barrier. Pupils may believe there is one correct way to move; open-ended tasks that reward diverse responses develop creative confidence. Pupils may focus on steps rather than expression; teaching that dance communicates something develops more intentional and expressive performance.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false
    },
    {
      "concept_id": "PE-KS1-C004",
      "concept_name": "Swimming Competence and Water Safety",
      "description": "Swimming competence combines the technical skills of using different swimming strokes with the physical confidence and stamina to swim a sustained distance. Water safety is distinct from swimming skill: it involves the knowledge and physical capability to survive in water in unexpected situations, including the ability to float on one's back and to tread water. At KS1/KS2, pupils develop both swimming skill and water safety awareness as complementary aspects of aquatic competence.",
      "teaching_guidance": "Develop water confidence before stroke technique by using games, floats and supported activity in shallow water. Introduce front crawl, backstroke and breaststroke systematically with clear technique points. Build up distance gradually, initially with floats and then independently. Teach floating and trebling water as explicit water safety skills, distinct from stroke swimming. Discuss scenarios where water safety matters - falling into a river, being in choppy seas - to give context to self-rescue skills. Ensure all pupils have equal access to swimming regardless of cultural or language barriers.",
      "key_vocabulary": "stroke, front crawl, backstroke, breaststroke, breathe, float, tread water, distance, depth, safety, rescue, pool, technique, kick, pull",
      "common_misconceptions": "Pupils and parents may not understand why all three strokes are required; explaining that different strokes are used in different conditions and that versatility is the goal helps. Some pupils may have significant water anxiety; a gradual, supportive approach that builds confidence before technique is essential. The distance of 25 metres can seem arbitrary; explaining that it represents the minimum for safe independent swimming in a pool context helps pupils understand the requirement.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": false
    },
    {
      "concept_id": "PE-KS1-C005",
      "concept_name": "Physical Health and Fitness",
      "description": "Physical education makes a critical contribution to pupils' physical health and wellbeing by developing the habit of regular physical activity and an understanding of its effects on the body. At KS1, pupils begin to understand the relationship between physical activity and health, noticing how their bodies change during exercise and beginning to understand why physical activity is important for overall health and wellbeing. This lays the foundation for the more detailed understanding of fitness and health developed at KS2 and beyond.",
      "teaching_guidance": "Build awareness of physical changes during exercise: breathing rate, heart rate, temperature, tiredness. Discuss why physical activity is good for bodies: strength, flexibility, stamina, heart health. Use simple warm-up and cool-down routines to develop understanding of preparation for and recovery from physical activity. Make connections to healthy lifestyle habits: sleep, nutrition and physical activity as interconnected. Keep the emphasis on enjoyment of physical activity so that positive associations are established early.",
      "key_vocabulary": "healthy, exercise, fitness, heart rate, breathing, warm up, cool down, strength, stamina, flexibility, energy, active, wellbeing, body",
      "common_misconceptions": "Pupils may equate physical activity with formal sport or competition, missing the broad range of physical activities that contribute to health. Teaching that walking, playing and dancing all count helps broaden pupils' concept of physical activity. Some pupils may have negative associations with physical exertion; connecting physical sensations to positive outcomes (feeling energised, improving at a skill) helps develop positive relationships with physical effort.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "PE-KS1-C001",
      "dependent_concept": "PE-KS1-C002",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.85,
      "rationale": "Fundamental movement skills including running, throwing and catching are the physical tools used in game situations; tactical understanding can only be applied when pupils have sufficient physical competence to execute the required movements."
    },
    {
      "prerequisite_concept": "PE-KS1-C001",
      "dependent_concept": "PE-KS1-C003",
      "confidence": "inferred",
      "relationship_type": "logical",
      "strength": 0.7,
      "rationale": "Basic coordination, balance and agility developed through fundamental movement skills provide the physical foundation for the controlled, expressive movement required in dance."
    },
    {
      "prerequisite_concept": "PE-KS1-C003",
      "dependent_concept": "PE-KS1-C005",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.5,
      "rationale": "Regular engagement with dance and other physical activities develops the experiential understanding of how physical exertion affects the body that underpins conceptual knowledge of physical health and fitness."
    }
  ]
}
