{
  "metadata": {
    "subject": "Science",
    "key_stage": "KS2",
    "years_covered": [
      3,
      4,
      5,
      6
    ],
    "document_reference": "DFE-00182-2013",
    "extraction_date": "2026-02-17",
    "structure_rating": 9,
    "notes": "KS2 Science is organised into two tiers: (1) Working Scientifically — a cross-cutting process domain taught through substantive content, split into Lower KS2 (Y3-4) and Upper KS2 (Y5-6) bands; and (2) Content domains split across Biology (Living Things and Habitats, Animals including Humans, Plants, Evolution and Inheritance), Chemistry (Rocks, States of Matter, Properties and Changes of Materials), and Physics (Light, Forces and Magnets, Sound, Electricity, Earth and Space). Topics are distributed across specific years. Strong cross-key-stage prerequisite chains link back to KS1 concepts."
  },
  "domains": [
    {
      "domain_id": "SC-KS2-D001",
      "domain_name": "Working Scientifically",
      "description": "Practical scientific methods, processes and skills taught through and integrated with substantive science content. In Lower KS2 (Y3-4), pupils broaden enquiry skills including fair tests, standard measurements, data recording and drawing conclusions. In Upper KS2 (Y5-6), pupils plan enquiries, control variables, use increasing precision, and evaluate evidence. Must not be taught as a separate strand.",
      "is_cross_cutting": true,
      "structure_type": "mixed",
      "notes": "Split into two bands: Lower KS2 (Y3-4) and Upper KS2 (Y5-6). Progressive development from guided enquiry to increasingly independent scientific investigation.",
      "curriculum_context": "Working scientifically at KS2 underpins all science learning and requires pupils to use a range of scientific methods and processes, progressing from the exploratory approaches of KS1 to systematic, fair-test investigations. Pupils develop the ability to plan different types of scientific enquiry — including observing over time, pattern seeking, classifying, comparative and fair testing, and researching using secondary sources — selecting the most appropriate method for the question being asked. The statutory curriculum requires pupils to recognise that scientific evidence is used to support or refute ideas, to take measurements using standard units, to record and present data in a variety of graphical forms, and to draw conclusions consistent with their evidence. By the end of KS2, pupils should be able to report and present findings from enquiries using appropriate scientific language and representations."
    },
    {
      "domain_id": "SC-KS2-D002",
      "domain_name": "Plants",
      "description": "Biology domain covering plant structure and function, requirements for life and growth, water transport in plants, and the full life cycle of flowering plants including pollination, seed formation and seed dispersal. Year 3 only at KS2.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "notes": "Year 3 only. Builds directly on KS1 plant identification and structure. Moves from naming parts to understanding function and life cycle processes.",
      "curriculum_context": "The Plants domain at KS2 builds on the introductory plant knowledge from KS1 to develop a scientific understanding of the life processes, nutrition and reproduction of plants. Pupils investigate how plants grow and are structured, learning about the functions of the root, stem, leaf and flower in the plant's life cycle. The statutory content requires pupils to explore what plants need for life and growth, to understand photosynthesis as the process by which plants make food from sunlight, water and carbon dioxide, and to understand the process of seed dispersal and pollination. Pupils investigate and observe the growing of plants from seeds and bulbs, developing their ability to conduct systematic observations over time and record changes."
    },
    {
      "domain_id": "SC-KS2-D003",
      "domain_name": "Animals, Including Humans",
      "description": "Biology domain covering nutrition and skeletal/muscular systems (Y3), digestive system and food chains (Y4), human development to old age (Y5), and the circulatory system and healthy lifestyles (Y6). Progressive study of animal and human body systems across KS2.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "notes": "Covered across all four KS2 years with different focus each year. Systematic progression through body systems.",
      "curriculum_context": "Animals Including Humans at KS2 extends pupils' understanding from the basic needs and life processes studied at KS1 to a more detailed understanding of animal biology, nutrition, circulation and reproduction. Pupils learn about the digestive system and the role of nutrition in health, the structure and function of the skeletal and muscular systems, and the circulatory system including the heart and blood. The statutory curriculum requires pupils to investigate the effects of diet, exercise and lifestyle on health and wellbeing, and to understand how offspring inherit characteristics from parents through reproduction. By upper KS2, pupils understand the changes that occur as humans develop from birth to old age, providing a foundation for the more detailed human biology studied at KS3."
    },
    {
      "domain_id": "SC-KS2-D004",
      "domain_name": "Rocks",
      "description": "Chemistry/Earth science domain covering classification of rocks, fossil formation and soil composition. Year 3 only. Provides foundation for later work on evolution and inheritance in Year 6.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "notes": "Year 3 only. Links to geography fieldwork. Fossil knowledge feeds into Year 6 evolution topic.",
      "curriculum_context": "The Rocks domain introduces pupils to the geological materials that make up the Earth's surface, providing a foundation for understanding Earth processes, the rock cycle and the fossil record. Pupils compare and group rocks on the basis of their appearance and physical properties, and learn to distinguish between sedimentary, igneous and metamorphic rocks. The statutory curriculum requires pupils to describe how fossils are formed and understand what they tell us about living things that existed millions of years ago, connecting palaeontology to the concept of evolution. Pupils also study soil, understanding its composition and the role of living organisms and weathering processes in soil formation."
    },
    {
      "domain_id": "SC-KS2-D005",
      "domain_name": "Light",
      "description": "Physics domain covering light sources, reflection, shadows and Sun safety (Y3), progressing to light travelling in straight lines, how we see objects, and explanations of shadows (Y6). Taught in Y3 and revisited with deeper explanation in Y6.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "notes": "Taught in Year 3 (observable phenomena) and Year 6 (explanatory model). Clear conceptual progression.",
      "curriculum_context": "The Light domain at KS2 requires pupils to understand light as a physical phenomenon — how it is produced, how it travels and how it interacts with materials. Pupils discover that light travels in straight lines and that we see because light enters the eye, correcting common misconceptions from younger years. The statutory curriculum requires pupils to investigate how shadows are formed and how their size and shape relate to the position of the light source, and to understand reflection as the mechanism by which mirrors and smooth surfaces change the direction of light. Pupils also explore how light is refracted, providing the conceptual foundation for understanding how lenses and optical instruments work."
    },
    {
      "domain_id": "SC-KS2-D006",
      "domain_name": "Forces and Magnets",
      "description": "Physics domain covering contact and non-contact forces, magnetic attraction and repulsion, magnetic poles, and movement on surfaces. Year 3 only at KS2, with forces revisited more deeply in Year 5.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "notes": "Year 3 only for magnets. Forces (gravity, air/water resistance, friction, mechanisms) covered separately in Year 5.",
      "curriculum_context": "Forces and Magnets at KS2 introduces pupils to the concept of force as an interaction between objects, progressing from the intuitive, qualitative understanding of push and pull in KS1 to a more systematic, measurable account. Pupils investigate how objects move on different surfaces, understanding friction as a force that opposes motion, and explore the properties of magnets — attraction, repulsion and the existence of magnetic fields. The statutory curriculum requires pupils to distinguish between contact forces (friction, air resistance, water resistance) and non-contact forces (gravity, magnetic and electrostatic forces), comparing how objects move on different surfaces. This foundational understanding of forces prepares pupils for the more mathematical treatment of Newton's laws at KS3."
    },
    {
      "domain_id": "SC-KS2-D007",
      "domain_name": "Living Things and Their Habitats",
      "description": "Biology/ecology domain covering classification systems (Y4), life cycles of different animal types (Y5), and formal biological classification including micro-organisms (Y6). Progressive deepening of ecological and taxonomic understanding.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "notes": "Covered in Years 4, 5 and 6. Progression from informal grouping to formal classification systems.",
      "curriculum_context": "Living Things and Their Habitats at KS2 develops pupils' ecological understanding, moving from the simple identification of living and non-living things at KS1 to an understanding of the relationships between organisms and their environments. Pupils classify living things into broad groups (plants, animals, fungi, micro-organisms) using observable characteristics, and understand how classification systems are constructed and used by scientists. The statutory curriculum requires pupils to explore how habitats provide for the basic needs of different organisms, to construct and interpret food chains, and to understand how changes to an environment can affect the living things that depend on it. Pupils are introduced to the concepts of producer, consumer, predator and prey."
    },
    {
      "domain_id": "SC-KS2-D008",
      "domain_name": "States of Matter",
      "description": "Chemistry domain covering solids, liquids and gases, changes of state when heated or cooled, and the water cycle including evaporation and condensation. Year 4 only.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "notes": "Year 4 only. Builds on KS1 materials knowledge. Links to geography (water cycle) and Year 5 (properties and changes of materials).",
      "curriculum_context": "States of Matter at KS2 introduces pupils to the particle model as the scientific explanation for the properties and behaviour of solids, liquids and gases. Pupils compare and group materials together according to whether they are solid, liquid or gas at room temperature, and investigate the processes of evaporation and condensation in the context of the water cycle. The statutory curriculum requires pupils to observe that some materials change state when they are heated or cooled, and to measure or research the temperature at which this happens. This provides the conceptual foundation for understanding thermodynamics, chemical reactions and the physical geography of the water cycle at later stages."
    },
    {
      "domain_id": "SC-KS2-D009",
      "domain_name": "Sound",
      "description": "Physics domain covering vibrations as the source of sound, transmission through media, pitch and volume patterns, and the inverse relationship between distance and sound intensity. Year 4 only.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "notes": "Year 4 only. New topic at KS2 with no direct KS1 prerequisite content, though general observation and pattern-finding skills from KS1 apply.",
      "curriculum_context": "The Sound domain requires pupils to understand sound as a physical phenomenon produced by vibration, and to explore the properties of sound — pitch, volume and the materials through which sound travels. Pupils identify how sounds are made (all sounds result from something vibrating), and understand that vibrations travel through a medium to the ear. The statutory curriculum requires pupils to investigate the relationship between the vibration of a string and the pitch of the sound produced, and to understand how sound is attenuated by distance. Pupils develop the ability to design fair test investigations, measuring and recording sound levels and making predictions about variables that affect pitch and volume."
    },
    {
      "domain_id": "SC-KS2-D010",
      "domain_name": "Electricity",
      "description": "Physics domain covering electrical appliances, constructing series circuits, switches, conductors and insulators (Y4), progressing to voltage, component function and circuit diagrams with standard symbols (Y6).",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "notes": "Year 4 (practical circuits) and Year 6 (explanatory models and symbols). Clear conceptual progression between years.",
      "curriculum_context": "Electricity at KS2 introduces pupils to electric circuits as systems in which energy is transferred from a power source through components. Pupils construct simple series circuits and investigate the effects of adding or removing components, predicting whether a lamp will light based on whether the circuit is complete. The statutory curriculum requires pupils to understand the function of common circuit components — cells, wires, bulbs, switches and buzzers — and to use recognised circuit symbols to draw diagrams. By upper KS2, pupils investigate how circuit properties (voltage, number of cells, component type) affect the behaviour of the circuit, developing the quantitative understanding of electricity that is extended at KS3."
    },
    {
      "domain_id": "SC-KS2-D011",
      "domain_name": "Properties and Changes of Materials",
      "description": "Chemistry domain covering material properties (hardness, solubility, transparency, conductivity, magnetism), solutions, separating mixtures, reversible and irreversible changes. Year 5 only. Builds on KS1 materials and Y4 states of matter.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "notes": "Year 5 only. Major extension of materials knowledge from KS1 and Y4 states of matter.",
      "curriculum_context": "Properties and Changes of Materials at upper KS2 requires pupils to compare and group materials based on physical properties — hardness, solubility, thermal conductivity, response to magnets, transparency — and to investigate mixtures and methods of separating them. Pupils understand that some changes (dissolving, mixing, changes of state) are reversible while others (burning, rusting, reactions involving new substances) are not, and learn to describe the differences using appropriate scientific language. The statutory curriculum requires pupils to investigate whether dissolving, mixing and changes of state produce new materials, providing the foundation for understanding chemical change at KS3."
    },
    {
      "domain_id": "SC-KS2-D012",
      "domain_name": "Earth and Space",
      "description": "Physics/astronomy domain covering the solar system, Earth's rotation, day and night, movement of Moon relative to Earth, and approximately spherical bodies. Year 5 only.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "notes": "Year 5 only. New topic at KS2, though links to KS1 seasonal changes (day length variation, seasons).",
      "curriculum_context": "Earth and Space at upper KS2 provides pupils with an understanding of the solar system, Earth's movements and the phenomena associated with them — day and night, seasons, phases of the Moon. Pupils learn that the Earth, along with other planets, orbits the Sun, and that the Moon orbits the Earth, using models and research to understand the relative sizes, distances and movements of these bodies. The statutory curriculum requires pupils to explain day and night as the result of Earth rotating on its axis, and to understand how this differs from the annual orbit of the Earth around the Sun. This provides important foundations for astronomical and geographical concepts at KS3 and beyond."
    },
    {
      "domain_id": "SC-KS2-D013",
      "domain_name": "Forces",
      "description": "Physics domain covering gravity, air resistance, water resistance, friction, and mechanisms (levers, pulleys, gears). Year 5 only. Builds on Y3 forces and magnets work on contact/non-contact forces.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "notes": "Year 5 only. Extends Y3 forces concepts to include gravity and resistance forces.",
      "curriculum_context": "Forces at upper KS2 moves beyond the qualitative introduction of Year 3 to a more quantitative understanding, including gravity, air resistance, water resistance and mechanisms that can change the effect of forces. Pupils investigate how objects fall due to gravity and explore the effects of air resistance and water resistance in opposing motion. The statutory curriculum requires pupils to understand that some mechanisms — levers, pulleys and gears — allow a smaller force to have a greater effect, introducing the concept of mechanical advantage. Pupils design and evaluate fair tests investigating factors that affect the force of air resistance or water resistance, developing their scientific investigation skills."
    },
    {
      "domain_id": "SC-KS2-D014",
      "domain_name": "Evolution and Inheritance",
      "description": "Biology domain covering fossil evidence for change over time, variation in offspring, adaptation to environments, and the concept of evolution. Year 6 only. Builds on Y3 fossils and Y5 life cycles.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical",
      "notes": "Year 6 only. Synthesises fossil knowledge (Y3), life cycle knowledge (Y5) and classification (Y4/Y6) into evolutionary framework.",
      "curriculum_context": "Evolution and Inheritance at upper KS2 introduces pupils to Charles Darwin's theory of evolution by natural selection as the scientific explanation for the diversity of life on Earth. Pupils learn that living things have changed over millions of years and that fossils provide evidence of organisms that lived long ago, connecting this to the geological evidence studied in the Rocks domain. The statutory curriculum requires pupils to understand that offspring are not identical to their parents (variation), that some variations are advantageous in a particular environment (natural selection), and that this can lead to evolution over many generations. This domain provides the conceptual framework for understanding inheritance, genetics and biodiversity at KS3."
    }
  ],
  "objectives": [
    {
      "objective_id": "SC-KS2-O001",
      "domain_id": "SC-KS2-D001",
      "objective_text": "asking relevant questions and using different types of scientific enquiries to answer them",
      "is_statutory": true,
      "year": [
        3,
        4
      ],
      "notes": "Lower KS2 Working Scientifically. Develops from KS1 simple questioning to choosing appropriate enquiry type."
    },
    {
      "objective_id": "SC-KS2-O002",
      "domain_id": "SC-KS2-D001",
      "objective_text": "setting up simple practical enquiries, comparative and fair tests",
      "is_statutory": true,
      "year": [
        3,
        4
      ],
      "notes": "Lower KS2 Working Scientifically. Introduction to fair testing with identified variables."
    },
    {
      "objective_id": "SC-KS2-O003",
      "domain_id": "SC-KS2-D001",
      "objective_text": "making systematic and careful observations and, where appropriate, taking accurate measurements using standard units, using a range of equipment, including thermometers and data loggers",
      "is_statutory": true,
      "year": [
        3,
        4
      ],
      "notes": "Lower KS2 Working Scientifically. Introduces standard units and specific equipment including thermometers and data loggers."
    },
    {
      "objective_id": "SC-KS2-O004",
      "domain_id": "SC-KS2-D001",
      "objective_text": "gathering, recording, classifying and presenting data in a variety of ways to help in answering questions",
      "is_statutory": true,
      "year": [
        3,
        4
      ],
      "notes": "Lower KS2 Working Scientifically. Extends KS1 data recording to include presenting and classifying."
    },
    {
      "objective_id": "SC-KS2-O005",
      "domain_id": "SC-KS2-D001",
      "objective_text": "recording findings using simple scientific language, drawings, labelled diagrams, keys, bar charts, and tables",
      "is_statutory": true,
      "year": [
        3,
        4
      ],
      "notes": "Lower KS2 Working Scientifically. Introduces keys and bar charts as recording formats."
    },
    {
      "objective_id": "SC-KS2-O006",
      "domain_id": "SC-KS2-D001",
      "objective_text": "reporting on findings from enquiries, including oral and written explanations, displays or presentations of results and conclusions",
      "is_statutory": true,
      "year": [
        3,
        4
      ],
      "notes": "Lower KS2 Working Scientifically. Moves towards written explanations and formal presentations."
    },
    {
      "objective_id": "SC-KS2-O007",
      "domain_id": "SC-KS2-D001",
      "objective_text": "using results to draw simple conclusions, make predictions for new values, suggest improvements and raise further questions",
      "is_statutory": true,
      "year": [
        3,
        4
      ],
      "notes": "Lower KS2 Working Scientifically. Introduces prediction and iterative improvement of investigations."
    },
    {
      "objective_id": "SC-KS2-O008",
      "domain_id": "SC-KS2-D001",
      "objective_text": "identifying differences, similarities or changes related to simple scientific ideas and processes",
      "is_statutory": true,
      "year": [
        3,
        4
      ],
      "notes": "Lower KS2 Working Scientifically. Analytical comparison linked to scientific concepts."
    },
    {
      "objective_id": "SC-KS2-O009",
      "domain_id": "SC-KS2-D001",
      "objective_text": "using straightforward scientific evidence to answer questions or to support their findings",
      "is_statutory": true,
      "year": [
        3,
        4
      ],
      "notes": "Lower KS2 Working Scientifically. Introduction to evidence-based reasoning."
    },
    {
      "objective_id": "SC-KS2-O010",
      "domain_id": "SC-KS2-D001",
      "objective_text": "planning different types of scientific enquiries to answer questions, including recognising and controlling variables where necessary",
      "is_statutory": true,
      "year": [
        5,
        6
      ],
      "notes": "Upper KS2 Working Scientifically. Introduces variable control as a key concept of experimental design."
    },
    {
      "objective_id": "SC-KS2-O011",
      "domain_id": "SC-KS2-D001",
      "objective_text": "taking measurements, using a range of scientific equipment, with increasing accuracy and precision, taking repeat readings when appropriate",
      "is_statutory": true,
      "year": [
        5,
        6
      ],
      "notes": "Upper KS2 Working Scientifically. Introduces precision, accuracy and repeat readings."
    },
    {
      "objective_id": "SC-KS2-O012",
      "domain_id": "SC-KS2-D001",
      "objective_text": "recording data and results of increasing complexity using scientific diagrams and labels, classification keys, tables, scatter graphs, bar and line graphs",
      "is_statutory": true,
      "year": [
        5,
        6
      ],
      "notes": "Upper KS2 Working Scientifically. Adds scatter graphs and line graphs to recording repertoire."
    },
    {
      "objective_id": "SC-KS2-O013",
      "domain_id": "SC-KS2-D001",
      "objective_text": "using test results to make predictions to set up further comparative and fair tests",
      "is_statutory": true,
      "year": [
        5,
        6
      ],
      "notes": "Upper KS2 Working Scientifically. Iterative scientific process — results informing future investigations."
    },
    {
      "objective_id": "SC-KS2-O014",
      "domain_id": "SC-KS2-D001",
      "objective_text": "reporting and presenting findings from enquiries, including conclusions, causal relationships and explanations of and degree of trust in results, in oral and written forms such as displays and other presentations",
      "is_statutory": true,
      "year": [
        5,
        6
      ],
      "notes": "Upper KS2 Working Scientifically. Introduces causal relationships and critical evaluation of trust in results."
    },
    {
      "objective_id": "SC-KS2-O015",
      "domain_id": "SC-KS2-D001",
      "objective_text": "identifying scientific evidence that has been used to support or refute ideas or arguments",
      "is_statutory": true,
      "year": [
        5,
        6
      ],
      "notes": "Upper KS2 Working Scientifically. Critical evaluation of evidence — including secondary sources and the work of scientists."
    },
    {
      "objective_id": "SC-KS2-O016",
      "domain_id": "SC-KS2-D002",
      "objective_text": "identify and describe the functions of different parts of flowering plants: roots, stem/trunk, leaves and flowers",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Plants. Moves from KS1 naming of parts to understanding their functional roles."
    },
    {
      "objective_id": "SC-KS2-O017",
      "domain_id": "SC-KS2-D002",
      "objective_text": "explore the requirements of plants for life and growth (air, light, water, nutrients from soil, and room to grow) and how they vary from plant to plant",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Plants. Extends KS1 water/light/temperature to include air, nutrients and space. Adds variation between plant species."
    },
    {
      "objective_id": "SC-KS2-O018",
      "domain_id": "SC-KS2-D002",
      "objective_text": "investigate the way in which water is transported within plants",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Plants. Links structure (stem) to function (water transport). Example: white carnations in coloured water."
    },
    {
      "objective_id": "SC-KS2-O019",
      "domain_id": "SC-KS2-D002",
      "objective_text": "explore the part that flowers play in the life cycle of flowering plants, including pollination, seed formation and seed dispersal",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Plants. Introduces reproductive aspects of plant life cycle: pollination, seed formation, dispersal."
    },
    {
      "objective_id": "SC-KS2-O020",
      "domain_id": "SC-KS2-D003",
      "objective_text": "identify that animals, including humans, need the right types and amount of nutrition, and that they cannot make their own food; they get nutrition from what they eat",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Animals including Humans. Extends KS1 basic needs to distinguish animal nutrition from plant nutrition (animals cannot make own food)."
    },
    {
      "objective_id": "SC-KS2-O021",
      "domain_id": "SC-KS2-D003",
      "objective_text": "identify that humans and some other animals have skeletons and muscles for support, protection and movement",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Animals including Humans. Introduces skeletal and muscular systems and their functions."
    },
    {
      "objective_id": "SC-KS2-O022",
      "domain_id": "SC-KS2-D004",
      "objective_text": "compare and group together different kinds of rocks on the basis of their appearance and simple physical properties",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Rocks. New KS2 topic. Classification of rocks extends KS1 materials classification skills."
    },
    {
      "objective_id": "SC-KS2-O023",
      "domain_id": "SC-KS2-D004",
      "objective_text": "describe in simple terms how fossils are formed when things that have lived are trapped within rock",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Rocks. Introduction to fossil formation. Feeds into Y6 evolution topic."
    },
    {
      "objective_id": "SC-KS2-O024",
      "domain_id": "SC-KS2-D004",
      "objective_text": "recognise that soils are made from rocks and organic matter",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Rocks. Links rocks to soil composition. Connects to plant growth requirements (nutrients from soil)."
    },
    {
      "objective_id": "SC-KS2-O025",
      "domain_id": "SC-KS2-D005",
      "objective_text": "recognise that they need light in order to see things and that dark is the absence of light",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Light. Foundation concept: light enables vision; darkness is absence of light."
    },
    {
      "objective_id": "SC-KS2-O026",
      "domain_id": "SC-KS2-D005",
      "objective_text": "notice that light is reflected from surfaces",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Light. Observable reflection phenomena."
    },
    {
      "objective_id": "SC-KS2-O027",
      "domain_id": "SC-KS2-D005",
      "objective_text": "recognise that light from the sun can be dangerous and that there are ways to protect their eyes",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Light. Safety awareness about direct sunlight."
    },
    {
      "objective_id": "SC-KS2-O028",
      "domain_id": "SC-KS2-D005",
      "objective_text": "recognise that shadows are formed when the light from a light source is blocked by an opaque object",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Light. Explains shadow formation in terms of light blocking by opaque objects."
    },
    {
      "objective_id": "SC-KS2-O029",
      "domain_id": "SC-KS2-D005",
      "objective_text": "find patterns in the way that the size of shadows change",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Light. Pattern-seeking enquiry: how shadow size varies with position of light source or object."
    },
    {
      "objective_id": "SC-KS2-O030",
      "domain_id": "SC-KS2-D006",
      "objective_text": "compare how things move on different surfaces",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Forces and Magnets. Observing friction effects on movement."
    },
    {
      "objective_id": "SC-KS2-O031",
      "domain_id": "SC-KS2-D006",
      "objective_text": "notice that some forces need contact between two objects, but magnetic forces can act at a distance",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Forces and Magnets. Key distinction: contact vs non-contact forces."
    },
    {
      "objective_id": "SC-KS2-O032",
      "domain_id": "SC-KS2-D006",
      "objective_text": "observe how magnets attract or repel each other and attract some materials and not others",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Forces and Magnets. Observable magnetic behaviour: attraction and repulsion."
    },
    {
      "objective_id": "SC-KS2-O033",
      "domain_id": "SC-KS2-D006",
      "objective_text": "compare and group together a variety of everyday materials on the basis of whether they are attracted to a magnet, and identify some magnetic materials",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Forces and Magnets. Classification of materials by magnetic properties."
    },
    {
      "objective_id": "SC-KS2-O034",
      "domain_id": "SC-KS2-D006",
      "objective_text": "describe magnets as having two poles",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Forces and Magnets. Introduces concept of magnetic poles."
    },
    {
      "objective_id": "SC-KS2-O035",
      "domain_id": "SC-KS2-D006",
      "objective_text": "predict whether two magnets will attract or repel each other, depending on which poles are facing",
      "is_statutory": true,
      "year": [
        3
      ],
      "notes": "Year 3 Forces and Magnets. Applying understanding of poles to make predictions — like poles repel, unlike poles attract."
    },
    {
      "objective_id": "SC-KS2-O036",
      "domain_id": "SC-KS2-D007",
      "objective_text": "recognise that living things can be grouped in a variety of ways",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Living Things and Their Habitats. Introduces flexible classification — different criteria yield different groupings."
    },
    {
      "objective_id": "SC-KS2-O037",
      "domain_id": "SC-KS2-D007",
      "objective_text": "explore and use classification keys to help group, identify and name a variety of living things in their local and wider environment",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Living Things and Their Habitats. Introduces classification keys as a tool for identification."
    },
    {
      "objective_id": "SC-KS2-O038",
      "domain_id": "SC-KS2-D007",
      "objective_text": "recognise that environments can change and that this can sometimes pose dangers to living things",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Living Things and Their Habitats. Environmental change and impact on living things. Includes human impact (positive and negative)."
    },
    {
      "objective_id": "SC-KS2-O039",
      "domain_id": "SC-KS2-D003",
      "objective_text": "describe the simple functions of the basic parts of the digestive system in humans",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Animals including Humans. Introduces digestive system: mouth, tongue, teeth, oesophagus, stomach, small and large intestine."
    },
    {
      "objective_id": "SC-KS2-O040",
      "domain_id": "SC-KS2-D003",
      "objective_text": "identify the different types of teeth in humans and their simple functions",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Animals including Humans. Types of teeth (incisors, canines, molars) and their functions in digestion."
    },
    {
      "objective_id": "SC-KS2-O041",
      "domain_id": "SC-KS2-D003",
      "objective_text": "construct and interpret a variety of food chains, identifying producers, predators and prey",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Animals including Humans. Extends KS1 simple food chains to include producer/predator/prey terminology."
    },
    {
      "objective_id": "SC-KS2-O042",
      "domain_id": "SC-KS2-D008",
      "objective_text": "compare and group materials together, according to whether they are solids, liquids or gases",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 States of Matter. Introduces three states of matter as a classification framework."
    },
    {
      "objective_id": "SC-KS2-O043",
      "domain_id": "SC-KS2-D008",
      "objective_text": "observe that some materials change state when they are heated or cooled, and measure or research the temperature at which this happens in degrees Celsius (°C)",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 States of Matter. Introduces temperature measurement linked to state changes."
    },
    {
      "objective_id": "SC-KS2-O044",
      "domain_id": "SC-KS2-D008",
      "objective_text": "identify the part played by evaporation and condensation in the water cycle and associate the rate of evaporation with temperature",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 States of Matter. Links state changes to the water cycle. Introduces evaporation rate as temperature-dependent."
    },
    {
      "objective_id": "SC-KS2-O045",
      "domain_id": "SC-KS2-D009",
      "objective_text": "identify how sounds are made, associating some of them with something vibrating",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Sound. Fundamental concept: sound is caused by vibration."
    },
    {
      "objective_id": "SC-KS2-O046",
      "domain_id": "SC-KS2-D009",
      "objective_text": "recognise that vibrations from sounds travel through a medium to the ear",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Sound. Sound transmission through media — solid, liquid, gas."
    },
    {
      "objective_id": "SC-KS2-O047",
      "domain_id": "SC-KS2-D009",
      "objective_text": "find patterns between the pitch of a sound and features of the object that produced it",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Sound. Pitch patterns: longer/larger objects produce lower pitch. Example: saucepan lids, elastic bands."
    },
    {
      "objective_id": "SC-KS2-O048",
      "domain_id": "SC-KS2-D009",
      "objective_text": "find patterns between the volume of a sound and the strength of the vibrations that produced it",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Sound. Volume/amplitude relationship to vibration strength."
    },
    {
      "objective_id": "SC-KS2-O049",
      "domain_id": "SC-KS2-D009",
      "objective_text": "recognise that sounds get fainter as the distance from the sound source increases",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Sound. Inverse relationship between distance and sound intensity."
    },
    {
      "objective_id": "SC-KS2-O050",
      "domain_id": "SC-KS2-D010",
      "objective_text": "identify common appliances that run on electricity",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Electricity. Contextual awareness of electrical devices in everyday life."
    },
    {
      "objective_id": "SC-KS2-O051",
      "domain_id": "SC-KS2-D010",
      "objective_text": "construct a simple series electrical circuit, identifying and naming its basic parts, including cells, wires, bulbs, switches and buzzers",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Electricity. Practical circuit construction. Components: cells, wires, bulbs, switches, buzzers."
    },
    {
      "objective_id": "SC-KS2-O052",
      "domain_id": "SC-KS2-D010",
      "objective_text": "identify whether or not a lamp will light in a simple series circuit, based on whether or not the lamp is part of a complete loop with a battery",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Electricity. Complete circuit concept — current requires an unbroken loop."
    },
    {
      "objective_id": "SC-KS2-O053",
      "domain_id": "SC-KS2-D010",
      "objective_text": "recognise that a switch opens and closes a circuit and associate this with whether or not a lamp lights in a simple series circuit",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Electricity. Function of switches in completing/breaking circuits."
    },
    {
      "objective_id": "SC-KS2-O054",
      "domain_id": "SC-KS2-D010",
      "objective_text": "recognise some common conductors and insulators, and associate metals with being good conductors",
      "is_statutory": true,
      "year": [
        4
      ],
      "notes": "Year 4 Electricity. Introduces conductors and insulators. Metals as conductors. Links to Y5 properties of materials."
    },
    {
      "objective_id": "SC-KS2-O055",
      "domain_id": "SC-KS2-D007",
      "objective_text": "describe the differences in the life cycles of a mammal, an amphibian, an insect and a bird",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Living Things and Their Habitats. Comparative study of life cycles across four animal groups."
    },
    {
      "objective_id": "SC-KS2-O056",
      "domain_id": "SC-KS2-D007",
      "objective_text": "describe the life process of reproduction in some plants and animals",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Living Things and Their Habitats. Sexual and asexual reproduction in plants; sexual reproduction in animals."
    },
    {
      "objective_id": "SC-KS2-O057",
      "domain_id": "SC-KS2-D003",
      "objective_text": "describe the changes as humans develop to old age",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Animals including Humans. Full human life span from birth to old age, including puberty. Draws a timeline of growth stages."
    },
    {
      "objective_id": "SC-KS2-O058",
      "domain_id": "SC-KS2-D011",
      "objective_text": "compare and group together everyday materials on the basis of their properties, including their hardness, solubility, transparency, conductivity (electrical and thermal), and response to magnets",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Properties and Changes of Materials. Systematic material properties including solubility and conductivity — links to Y3 magnets and Y4 electricity."
    },
    {
      "objective_id": "SC-KS2-O059",
      "domain_id": "SC-KS2-D011",
      "objective_text": "know that some materials will dissolve in liquid to form a solution, and describe how to recover a substance from a solution",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Properties and Changes of Materials. Introduces dissolving, solutions and recovery (evaporation)."
    },
    {
      "objective_id": "SC-KS2-O060",
      "domain_id": "SC-KS2-D011",
      "objective_text": "use knowledge of solids, liquids and gases to decide how mixtures might be separated, including through filtering, sieving and evaporating",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Properties and Changes of Materials. Separation techniques using states of matter knowledge from Y4."
    },
    {
      "objective_id": "SC-KS2-O061",
      "domain_id": "SC-KS2-D011",
      "objective_text": "give reasons, based on evidence from comparative and fair tests, for the particular uses of everyday materials, including metals, wood and plastic",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Properties and Changes of Materials. Evidence-based reasoning about material selection — extends KS1 material suitability."
    },
    {
      "objective_id": "SC-KS2-O062",
      "domain_id": "SC-KS2-D011",
      "objective_text": "demonstrate that dissolving, mixing and changes of state are reversible changes",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Properties and Changes of Materials. Concept of reversibility in material changes."
    },
    {
      "objective_id": "SC-KS2-O063",
      "domain_id": "SC-KS2-D011",
      "objective_text": "explain that some changes result in the formation of new materials, and that this kind of change is not usually reversible, including changes associated with burning and the action of acid on bicarbonate of soda",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Properties and Changes of Materials. Irreversible chemical changes — burning, acid reactions. Contrasts with reversible changes."
    },
    {
      "objective_id": "SC-KS2-O064",
      "domain_id": "SC-KS2-D012",
      "objective_text": "describe the movement of the Earth, and other planets, relative to the Sun in the solar system",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Earth and Space. Heliocentric model of solar system. Eight planets named."
    },
    {
      "objective_id": "SC-KS2-O065",
      "domain_id": "SC-KS2-D012",
      "objective_text": "describe the movement of the Moon relative to the Earth",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Earth and Space. Moon as Earth's natural satellite — orbital relationship."
    },
    {
      "objective_id": "SC-KS2-O066",
      "domain_id": "SC-KS2-D012",
      "objective_text": "describe the Sun, Earth and Moon as approximately spherical bodies",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Earth and Space. Shape of celestial bodies — approximately spherical (not flat)."
    },
    {
      "objective_id": "SC-KS2-O067",
      "domain_id": "SC-KS2-D012",
      "objective_text": "use the idea of the Earth's rotation to explain day and night and the apparent movement of the sun across the sky",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Earth and Space. Earth's 24-hour rotation explains day/night cycle and apparent solar movement. Links to KS1 day length variation."
    },
    {
      "objective_id": "SC-KS2-O068",
      "domain_id": "SC-KS2-D013",
      "objective_text": "explain that unsupported objects fall towards the Earth because of the force of gravity acting between the Earth and the falling object",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Forces. Introduces gravity as a non-contact force acting between Earth and objects."
    },
    {
      "objective_id": "SC-KS2-O069",
      "domain_id": "SC-KS2-D013",
      "objective_text": "identify the effects of air resistance, water resistance and friction, that act between moving surfaces",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Forces. Resistance forces opposing motion. Builds on Y3 friction observations."
    },
    {
      "objective_id": "SC-KS2-O070",
      "domain_id": "SC-KS2-D013",
      "objective_text": "recognise that some mechanisms, including levers, pulleys and gears, allow a smaller force to have a greater effect",
      "is_statutory": true,
      "year": [
        5
      ],
      "notes": "Year 5 Forces. Simple machines as force multipliers — levers, pulleys, gears."
    },
    {
      "objective_id": "SC-KS2-O071",
      "domain_id": "SC-KS2-D007",
      "objective_text": "describe how living things are classified into broad groups according to common observable characteristics and based on similarities and differences, including micro-organisms, plants and animals",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Living Things and Their Habitats. Formal classification system — micro-organisms, plants, animals; vertebrates and invertebrates."
    },
    {
      "objective_id": "SC-KS2-O072",
      "domain_id": "SC-KS2-D007",
      "objective_text": "give reasons for classifying plants and animals based on specific characteristics",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Living Things and Their Habitats. Justifying classification decisions using evidence of shared characteristics."
    },
    {
      "objective_id": "SC-KS2-O073",
      "domain_id": "SC-KS2-D003",
      "objective_text": "identify and name the main parts of the human circulatory system, and describe the functions of the heart, blood vessels and blood",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Animals including Humans. Circulatory system: heart, arteries, veins, capillaries, blood. Functions of each component."
    },
    {
      "objective_id": "SC-KS2-O074",
      "domain_id": "SC-KS2-D003",
      "objective_text": "recognise the impact of diet, exercise, drugs and lifestyle on the way their bodies function",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Animals including Humans. Extends KS1 health knowledge to include drugs and fuller lifestyle factors."
    },
    {
      "objective_id": "SC-KS2-O075",
      "domain_id": "SC-KS2-D003",
      "objective_text": "describe the ways in which nutrients and water are transported within animals, including humans",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Animals including Humans. Circulatory system as transport system for nutrients and water. Links digestive and circulatory systems."
    },
    {
      "objective_id": "SC-KS2-O076",
      "domain_id": "SC-KS2-D014",
      "objective_text": "recognise that living things have changed over time and that fossils provide information about living things that inhabited the Earth millions of years ago",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Evolution and Inheritance. Fossils as evidence of change over time. Builds on Y3 fossil formation."
    },
    {
      "objective_id": "SC-KS2-O077",
      "domain_id": "SC-KS2-D014",
      "objective_text": "recognise that living things produce offspring of the same kind, but normally offspring vary and are not identical to their parents",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Evolution and Inheritance. Introduces variation in offspring. Foundation for understanding natural selection. Note: genes/chromosomes not required at this stage."
    },
    {
      "objective_id": "SC-KS2-O078",
      "domain_id": "SC-KS2-D014",
      "objective_text": "identify how animals and plants are adapted to suit their environment in different ways and that adaptation may lead to evolution",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Evolution and Inheritance. Adaptation and evolution concept. Examples: giraffe necks, arctic fox fur."
    },
    {
      "objective_id": "SC-KS2-O079",
      "domain_id": "SC-KS2-D005",
      "objective_text": "recognise that light appears to travel in straight lines",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Light. Explanatory model — light travels in straight lines. Builds on Y3 observable light phenomena."
    },
    {
      "objective_id": "SC-KS2-O080",
      "domain_id": "SC-KS2-D005",
      "objective_text": "use the idea that light travels in straight lines to explain that objects are seen because they give out or reflect light into the eye",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Light. Applying the straight-line model to explain vision — distinguishes light sources from reflectors."
    },
    {
      "objective_id": "SC-KS2-O081",
      "domain_id": "SC-KS2-D005",
      "objective_text": "explain that we see things because light travels from light sources to our eyes or from light sources to objects and then to our eyes",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Light. Full model of vision: direct light sources and reflected light from objects."
    },
    {
      "objective_id": "SC-KS2-O082",
      "domain_id": "SC-KS2-D005",
      "objective_text": "use the idea that light travels in straight lines to explain why shadows have the same shape as the objects that cast them",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Light. Explains shadow shape using straight-line light model. Builds on Y3 shadow observations."
    },
    {
      "objective_id": "SC-KS2-O083",
      "domain_id": "SC-KS2-D010",
      "objective_text": "associate the brightness of a lamp or the volume of a buzzer with the number and voltage of cells used in the circuit",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Electricity. Introduces voltage concept as affecting component output."
    },
    {
      "objective_id": "SC-KS2-O084",
      "domain_id": "SC-KS2-D010",
      "objective_text": "compare and give reasons for variations in how components function, including the brightness of bulbs, the loudness of buzzers and the on/off position of switches",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Electricity. Systematic investigation of circuit components. Explaining variations in component behaviour."
    },
    {
      "objective_id": "SC-KS2-O085",
      "domain_id": "SC-KS2-D010",
      "objective_text": "use recognised symbols when representing a simple circuit in a diagram",
      "is_statutory": true,
      "year": [
        6
      ],
      "notes": "Year 6 Electricity. Formal circuit diagrams with standard symbols — introduced here after pictorial representation in Y4."
    }
  ],
  "concepts": [
    {
      "concept_id": "SC-KS2-C001",
      "concept_name": "Relevant Questioning and Enquiry Selection",
      "description": "The ability to ask relevant scientific questions and select the most appropriate type of scientific enquiry to answer them (observation over time, pattern seeking, classifying, fair testing, secondary research). Develops from KS1 simple questioning to active enquiry design.",
      "concept_type": "process",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "domain_id": "SC-KS2-D001",
      "year": [
        3,
        4
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C002",
      "concept_name": "Fair and Comparative Testing",
      "description": "Setting up simple practical enquiries as fair tests, recognising and controlling variables. Understanding that a fair test changes only one variable at a time while keeping others constant, enabling valid comparisons.",
      "concept_type": "process",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "domain_id": "SC-KS2-D001",
      "year": [
        3,
        4
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C003",
      "concept_name": "Systematic Measurement with Standard Units",
      "description": "Making systematic and careful observations using standard units (e.g., degrees Celsius, metres, grams). Using a range of equipment including thermometers and data loggers. Increasing accuracy over Lower KS2.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "domain_id": "SC-KS2-D001",
      "year": [
        3,
        4
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C004",
      "concept_name": "Data Classification and Presentation",
      "description": "Gathering, recording, classifying and presenting data in a variety of ways: simple scientific language, labelled diagrams, classification keys, bar charts, and tables. Moving from recording towards analytical presentation.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "domain_id": "SC-KS2-D001",
      "year": [
        3,
        4
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C005",
      "concept_name": "Drawing Conclusions and Predictions",
      "description": "Using results to draw simple conclusions, make predictions for new values, suggest improvements and raise further questions. Iterative development of scientific understanding through evidence-based reasoning.",
      "concept_type": "process",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "domain_id": "SC-KS2-D001",
      "year": [
        3,
        4
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C006",
      "concept_name": "Scientific Reporting and Communication",
      "description": "Reporting on findings from enquiries through oral and written explanations, displays and presentations. Using scientific language and illustrations to communicate findings to different audiences.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": true,
      "domain_id": "SC-KS2-D001",
      "year": [
        3,
        4
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C007",
      "concept_name": "Variable Control in Enquiry Planning",
      "description": "Planning scientific enquiries by recognising and controlling variables where necessary. Understanding which variables to keep constant, which to change, and which to measure. Required for valid experimental design.",
      "concept_type": "process",
      "complexity_level": 4,
      "is_cross_cutting": true,
      "domain_id": "SC-KS2-D001",
      "year": [
        5,
        6
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C008",
      "concept_name": "Precision and Repeat Measurements",
      "description": "Taking measurements with increasing accuracy and precision using a range of scientific equipment. Understanding the value of repeat readings to improve reliability and identify anomalies.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": true,
      "domain_id": "SC-KS2-D001",
      "year": [
        5,
        6
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C009",
      "concept_name": "Complex Data Recording",
      "description": "Recording data and results of increasing complexity using scatter graphs, line graphs, bar charts, classification keys, tables and scientific diagrams. Selecting the most appropriate representation for different types of data.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": true,
      "domain_id": "SC-KS2-D001",
      "year": [
        5,
        6
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C010",
      "concept_name": "Causal Relationships and Evidence Evaluation",
      "description": "Identifying causal relationships in data. Evaluating degree of trust in results. Identifying scientific evidence that supports or refutes ideas and arguments. Distinguishing opinion from fact in secondary sources.",
      "concept_type": "process",
      "complexity_level": 4,
      "is_cross_cutting": true,
      "domain_id": "SC-KS2-D001",
      "year": [
        5,
        6
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C011",
      "concept_name": "Plant Part Functions",
      "description": "Understanding that different parts of flowering plants have specific functions: roots (anchorage and water/nutrient uptake), stems/trunks (support and water transport), leaves (photosynthesis and gas exchange), flowers (reproduction). Structure-function relationship.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D002",
      "year": [
        3
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C012",
      "concept_name": "Plant Requirements for Life and Growth",
      "description": "Understanding that plants need air, light, water, nutrients from soil, and room to grow. These requirements vary between plant species. Plants can make their own food (photosynthesis concept introduced without detailed mechanism).",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D002",
      "year": [
        3
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C013",
      "concept_name": "Water Transport in Plants",
      "description": "Understanding that water is transported upward within plants through the stem to leaves and flowers. Observable through the coloured carnation investigation. Links root function to water availability and stem function to transport.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D002",
      "year": [
        3
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C014",
      "concept_name": "Flowering Plant Life Cycle",
      "description": "Understanding the complete life cycle of flowering plants: germination, growth, pollination, seed formation, seed dispersal, and back to germination. Understanding the role of flowers in reproduction and the variety of seed dispersal mechanisms.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D002",
      "year": [
        3
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C015",
      "concept_name": "Pollination",
      "description": "Understanding that pollination is the transfer of pollen between flowers, enabling seed formation. Part of the flowering plant reproductive cycle. Includes wind and insect pollination.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D002",
      "year": [
        3
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C016",
      "concept_name": "Seed Dispersal",
      "description": "Understanding that seeds are dispersed from parent plants by various mechanisms including wind, water, animals (internally and externally) and explosive mechanisms. Structure of fruits relates to dispersal method.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D002",
      "year": [
        3
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C017",
      "concept_name": "Animal Nutrition",
      "description": "Understanding that animals, including humans, require the right types and amounts of nutrition and cannot make their own food — they obtain nutrition from what they eat. Contrasts with plants which can make their own food.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D003",
      "year": [
        3
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C018",
      "concept_name": "Skeletal and Muscular Systems",
      "description": "Understanding that humans and some other animals have skeletons for support, protection and movement. Muscles are attached to bones and enable movement by contracting and relaxing. Different body parts have different skeletal structures suited to their functions.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D003",
      "year": [
        3
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C019",
      "concept_name": "Rock Classification",
      "description": "Understanding that rocks can be grouped and compared based on appearance and physical properties such as grain size, crystal structure, hardness, porosity, and whether they contain fossils. Examples: igneous, sedimentary, metamorphic (informal introduction).",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D004",
      "year": [
        3
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C020",
      "concept_name": "Fossil Formation",
      "description": "Understanding in simple terms how fossils are formed when the remains or traces of living things are trapped within sedimentary rock over millions of years. Fossils provide evidence of past life on Earth.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D004",
      "year": [
        3
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C021",
      "concept_name": "Soil Composition",
      "description": "Understanding that soils are made from rock particles (formed by weathering) and organic matter (decayed living material). Different soils have different properties depending on their rock and organic matter composition.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D004",
      "year": [
        3
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C022",
      "concept_name": "Light and Vision",
      "description": "Understanding that light is needed to see — dark is the absence of light. In Year 3, this is the observable phenomenon; in Year 6, it is explained using the model that light travels in straight lines from sources to eyes or via reflection.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D005",
      "year": [
        3
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C023",
      "concept_name": "Reflection of Light",
      "description": "Understanding that light is reflected from surfaces, including mirrors and other reflective materials. In Year 3 this is observed; in Year 6 it is explained using the straight-line travel model.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D005",
      "year": [
        3
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C024",
      "concept_name": "Shadow Formation",
      "description": "Understanding that shadows are formed when light from a source is blocked by an opaque object. In Year 3, the pattern of shadow size changes is explored. In Year 6, shadow shape is explained using the straight-line travel model.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D005",
      "year": [
        3,
        6
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C025",
      "concept_name": "Contact and Non-Contact Forces",
      "description": "Understanding that most forces require direct contact between objects (e.g., pushing, pulling, friction) but some forces, notably magnetic forces and gravity, can act at a distance without direct contact.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D006",
      "year": [
        3
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C026",
      "concept_name": "Magnetic Properties",
      "description": "Understanding that magnets attract some materials (magnetic materials, principally metals containing iron, nickel or cobalt) and not others. Magnets have two poles (north and south); like poles repel and unlike poles attract. Magnetic force acts at a distance.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D006",
      "year": [
        3
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C027",
      "concept_name": "Friction and Movement on Surfaces",
      "description": "Understanding that the surface of an object affects how it moves — rough surfaces produce more friction and slow objects down more than smooth surfaces. Friction is a contact force.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D006",
      "year": [
        3
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C028",
      "concept_name": "Classification Keys",
      "description": "Using and making simple branching keys (dichotomous keys) to identify and classify living things by asking yes/no questions about observable characteristics. An important tool in biological identification.",
      "concept_type": "skill",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D007",
      "year": [
        4
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C029",
      "concept_name": "Variety of Classification Criteria",
      "description": "Understanding that living things can be grouped in many different ways depending on the characteristics chosen as criteria. No single correct grouping — different criteria produce different and equally valid classifications.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D007",
      "year": [
        4
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C030",
      "concept_name": "Environmental Change and Impact",
      "description": "Understanding that environments change over time (seasonal changes, human impact) and that these changes can sometimes pose dangers to living things. Includes positive and negative human impacts on environments.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D007",
      "year": [
        4
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C031",
      "concept_name": "Digestive System",
      "description": "Understanding the functions of the basic parts of the human digestive system: mouth (chewing, saliva), oesophagus (transport), stomach (churning, digestion), small intestine (nutrient absorption), large intestine (water absorption). Food is broken down to release nutrients.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D003",
      "year": [
        4
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C032",
      "concept_name": "Types and Functions of Teeth",
      "description": "Understanding that humans have different types of teeth with different functions: incisors (cutting), canines (tearing), premolars and molars (grinding). Diet of carnivores and herbivores relates to different tooth structures.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D003",
      "year": [
        4
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C033",
      "concept_name": "Food Chains with Producers, Predators and Prey",
      "description": "Constructing and interpreting food chains that include producers (plants), consumers, predators and prey. Understanding that food chains show the flow of energy and that producers are always the starting point. Extends KS1 simple food chains.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D003",
      "year": [
        4
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C034",
      "concept_name": "Three States of Matter",
      "description": "Understanding that materials can be classified as solids, liquids or gases based on their observable properties. Solids hold their shape; liquids form a pool but not a pile; gases escape from unsealed containers and are not visible.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D008",
      "year": [
        4
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C035",
      "concept_name": "Changes of State",
      "description": "Understanding that materials change state when heated or cooled: melting (solid to liquid), freezing (liquid to solid), evaporation/boiling (liquid to gas), condensation (gas to liquid). Temperature at which state changes occur can be measured in degrees Celsius.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D008",
      "year": [
        4
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C036",
      "concept_name": "The Water Cycle",
      "description": "Understanding that evaporation and condensation are key processes in the water cycle. Water evaporates from oceans, lakes and land when heated; water vapour condenses to form clouds; precipitation returns water to the surface. Rate of evaporation increases with temperature.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D008",
      "year": [
        4
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C037",
      "concept_name": "Vibration as the Cause of Sound",
      "description": "Understanding that all sounds are made by vibrating objects. The vibration causes surrounding particles to vibrate, transmitting the sound as a wave through the medium (solid, liquid or gas) to the ear.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D009",
      "year": [
        4
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C038",
      "concept_name": "Sound Transmission Through Media",
      "description": "Understanding that vibrations from sounds travel through a medium (solid, liquid or gas) to the ear. Sound cannot travel through a vacuum. Sound travels through different media at different speeds.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D009",
      "year": [
        4
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C039",
      "concept_name": "Pitch and Sound Source Features",
      "description": "Understanding that the pitch of a sound is related to features of the object producing it. Longer, larger or looser objects produce lower pitch sounds. Shorter, smaller or tighter objects produce higher pitch sounds. Patterns can be found and investigated.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D009",
      "year": [
        4
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C040",
      "concept_name": "Volume and Vibration Strength",
      "description": "Understanding that the volume (loudness) of a sound is related to the strength (amplitude) of the vibrations producing it. Stronger vibrations produce louder sounds. Sound becomes fainter as distance from the source increases.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D009",
      "year": [
        4
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C041",
      "concept_name": "Series Electrical Circuits",
      "description": "Understanding that a simple series electrical circuit consists of components (cells, bulbs, switches, buzzers, wires) connected in a single unbroken loop. A lamp will only light when part of a complete circuit. In Year 6, circuits can be represented using standard symbols.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D010",
      "year": [
        4,
        6
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C042",
      "concept_name": "Conductors and Insulators",
      "description": "Understanding that some materials allow electricity to flow through them (conductors) while others do not (insulators). Metals tend to be good conductors. Insulators are used to protect us from electrical current and to prevent short circuits.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D010",
      "year": [
        4
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C043",
      "concept_name": "Voltage and Circuit Effects",
      "description": "Understanding that the brightness of a lamp and the volume of a buzzer are associated with the number and voltage of cells in a circuit. More cells/higher voltage produces brighter bulbs and louder buzzers. Voltage is introduced informally.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D010",
      "year": [
        6
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C044",
      "concept_name": "Comparative Life Cycles",
      "description": "Describing and comparing the life cycles of four types of animals: mammals (live birth, parental care), amphibians (metamorphosis, aquatic larval stage), insects (complete or incomplete metamorphosis), birds (eggs, hatching, fledging). Understanding variety within the concept of life cycle.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D007",
      "year": [
        5
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C045",
      "concept_name": "Reproduction in Plants and Animals",
      "description": "Understanding the life process of reproduction. In plants: sexual reproduction (pollination, fertilisation, seed formation) and asexual reproduction (runners, bulbs, cuttings, tubers). In animals: sexual reproduction. Understanding that reproduction maintains species.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D007",
      "year": [
        5
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C046",
      "concept_name": "Human Development and Ageing",
      "description": "Understanding the full sequence of human development from birth through childhood, puberty, adulthood and old age. Changes at puberty are introduced. Timeline of growth stages. Gestation period concept.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D003",
      "year": [
        5
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C047",
      "concept_name": "Extended Material Properties",
      "description": "Comparing and grouping materials based on a wider range of properties: hardness, solubility, transparency, electrical conductivity, thermal conductivity, and response to magnets. Builds on KS1 and Y4 materials knowledge with additional property types.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D011",
      "year": [
        5
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C048",
      "concept_name": "Dissolving and Solutions",
      "description": "Understanding that some materials dissolve in liquid to form a solution — the solute appears to disappear but is not lost. Understanding that a dissolved substance can be recovered by evaporating the solvent. Dissolving is different from melting.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D011",
      "year": [
        5
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C049",
      "concept_name": "Separating Mixtures",
      "description": "Understanding that mixtures of solids, liquids and gases can be separated using various techniques: filtering (remove insoluble solids from liquids), sieving (separate solids by particle size), evaporating (recover dissolved solids). Technique chosen depends on properties of components.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D011",
      "year": [
        5
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C050",
      "concept_name": "Reversible Changes",
      "description": "Understanding that some material changes are reversible — the original materials can be recovered. Examples: dissolving, mixing, melting, freezing, evaporation, condensation. The material is changed in form but not in substance.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D011",
      "year": [
        5
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C051",
      "concept_name": "Irreversible Changes",
      "description": "Understanding that some changes result in the formation of new materials and are not easily reversed. Examples: burning, rusting, acid reacting with bicarbonate of soda, cooking. New substances are formed that cannot easily be changed back.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D011",
      "year": [
        5
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C052",
      "concept_name": "The Solar System",
      "description": "Understanding that the Sun is a star at the centre of our solar system and that eight planets (Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, Neptune) orbit it. Heliocentric model replaced earlier geocentric model. History of scientific ideas including Ptolemy, Alhazen, Copernicus.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D012",
      "year": [
        5
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C053",
      "concept_name": "Earth's Rotation and Day/Night",
      "description": "Understanding that the Earth rotates on its axis once every 24 hours, causing day and night. The part of Earth facing the Sun experiences day; the opposite side experiences night. The Sun's apparent movement across the sky is explained by Earth's rotation, not the Sun moving.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D012",
      "year": [
        5
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C054",
      "concept_name": "Moon's Orbit",
      "description": "Understanding that the Moon is a natural satellite that orbits the Earth. The Moon is approximately spherical. Other planets also have moons. The Moon's orbital relationship with Earth distinguishes it from planets.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D012",
      "year": [
        5
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C055",
      "concept_name": "Gravity",
      "description": "Understanding that gravity is a non-contact force of attraction acting between the Earth and objects. Unsupported objects fall towards Earth because of gravity. Gravity is responsible for keeping planets in orbit around the Sun and the Moon in orbit around Earth.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D013",
      "year": [
        5
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C056",
      "concept_name": "Resistance Forces",
      "description": "Understanding that air resistance, water resistance and friction are forces that act against motion between moving surfaces. These forces slow objects down and can be useful (parachutes, brakes) or a problem (inefficiency). Friction acts between surfaces in contact.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D013",
      "year": [
        5
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C057",
      "concept_name": "Mechanisms as Force Multipliers",
      "description": "Understanding that simple mechanisms — levers, pulleys and gears — allow a smaller input force to have a greater effect. These machines do not create energy but redistribute force and distance. Applications in everyday tools and machines.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D013",
      "year": [
        5
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C058",
      "concept_name": "Formal Biological Classification",
      "description": "Understanding the formal biological classification system: broad groups of living things (micro-organisms, plants, animals) can be subdivided. Animals classified as vertebrates (fish, amphibians, reptiles, birds, mammals) and invertebrates. Plants classified as flowering and non-flowering. Based on work of Carl Linnaeus.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D007",
      "year": [
        6
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C059",
      "concept_name": "Micro-organisms",
      "description": "Introduction to micro-organisms as a broad group of living things too small to see with the naked eye. Included in the formal classification of living things. Not yet expected to classify into bacteria, fungi, viruses etc. at this stage.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D007",
      "year": [
        6
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C060",
      "concept_name": "Circulatory System",
      "description": "Understanding the main parts of the human circulatory system: heart (pump), blood vessels (arteries carry oxygenated blood from heart, veins return deoxygenated blood, capillaries enable exchange). Blood transports nutrients, oxygen and waste. Functions of each component.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D003",
      "year": [
        6
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C061",
      "concept_name": "Diet, Exercise, Drugs and Lifestyle",
      "description": "Understanding that diet, exercise, drugs and lifestyle choices affect how the body functions. Both beneficial choices (regular exercise, balanced diet) and harmful choices (drugs, poor diet) have impacts on body function and health.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D003",
      "year": [
        6
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C062",
      "concept_name": "Nutrient and Water Transport in Animals",
      "description": "Understanding that the circulatory system transports nutrients (absorbed from the small intestine) and water to all cells in the body. Blood is the transport medium. This links the digestive system output to the circulatory system.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D003",
      "year": [
        6
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C063",
      "concept_name": "Fossils as Evidence of Change Over Time",
      "description": "Understanding that fossils (introduced in Y3 as trapped remains in rock) provide evidence that living things have changed over time and that animals and plants that no longer exist once lived on Earth millions of years ago.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D014",
      "year": [
        6
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C064",
      "concept_name": "Variation in Offspring",
      "description": "Understanding that living things reproduce offspring of the same kind, but that offspring vary and are not identical to their parents or to each other. This natural variation within species is the raw material for natural selection. Genes/chromosomes not required at this stage.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D014",
      "year": [
        6
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C065",
      "concept_name": "Adaptation",
      "description": "Understanding that animals and plants have features that help them survive in their particular environment. These adaptations may be structural (camouflage, body shape, insulation) or behavioural. Different environments select for different adaptations.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D014",
      "year": [
        6
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C066",
      "concept_name": "Evolution",
      "description": "Understanding that adaptation may lead to evolution — that over very long periods of time, variation and natural selection can lead to populations becoming better adapted to their environments and to the development of new species. Work of Darwin and Wallace.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D014",
      "year": [
        6
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C067",
      "concept_name": "Light Travels in Straight Lines",
      "description": "The explanatory model that light travels in straight lines from sources. This model explains why we see objects (light reaches our eyes directly from sources or via reflection), why shadows have the same shape as the object casting them, and how optical instruments work.",
      "concept_type": "knowledge",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D005",
      "year": [
        6
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    },
    {
      "concept_id": "SC-KS2-C068",
      "concept_name": "Circuit Symbols and Diagrams",
      "description": "Using recognised standard symbols to represent components in circuit diagrams: cell, battery, bulb, switch, buzzer, wire. Ability to draw and interpret circuit diagrams using standard symbols, building on pictorial representations from Year 4.",
      "concept_type": "skill",
      "complexity_level": 4,
      "is_cross_cutting": false,
      "domain_id": "SC-KS2-D010",
      "year": [
        6
      ],
      "teaching_guidance": "",
      "key_vocabulary": "",
      "common_misconceptions": ""
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "SC-KS1-C001",
      "dependent_concept": "SC-KS2-C001",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "KS1 asking simple questions is the direct predecessor to KS2 asking relevant questions and choosing enquiry type. The curriculum explicitly builds from simple to relevant questions and from single method to choosing the most appropriate enquiry type."
    },
    {
      "prerequisite_concept": "SC-KS1-C003",
      "dependent_concept": "SC-KS2-C002",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "KS1 simple testing is directly developed into KS2 fair and comparative testing with identified variables. The curriculum explicitly states this progression: from 'simple tests' to 'setting up simple practical enquiries, comparative and fair tests'."
    },
    {
      "prerequisite_concept": "SC-KS1-C039",
      "dependent_concept": "SC-KS2-C002",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 comparative testing method is the direct foundation for KS2 comparative and fair testing. The comparative test approach is formalised and extended."
    },
    {
      "prerequisite_concept": "SC-KS1-C041",
      "dependent_concept": "SC-KS2-C003",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 using simple measurements develops into KS2 systematic measurement with standard units using a wider range of equipment. Direct skill progression."
    },
    {
      "prerequisite_concept": "SC-KS1-C006",
      "dependent_concept": "SC-KS2-C004",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "KS1 data recording (tables, charts, drawings) is directly extended in KS2 to include classification, bar charts and keys. Explicit curriculum progression."
    },
    {
      "prerequisite_concept": "SC-KS1-C005",
      "dependent_concept": "SC-KS2-C005",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "KS1 drawing conclusions from observations develops into KS2 drawing conclusions and making predictions for new values. Prediction is the key addition."
    },
    {
      "prerequisite_concept": "SC-KS1-C042",
      "dependent_concept": "SC-KS2-C006",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 scientific communication develops into KS2 formal reporting with oral and written explanations and presentations for different audiences."
    },
    {
      "prerequisite_concept": "SC-KS2-C002",
      "dependent_concept": "SC-KS2-C007",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "Lower KS2 fair testing (identifying and controlling variables informally) is the direct prerequisite for Upper KS2 formal variable control in enquiry planning. Explicit curriculum progression from Y3-4 to Y5-6 Working Scientifically."
    },
    {
      "prerequisite_concept": "SC-KS2-C003",
      "dependent_concept": "SC-KS2-C008",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "Lower KS2 systematic measurement with standard units develops into Upper KS2 precision and repeat measurements. Explicit curriculum progression."
    },
    {
      "prerequisite_concept": "SC-KS2-C004",
      "dependent_concept": "SC-KS2-C009",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Lower KS2 data classification and presentation (bar charts, tables, keys) develops into Upper KS2 complex recording including scatter graphs and line graphs."
    },
    {
      "prerequisite_concept": "SC-KS2-C005",
      "dependent_concept": "SC-KS2-C010",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Lower KS2 drawing conclusions develops into Upper KS2 identifying causal relationships and evaluating evidence. Explicit curriculum progression in depth of analysis."
    },
    {
      "prerequisite_concept": "SC-KS1-C010",
      "dependent_concept": "SC-KS2-C011",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "KS1 plant structure (naming parts: roots, stem, leaves, flowers) is the direct prerequisite for KS2 plant part functions (what those parts do). Curriculum explicitly builds from identification to function."
    },
    {
      "prerequisite_concept": "SC-KS1-C013",
      "dependent_concept": "SC-KS2-C012",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 plant requirements (water, light, temperature) are directly extended in Y3 to include air, nutrients from soil, and room to grow. Explicit curriculum extension."
    },
    {
      "prerequisite_concept": "SC-KS2-C011",
      "dependent_concept": "SC-KS2-C013",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Understanding the function of stems (support and transport) is necessary before investigating water transport within plants. Structure-function relationship established first."
    },
    {
      "prerequisite_concept": "SC-KS1-C014",
      "dependent_concept": "SC-KS2-C014",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 germination (seeds beginning to grow) is incorporated into the full Y3 flowering plant life cycle which adds pollination, seed formation and seed dispersal. Direct content extension."
    },
    {
      "prerequisite_concept": "SC-KS1-C012",
      "dependent_concept": "SC-KS2-C014",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS1 plant growth from seeds and bulbs provides the growth phase context for the full plant life cycle studied in Year 3."
    },
    {
      "prerequisite_concept": "SC-KS2-C014",
      "dependent_concept": "SC-KS2-C015",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.95,
      "rationale": "Pollination is a component of the flowering plant life cycle — must understand the cycle before understanding individual components in detail."
    },
    {
      "prerequisite_concept": "SC-KS2-C014",
      "dependent_concept": "SC-KS2-C016",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Seed dispersal is a component of the plant life cycle — must understand the cycle context before studying individual dispersal mechanisms."
    },
    {
      "prerequisite_concept": "SC-KS1-C022",
      "dependent_concept": "SC-KS2-C017",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 basic needs of animals (water, food, air) is directly extended in Y3 to focus specifically on nutrition requirements — types and amounts — and the distinction between animal and plant nutrition."
    },
    {
      "prerequisite_concept": "SC-KS1-C018",
      "dependent_concept": "SC-KS2-C018",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.75,
      "rationale": "KS1 human body parts knowledge provides the context for Y3 skeletal and muscular systems, which require understanding of body part locations and functions."
    },
    {
      "prerequisite_concept": "SC-KS1-C025",
      "dependent_concept": "SC-KS2-C019",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS1 material identification (including rock) is the direct prerequisite for Y3 rock classification — pupils already know rocks as a material category, now they classify subtypes."
    },
    {
      "prerequisite_concept": "SC-KS1-C026",
      "dependent_concept": "SC-KS2-C019",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS1 material properties (hard/soft, rough/smooth, etc.) provide the vocabulary and approach for comparing rocks based on their physical properties in Year 3."
    },
    {
      "prerequisite_concept": "SC-KS1-C032",
      "dependent_concept": "SC-KS2-C020",
      "confidence": "inferred",
      "relationship_type": "foundational",
      "strength": 0.7,
      "rationale": "KS1 understanding that things can be living, dead or never alive provides the conceptual basis for understanding that fossils are the remains of once-living things."
    },
    {
      "prerequisite_concept": "SC-KS2-C020",
      "dependent_concept": "SC-KS2-C063",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "Y3 fossil formation knowledge is directly extended in Y6 evolution to use fossils as evidence of change in living things over time. The curriculum notes explicitly reference this connection."
    },
    {
      "prerequisite_concept": "SC-KS1-C026",
      "dependent_concept": "SC-KS2-C022",
      "confidence": "inferred",
      "relationship_type": "foundational",
      "strength": 0.7,
      "rationale": "KS1 material properties including transparent/opaque provides the vocabulary for Y3 light work distinguishing opaque objects that block light from transparent ones."
    },
    {
      "prerequisite_concept": "SC-KS2-C022",
      "dependent_concept": "SC-KS2-C067",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "Y3 observable light phenomena (need light to see, reflection, shadows) provide the experiential foundation that the Y6 straight-line travel model is designed to explain. Curriculum notes explicitly state Y6 builds on Y3 light work."
    },
    {
      "prerequisite_concept": "SC-KS2-C023",
      "dependent_concept": "SC-KS2-C067",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Y3 observed reflection is explained in Y6 using the straight-line light travel model — reflection is the basis for seeing non-luminous objects."
    },
    {
      "prerequisite_concept": "SC-KS2-C024",
      "dependent_concept": "SC-KS2-C067",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Y3 shadow formation observations are explained in Y6 using the straight-line light travel model. The Y6 objective explicitly references explaining why shadows have the same shape as the casting object."
    },
    {
      "prerequisite_concept": "SC-KS1-C026",
      "dependent_concept": "SC-KS2-C027",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.75,
      "rationale": "KS1 material properties (rough/smooth) provides vocabulary for understanding that surface texture affects friction. Smooth surfaces produce less friction than rough surfaces."
    },
    {
      "prerequisite_concept": "SC-KS2-C027",
      "dependent_concept": "SC-KS2-C056",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Y3 friction and surface observations are directly extended in Y5 Forces to include air resistance and water resistance as resistance forces. Friction is explicitly mentioned again in Y5."
    },
    {
      "prerequisite_concept": "SC-KS2-C025",
      "dependent_concept": "SC-KS2-C055",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Y3 concept of non-contact forces (magnetic forces act at a distance) provides the conceptual framework for Y5 gravity as another non-contact force acting at a distance."
    },
    {
      "prerequisite_concept": "SC-KS1-C004",
      "dependent_concept": "SC-KS2-C029",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS1 classification and grouping is the direct foundation for Y4 understanding that living things can be grouped in a variety of ways using different criteria."
    },
    {
      "prerequisite_concept": "SC-KS1-C015",
      "dependent_concept": "SC-KS2-C029",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS1 animal classification by vertebrate group provides specific experience of grouping animals that directly feeds into Y4 understanding of classification variety and flexibility."
    },
    {
      "prerequisite_concept": "SC-KS1-C036",
      "dependent_concept": "SC-KS2-C030",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS1 habitat suitability (living things need suitable habitats) is the direct predecessor for Y4 environmental change concept — if environments change, habitat suitability may be lost."
    },
    {
      "prerequisite_concept": "SC-KS2-C029",
      "dependent_concept": "SC-KS2-C028",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Understanding that living things can be classified by different criteria is necessary before classification keys (which formalise one approach to classification) can be used meaningfully."
    },
    {
      "prerequisite_concept": "SC-KS1-C022",
      "dependent_concept": "SC-KS2-C031",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "KS1 basic needs of animals includes food/nutrition. Y4 digestive system explains how the body processes food to extract nutrition — mechanistic explanation of the feeding need."
    },
    {
      "prerequisite_concept": "SC-KS2-C017",
      "dependent_concept": "SC-KS2-C031",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Y3 animal nutrition concept (animals need right types and amounts of food) provides the context for Y4 digestive system — digestion is how animals obtain nutrition from food."
    },
    {
      "prerequisite_concept": "SC-KS1-C038",
      "dependent_concept": "SC-KS2-C033",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "KS1 simple food chains are directly extended in Y4 to include producer/predator/prey vocabulary. The curriculum explicitly notes this as an extension of food chain understanding. Y4 adds formal ecological terminology."
    },
    {
      "prerequisite_concept": "SC-KS2-C017",
      "dependent_concept": "SC-KS2-C033",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.85,
      "rationale": "Y3 nutrition concept (animals get nutrition from what they eat) provides the underpinning rationale for food chains showing energy and nutrient flow through an ecosystem."
    },
    {
      "prerequisite_concept": "SC-KS1-C028",
      "dependent_concept": "SC-KS2-C034",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "KS1 physical transformation of materials (squashing, bending etc.) is prior knowledge for Y4 states of matter — pupils already know materials can be in different forms; now they learn the systematic framework of solid/liquid/gas."
    },
    {
      "prerequisite_concept": "SC-KS1-C027",
      "dependent_concept": "SC-KS2-C034",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.7,
      "rationale": "KS1 material suitability includes matching material properties to uses — understanding solids, liquids and gases as categories extends this classification system."
    },
    {
      "prerequisite_concept": "SC-KS2-C034",
      "dependent_concept": "SC-KS2-C035",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.95,
      "rationale": "Understanding the three states of matter is essential before understanding changes between states — pupils must know what the states are before they can understand transitions between them."
    },
    {
      "prerequisite_concept": "SC-KS2-C035",
      "dependent_concept": "SC-KS2-C036",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Understanding evaporation and condensation as changes of state is essential for understanding the water cycle, which is driven by these two state changes."
    },
    {
      "prerequisite_concept": "SC-KS2-C034",
      "dependent_concept": "SC-KS2-C049",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Y4 states of matter knowledge is explicitly referenced in Y5 separation of mixtures objective — pupils 'use knowledge of solids, liquids and gases to decide how mixtures might be separated'."
    },
    {
      "prerequisite_concept": "SC-KS2-C035",
      "dependent_concept": "SC-KS2-C050",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Y4 changes of state (melting, freezing, evaporation, condensation) are explicitly named as reversible changes in Y5. Y4 knowledge is categorised and explained in Y5."
    },
    {
      "prerequisite_concept": "SC-KS1-C026",
      "dependent_concept": "SC-KS2-C047",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 material properties (hard/soft, transparent/opaque etc.) directly feeds into Y5 extended material properties which adds solubility, conductivity and magnetic response. Systematic extension of the same conceptual framework."
    },
    {
      "prerequisite_concept": "SC-KS2-C026",
      "dependent_concept": "SC-KS2-C047",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Y3 magnetic properties (materials attracted to magnets) is explicitly referenced in Y5 material properties — response to magnets is one of the properties in the Y5 systematic framework. Curriculum notes reference Y3 magnetism link."
    },
    {
      "prerequisite_concept": "SC-KS2-C042",
      "dependent_concept": "SC-KS2-C047",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Y4 electrical conductors and insulators is explicitly referenced in Y5 material properties — electrical conductivity is one of the properties in the Y5 systematic framework. Curriculum notes reference Y4 electricity link."
    },
    {
      "prerequisite_concept": "SC-KS1-C020",
      "dependent_concept": "SC-KS2-C044",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 animal life cycles (offspring grow into adults, examples of egg-chick-chicken, spawn-tadpole-frog) is the direct prerequisite for Y5 comparative study of life cycles across mammals, amphibians, insects and birds."
    },
    {
      "prerequisite_concept": "SC-KS2-C014",
      "dependent_concept": "SC-KS2-C045",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Y3 flowering plant life cycle (including pollination and seed formation) provides the plant reproduction knowledge that Y5 reproduction topic formalises and extends to include asexual reproduction."
    },
    {
      "prerequisite_concept": "SC-KS2-C044",
      "dependent_concept": "SC-KS2-C045",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Y5 life cycle comparison provides the context for understanding reproduction — life cycles include reproductive stages that are then studied in more detail."
    },
    {
      "prerequisite_concept": "SC-KS1-C021",
      "dependent_concept": "SC-KS2-C046",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 human growth stages (baby to adult) is directly extended in Y5 to include puberty, ageing and the full timeline from birth to old age. Explicit curriculum extension."
    },
    {
      "prerequisite_concept": "SC-KS1-C031",
      "dependent_concept": "SC-KS2-C053",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "KS1 day length variation (longer in summer, shorter in winter) is explained in Y5 by Earth's rotation and orbital position. The observable phenomenon from KS1 is given its scientific explanation."
    },
    {
      "prerequisite_concept": "SC-KS1-C029",
      "dependent_concept": "SC-KS2-C052",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.7,
      "rationale": "KS1 the four seasons provides the prior understanding that Earth orbits the Sun annually (implied by seasonal cycle). Y5 solar system makes the Earth's orbital motion explicit and extends to the full solar system model."
    },
    {
      "prerequisite_concept": "SC-KS2-C028",
      "dependent_concept": "SC-KS2-C058",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Y4 classification keys are the practical tool that Y6 formal biological classification system relies on. The Y6 curriculum notes explicitly state it builds on Y4 grouping work."
    },
    {
      "prerequisite_concept": "SC-KS2-C029",
      "dependent_concept": "SC-KS2-C058",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Y4 understanding that living things can be grouped in various ways provides the foundation for Y6 formal classification — which formalises one specific hierarchical system. Curriculum explicitly links these."
    },
    {
      "prerequisite_concept": "SC-KS2-C018",
      "dependent_concept": "SC-KS2-C060",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.85,
      "rationale": "Y3 skeletal and muscular systems introduces pupils to internal body systems, preparing them for Y6 circulatory system study. Curriculum notes state Y6 builds on Y3/4 body systems knowledge."
    },
    {
      "prerequisite_concept": "SC-KS2-C031",
      "dependent_concept": "SC-KS2-C060",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Y4 digestive system knowledge is directly linked to Y6 circulatory system — the circulatory system transports nutrients absorbed by the digestive system. Curriculum explicitly links these systems."
    },
    {
      "prerequisite_concept": "SC-KS2-C031",
      "dependent_concept": "SC-KS2-C062",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Understanding how the digestive system absorbs nutrients is prerequisite for understanding how the circulatory system then transports those nutrients to cells throughout the body."
    },
    {
      "prerequisite_concept": "SC-KS1-C023",
      "dependent_concept": "SC-KS2-C061",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "KS1 human health requirements (exercise, diet, hygiene) is directly extended in Y6 to include drugs and wider lifestyle factors, and is linked to specific body system function rather than just general health."
    },
    {
      "prerequisite_concept": "SC-KS2-C063",
      "dependent_concept": "SC-KS2-C066",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Fossil evidence of change over time is the empirical basis for the concept of evolution — evolution is the scientific explanation for why living things have changed over millions of years as shown by the fossil record."
    },
    {
      "prerequisite_concept": "SC-KS2-C064",
      "dependent_concept": "SC-KS2-C066",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.95,
      "rationale": "Variation in offspring is the raw material for natural selection and evolution — without variation, natural selection cannot operate. The curriculum explicitly links these: 'adaptation may lead to evolution'."
    },
    {
      "prerequisite_concept": "SC-KS2-C065",
      "dependent_concept": "SC-KS2-C066",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Adaptation is the intermediate step between variation and evolution — the curriculum presents adaptation as leading to evolution. Adaptation must be understood before the fuller evolutionary concept."
    },
    {
      "prerequisite_concept": "SC-KS2-C041",
      "dependent_concept": "SC-KS2-C043",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "Y4 series circuit construction is the direct prerequisite for Y6 voltage and circuit effects — pupils need practical circuit experience before understanding voltage effects on component behaviour. Curriculum notes explicitly reference Y4 work."
    },
    {
      "prerequisite_concept": "SC-KS2-C041",
      "dependent_concept": "SC-KS2-C068",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Y4 pictorial circuit representations are explicitly referenced as the precursor to Y6 standard circuit symbols. Curriculum notes state conventional symbols are introduced in Y6 after pictorial representations in Y4."
    },
    {
      "prerequisite_concept": "SC-KS2-C001",
      "dependent_concept": "SC-KS2-C007",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Lower KS2 enquiry selection skill develops into Upper KS2 full enquiry planning with variable control. Each band's Working Scientifically builds directly on the previous."
    },
    {
      "prerequisite_concept": "SC-KS2-C006",
      "dependent_concept": "SC-KS2-C010",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Lower KS2 scientific reporting develops into Upper KS2 reporting with causal relationships and evaluation of trust in results — a deeper level of scientific communication."
    },
    {
      "prerequisite_concept": "SC-KS2-C044",
      "dependent_concept": "SC-KS2-C064",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Y5 comparative life cycles (offspring grow from reproduction) provides context for Y6 variation in offspring — pupils who understand reproduction understand that offspring are produced, setting up the concept that these offspring vary."
    },
    {
      "prerequisite_concept": "SC-KS2-C019",
      "dependent_concept": "SC-KS2-C021",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.85,
      "rationale": "Y3 rock classification introduces rock types and the fact that rocks can be broken down — prerequisite for understanding soil composition which requires knowing what rocks are and that they weather into smaller particles."
    },
    {
      "prerequisite_concept": "SC-KS2-C021",
      "dependent_concept": "SC-KS2-C012",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.75,
      "rationale": "Understanding soil composition (made from rock and organic matter) provides foundation for understanding how soil provides nutrients to plants — one of the plant growth requirements in Y3."
    },
    {
      "prerequisite_concept": "SC-KS2-C052",
      "dependent_concept": "SC-KS2-C053",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.95,
      "rationale": "Understanding the solar system model (Earth orbiting the Sun) is prerequisite for using Earth's rotation to explain day and night — both are part of the same Y5 topic and the orbital model provides necessary context."
    },
    {
      "prerequisite_concept": "SC-KS2-C037",
      "dependent_concept": "SC-KS2-C038",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.95,
      "rationale": "Understanding that vibration causes sound is prerequisite for understanding how vibrations travel through a medium to the ear — both are within Y4 Sound but vibration cause precedes transmission."
    },
    {
      "prerequisite_concept": "SC-KS2-C037",
      "dependent_concept": "SC-KS2-C039",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Understanding that vibration causes sound is necessary before investigating how features of the vibrating object affect the pitch of the sound produced."
    },
    {
      "prerequisite_concept": "SC-KS2-C037",
      "dependent_concept": "SC-KS2-C040",
      "confidence": "explicit",
      "relationship_type": "foundational",
      "strength": 0.9,
      "rationale": "Understanding that vibration causes sound is necessary before investigating how vibration strength (amplitude) relates to volume."
    }
  ]
}