{
  "metadata": {
    "subject": "Science",
    "key_stage": "KS1",
    "years_covered": [1, 2],
    "document_reference": "DFE-00182-2013",
    "extraction_date": "2026-02-17",
    "structure_rating": 8,
    "notes": "KS1 Science has a clear dual structure: (1) Working Scientifically as a cross-cutting domain of processes and methods that must be taught through substantive content, and (2) Content domains organised by scientific discipline. The statutory content covers plants, animals including humans, everyday materials, seasonal changes (Y1), and living things and their habitats (Y2). Non-statutory guidance is embedded throughout the document and sets expectations for practical activity."
  },
  "domains": [
    {
      "domain_id": "SC-KS1-D001",
      "domain_name": "Working Scientifically",
      "description": "The practical scientific methods, processes and skills that underpin all scientific enquiry at KS1.",
      "curriculum_context": "Working Scientifically at KS1 encompasses the essential processes by which children engage with science as a discipline: asking questions, observing closely, performing simple tests, identifying and classifying, using observations to suggest answers, and gathering and recording data. These skills are not to be taught in isolation but must be embedded within the substantive content domains so that children experience scientific methods as purposeful ways of finding out about the world. At this stage the emphasis is on developing curiosity, practical skills and early scientific literacy through first-hand experience with real objects, organisms and phenomena. The curriculum notes that working scientifically at KS1 should focus on practical activities and that written communication should not dominate - talk, drawing and practical demonstration are all valid forms of scientific communication.",
      "is_cross_cutting": true,
      "structure_type": "mixed"
    },
    {
      "domain_id": "SC-KS1-D002",
      "domain_name": "Plants",
      "description": "Understanding of plant diversity, structure, and basic requirements for life, covering identification and naming of common plants, plant structures, and what plants need to grow.",
      "curriculum_context": "The Plants domain at KS1 introduces children to the diversity of plant life they encounter in their immediate environment - wild flowers, garden plants and trees. In Year 1, pupils learn to identify and name a variety of common wild and garden plants and to describe the basic structures of flowering plants including roots, stem, leaves, flowers, petals, fruit, seeds and bulbs. In Year 2, the focus moves to plant growth, as pupils observe and describe how seeds and bulbs grow into mature plants and investigate what plants need to survive: water, light, and suitable temperature. This domain builds essential biological vocabulary and establishes the concept that plants are living organisms with specific needs, providing the foundation for later KS2 work on plant function, photosynthesis, and life cycles.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical"
    },
    {
      "domain_id": "SC-KS1-D003",
      "domain_name": "Animals, Including Humans",
      "description": "Understanding of animal diversity, body structures, basic needs, life processes and health requirements, including the human body and its senses.",
      "curriculum_context": "The Animals Including Humans domain at KS1 establishes foundational zoological knowledge by introducing children to the major vertebrate animal groups and their distinguishing features. In Year 1, pupils identify and name fish, amphibians, reptiles, birds and mammals, classify animals by diet (carnivore, herbivore, omnivore), compare body structures across groups, and learn the basic parts of the human body alongside the five senses. In Year 2, the focus extends to life processes: pupils discover that animals have offspring that grow into adults, learn that animals need water, food and air to survive, and explore the importance for humans of exercise, a balanced diet and good hygiene. This domain establishes the conceptual foundations for KS2 work on body systems, nutrition, and the diversity of life cycles, and also supports children's understanding of their own health and wellbeing.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical"
    },
    {
      "domain_id": "SC-KS1-D004",
      "domain_name": "Everyday Materials",
      "description": "Understanding of the properties of common materials and their suitability for different purposes, and how the shape of some materials can be changed.",
      "curriculum_context": "The Everyday Materials domain introduces children to the fundamental chemistry concept that the world is made of different materials, each with distinctive properties. In Year 1, pupils learn to distinguish between an object and the material from which it is made, identify and name common materials including wood, plastic, glass, metal, water and rock, and describe physical properties such as hard, soft, stretchy, shiny, rough, smooth, bendy, waterproof, absorbent, opaque and transparent. In Year 2, this understanding deepens as pupils compare the suitability of materials for different purposes and discover that the shape of solid objects can be changed by squashing, bending, twisting and stretching. This domain builds the scientific vocabulary and classification skills that underpin all subsequent chemistry work in KS2, particularly the study of rocks, states of matter, and properties and changes of materials.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical"
    },
    {
      "domain_id": "SC-KS1-D005",
      "domain_name": "Seasonal Changes",
      "description": "Understanding of observable patterns in weather and seasonal variation, including how day length varies across the year.",
      "curriculum_context": "The Seasonal Changes domain, taught in Year 1, introduces children to one of the most observable patterns in the natural world: the cyclical change in weather, temperature, day length and biological activity that characterises the four seasons. Pupils observe changes across spring, summer, autumn and winter, describe the weather associated with each season, and begin to notice that day length varies significantly throughout the year. This domain is particularly valuable for developing the process skill of observation over time, as meaningful engagement requires sustained attention across the school year. It connects directly to biology (deciduous and evergreen trees, animal behaviour) and to geography (climate and weather), and provides an accessible, first-hand context in which to practise systematic scientific observation and recording.",
      "is_cross_cutting": false,
      "structure_type": "sequential"
    },
    {
      "domain_id": "SC-KS1-D006",
      "domain_name": "Living Things and Their Habitats",
      "description": "Understanding of the characteristics of living things, how living things are suited to their habitats, and how organisms interact through simple food chains.",
      "curriculum_context": "The Living Things and Their Habitats domain, taught in Year 2, introduces fundamental ecological and biological concepts by asking children to explore what makes something alive, where different organisms live, and how they depend on one another. Pupils learn to distinguish between things that are living, dead, and things that have never been alive, and explore a range of habitats from woodland to seashore to micro-habitats such as under a log. They identify how different habitats provide for the basic needs of the organisms that live there, and how plants and animals in a habitat depend on each other. The introduction of simple food chains connects diet classification (learned in Year 1) to the concept of energy flow through ecosystems. This domain establishes the ecological thinking that is progressively deepened through KS2 work on classification systems, life cycles, and adaptation.",
      "is_cross_cutting": false,
      "structure_type": "hierarchical"
    }
  ],
  "objectives": [
    {
      "objective_id": "SC-KS1-O001",
      "domain_id": "SC-KS1-D001",
      "objective_text": "asking simple questions and recognising that they can be answered in different ways",
      "non_statutory_guidance": "Pupils should use the local environment throughout the year to explore and answer questions about plants and animals in their habitat. They should understand that there are different ways of answering scientific questions and know that different types of scientific enquiry include: observing changes over time; noticing patterns; grouping and classifying things; carrying out simple comparative and fair tests and finding things out using secondary sources of information.",
      "examples": "Pupils might ask 'Which material is best for making an umbrella?' (answered by a comparative test) or 'What do woodlice prefer?' (answered by observation). They learn that not all questions need an experiment - some can be answered from books or by watching over time.",
      "is_statutory": true,
      "year": [1, 2]
    },
    {
      "objective_id": "SC-KS1-O002",
      "domain_id": "SC-KS1-D001",
      "objective_text": "observing closely, using simple equipment",
      "non_statutory_guidance": "Pupils should use simple equipment such as magnifying glasses, hand lenses and simple balance scales. They should be encouraged to use all their senses (not just sight) to make observations, and where appropriate to use prepared slides and microscopes.",
      "examples": "Using a hand lens to look at the surface texture of leaves; using a magnifying glass to observe minibeasts in a habitat; observing seeds closely before planting them.",
      "is_statutory": true,
      "year": [1, 2]
    },
    {
      "objective_id": "SC-KS1-O003",
      "domain_id": "SC-KS1-D001",
      "objective_text": "performing simple tests",
      "non_statutory_guidance": "Pupils should be helped to investigate questions by setting up simple practical enquiries. Where appropriate, they should begin to understand what makes a test fair - keeping some things the same while changing one thing at a time.",
      "examples": "Testing which material is most waterproof by dripping water on different samples; testing which surfaces a toy car travels furthest on; finding out which conditions best support plant germination.",
      "is_statutory": true,
      "year": [1, 2]
    },
    {
      "objective_id": "SC-KS1-O004",
      "domain_id": "SC-KS1-D001",
      "objective_text": "identifying and classifying",
      "non_statutory_guidance": "Pupils should sort and classify things by their observable characteristics. They should be introduced to the idea that things can be sorted in different ways depending on which features are chosen as the basis for grouping.",
      "examples": "Sorting leaves by shape, colour or size; grouping animals by number of legs; classifying materials into those that are shiny and those that are not; making a classification key for common plants.",
      "is_statutory": true,
      "year": [1, 2]
    },
    {
      "objective_id": "SC-KS1-O005",
      "domain_id": "SC-KS1-D001",
      "objective_text": "using their observations and ideas to suggest answers to questions",
      "non_statutory_guidance": "Pupils should be supported to notice what they have observed and to make connections between their observations and possible answers. They should be encouraged to explain their reasoning in their own words and to recognise when their observations support or challenge their initial ideas.",
      "examples": "After observing that plants placed in the dark grow pale and weak, suggesting that plants need light to stay healthy; using observations of animal body structures to suggest why certain animals belong to particular groups.",
      "is_statutory": true,
      "year": [1, 2]
    },
    {
      "objective_id": "SC-KS1-O006",
      "domain_id": "SC-KS1-D001",
      "objective_text": "gathering and recording data to help in answering questions",
      "non_statutory_guidance": "Pupils should begin to gather and record findings in a range of ways: in writing (simple sentences, labelled diagrams), through drawing, in tables, in pictograms and through talk. They should understand that recording serves the purpose of helping them to answer questions and to share what they found out.",
      "examples": "Drawing and labelling the parts of a plant; completing a simple table recording which materials were waterproof; making a tally chart of birds observed from the classroom window over a week.",
      "is_statutory": true,
      "year": [1, 2]
    },
    {
      "objective_id": "SC-KS1-O007",
      "domain_id": "SC-KS1-D002",
      "objective_text": "identify and name a variety of common wild and garden plants, including deciduous and evergreen trees",
      "non_statutory_guidance": "Pupils should use the local environment as a resource. Appropriate plants might include bramble, buddleia, daisy, dandelion, and hazel (wild plants) and daffodil, sunflower, and mustard (garden plants). For trees, pupils might consider oak, ash, horse chestnut, sycamore, pine, holly and yew. It is important that pupils see the actual plants, not just pictures.",
      "examples": "Identifying common weeds in the school garden; recognising trees in the school grounds or a local park; matching leaf samples to plant identification guides.",
      "is_statutory": true,
      "year": [1]
    },
    {
      "objective_id": "SC-KS1-O008",
      "domain_id": "SC-KS1-D002",
      "objective_text": "identify and describe the basic structure of a variety of common flowering plants, including trees",
      "non_statutory_guidance": "Pupils should learn the names of the main external parts of flowering plants: leaves, flowers (blossom), petals, fruit, roots, bulb, seed, trunk, branches and stem. They should explore these on real plants where possible.",
      "examples": "Labelling a diagram of a dandelion showing its roots, stem, leaves and flower; dissecting a simple flower to see petals, stamens and carpel; planting a broad bean and observing root development.",
      "is_statutory": true,
      "year": [1]
    },
    {
      "objective_id": "SC-KS1-O009",
      "domain_id": "SC-KS1-D003",
      "objective_text": "identify and name a variety of common animals including fish, amphibians, reptiles, birds and mammals",
      "non_statutory_guidance": "Pupils should be able to identify and name a variety of common animals and group them by common characteristics. Common examples include: fish - goldfish, salmon; amphibians - frog, toad, newt; reptiles - lizard, snake; birds - robin, starling, seagull; mammals - rabbit, dog, cat. Pupils should understand that humans are mammals.",
      "examples": "Sorting pictures of animals into the five vertebrate groups; visiting a zoo or nature area to spot and name animals; looking at a pet fish, frog spawn, or birds through the classroom window.",
      "is_statutory": true,
      "year": [1]
    },
    {
      "objective_id": "SC-KS1-O010",
      "domain_id": "SC-KS1-D003",
      "objective_text": "identify and name a variety of common animals that are carnivores, herbivores and omnivores",
      "non_statutory_guidance": "Pupils should understand that carnivores eat other animals, herbivores eat plants only, and omnivores eat both plants and animals. Examples: carnivores - lion, owl, shark; herbivores - rabbit, horse, cow; omnivores - humans, bear, crow.",
      "examples": "Sorting pictures of animals into three groups based on diet; discussing what foods different animals eat and why; linking to food chains where plants are always at the start.",
      "is_statutory": true,
      "year": [1]
    },
    {
      "objective_id": "SC-KS1-O011",
      "domain_id": "SC-KS1-D003",
      "objective_text": "describe and compare the structure of a variety of common animals (fish, amphibians, reptiles, birds and mammals, including pets)",
      "non_statutory_guidance": "Pupils should explore the external features of animals in each group, noting similarities and differences. Key structural features include: fish (scales, fins, gills), amphibians (moist skin), reptiles (dry scaly skin), birds (feathers, wings, beak, two legs), mammals (fur or hair, warm-blooded, young born live and fed milk). Comparing pets provides an accessible starting point.",
      "examples": "Comparing a frog and a lizard - what's the same, what's different? Drawing labelled diagrams of a bird and a fish side by side; handling different feathers, fur samples and scales.",
      "is_statutory": true,
      "year": [1]
    },
    {
      "objective_id": "SC-KS1-O012",
      "domain_id": "SC-KS1-D003",
      "objective_text": "identify, name, draw and label the basic parts of the human body and say which part of the body is associated with each sense",
      "non_statutory_guidance": "Pupils should learn the names of the following body parts: head, neck, arms, elbows, legs, knees, face, ears, eyes, hair, mouth, teeth. They should associate each sense with the corresponding body part: sight - eyes; hearing - ears; smell - nose; taste - tongue; touch - skin.",
      "examples": "Drawing and labelling an outline of their own body; playing 'Simon says' using correct anatomical terms; exploring how each sense helps us in daily life using a sensory tray activity.",
      "is_statutory": true,
      "year": [1]
    },
    {
      "objective_id": "SC-KS1-O013",
      "domain_id": "SC-KS1-D004",
      "objective_text": "distinguish between an object and the material from which it is made",
      "non_statutory_guidance": "Pupils should understand that objects are things that exist (e.g., a window, a chair, a toy car) and materials are what those objects are made from (e.g., glass, wood, plastic). The same material can be used to make many different objects, and an object can be made from more than one material.",
      "examples": "Sorting objects in the classroom by the material they are made from; discussing a door - 'it is made of wood'; a window - 'it is made of glass'; a coin - 'it is made of metal'.",
      "is_statutory": true,
      "year": [1]
    },
    {
      "objective_id": "SC-KS1-O014",
      "domain_id": "SC-KS1-D004",
      "objective_text": "identify and name a variety of everyday materials, including wood, plastic, glass, metal, water, and rock",
      "non_statutory_guidance": "Pupils should be able to identify and name materials in everyday contexts. In addition to those listed, other materials include: brick, paper, cardboard, fabric, elastic and foil. The focus at this stage is on recognition and naming rather than detailed understanding of composition.",
      "examples": "A 'materials hunt' around the classroom or school; sorting a collection of objects by material; finding examples of the same material in different locations in the school.",
      "is_statutory": true,
      "year": [1]
    },
    {
      "objective_id": "SC-KS1-O015",
      "domain_id": "SC-KS1-D004",
      "objective_text": "describe the simple physical properties of a variety of everyday materials",
      "non_statutory_guidance": "Pupils should explore and describe properties using paired opposites: hard/soft, stretchy/stiff, shiny/dull, rough/smooth, bendy/not bendy, waterproof/not waterproof, absorbent/not absorbent, opaque/transparent. Pupils should use their senses and simple tests to explore these properties directly.",
      "examples": "Feeling different materials to decide if they are rough or smooth; dripping water on materials to test waterproofing; looking through materials to decide if they are opaque or transparent.",
      "is_statutory": true,
      "year": [1]
    },
    {
      "objective_id": "SC-KS1-O016",
      "domain_id": "SC-KS1-D004",
      "objective_text": "compare and group together a variety of everyday materials on the basis of their simple physical properties",
      "non_statutory_guidance": "Pupils should sort and classify materials using their knowledge of properties. They should be encouraged to explain their sorting decisions and to recognise that the same set of materials can be grouped in different ways depending on which property is chosen.",
      "examples": "Sorting a collection of materials into 'shiny' and 'not shiny'; creating a branching database to classify materials by multiple properties; grouping fabrics by how absorbent they are.",
      "is_statutory": true,
      "year": [1]
    },
    {
      "objective_id": "SC-KS1-O017",
      "domain_id": "SC-KS1-D005",
      "objective_text": "observe changes across the four seasons",
      "non_statutory_guidance": "Pupils should observe and describe changes associated with each season, including changes to plants and trees, animal behaviour, and the weather. This works best when observation continues throughout the year so that pupils directly experience the transitions between seasons. Pupils might keep a class seasonal journal.",
      "examples": "Taking photographs of the school grounds monthly throughout the year; observing when trees lose and regain their leaves; recording whether there is frost or snow; noticing when days feel noticeably longer or shorter.",
      "is_statutory": true,
      "year": [1]
    },
    {
      "objective_id": "SC-KS1-O018",
      "domain_id": "SC-KS1-D005",
      "objective_text": "observe and describe weather associated with the seasons and how day length varies",
      "non_statutory_guidance": "Pupils should observe and describe weather patterns across the year and understand that these are broadly predictable by season. They should also observe that day length varies, with longer days in summer and shorter days in winter. Pupils should be warned that they must never look directly at the Sun, even if wearing dark glasses.",
      "examples": "Recording daily weather using a simple weather chart; timing sunrise and sunset (using published data) at different times of year and comparing; noting that it is already dark when they go home in winter but still light in summer.",
      "is_statutory": true,
      "year": [1]
    },
    {
      "objective_id": "SC-KS1-O019",
      "domain_id": "SC-KS1-D006",
      "objective_text": "explore and compare the differences between things that are living, dead, and things that have never been alive",
      "non_statutory_guidance": "Pupils should explore a range of objects and organisms to decide whether they are living, dead (were once alive), or have never been alive. This helps establish the concept of life processes as the defining characteristics of living things. Common misconceptions include thinking fire or clouds are alive, or that a dried-up leaf is 'dead' in the same way as a dead animal.",
      "examples": "Sorting a collection including a live woodlouse, dried flower, wooden pencil, stone, and feather into the three categories; discussing why a log is dead but was once alive; exploring what we mean by 'alive' - does it move? grow? breathe?",
      "is_statutory": true,
      "year": [2]
    },
    {
      "objective_id": "SC-KS1-O020",
      "domain_id": "SC-KS1-D006",
      "objective_text": "identify that most living things live in habitats to which they are suited and describe how different habitats provide for the basic needs of different kinds of animals and plants, and how they depend on each other",
      "non_statutory_guidance": "Pupils should explore a range of local habitats including micro-habitats. They should understand that habitats provide what organisms need to survive: food, water, shelter and appropriate conditions. They should also begin to understand that plants and animals in a habitat are interdependent - for example, plants provide food and shelter for animals, and animals may help to pollinate plants or disperse seeds.",
      "examples": "Investigating which organisms live under stones, in long grass, or in a pond; matching animals to their habitats using a picture-sorting activity; visiting a local nature area to observe habitat diversity.",
      "is_statutory": true,
      "year": [2]
    },
    {
      "objective_id": "SC-KS1-O021",
      "domain_id": "SC-KS1-D006",
      "objective_text": "identify and name a variety of plants and animals in their habitats, including micro-habitats",
      "non_statutory_guidance": "Pupils should go into the school grounds and local environment to identify organisms in their habitats. They should understand that a micro-habitat is a very small, localised area within a larger habitat - for example, under a stone, in leaf litter, on a tree trunk. Pupils should be encouraged to handle minibeasts carefully and return them to their habitat after observation.",
      "examples": "Turning over a log or stone and recording what is found underneath; using a quadrat in long grass to survey plants and animals; visiting a pond to identify pond skaters, water boatmen or frogs.",
      "is_statutory": true,
      "year": [2]
    },
    {
      "objective_id": "SC-KS1-O022",
      "domain_id": "SC-KS1-D006",
      "objective_text": "describe how animals obtain their food from plants and other animals, using the idea of a simple food chain, and identify and name different sources of food",
      "non_statutory_guidance": "Pupils should be introduced to the idea of a food chain showing what eats what, always starting with a plant (producer). Simple food chains from their local environment work best. Pupils should identify and name a variety of food sources, understanding that most food ultimately comes from plants. The concept of a food chain is introduced at this stage; food webs are not expected at KS1.",
      "examples": "Constructing a simple food chain such as: nettle → caterpillar → robin → hawk; identifying that bread comes from wheat, milk from cows that eat grass; making cards showing plant → herbivore → carnivore and arranging them in order.",
      "is_statutory": true,
      "year": [2]
    },
    {
      "objective_id": "SC-KS1-O023",
      "domain_id": "SC-KS1-D002",
      "objective_text": "observe and describe how seeds and bulbs grow into mature plants",
      "non_statutory_guidance": "Pupils should grow a variety of plants from seeds and bulbs throughout the year. Good examples include sunflowers, beans, peas, cress, and daffodil bulbs. They should observe, describe and record changes over time, using drawings, photographs and simple measurements.",
      "examples": "Planting broad beans in transparent containers pressed against the glass so that root development is visible; growing cress or mustard seeds on damp paper towels to observe rapid germination; planting daffodil bulbs in autumn and observing the whole growth cycle.",
      "is_statutory": true,
      "year": [2]
    },
    {
      "objective_id": "SC-KS1-O024",
      "domain_id": "SC-KS1-D002",
      "objective_text": "find out and describe how plants need water, light and a suitable temperature to grow and stay healthy",
      "non_statutory_guidance": "Pupils should work scientifically by setting up simple comparative tests - for example, growing plants with and without light, or with and without water. They should understand that while mature plants need light to grow well, seeds and bulbs contain their own food store and so can germinate and begin to grow in the dark, but they do need water. Plants also need a suitable temperature to grow - too cold and they will not grow; too hot and they will wilt.",
      "examples": "Growing two sets of seedlings - one in good light, one in a dark cupboard - and comparing results after two weeks; comparing plants grown with different amounts of water; discussing what happens to plants in a very cold winter.",
      "is_statutory": true,
      "year": [2]
    },
    {
      "objective_id": "SC-KS1-O025",
      "domain_id": "SC-KS1-D003",
      "objective_text": "notice that animals, including humans, have offspring which grow into adults",
      "non_statutory_guidance": "Pupils should observe and describe the stages of animal growth and development, using a variety of animals as examples. Good examples include egg → chick → chicken, egg → caterpillar → pupa → butterfly, spawn → tadpole → frog, and lamb → sheep or baby → toddler → child → teenager → adult. At this stage, pupils are not expected to understand the mechanisms of reproduction.",
      "examples": "Hatching chick eggs in an incubator in the classroom; raising butterfly larvae through metamorphosis; using time-lapse videos to observe frog spawn developing; sequencing picture cards of human growth stages.",
      "is_statutory": true,
      "year": [2]
    },
    {
      "objective_id": "SC-KS1-O026",
      "domain_id": "SC-KS1-D003",
      "objective_text": "find out about and describe the basic needs of animals, including humans, for survival (water, food and air)",
      "non_statutory_guidance": "Pupils should understand that all animals, including humans, need water, food and air to stay alive. They should explore how animals obtain these things in their natural habitats. Pupils should not be expected to explore what happens when these needs are not met in relation to live animals - use secondary sources for this.",
      "examples": "Discussing what they themselves need to stay alive each day; finding out how fish get air (from dissolved oxygen in water); researching through secondary sources how desert animals obtain water; comparing what different animals eat.",
      "is_statutory": true,
      "year": [2]
    },
    {
      "objective_id": "SC-KS1-O027",
      "domain_id": "SC-KS1-D003",
      "objective_text": "describe the importance for humans of exercise, eating the right amounts of different types of food, and hygiene",
      "non_statutory_guidance": "Pupils should understand that eating a balanced diet, taking exercise and maintaining good hygiene are all important for staying healthy. They should be introduced to the idea that different foods provide different nutrients and that variety is important. Hygiene includes handwashing and dental hygiene. Pupils should understand why exercise is important for the heart, muscles and joints.",
      "examples": "Creating a 'healthy plate' showing different food groups; discussing why we wash hands before eating and after using the toilet; recording physical activities done in a week; talking about what happens to the body during exercise (heart beats faster, breathing quickens).",
      "is_statutory": true,
      "year": [2]
    },
    {
      "objective_id": "SC-KS1-O028",
      "domain_id": "SC-KS1-D004",
      "objective_text": "identify and compare the suitability of a variety of everyday materials, including wood, metal, plastic, glass, brick, rock, paper and cardboard for particular uses",
      "non_statutory_guidance": "Pupils should consider why materials are chosen for particular uses based on their properties. They should be encouraged to suggest suitable and unsuitable materials for given purposes and justify their reasoning in terms of the material's properties. The focus is on functional suitability rather than aesthetics.",
      "examples": "Comparing different materials for making a waterproof umbrella cover; testing which materials would be suitable for a chair - which need to be hard, strong and not too heavy; discussing why windows are made of glass rather than wood (transparency) and why doors are not made of glass (not strong enough for purpose in most cases).",
      "is_statutory": true,
      "year": [2]
    },
    {
      "objective_id": "SC-KS1-O029",
      "domain_id": "SC-KS1-D004",
      "objective_text": "find out how the shapes of solid objects made from some materials can be changed by squashing, bending, twisting and stretching",
      "non_statutory_guidance": "Pupils should explore how applying forces to solid objects can change their shape. Not all materials respond in the same way: some materials (e.g., plasticine, clay) can be squashed; some (e.g., wire, rubber) can be bent or stretched; some (e.g., paper) can be twisted. Pupils should note that some changes are reversible (rubber band stretches back) and some are not (squashed clay stays squashed). At this stage they need not understand that it is forces causing the changes.",
      "examples": "Exploring what happens when they squash, bend, twist and stretch a range of materials including playdough, foam, rubber bands, wire and paper; recording which materials could be changed by each method; discussing which changes spring back and which do not.",
      "is_statutory": true,
      "year": [2]
    }
  ],
  "concepts": [
    {
      "concept_id": "SC-KS1-C001",
      "concept_name": "Asking Scientific Questions",
      "description": "The ability to formulate questions about the natural world that can be investigated through scientific means. At KS1, pupils learn that some questions can be answered by watching and observing over time, some by carrying out a test, some by sorting and classifying, and some by looking in books or other sources. Developing the habit of asking 'How do we find out?' is foundational to scientific thinking.",
      "teaching_guidance": "Encourage pupils to share questions they have about things they observe. Model the distinction between questions that can be tested (e.g., 'Which paper towel absorbs the most water?') and questions that require research (e.g., 'How do whales breathe?'). Use questioning stems such as 'I wonder why...', 'What would happen if...?', and 'How does...?'",
      "key_vocabulary": "question, investigate, test, observe, find out, wonder",
      "common_misconceptions": "Children often think all science questions must be answered by doing an experiment. They need to learn that observation, research, and classification are also valid scientific methods.",
      "concept_type": "process",
      "complexity_level": 1,
      "is_cross_cutting": true,
      "domain_id": "SC-KS1-D001"
    },
    {
      "concept_id": "SC-KS1-C002",
      "concept_name": "Close Observation",
      "description": "The skill of carefully attending to and noticing details about objects, organisms and phenomena. Close observation at KS1 involves using multiple senses (while maintaining safety) and simple equipment such as hand lenses to reveal details not visible to the naked eye. Mastery is shown when pupils can describe what they observe with increasing precision and use observations as evidence.",
      "teaching_guidance": "Model careful observation explicitly - slow down, look from different angles, feel textures, listen carefully. Use hand lenses and magnifying glasses routinely. Give pupils observation frames or structured recording sheets to focus their attention. Distinguish between 'seeing' (casual glance) and 'observing' (careful, purposeful noticing).",
      "key_vocabulary": "observe, notice, look closely, magnify, detail, describe, compare",
      "common_misconceptions": "Children often describe what they expect to see rather than what they actually see. Encourage them to record actual observations rather than prior knowledge.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": true,
      "domain_id": "SC-KS1-D001"
    },
    {
      "concept_id": "SC-KS1-C003",
      "concept_name": "Simple Testing",
      "description": "Carrying out simple practical investigations to answer scientific questions. At KS1 this includes comparative tests (which of these is best for...?) and observation-based investigations. Pupils begin to understand the idea of keeping things the same (a rudimentary understanding of fair testing) and changing just one thing at a time. Mastery is evident when pupils can carry out a simple test independently and describe what they did and found out.",
      "teaching_guidance": "Start with teacher-led investigations before asking pupils to carry out their own. Use contexts pupils find motivating (e.g., testing materials for the Three Little Pigs, finding the best material for a raincoat). Explicitly model saying 'I am going to keep these things the same... and change this one thing...'",
      "key_vocabulary": "test, fair, same, different, change, result, compare, find out",
      "common_misconceptions": "Children often change several things at once without realising this makes a fair comparison impossible. They may also confuse prediction with wish ('I want the green one to win') rather than evidence-based expectation.",
      "concept_type": "process",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "domain_id": "SC-KS1-D001"
    },
    {
      "concept_id": "SC-KS1-C004",
      "concept_name": "Classification and Grouping",
      "description": "The process of organising objects, materials, or living things into groups based on shared observable characteristics. At KS1, pupils choose their own criteria for sorting as well as use given criteria. They begin to understand that the same set of things can be classified in more than one way, and that the classification system chosen depends on purpose. This is foundational to biological taxonomy and chemical classification.",
      "teaching_guidance": "Provide sets of real objects for sorting rather than pictures where possible. Use Carroll diagrams and Venn diagrams as organisational structures. Ask pupils to explain their sorting decisions. Highlight that there is not always one 'right' way to classify things and that scientists also argue about classification.",
      "key_vocabulary": "sort, group, classify, same, different, belongs, category, criteria",
      "common_misconceptions": "Children may think that once they have sorted something one way, that is the only way. They benefit from repeated sorting activities using different criteria on the same set of objects.",
      "concept_type": "process",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "domain_id": "SC-KS1-D001"
    },
    {
      "concept_id": "SC-KS1-C005",
      "concept_name": "Drawing Conclusions from Evidence",
      "description": "Using observations and data gathered to suggest answers to scientific questions. At KS1, pupils move from simply describing what they saw to connecting observations to explanations. Mastery involves being able to say not only what happened but to offer a simple reason why, based on evidence rather than imagination.",
      "teaching_guidance": "Scaffold conclusion-writing with frames such as 'We found out that... because...' and 'Our results show... This means...' Accept oral conclusions as well as written. Model the difference between 'I think...' (prediction/opinion) and 'Our investigation showed that...' (evidence-based conclusion).",
      "key_vocabulary": "found out, result, evidence, because, shows, conclusion, means",
      "common_misconceptions": "Children often state what they think or wish rather than what the evidence shows. They may also over-generalise from limited data ('All rocks float' from a single observation).",
      "concept_type": "process",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "domain_id": "SC-KS1-D001"
    },
    {
      "concept_id": "SC-KS1-C006",
      "concept_name": "Recording Scientific Findings",
      "description": "Gathering and recording observations, measurements and conclusions in a variety of formats including drawings, labelled diagrams, simple tables, pictograms and written sentences. At KS1, the primary purpose of recording is to help pupils answer their question and to communicate findings to others. Written recording should not dominate at this stage; drawings, tables and talk are equally valid.",
      "teaching_guidance": "Provide structured recording frameworks initially (observation sheets with headings, partially completed tables). Gradually increase independence. Teach specific formats explicitly - how to draw and label a scientific diagram, how to complete a simple results table. Celebrate different modes of recording.",
      "key_vocabulary": "record, draw, label, table, diagram, results, write, show",
      "common_misconceptions": "Children (and some teachers) can mistake beautiful or elaborate recording for good science. Emphasise that recording should be clear and purposeful, serving the science rather than replacing it.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "domain_id": "SC-KS1-D001"
    },
    {
      "concept_id": "SC-KS1-C007",
      "concept_name": "Pattern Recognition in Science",
      "description": "Noticing regularities, relationships and trends in observations or data. At KS1, pattern recognition includes seeing that things change in predictable ways (seasons, plant growth) and that groups of things share common characteristics. Recognising patterns is central to all scientific disciplines and leads to generalisation and the formation of scientific laws and principles.",
      "teaching_guidance": "Draw attention to patterns explicitly during discussions. Use language like 'I notice that every time...' and 'It seems like... always...'. Use repeated observations (weather diaries, plant growth charts) to make patterns visible over time.",
      "key_vocabulary": "pattern, always, usually, trend, similar, regular, changes, same",
      "common_misconceptions": "Children may identify false patterns from too few observations. Emphasise the need to observe many examples before claiming a pattern exists.",
      "concept_type": "process",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "domain_id": "SC-KS1-D001"
    },
    {
      "concept_id": "SC-KS1-C008",
      "concept_name": "Using Secondary Sources",
      "description": "Finding scientific information from books, photographs, videos, internet resources and by asking knowledgeable people. At KS1, pupils learn that some questions cannot be answered by observation or investigation alone, and that scientists build on the knowledge and work of others. This is an important habit of scientific inquiry.",
      "teaching_guidance": "Provide a range of non-fiction books, photographs and age-appropriate videos on science topics. Model the process of finding specific information to answer a question. Discuss where information comes from and how we can trust it.",
      "key_vocabulary": "source, information, research, find out, book, video, website",
      "common_misconceptions": "Children may not distinguish between reliable and unreliable sources. Introduce the idea that scientific information is checked by other scientists, and that some sources are more trustworthy than others.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": true,
      "domain_id": "SC-KS1-D001"
    },
    {
      "concept_id": "SC-KS1-C009",
      "concept_name": "Plant Identification",
      "description": "Recognising and naming common wild and garden plants including deciduous and evergreen trees found in the local environment. Plant identification at KS1 builds botanical vocabulary and develops observation skills as pupils attend to the specific features - leaf shape, flower colour and structure, bark texture - that distinguish species. Mastery involves confidently naming a range of plants and explaining how they were identified.",
      "teaching_guidance": "Take pupils outside frequently to observe real plants in context. Use simple field guides or identification keys with clear photographs. Focus on a manageable set of locally common species. Plant and tend a class garden to develop familiarity over time. Link identification to seasonal observations.",
      "key_vocabulary": "plant, flower, tree, deciduous, evergreen, wild, garden, species, name, identify",
      "common_misconceptions": "Children often think 'plant' means only flowering plants or garden plants, not trees, grasses or mosses. Broaden their conception of what counts as a plant.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D002"
    },
    {
      "concept_id": "SC-KS1-C010",
      "concept_name": "Plant Structure",
      "description": "Knowledge of the basic external parts of flowering plants and trees: roots, stem/trunk, branches, leaves, flowers (blossom), petals, fruit, seeds and bulbs. Pupils at KS1 should be able to identify these parts on real plants and in diagrams, and name them correctly. This structural knowledge is prerequisite for later KS2 work on the functions of plant parts.",
      "teaching_guidance": "Use real plants and plant parts wherever possible. Grow plants from seed so pupils observe how roots, stem and leaves develop. Dissect flowers to see petals, stamens and carpels. Use labelled diagrams alongside real specimens. The curriculum specifies: roots, stem/trunk, leaves, flowers, blossom, petals, fruit, roots, bulb, seed, trunk, branches, stem.",
      "key_vocabulary": "root, stem, trunk, branch, leaf, flower, petal, fruit, seed, bulb, blossom",
      "common_misconceptions": "Children often think only trees have trunks and branches. They may not realise that a fruit (in the botanical sense) contains seeds and can be a tomato, pea pod or acorn, not just sweet fruits. Some children think bulbs are seeds.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D002"
    },
    {
      "concept_id": "SC-KS1-C011",
      "concept_name": "Deciduous vs Evergreen Trees",
      "description": "Understanding that deciduous trees lose their leaves in autumn and regrow them in spring, while evergreen trees retain their leaves all year round. This concept connects to seasonal change and is one of the most visible examples of plant adaptation to seasonal variation. Mastery involves correctly classifying common trees as deciduous or evergreen.",
      "teaching_guidance": "Observe specific trees in the school grounds throughout the year - this is the most powerful teaching approach. In autumn, collect and examine leaves; in winter, observe bare deciduous trees alongside green conifers or holly. Make rubbings of different bark and leaf textures.",
      "key_vocabulary": "deciduous, evergreen, leaf, autumn, winter, spring, bare, shed",
      "common_misconceptions": "Children often think all trees lose their leaves in winter. Some children think dead plants have lost their leaves, confusing seasonal leaf-shedding with plant death.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D002"
    },
    {
      "concept_id": "SC-KS1-C012",
      "concept_name": "Plant Growth from Seeds and Bulbs",
      "description": "Understanding that mature plants grow from seeds or bulbs, developing through observable stages from germination to mature plant. At KS1, pupils observe this process directly by growing plants, recording changes in height, leaf number, and appearance over time. Understanding that a tiny seed contains everything needed to begin a new plant is a conceptually powerful idea in biology.",
      "teaching_guidance": "Grow plants from both seeds (sunflower, bean, pea, cress) and bulbs (daffodil, tulip) so pupils can compare. Use transparent containers pressed against the window so root development is visible. Photograph growth weekly to create time-lapse records. Encourage measurement and drawing of plants at regular intervals.",
      "key_vocabulary": "seed, bulb, germinate, grow, root, shoot, seedling, mature, plant",
      "common_misconceptions": "Children often think seeds need light to germinate - they do not initially. They may also think that all plants grow from seeds (bulbs, cuttings, and runners are also used for propagation). Some children believe that when a seed sprouts, the seedling 'was inside the seed' in its final form.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D002"
    },
    {
      "concept_id": "SC-KS1-C013",
      "concept_name": "Plant Requirements for Growth",
      "description": "Understanding that plants need water, light and a suitable temperature to grow and stay healthy. This is tested at KS1 through simple comparative investigations. The key scientific point is that although seeds germinate without light (they have their own food stores), growing plants require light for photosynthesis. Plants also wilt and die without water, and grow poorly in extreme temperatures.",
      "teaching_guidance": "Set up parallel investigations comparing plants grown in different conditions - with and without water, with and without light, in warm and cold locations. Record observations over two to three weeks. Help pupils connect results to the concept of plant needs. Note: seeds can germinate without light, but seedlings cannot thrive without it.",
      "key_vocabulary": "water, light, temperature, warmth, grow, healthy, wilt, survive, needs, conditions",
      "common_misconceptions": "Children commonly believe seeds need light to germinate (they do not). Many children also think plants get their food from the soil (plants make their own food via photosynthesis; they absorb water and minerals from the soil). Children may not realise that too much water is also harmful to plants.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D002"
    },
    {
      "concept_id": "SC-KS1-C014",
      "concept_name": "Germination",
      "description": "The process by which a dormant seed begins to grow, producing a root and shoot under the right conditions of water and suitable temperature. Germination is the first stage of a plant's life cycle and is a direct observable phenomenon accessible to KS1 pupils. Understanding germination requires grasping that seeds are alive but dormant, and that activating conditions switch on growth.",
      "teaching_guidance": "Germinate fast-growing seeds (cress, radish, broad bean) so results are visible within days. Use damp kitchen paper or transparent bags to observe germination in progress. Compare germination in wet versus dry conditions. Introduce the term 'germinate' as the scientific word for 'sprouting'.",
      "key_vocabulary": "germinate, dormant, seed, root, shoot, sprout, conditions, water, grow",
      "common_misconceptions": "Children may think a germinating seed is a different organism to the mature plant it will become. Some children think germination requires soil specifically - it requires water and warmth, not soil (though soil provides support and minerals for later growth).",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D002"
    },
    {
      "concept_id": "SC-KS1-C015",
      "concept_name": "Animal Classification by Vertebrate Group",
      "description": "Knowledge of the five major vertebrate animal groups - fish, amphibians, reptiles, birds and mammals - and the ability to correctly classify common animals into these groups. Mastery involves understanding the key distinguishing features of each group (e.g., birds have feathers, mammals have fur and feed young on milk) and confidently classifying unfamiliar animals.",
      "teaching_guidance": "Use real animals where safe to do so (class fish, visiting birds of prey, handling invertebrates). Use large photographic collections for classification activities. Teach one group at a time, focusing on key distinguishing features. Note that humans are mammals. Use 'odd one out' activities to reinforce classification.",
      "key_vocabulary": "fish, amphibian, reptile, bird, mammal, vertebrate, group, feature, classify, scales, feathers, fur, warm-blooded, cold-blooded",
      "common_misconceptions": "Children commonly misclassify animals: whales as fish (they are mammals), dolphins as fish, penguins as fish. They may not know humans are mammals. Some children think all animals that live in water are fish. Children often believe that all reptiles are dangerous or all amphibians are frogs.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D003"
    },
    {
      "concept_id": "SC-KS1-C016",
      "concept_name": "Animal Classification by Diet",
      "description": "Understanding that animals can be classified by what they eat: carnivores eat other animals only, herbivores eat plants only, and omnivores eat both plants and animals. This classification reflects animals' ecological roles and is foundational to understanding food chains. Mastery involves correctly classifying familiar and unfamiliar animals and explaining the basis for classification.",
      "teaching_guidance": "Relate diet classification to animals pupils already know. Use tooth shape and structure as evidence (sharp teeth in carnivores, flat grinding teeth in herbivores). Create sorting activities with a wide range of animals. Connect to food chains: producers (plants) are eaten by herbivores, which may be eaten by carnivores.",
      "key_vocabulary": "carnivore, herbivore, omnivore, diet, eat, food, prey, predator, plants, animals",
      "common_misconceptions": "Children may think all large animals are carnivores (elephants and rhinos are herbivores). They often incorrectly classify humans - we are omnivores. Some children think sharks are the only carnivores.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D003"
    },
    {
      "concept_id": "SC-KS1-C017",
      "concept_name": "Animal Body Structures - Comparative",
      "description": "The ability to compare and describe the external body structures of different vertebrate animals, identifying both similarities (all have a head, most have four limbs, all have a backbone) and key differences (feathers vs fur vs scales, wings vs fins vs legs). This comparative anatomy builds a scientific basis for animal classification.",
      "teaching_guidance": "Use photographs, models and real animals for comparison. Focus on externally observable features: body covering, limbs, head shape, mouth/beak structure. Create comparison tables. Use the question 'How are these animals the same? How are they different?' as a regular prompt.",
      "key_vocabulary": "structure, body, limb, wing, fin, scales, feathers, fur, beak, tail, compare, similar, different",
      "common_misconceptions": "Children often describe animals in terms of size or colour (which are not reliable classification criteria) rather than structural features. They may not recognise that a bat's wing and a bird's wing are different structural solutions to the same problem.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D003"
    },
    {
      "concept_id": "SC-KS1-C018",
      "concept_name": "Human Body Parts",
      "description": "Knowledge of the names and locations of the main external parts of the human body: head, neck, arms, elbows, legs, knees, face, ears, eyes, hair, mouth and teeth. Pupils should be able to draw, label and point to these body parts. This is foundational for later work on body systems, health, and the senses.",
      "teaching_guidance": "Use body outlines for labelling activities. Play identification games. Connect to physical education by using correct anatomical terms during PE. Ask pupils to draw themselves and label their own body parts. Relate to health education.",
      "key_vocabulary": "head, neck, arm, elbow, leg, knee, face, ear, eye, hair, mouth, tooth, teeth, body",
      "common_misconceptions": "Children frequently confuse the terms 'arm' and 'hand', or 'leg' and 'foot'. Some children do not distinguish 'face' from 'head'. Children may not use the term 'elbow' or 'knee' accurately.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D003"
    },
    {
      "concept_id": "SC-KS1-C019",
      "concept_name": "The Five Senses",
      "description": "Understanding that humans perceive the world through five senses - sight, hearing, smell, taste and touch - and that each sense is associated with a specific body part: eyes (sight), ears (hearing), nose (smell), tongue (taste), and skin (touch). Mastery involves correctly linking each sense to its organ and explaining what each sense does.",
      "teaching_guidance": "Use sensory exploration activities: taste-testing (safely), listening activities, blindfold touch activities, and smelling jars. Explicitly connect each activity to the relevant sense and body part. Create a senses display. Link to how animals use senses differently (bats - hearing, dogs - smell).",
      "key_vocabulary": "sight, hearing, smell, taste, touch, eye, ear, nose, tongue, skin, sense",
      "common_misconceptions": "Children sometimes think they smell with their mouth or taste with their nose (these senses are closely related and interact, which can cause this confusion). Some children name more or fewer than five senses.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D003"
    },
    {
      "concept_id": "SC-KS1-C020",
      "concept_name": "Animal Life Cycles",
      "description": "Understanding that animals produce offspring that grow into adults, and that this process involves different observable stages depending on the animal. Key examples at KS1 include: egg → chick → chicken, egg → caterpillar → pupa → butterfly, spawn → tadpole → frog, and lamb → sheep. Pupils are not expected to understand the mechanisms of reproduction at this stage, only to recognise and sequence the stages of growth.",
      "teaching_guidance": "Rear butterflies or chicks in the classroom to observe life cycle stages directly. Use time-lapse videos for slower cycles. Sequence picture cards showing life cycle stages. Compare life cycles of different animals and notice similarities and differences. Emphasise that all animals follow some form of this growth cycle.",
      "key_vocabulary": "offspring, adult, grow, life cycle, egg, larva, pupa, caterpillar, tadpole, spawn, chick, hatch, metamorphosis",
      "common_misconceptions": "Children often think caterpillars and butterflies are completely different animals. They may not know that frogs come from frogspawn. Some children do not realise that humans also follow a life cycle (baby to adult).",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D003"
    },
    {
      "concept_id": "SC-KS1-C021",
      "concept_name": "Human Growth Stages",
      "description": "Understanding that humans, like all animals, grow and change from birth to adulthood through recognisable stages: baby, toddler, child, teenager, adult. Pupils observe that at each stage humans look and can do different things. This is a personal and relevant context for understanding animal life cycles.",
      "teaching_guidance": "Bring in photographs of people at different ages (including the teacher, pupils' parents). Use ordering activities with a timeline. Discuss what babies can do versus what older children or adults can do. Make sensitive links to families and diversity.",
      "key_vocabulary": "baby, toddler, child, teenager, adult, grow, change, stage, older, younger",
      "common_misconceptions": "Children may not place themselves on the growth timeline accurately. Some children think 'old person' is the final stage, not recognising the full adult stage before old age.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D003"
    },
    {
      "concept_id": "SC-KS1-C022",
      "concept_name": "Basic Survival Needs of Animals",
      "description": "Understanding that all animals, including humans, have three fundamental survival needs: water, food and air. These are non-negotiable requirements - without any one of them, an animal cannot survive. This concept supports understanding of both individual animal welfare and habitat suitability in ecology.",
      "teaching_guidance": "Start from pupils' own experience - what would happen if they had no food, water, or air? Extend to animals in different habitats and how they get these needs met. Use secondary sources to explore unusual cases (desert animals getting water from food, diving mammals holding their breath).",
      "key_vocabulary": "survive, need, water, food, air, breathe, eat, drink, alive",
      "common_misconceptions": "Children often add shelter, warmth or space to this list - while these matter for wellbeing, water, food and air are the three survival essentials. Some children think fish breathe air directly rather than dissolved oxygen in water.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D003"
    },
    {
      "concept_id": "SC-KS1-C023",
      "concept_name": "Human Health - Exercise, Diet and Hygiene",
      "description": "Understanding that maintaining good health requires regular exercise, eating a balanced and varied diet, and practising good hygiene (including handwashing and dental hygiene). Pupils learn that exercise strengthens the heart and muscles, that different foods provide different nutrients, and that good hygiene prevents the spread of disease. This is both a scientific and a personal health education topic.",
      "teaching_guidance": "Connect to pupils' real lives - exercise they enjoy, foods they eat. Use the eatwell plate or similar tool to discuss food variety. Conduct simple investigations into how exercise affects heartbeat. Link handwashing to preventing illness. Make hygiene practical through routine.",
      "key_vocabulary": "exercise, diet, hygiene, healthy, nutrition, food groups, balanced, heart, muscles, handwashing, germs",
      "common_misconceptions": "Children often think healthy food means eating no treats ever, rather than understanding balance and variety. Many do not know that different foods serve different purposes (energy, growth, repair). Some children associate exercise only with sport rather than any physical activity.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D003"
    },
    {
      "concept_id": "SC-KS1-C024",
      "concept_name": "Object vs Material Distinction",
      "description": "The conceptual distinction between an object (a made thing with a function, such as a chair, a bottle, or a window) and the material it is made from (the substance of which it consists, such as wood, glass, or plastic). This is a foundational concept in chemistry that underpins all further study of materials. An object can be made from multiple materials; the same material can be used to make many different objects.",
      "teaching_guidance": "Use a 'what is it made of?' routine when handling objects. Deliberately choose objects made from one obvious material first, then introduce objects made from multiple materials. Classroom hunts where pupils label each object and its material(s) are effective. Emphasise the question 'What is it made from?' as distinct from 'What is it?'",
      "key_vocabulary": "object, material, made from, made of, wood, plastic, glass, metal, contains",
      "common_misconceptions": "Children frequently name an object when asked what it is made of (e.g., saying 'table' when the material is 'wood'). Some children believe that only man-made things are materials, not natural materials like rock or water.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D004"
    },
    {
      "concept_id": "SC-KS1-C025",
      "concept_name": "Material Identification",
      "description": "The ability to recognise and name common everyday materials: wood, plastic, glass, metal, water, rock, brick, paper, cardboard, fabric, elastic and foil. Building a broad vocabulary of material names allows pupils to describe the world with precision and is prerequisite to studying material properties and suitability.",
      "teaching_guidance": "Provide collections of real material samples for handling and naming. Include both natural and synthetic materials. Match samples to labels. Use material ID games and classroom hunts. Distinguish between similar-looking materials (glass vs clear plastic) by exploring their properties.",
      "key_vocabulary": "wood, plastic, glass, metal, water, rock, brick, paper, cardboard, fabric, elastic, foil, natural, man-made",
      "common_misconceptions": "Children often think all clear, hard materials are glass (many are plastic). They may not recognise rock in manufactured form (e.g., granite worktop). Some children do not identify water as a material.",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D004"
    },
    {
      "concept_id": "SC-KS1-C026",
      "concept_name": "Material Properties",
      "description": "Knowledge and understanding of the physical properties of common materials expressed through paired descriptors: hard/soft, stretchy/stiff, shiny/dull, rough/smooth, bendy/not bendy, waterproof/not waterproof, absorbent/not absorbent, opaque/transparent. Pupils test and describe properties of materials through direct sensory investigation and simple tests. Mastery involves accurately describing a material's properties using scientific vocabulary.",
      "teaching_guidance": "Provide a range of material samples and property-testing activities. Teach paired terms explicitly. Set up property testing stations: drip water on samples (waterproof/absorbent), feel surfaces (rough/smooth), try to bend (bendy/stiff), try to see through (opaque/transparent). Create a properties database of materials.",
      "key_vocabulary": "hard, soft, stretchy, stiff, shiny, dull, rough, smooth, bendy, flexible, rigid, waterproof, absorbent, opaque, transparent, property",
      "common_misconceptions": "Children often confuse 'hard' with 'heavy'. They may say transparent means 'see through' but not understand that opaque means 'you cannot see through it'. Some confuse 'absorbent' and 'waterproof' as opposites when other categories exist (e.g., water-resistant).",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D004"
    },
    {
      "concept_id": "SC-KS1-C027",
      "concept_name": "Material Suitability for Purpose",
      "description": "Understanding that materials are selected for specific uses based on their properties - some properties make a material suitable while others make it unsuitable. For example, metal is used for a car body because it is strong and hard, but not for a raincoat because it is not flexible. Mastery involves evaluating the suitability of materials for a given purpose by referring to specific properties.",
      "teaching_guidance": "Use design and technology contexts to explore material suitability - 'What material would be best for a raincoat? For a window? For a door?'. Encourage pupils to justify choices using property vocabulary. Comparative tests (testing which material is most waterproof for an umbrella) are the most powerful pedagogical approach here.",
      "key_vocabulary": "suitable, unsuitable, best, because, property, use, purpose, waterproof, strong, flexible, transparent",
      "common_misconceptions": "Children often choose materials based on familiarity or preference rather than properties. Some think there is always one 'right' answer for material choice, rather than understanding that multiple materials might work and that context determines the best choice.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D004"
    },
    {
      "concept_id": "SC-KS1-C028",
      "concept_name": "Physical Transformation of Solid Materials",
      "description": "Understanding that the shape of solid objects can be changed by applying physical forces: squashing (compressing), bending (curving), twisting (rotating) and stretching (elongating). Not all materials can be transformed by all methods, and some transformations are reversible while others are not. This introduces the concept of material response to force, a precursor to KS2 and KS3 work on forces and materials.",
      "teaching_guidance": "Provide a range of materials for hands-on exploration: clay, plasticine, foam, rubber bands, wire, paper, fabric. Pupils test each method systematically on each material. Introduce the idea of reversibility - does it spring back? Vocabulary: squash, bend, twist, stretch, change, shape, spring back, permanent.",
      "key_vocabulary": "squash, bend, twist, stretch, shape, change, force, spring back, reversible, solid, permanent",
      "common_misconceptions": "Children often think that because a rubber band stretches, rubber is not solid. They may not distinguish between reversible deformation (stretching a rubber band) and permanent change (squashing clay). Some confuse physical change (shape change) with chemical change (making something new).",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D004"
    },
    {
      "concept_id": "SC-KS1-C029",
      "concept_name": "The Four Seasons",
      "description": "Understanding that a year is divided into four seasons - spring, summer, autumn and winter - each with characteristic weather, temperature, day length and changes to the natural world. This is one of the most fundamental patterns in the natural world, directly observable by pupils. The ability to name and characterise the four seasons is foundational to all environmental science.",
      "teaching_guidance": "Observe the seasons as they actually occur rather than just from pictures. Keep a seasonal journal or class diary throughout the year. Go outside regularly in all seasons. Compare seasonal photographs taken from the same viewpoint at different times of year. Link to changes in plants, animals, weather and day length.",
      "key_vocabulary": "season, spring, summer, autumn, winter, temperature, warm, cold, month, year, change",
      "common_misconceptions": "Children in the UK may have a distorted view of seasons based on books featuring idealised summer or winter conditions. Some children think it is always the same season everywhere in the world at the same time (it is summer in Australia when it is winter in the UK).",
      "concept_type": "knowledge",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D005"
    },
    {
      "concept_id": "SC-KS1-C030",
      "concept_name": "Seasonal Weather Patterns",
      "description": "Understanding that each season is typically associated with characteristic weather patterns in the UK: spring (mild, showery), summer (warm, longer days, less rain), autumn (cooling, wet, windy), winter (cold, shorter days, possibility of frost and snow). Pupils observe and describe weather over time, developing the understanding that weather patterns are broadly predictable by season.",
      "teaching_guidance": "Maintain a class weather chart throughout the year. Record temperature, cloud cover, precipitation and wind. At the end of each season, collate the data and discuss what was typical. Use weather data to introduce the idea of climate (typical long-term patterns) versus weather (day-to-day variation).",
      "key_vocabulary": "weather, sunny, cloudy, rainy, windy, snowy, temperature, warm, cold, frost, season",
      "common_misconceptions": "Children often think it always snows in winter in the UK (it frequently does not, especially in southern England). They may think all rain falls in autumn and winter, not appreciating that it can rain heavily in summer too.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D005"
    },
    {
      "concept_id": "SC-KS1-C031",
      "concept_name": "Day Length Variation",
      "description": "Understanding that the length of daylight (hours between sunrise and sunset) varies throughout the year, with the longest days in summer (up to about 16 hours in the UK) and the shortest in winter (as few as 8 hours). Pupils observe this directly - noticing that it is dark when they travel to school in winter but still light in summer evenings. Note: pupils must never look directly at the Sun.",
      "teaching_guidance": "Use published sunrise/sunset data to record day length at regular intervals. Draw attention to the contrast in a very practical way - 'It is still light at bedtime now; in January it was dark by 4 o'clock'. Avoid asking pupils to observe the Sun directly. Connect to why nocturnal animals are more active in winter with its longer nights.",
      "key_vocabulary": "day length, sunrise, sunset, daylight, dark, light, hours, longer, shorter, summer, winter",
      "common_misconceptions": "Children (and some adults) believe that in summer the Earth is closer to the Sun (it is actually very slightly further away). The correct reason for day length and seasonal temperature is the tilt of Earth's axis, which is not covered until later in the curriculum.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D005"
    },
    {
      "concept_id": "SC-KS1-C032",
      "concept_name": "Living, Dead and Never Alive",
      "description": "The ability to classify things into three categories: living (currently alive), dead (was once alive but is no longer), and never alive (was never a living thing). This requires understanding what it means to be alive - that living things show life processes such as growth, movement, nutrition and reproduction. Common tricky cases include fire (never alive), a piece of wood (dead - was once part of a living tree), and a dried leaf (dead).",
      "teaching_guidance": "Use a variety of real objects for sorting: a live plant, a pressed flower, a stone, a piece of wood, a plastic toy, a dried seed, a feather, a seashell. Discuss reasoning for each classification. Ask 'Was this ever alive? Is it still alive? How do you know?'. Introduce the idea that living things show certain signs of life.",
      "key_vocabulary": "living, alive, dead, never alive, life, was once, grow, move, breathe, feed",
      "common_misconceptions": "Children commonly think fire is alive (it moves, grows, and 'breathes' oxygen). They may also think clouds or rivers are alive. A very common error is classifying wood as 'never alive' rather than 'dead' (was part of a living tree). Seeds are often wrongly classified as 'never alive' or 'dead'.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D006"
    },
    {
      "concept_id": "SC-KS1-C033",
      "concept_name": "Life Processes",
      "description": "The characteristics that define living things: movement, respiration, sensitivity (response to stimuli), growth, reproduction, excretion and nutrition (often remembered by the mnemonic MRSGREN). At KS1, pupils do not need to know all seven formally, but should understand that living things share certain essential characteristics including growth, movement (even plants move slowly), feeding, and producing offspring.",
      "teaching_guidance": "Introduce informally at KS1 by asking 'How do we know this is alive?' and building a class list of properties of living things. Use plants as well as animals to challenge the assumption that only things that move visibly can be alive. Formally introduce the life processes mnemonic at KS2.",
      "key_vocabulary": "alive, grow, move, feed, breathe, reproduce, offspring, respond, living",
      "common_misconceptions": "Children often think that movement is the key indicator of life, which leads them to classify fire or rivers as alive, and plants as non-living (because plants move too slowly to see without time-lapse). Many children do not realise that plants are alive.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D006"
    },
    {
      "concept_id": "SC-KS1-C034",
      "concept_name": "Habitat Concept",
      "description": "Understanding that a habitat is a natural environment where a community of plants and animals live. Different habitats - woodland, seashore, ocean, grassland, rainforest, desert, freshwater pond - have different physical characteristics (temperature, moisture, light levels, food availability) that determine which organisms can live there. A habitat provides an organism with everything it needs to survive.",
      "teaching_guidance": "Explore local habitats directly: the school garden, a nearby pond or park, a hedgerow. Use photographs and secondary sources for habitats pupils cannot visit. Build a habitat map of the local area. Create simple model habitats to understand what each provides for its inhabitants.",
      "key_vocabulary": "habitat, environment, home, live, woodland, seashore, pond, ocean, grassland, desert, provide, conditions",
      "common_misconceptions": "Children often think of habitats only as exotic places (jungle, Arctic) rather than recognising habitats in their immediate environment such as a garden, hedgerow, or under a stone. Some children think an animal's habitat is simply wherever it happens to be rather than where it is adapted to live.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D006"
    },
    {
      "concept_id": "SC-KS1-C035",
      "concept_name": "Micro-habitats",
      "description": "Understanding that within a larger habitat, there are micro-habitats - very small, localised environments with specific conditions that suit particular small organisms. Examples include: under stones (dark, damp, sheltered - suits woodlice, centipedes), in leaf litter (moist, decaying material - suits worms, millipedes), on tree bark (rough surface, variable moisture - suits lichens, insects), and in a puddle (temporary water habitat).",
      "teaching_guidance": "Survey different micro-habitats in the school grounds systematically - use a quadrat and identification guides. Compare which organisms are found in different micro-habitats and why conditions differ. Handle invertebrates carefully and return them after observation.",
      "key_vocabulary": "micro-habitat, under, damp, dark, shelter, woodlouse, minibeast, condition, small, localised",
      "common_misconceptions": "Children may not realise that the specific conditions in a micro-habitat (dampness, darkness, temperature) are what make it suitable for certain organisms - they may think animals choose locations randomly.",
      "concept_type": "knowledge",
      "complexity_level": 2,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D006"
    },
    {
      "concept_id": "SC-KS1-C036",
      "concept_name": "Habitat Suitability and Adaptation",
      "description": "The understanding that living things are suited to the habitats in which they live - they possess features and behaviours that allow them to survive in that habitat's specific conditions. For example, polar bears are suited to cold Arctic habitats (thick fur, fat layer); camels are suited to hot deserts (hump for fat storage, wide feet for sand). At KS1 this is introduced as a descriptive observation; causal explanation through natural selection is not expected until Year 6.",
      "teaching_guidance": "Use photographs of animals in their natural habitats and discuss how the animal is suited to its environment. Focus on observable features (thick fur in cold animals, streamlined shape in swimming animals). Avoid asserting that animals 'chose' their features or that adaptations were deliberately acquired.",
      "key_vocabulary": "suited, adapted, feature, habitat, survive, conditions, suited to, environment",
      "common_misconceptions": "Children often think animals actively chose or developed their adaptations (intentional fallacy). Some think all animals could survive in all habitats if they wanted to. Children may think adaptation happens within a single animal's lifetime rather than over many generations.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D006"
    },
    {
      "concept_id": "SC-KS1-C037",
      "concept_name": "Interdependence in Habitats",
      "description": "The understanding that plants and animals in a habitat depend on each other for survival. Plants produce food and oxygen that animals need; animals may pollinate plants or disperse seeds; predators control prey populations; decomposers recycle nutrients. At KS1 this is introduced simply: pupils recognise that if a key organism is removed, others are affected. This concept develops into understanding of food webs and ecosystems in KS2.",
      "teaching_guidance": "Use local habitat examples to explore who depends on whom. Play 'food web games' where pupils hold strings connecting different organisms - pull one string and see how all others are affected. Discuss what would happen if all the plants disappeared, or all the bees.",
      "key_vocabulary": "depend, need, habitat, food, shelter, pollinate, seeds, interdependence, linked",
      "common_misconceptions": "Children often think of habitats as collections of independent organisms rather than an interconnected community. They may not appreciate that plants depend on animals (for pollination) as well as animals depending on plants.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D006"
    },
    {
      "concept_id": "SC-KS1-C038",
      "concept_name": "Simple Food Chains",
      "description": "A food chain is a sequence showing who eats whom, starting always with a producer (a green plant that makes its own food through photosynthesis) and showing the flow of energy through herbivores, omnivores and carnivores. At KS1 pupils construct and read simple linear food chains (3-4 organisms) from their local habitat. The concept of energy transfer from food is not formally introduced until KS2.",
      "teaching_guidance": "Build food chains using cards or pictures from local habitats (nettle → caterpillar → blue tit → sparrowhawk). Emphasise that food chains always start with a green plant. Use arrows correctly - the arrow represents 'is eaten by' or 'energy goes to', pointing from prey to predator. Discuss what happens if one organism is removed.",
      "key_vocabulary": "food chain, producer, consumer, predator, prey, eaten by, plant, herbivore, carnivore, arrow, energy",
      "common_misconceptions": "Children often draw arrows pointing in the wrong direction (from predator to prey). Many do not realise that food chains must always start with a plant. Some children think food chains exist only in exotic environments, not recognising chains in the school garden.",
      "concept_type": "knowledge",
      "complexity_level": 3,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D006"
    },
    {
      "concept_id": "SC-KS1-C039",
      "concept_name": "Comparative Testing Method",
      "description": "A comparative test investigates which option is best for a given purpose by testing two or more options under the same conditions and comparing results. For example, 'which material is most waterproof?' tested by dripping the same amount of water on samples of equal size. At KS1, pupils begin to understand that changing one thing at a time while keeping everything else the same is what makes a test fair.",
      "teaching_guidance": "Design comparative tests together as a class before expecting pupils to work independently. Ask 'What will we change? What will we keep the same? What will we measure or observe?' Model how to record results comparatively in a simple table. Discuss what the results tell us.",
      "key_vocabulary": "test, compare, fair, same, change, different, better, worse, result, measure",
      "common_misconceptions": "Children frequently change multiple variables in a test without realising this makes fair comparison impossible. They may also not understand why keeping things the same matters.",
      "concept_type": "process",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "domain_id": "SC-KS1-D001"
    },
    {
      "concept_id": "SC-KS1-C040",
      "concept_name": "Observation Over Time",
      "description": "The scientific process of making repeated observations at regular intervals to track change and detect patterns that cannot be seen in a single observation. Many important scientific phenomena - plant growth, seasonal change, animal development - are only visible through sustained observation over days, weeks or months. Mastery involves planning and maintaining a systematic observation schedule and using the accumulated record to draw conclusions.",
      "teaching_guidance": "Set up investigations requiring repeated observation: plant growth diaries, weather records, the school tree through the seasons. Provide structured recording sheets with dates. At regular intervals, review accumulated records and ask 'What do we notice has changed? What patterns can we see?'",
      "key_vocabulary": "observe, over time, change, record, pattern, regular, week, month, compare, date",
      "common_misconceptions": "Children often expect results to be visible immediately. They may lose motivation during extended investigations. Helping them see the value of the accumulated record, rather than each individual data point, is important.",
      "concept_type": "process",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "domain_id": "SC-KS1-D001"
    },
    {
      "concept_id": "SC-KS1-C041",
      "concept_name": "Using Simple Scientific Equipment",
      "description": "The skill of selecting and correctly using simple scientific equipment to make more accurate or detailed observations and measurements. At KS1, relevant equipment includes: hand lenses and magnifying glasses (to see small details), simple balance scales (to compare mass), egg timers (to measure time), rulers (to measure length). Using equipment purposefully and carefully is an important aspect of scientific practice.",
      "teaching_guidance": "Introduce equipment explicitly and provide guided practice before expecting pupils to use it independently. Teach the purpose of each item of equipment. Include equipment as a natural part of investigations rather than as a separate 'equipment lesson'. Discuss why equipment helps us observe and measure more accurately than our unaided senses.",
      "key_vocabulary": "equipment, hand lens, magnifying glass, balance, ruler, measure, accurate, observe, tool",
      "common_misconceptions": "Children often use hand lenses incorrectly (holding them too far from the object or eye). They may not understand why using equipment gives better results than using their senses alone.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "domain_id": "SC-KS1-D001"
    },
    {
      "concept_id": "SC-KS1-C042",
      "concept_name": "Scientific Communication",
      "description": "The ability to share scientific findings, ideas and explanations with others using a variety of modes including talk, scientific vocabulary, drawing, labelling, diagrams, tables and simple graphs. At KS1, oral communication is as important as written. Mastery involves being able to explain clearly what was done, what was found, and what it means - in a form others can understand.",
      "teaching_guidance": "Value talk as a mode of communication alongside writing. Provide structured sentence frames. Create displays, posters and presentations of scientific work. Encourage pupils to explain their work to another class or to parents. Model scientific language and expect pupils to use it.",
      "key_vocabulary": "explain, describe, share, communicate, tell, show, draw, label, scientific language, findings",
      "common_misconceptions": "Children (and sometimes teachers) equate quantity of writing with quality of science. Oral explanation and careful drawing can demonstrate understanding just as effectively as written accounts.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "domain_id": "SC-KS1-D001"
    },
    {
      "concept_id": "SC-KS1-C043",
      "concept_name": "Observing Changes Over Time",
      "description": "The process skill of noticing and recording how things change over time through systematic, repeated observation. This differs from comparative testing in that there is no intervention - the observer simply records what is happening as it happens naturally. Examples include a plant growing, ice melting, the Moon's phases, or the seasons changing.",
      "teaching_guidance": "Use structured recording sheets with clear date columns. Photograph changes at regular intervals. At intervals, review the accumulated record and highlight changes. Encourage pupils to notice specific details that have changed rather than just recording 'it grew bigger'.",
      "key_vocabulary": "change, over time, notice, record, grow, melt, season, pattern, compare, before, after",
      "common_misconceptions": "Children often look for dramatic, sudden changes rather than slow continuous ones. They may not see slow processes (plant growth, seasonal change) as interesting because they are not immediately visible.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "domain_id": "SC-KS1-D001"
    },
    {
      "concept_id": "SC-KS1-C044",
      "concept_name": "Sorting and Grouping Decisions",
      "description": "The scientific skill of choosing appropriate criteria for sorting a set of objects or organisms and consistently applying those criteria to form groups. This goes beyond classification as a content outcome (e.g., naming vertebrate groups) to the procedural skill of making and justifying sorting decisions. Scientists regularly make decisions about how to group things, and different classification systems can be equally valid.",
      "teaching_guidance": "Provide open-ended sorting tasks where pupils choose their own criteria and explain them. Then give the same set of objects with a different criterion and ask them to re-sort. Discuss: 'Can the same thing be in two different groups depending on what criterion you choose?' Use branching databases as an introduction to hierarchical classification.",
      "key_vocabulary": "sort, group, criteria, decide, category, same, different, explain, reason, belong",
      "common_misconceptions": "Children often think there is one correct way to sort a set of things. They may not see that the choice of criterion is itself a scientific decision.",
      "concept_type": "skill",
      "complexity_level": 2,
      "is_cross_cutting": true,
      "domain_id": "SC-KS1-D001"
    },
    {
      "concept_id": "SC-KS1-C045",
      "concept_name": "Identifying Similarities and Differences",
      "description": "The foundational scientific skill of attending to how two or more things are alike and how they differ. This is prerequisite for both classification and comparative investigation. Mastery involves moving beyond superficial features (colour, size) to more scientifically meaningful characteristics (body covering, material properties, growth pattern).",
      "teaching_guidance": "Use side-by-side comparison as a regular classroom strategy. Provide structured 'same and different' frames. Explicitly teach pupils to look beyond the obvious and consider less visible features. Comparison tables help organise thinking.",
      "key_vocabulary": "same, similar, different, alike, compare, both, but, whereas, however",
      "common_misconceptions": "Children tend to notice obvious differences (size, colour) before noticing less visible but scientifically more important ones (structure, composition, behaviour). Guiding pupils to look at specific features systematically helps overcome this.",
      "concept_type": "skill",
      "complexity_level": 1,
      "is_cross_cutting": true,
      "domain_id": "SC-KS1-D001"
    },
    {
      "concept_id": "SC-KS1-C046",
      "concept_name": "Scientific Curiosity and Wonder",
      "description": "The disposition to notice, question and want to find out about the natural world. Scientific curiosity drives all scientific enquiry - it is the emotional and motivational foundation of science. At KS1, nurturing and sustaining children's natural curiosity is one of the primary aims of science education, ensuring that school science amplifies rather than extinguishes the wondering that young children naturally display.",
      "teaching_guidance": "Create a 'Wonder wall' where pupils can post questions they have about the world. Respond with genuine enthusiasm when pupils raise unexpected questions. Validate curiosity explicitly: 'That's a brilliant scientific question'. Begin lessons with surprising observations or phenomena that prompt questions. Use outdoor learning to contextualise wonder in the real world.",
      "key_vocabulary": "wonder, curious, question, find out, interesting, amazing, why, how, what if",
      "common_misconceptions": "Some pupils believe that science means knowing the right answer rather than asking good questions. It is important to model scientific curiosity as a valued disposition, not just a stepping-stone to right answers.",
      "concept_type": "attitude",
      "complexity_level": 1,
      "is_cross_cutting": true,
      "domain_id": "SC-KS1-D001"
    },
    {
      "concept_id": "SC-KS1-C047",
      "concept_name": "Care for Living Things",
      "description": "The scientific attitude of treating living organisms with care and respect, understanding that they have biological needs and can be harmed by careless handling. At KS1, pupils learn to handle minibeasts and small animals carefully and to return wild animals to their habitats after observation. This attitude supports both good scientific practice (handling damage can affect results) and broader environmental values.",
      "teaching_guidance": "Model careful handling of living things. Establish clear procedures for handling minibeasts - use paint brushes rather than fingers to move very small organisms. Teach that we observe animals in their habitat rather than keeping them permanently. Discuss why it matters to return animals to their habitat.",
      "key_vocabulary": "careful, gently, handle, return, habitat, respect, need, alive, welfare",
      "common_misconceptions": "Children sometimes think that because they are gentle, handling living things for extended periods is fine. They need to understand that even gentle handling causes stress and that returning animals quickly is important.",
      "concept_type": "attitude",
      "complexity_level": 1,
      "is_cross_cutting": false,
      "domain_id": "SC-KS1-D003"
    },
    {
      "concept_id": "SC-KS1-C048",
      "concept_name": "Safety in Science - Sun Safety",
      "description": "Understanding the specific safety rule that one must never look directly at the Sun, even when wearing dark glasses or through a telescope or binoculars, because the intense light can permanently damage the retina and cause blindness. This rule applies during all science work involving observation of the sky, including during seasonal changes observations and any astronomy. This is a rare absolute rule in primary science.",
      "teaching_guidance": "State the rule clearly and repeat it whenever relevant. Ensure pupils understand it is not negotiable and applies even on cloudy days when the Sun appears less bright. Discuss why this rule exists - the concentrated light and ultraviolet radiation can permanently damage the sensitive cells of the retina. Model safe sky observation techniques.",
      "key_vocabulary": "Sun, look, directly, dangerous, eyes, retina, blindness, safe, never, rule",
      "common_misconceptions": "Children commonly believe that dark glasses make it safe to look at the Sun - they do not. Some believe that looking quickly is safe - it is not.",
      "concept_type": "attitude",
      "complexity_level": 1,
      "is_cross_cutting": true,
      "domain_id": "SC-KS1-D001"
    }
  ],
  "prerequisite_relationships": [
    {
      "prerequisite_concept": "SC-KS1-C046",
      "dependent_concept": "SC-KS1-C001",
      "confidence": "inferred",
      "relationship_type": "logical",
      "strength": 0.7,
      "rationale": "Scientific curiosity is the motivational foundation for asking scientific questions. Pupils who are curious about the world are more naturally inclined to ask investigable questions, though question-asking can also be taught without curiosity as a starting point."
    },
    {
      "prerequisite_concept": "SC-KS1-C001",
      "dependent_concept": "SC-KS1-C003",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Pupils must be able to formulate a scientific question before they can design and carry out an investigation to answer it. The question determines the method, what to change, and what to observe."
    },
    {
      "prerequisite_concept": "SC-KS1-C002",
      "dependent_concept": "SC-KS1-C004",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Close observation is essential before classification - pupils must be able to notice the features and details of objects before they can use those features as the basis for grouping them."
    },
    {
      "prerequisite_concept": "SC-KS1-C045",
      "dependent_concept": "SC-KS1-C004",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.95,
      "rationale": "Identifying similarities and differences is the cognitive basis for classification - you cannot group objects without first recognising what makes them alike or different."
    },
    {
      "prerequisite_concept": "SC-KS1-C002",
      "dependent_concept": "SC-KS1-C045",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.85,
      "rationale": "Close, careful observation is required before pupils can identify meaningful similarities and differences between objects. Superficial observation leads to superficial comparison."
    },
    {
      "prerequisite_concept": "SC-KS1-C003",
      "dependent_concept": "SC-KS1-C005",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.9,
      "rationale": "Pupils must have carried out observations or tests before they can use the results as evidence to draw conclusions. Evidence-based conclusions require evidence first."
    },
    {
      "prerequisite_concept": "SC-KS1-C002",
      "dependent_concept": "SC-KS1-C006",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.85,
      "rationale": "Observations must exist before they can be recorded. The purpose of recording is to capture observations for future reference and communication."
    },
    {
      "prerequisite_concept": "SC-KS1-C005",
      "dependent_concept": "SC-KS1-C042",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.7,
      "rationale": "Scientific communication includes communicating conclusions. Pupils need findings to communicate before they can practise communicating them effectively."
    },
    {
      "prerequisite_concept": "SC-KS1-C006",
      "dependent_concept": "SC-KS1-C042",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.8,
      "rationale": "Data recording is a foundational form of scientific communication that develops into more sophisticated oral and written communication of findings and explanations."
    },
    {
      "prerequisite_concept": "SC-KS1-C001",
      "dependent_concept": "SC-KS1-C039",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.8,
      "rationale": "Comparative testing is one method of answering scientific questions. Pupils must understand that questions can be answered in different ways before appreciating the comparative test as one specific approach."
    },
    {
      "prerequisite_concept": "SC-KS1-C002",
      "dependent_concept": "SC-KS1-C040",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.85,
      "rationale": "Basic observation skills are prerequisite for observation over time, which involves the same core skill applied repeatedly across extended periods. You must be able to observe before you can observe systematically over time."
    },
    {
      "prerequisite_concept": "SC-KS1-C002",
      "dependent_concept": "SC-KS1-C043",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "The skill of observing changes over time is an extension of basic observation skill - the same careful attention to detail is required, repeated at intervals with specific focus on what has changed."
    },
    {
      "prerequisite_concept": "SC-KS1-C002",
      "dependent_concept": "SC-KS1-C007",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.85,
      "rationale": "Recognising patterns in observations requires careful and detailed observation in the first place. Patterns only emerge when sufficient careful observations have been made."
    },
    {
      "prerequisite_concept": "SC-KS1-C002",
      "dependent_concept": "SC-KS1-C041",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.8,
      "rationale": "Using equipment is a means of making better observations. Pupils should first develop basic observation skills before learning to extend those skills using tools."
    },
    {
      "prerequisite_concept": "SC-KS1-C044",
      "dependent_concept": "SC-KS1-C004",
      "confidence": "inferred",
      "relationship_type": "logical",
      "strength": 0.8,
      "rationale": "The skill of making sorting and grouping decisions underpins the classification process. Classification requires the meta-skill of deciding how to group as well as the act of grouping."
    },
    {
      "prerequisite_concept": "SC-KS1-C009",
      "dependent_concept": "SC-KS1-C010",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.7,
      "rationale": "Identifying whole plants provides meaningful context for then studying and naming their component parts in detail. Recognition of the whole plant precedes systematic analysis of its structure."
    },
    {
      "prerequisite_concept": "SC-KS1-C009",
      "dependent_concept": "SC-KS1-C011",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.75,
      "rationale": "Identifying and naming trees is prerequisite for classifying them into deciduous and evergreen categories. Pupils need to know which trees they are looking at before they can compare their seasonal behaviour."
    },
    {
      "prerequisite_concept": "SC-KS1-C010",
      "dependent_concept": "SC-KS1-C012",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.8,
      "rationale": "Understanding plant structures, including what seeds and bulbs are, provides essential foundation for understanding how plants grow from these structures. Knowing the structures precedes understanding their role in growth."
    },
    {
      "prerequisite_concept": "SC-KS1-C010",
      "dependent_concept": "SC-KS1-C014",
      "confidence": "inferred",
      "relationship_type": "logical",
      "strength": 0.7,
      "rationale": "Understanding that seeds are a plant structure is prerequisite for understanding germination as the process by which seeds begin to grow into plants."
    },
    {
      "prerequisite_concept": "SC-KS1-C012",
      "dependent_concept": "SC-KS1-C013",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.75,
      "rationale": "Observing plant growth from seeds and bulbs raises the natural question of what plants need to grow successfully, making study of plant requirements a logical next step."
    },
    {
      "prerequisite_concept": "SC-KS1-C013",
      "dependent_concept": "SC-KS1-C014",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.8,
      "rationale": "Understanding general plant requirements for growth provides the context for understanding germination requirements specifically. Germination is the first stage of growth and requires a subset of general plant conditions."
    },
    {
      "prerequisite_concept": "SC-KS1-C040",
      "dependent_concept": "SC-KS1-C012",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.8,
      "rationale": "The process skill of observation over time is required to observe and understand plant growth from seeds and bulbs, which is a slow process requiring systematic observation over days and weeks."
    },
    {
      "prerequisite_concept": "SC-KS1-C015",
      "dependent_concept": "SC-KS1-C017",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.85,
      "rationale": "Knowing and being able to name the five vertebrate groups provides the framework for systematically comparing and contrasting body structures within and between groups."
    },
    {
      "prerequisite_concept": "SC-KS1-C015",
      "dependent_concept": "SC-KS1-C016",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.6,
      "rationale": "Understanding the five vertebrate groups provides a useful additional framework for thinking about diet classification, though diet classification can be learned somewhat independently."
    },
    {
      "prerequisite_concept": "SC-KS1-C018",
      "dependent_concept": "SC-KS1-C019",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "The curriculum explicitly links sense organs to senses: pupils must know the names of body parts (eyes, ears, nose, tongue, skin) before they can associate each with its corresponding sense."
    },
    {
      "prerequisite_concept": "SC-KS1-C040",
      "dependent_concept": "SC-KS1-C020",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.8,
      "rationale": "Understanding animal life cycles, particularly metamorphosis and development, requires the process skill of observation over time, as the stages unfold across days, weeks or months."
    },
    {
      "prerequisite_concept": "SC-KS1-C022",
      "dependent_concept": "SC-KS1-C023",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.7,
      "rationale": "Understanding basic survival needs (water, food, air) provides foundation for understanding what it means to stay healthy. Health requirements build on survival needs to include quality and exercise."
    },
    {
      "prerequisite_concept": "SC-KS1-C024",
      "dependent_concept": "SC-KS1-C025",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.85,
      "rationale": "Understanding the distinction between objects and materials is conceptually prerequisite for material identification - pupils need to understand they are naming what something is made from, not what it is."
    },
    {
      "prerequisite_concept": "SC-KS1-C025",
      "dependent_concept": "SC-KS1-C026",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Pupils must be able to identify and name materials before they can meaningfully describe and compare their properties. You need to know what material you are testing before you can characterise its properties."
    },
    {
      "prerequisite_concept": "SC-KS1-C026",
      "dependent_concept": "SC-KS1-C027",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.95,
      "rationale": "Knowledge of material properties is directly prerequisite for judging suitability for purpose. The reasoning for suitability (e.g., 'metal is suitable for a bridge because it is strong and hard') requires knowing that metal has those properties. This is the explicit Year 1 to Year 2 progression in the curriculum."
    },
    {
      "prerequisite_concept": "SC-KS1-C025",
      "dependent_concept": "SC-KS1-C028",
      "confidence": "inferred",
      "relationship_type": "logical",
      "strength": 0.7,
      "rationale": "Identifying materials is prerequisite for exploring how different materials respond to physical forces. Pupils need to know what materials they are working with before they can investigate how those materials behave."
    },
    {
      "prerequisite_concept": "SC-KS1-C039",
      "dependent_concept": "SC-KS1-C027",
      "confidence": "explicit",
      "relationship_type": "instructional",
      "strength": 0.85,
      "rationale": "The comparative testing method is the primary way pupils investigate material suitability at KS1. The curriculum explicitly suggests testing questions such as which material is best for a given purpose."
    },
    {
      "prerequisite_concept": "SC-KS1-C039",
      "dependent_concept": "SC-KS1-C013",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.8,
      "rationale": "Comparative testing is the method by which pupils investigate plant requirements (comparing plants with and without light, water, or warmth). The process skill enables the content knowledge to be discovered empirically."
    },
    {
      "prerequisite_concept": "SC-KS1-C029",
      "dependent_concept": "SC-KS1-C030",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Understanding that there are four distinct seasons is the conceptual framework within which seasonal weather patterns can be organised and understood. The seasonal framework precedes associating specific weather with each season."
    },
    {
      "prerequisite_concept": "SC-KS1-C029",
      "dependent_concept": "SC-KS1-C031",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Understanding the four seasons provides the temporal framework for understanding how day length varies across the year. The seasonal vocabulary is needed to describe when days are longer or shorter."
    },
    {
      "prerequisite_concept": "SC-KS1-C043",
      "dependent_concept": "SC-KS1-C030",
      "confidence": "inferred",
      "relationship_type": "instructional",
      "strength": 0.8,
      "rationale": "Observing seasonal weather patterns requires sustained observation over time. The process skill of observing changes over time is required to collect the evidence from which seasonal patterns emerge."
    },
    {
      "prerequisite_concept": "SC-KS1-C011",
      "dependent_concept": "SC-KS1-C030",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.6,
      "rationale": "Understanding that deciduous trees lose their leaves in autumn and winter provides a concrete, visible example of seasonal change that supports general understanding of seasonal patterns."
    },
    {
      "prerequisite_concept": "SC-KS1-C033",
      "dependent_concept": "SC-KS1-C032",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Understanding what life processes are is prerequisite for distinguishing living things (those showing life processes) from dead things (once showed life processes) and things never alive (never showed life processes)."
    },
    {
      "prerequisite_concept": "SC-KS1-C022",
      "dependent_concept": "SC-KS1-C036",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Understanding that animals have basic survival needs is foundational for understanding habitat suitability - a suitable habitat is one that provides for those needs. The concept of needs precedes the concept of their provision by habitat."
    },
    {
      "prerequisite_concept": "SC-KS1-C013",
      "dependent_concept": "SC-KS1-C036",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.85,
      "rationale": "Understanding plant requirements for growth supports understanding habitat suitability for plants, which is part of understanding how habitats provide for the needs of all their inhabitants."
    },
    {
      "prerequisite_concept": "SC-KS1-C034",
      "dependent_concept": "SC-KS1-C036",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Understanding the concept of a habitat is essential before understanding that habitats are suitable for particular organisms. The general concept of habitat precedes the nuanced understanding of habitat-organism fit."
    },
    {
      "prerequisite_concept": "SC-KS1-C034",
      "dependent_concept": "SC-KS1-C035",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.85,
      "rationale": "Understanding the concept of habitat as a home for organisms is prerequisite for understanding micro-habitats as very small, localised versions of the same idea. The macro concept precedes the micro concept."
    },
    {
      "prerequisite_concept": "SC-KS1-C034",
      "dependent_concept": "SC-KS1-C037",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.85,
      "rationale": "Understanding habitats as communities where multiple organisms live together is foundational for understanding interdependence - that the organisms in a habitat depend on one another."
    },
    {
      "prerequisite_concept": "SC-KS1-C016",
      "dependent_concept": "SC-KS1-C038",
      "confidence": "explicit",
      "relationship_type": "logical",
      "strength": 0.9,
      "rationale": "Understanding diet classification (carnivore/herbivore/omnivore) from Year 1 is essential background for constructing food chains in Year 2. The chain shows who eats whom, which requires knowing each organism's diet category."
    },
    {
      "prerequisite_concept": "SC-KS1-C037",
      "dependent_concept": "SC-KS1-C038",
      "confidence": "explicit",
      "relationship_type": "developmental",
      "strength": 0.85,
      "rationale": "Food chains are a specific, formal representation of one type of interdependence (feeding relationships) in a habitat. Understanding general interdependence provides the conceptual context for the food chain model."
    },
    {
      "prerequisite_concept": "SC-KS1-C032",
      "dependent_concept": "SC-KS1-C034",
      "confidence": "inferred",
      "relationship_type": "logical",
      "strength": 0.65,
      "rationale": "Understanding that something is 'living' is prerequisite for understanding habitats as environments where living things reside. The concept of life precedes the concept of where living things live."
    },
    {
      "prerequisite_concept": "SC-KS1-C009",
      "dependent_concept": "SC-KS1-C034",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.6,
      "rationale": "Being able to identify plants in their local environment supports identifying plants in specific habitats. Basic plant identification skills apply directly when studying organisms in their habitats."
    },
    {
      "prerequisite_concept": "SC-KS1-C015",
      "dependent_concept": "SC-KS1-C034",
      "confidence": "inferred",
      "relationship_type": "developmental",
      "strength": 0.6,
      "rationale": "Knowledge of different animal groups from Year 1 supports identifying animals in habitats in Year 2. The classification framework helps pupils organise and describe the organisms they find."
    }
  ]
}
